-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 opened on:  31 Jan 2023, 11:44:13

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,704 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,974 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,734 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,301        9.83        9.83
           East Midlands |      3,372       10.04       19.87
                  London |      6,733       20.05       39.91
              North East |      3,370       10.03       49.95
              North West |      3,426       10.20       60.15
              South East |      3,325        9.90       70.05
              South West |      3,417       10.17       80.22
           West Midlands |      3,280        9.77       89.98
Yorkshire and The Humber |      3,364       10.02      100.00
-------------------------+-----------------------------------
                   Total |     33,588      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,668        4.97        4.97
          1 |      6,356       18.92       23.89
          2 |      6,463       19.24       43.13
          3 |      6,522       19.42       62.55
          4 |      6,235       18.56       81.11
          5 |      6,344       18.89      100.00
------------+-----------------------------------
      Total |     33,588      100.00

. drop if imd==0
(1,668 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,921 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(813 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(816 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,025 real changes made, 14,025 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,025 missing values generated)

. gen min_baseline_creatinine=.
(31,920 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,324 real changes made)

. gen max_baseline_creatinine=.
(31,920 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,895 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,596 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,025 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,895 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,098 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,647 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,920
25%            0              0       Sum of Wgt.      31,920

50%            0                      Mean           12.49825
                        Largest       Std. Dev.      13.01894
75%       25.039       43.27767
90%     29.27043       44.03526       Variance       169.4929
95%     31.41735       45.25942       Skewness       .2176451
99%     35.28129       45.69954       Kurtosis        1.30211

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,538        5.35        5.35
         <= |      1,615        5.62       10.97
          = |     20,777       72.27       83.23
          > |      1,581        5.50       88.73
         >= |      1,592        5.54       94.27
          ~ |      1,648        5.73      100.00
------------+-----------------------------------
      Total |     28,751      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,628       55.23       55.23
          1 |     14,292       44.77      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,981       46.93       46.93
          1 |     16,939       53.07      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,353       95.09       95.09
          1 |      1,567        4.91      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(762 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,299       94.92       94.92
          1 |      1,621        5.08      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(738 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,308       94.95       94.95
          1 |      1,612        5.05      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(690 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,330       95.02       95.02
          1 |      1,590        4.98      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(624 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,295       94.91       94.91
          1 |      1,625        5.09      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(593 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,306       94.94       94.94
          1 |      1,614        5.06      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(601 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,973       34.38       34.38
          1 |     20,947       65.62      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. drop if ckd==0
(10,973 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2017_ckd.csv not found)
file ./output/2017_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 closed on:  31 Jan 2023, 11:44:16
-------------------------------------------------------------------------------
