-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_nockd_complete.log
  log type:  text
 opened on:  20 Sep 2023, 16:49:35

. clear

. 
. *Merge `dataset'_nockd with `dataset'_nockd_complete
. capture noisily import delimited ./output/`dataset'_nockd.csv, clear
(18 vars, 10,901 obs)

. tempfile `dataset'_nockd

. save ``dataset'_nockd', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. capture noisily import delimited ./output/input_`dataset'_nockd_complete.csv,
>  clear
(24 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_nockd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        58,663
        from master                    48,881  (_merge==1)
        from using                      9,782  (_merge==2)

    matched                             1,119  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(58,663 observations deleted)

. drop _merge

. tempfile `dataset'_nockd_complete

. save ``dataset'_nockd_complete', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_nockd.csv, clear
> tempfile 2017_nockd
> save ./output/2017_nockd, replace
> capture noisily import delimited ./output/input_2017_nockd_complete.csv, clea
> r
> merge 1:1 patient_id using ./output/2017_nockd
> keep if _merge==3
> drop _merge
> tempfile 2017_nockd_complete
> save ./output/2017_nockd_complete, replace
> */
. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. drop sex

. rename male sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(479 real changes made, 479 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(479 missing values generated)

. gen min_creatinine_outcome=.
(1,119 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(0 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(0 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(0 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(0 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(0 real changes made)

. gen max_creatinine_outcome=.
(1,119 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(0 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(0 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(0 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,119 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(1,119 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(0 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(0 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(1119 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 0 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2
(0 real changes made)

. replace ckd_progression = 2 if egfr_end==3
(0 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(1119 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 0 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          . |      1,119      100.00      100.00
------------+-----------------------------------
      Total |      1,119      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(64 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(39 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(0 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(9 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(64 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(39 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(116 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |        891       79.62       79.62
            Dialysis |         64        5.72       85.34
   Kidney transplant |         39        3.49       88.83
KRT unclear modality |          9        0.80       89.63
            Deceased |        116       10.37      100.00
---------------------+-----------------------------------
               Total |      1,119      100.00

. gen ckd_group = 0

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(41 real changes made)

. replace ethnicity=2 if ethnicity==3
(37 real changes made)

. replace ethnicity=3 if ethnicity==4
(45 real changes made)

. replace ethnicity=4 if ethnicity==6
(41 real changes made)

. replace ethnicity=6 if ethnicity==.
(285 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,017 missing values generated)

. replace region = 2 if region_string=="East"
(112 real changes made)

. replace region = 3 if region_string=="London"
(231 real changes made)

. replace region = 4 if region_string=="North East"
(108 real changes made)

. replace region = 5 if region_string=="North West"
(102 real changes made)

. replace region = 6 if region_string=="South East"
(122 real changes made)

. replace region = 7 if region_string=="South West"
(112 real changes made)

. replace region = 8 if region_string=="West Midlands"
(109 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(121 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(1,119 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(454 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(665 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. save "./output/`dataset'_nockd_complete.dta", replace
(note: file ./output/2017_nockd_complete.dta not found)
file ./output/2017_nockd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_nockd_complete.log
  log type:  text
 closed on:  20 Sep 2023, 16:49:38
-------------------------------------------------------------------------------
