-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 opened on:   4 Jan 2023, 22:56:39

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,634 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,942 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,690 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,377       10.01       10.01
           East Midlands |      3,300        9.78       19.79
                  London |      6,875       20.38       40.17
              North East |      3,406       10.10       50.27
              North West |      3,376       10.01       60.28
              South East |      3,358        9.95       70.23
              South West |      3,253        9.64       79.87
           West Midlands |      3,439       10.19       90.07
Yorkshire and The Humber |      3,350        9.93      100.00
-------------------------+-----------------------------------
                   Total |     33,734      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,682        4.99        4.99
          1 |      6,423       19.04       24.03
          2 |      6,357       18.84       42.87
          3 |      6,398       18.97       61.84
          4 |      6,420       19.03       80.87
          5 |      6,454       19.13      100.00
------------+-----------------------------------
      Total |     33,734      100.00

. drop if imd==0
(1,682 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,005 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(771 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(789 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,070 real changes made, 14,070 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,070 missing values generated)

. gen min_baseline_creatinine=.
(32,052 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,183 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,799 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,183 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,799 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,451 real changes made)

. gen max_baseline_creatinine=.
(32,052 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,183 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,799 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,982 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,601 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,070 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,982 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,183 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,668 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,052
25%            0              0       Sum of Wgt.      32,052

50%            0                      Mean           12.47998
                        Largest       Std. Dev.      12.97989
75%     25.00468       43.76345
90%     29.09932       44.50148       Variance       168.4776
95%     31.34176       45.45984       Skewness        .213709
99%     35.08804       45.94014       Kurtosis       1.299328

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,591        5.52        5.52
         <= |      1,649        5.72       11.24
          = |     20,796       72.15       83.39
          > |      1,615        5.60       88.99
         >= |      1,598        5.54       94.54
          ~ |      1,575        5.46      100.00
------------+-----------------------------------
      Total |     28,824      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,607       54.93       54.93
          1 |     14,445       45.07      100.00
------------+-----------------------------------
      Total |     32,052      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,939       46.61       46.61
          1 |     17,113       53.39      100.00
------------+-----------------------------------
      Total |     32,052      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,440       94.97       94.97
          1 |      1,612        5.03      100.00
------------+-----------------------------------
      Total |     32,052      100.00
(742 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,467       95.05       95.05
          1 |      1,585        4.95      100.00
------------+-----------------------------------
      Total |     32,052      100.00
(675 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,454       95.01       95.01
          1 |      1,598        4.99      100.00
------------+-----------------------------------
      Total |     32,052      100.00
(694 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,422       94.91       94.91
          1 |      1,630        5.09      100.00
------------+-----------------------------------
      Total |     32,052      100.00
(623 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,433       94.95       94.95
          1 |      1,619        5.05      100.00
------------+-----------------------------------
      Total |     32,052      100.00
(606 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,424       94.92       94.92
          1 |      1,628        5.08      100.00
------------+-----------------------------------
      Total |     32,052      100.00
(593 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,006       34.34       34.34
          1 |     21,046       65.66      100.00
------------+-----------------------------------
      Total |     32,052      100.00

. drop if ckd==0
(11,006 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2017_ckd.csv not found)
file ./output/2017_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 closed on:   4 Jan 2023, 22:56:42
-------------------------------------------------------------------------------
