------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\ckd-healthcare-use\logs/2017_ckd_complete.log
  log type:  text
 opened on:  30 Nov 2022, 21:55:46

. clear

. 
. * Merge 2017_ckd with 2017_ckd_complete
. capture noisily import delimited ./output/2017_ckd.csv, clear
(encoding automatically selected: ISO-8859-1)
(6 vars, 2,414 obs)

. tempfile 2017_ckd

. save `2017_ckd', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000001.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000001.tmp saved as .dta format

. capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
(encoding automatically selected: ISO-8859-2)
(21 vars, 10,000 obs)

. merge 1:1 patient_id using `2017_ckd'

    Result                      Number of obs
    -----------------------------------------
    Not matched                        11,940
        from master                     9,763  (_merge==1)
        from using                      2,177  (_merge==2)

    Matched                               237  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(11,940 observations deleted)

. drop _merge

. tempfile 2017_ckd_complete

. save `2017_ckd_complete', replace
(file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000002.tmp not found)
file C:\Users\LSH170~1\AppData\Local\Temp\ST_adc_000002.tmp saved as .dta format

. 
. * Baseline dialysis & kidney transplant group classification
. drop dialysis_baseline_primary_care

. drop dialysis_baseline_icd_10

. drop dialysis_baseline_opcs_4

. drop kt_baseline_primary_care

. drop kt_baseline_icd_10

. drop kt_baseline_opcs_4

. gen dialysis_baseline = date(dialysis_baseline_date, "YMD")
(207 missing values generated)

. format dialysis_baseline %td

. drop dialysis_baseline_date

. gen kidney_transplant_baseline = date(kidney_transplant_baseline_date, "YMD")
(205 missing values generated)

. format kidney_transplant_baseline %td

. drop kidney_transplant_baseline_date

. gen dialysis = 0

. replace dialysis = 1 if dialysis_baseline!=.
(30 real changes made)

. replace dialysis = 0 if kidney_transplant_baseline > dialysis_baseline
(29 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline!=.
(32 real changes made)

. replace kidney_transplant = 0 if dialysis_baseline > kidney_transplant_baseline
(31 real changes made)

. drop dialysis_baseline

. drop kidney_transplant_baseline

. 
. * CKD stage classification
. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(66 missing values generated)

. drop baseline_egfr

. recode ckd_group 0=3 30=2 60=1
(171 changes made to ckd_group)

. replace ckd_group = 4 if dialysis==1
(1 real change made)

. drop dialysis

. replace ckd_group = 5 if kidney_transplant==1
(1 real change made)

. drop kidney_transplant

. label define ckd_group 1 "eGFR ≥60 with albuminuria" 2 "CKD 3" 3 "CKD 4/5 without kidney replacement therapy" 4 "Dialysis" 5 "Kidney transplant"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. 
. * Dialysis & kidney transplant outcome classification
. drop dialysis_outcome_primary_care

. drop dialysis_outcome_icd_10

. drop dialysis_outcome_opcs_4

. drop kt_outcome_primary_care

. drop kt_outcome_icd_10

. drop kt_outcome_opcs_4

. gen dialysis_outcome = date(dialysis_outcome_date, "YMD")
(201 missing values generated)

. format dialysis_outcome %td

. drop dialysis_outcome_date

. gen kidney_transplant_outcome = date(kidney_transplant_outcome_date, "YMD")
(207 missing values generated)

. format kidney_transplant_outcome %td

. drop kidney_transplant_outcome_date

. gen dialysis_new = 0

. replace dialysis_new = 1 if dialysis_outcome!=. & ckd_group!=4/5
(36 real changes made)

. replace dialysis_new = 0 if kidney_transplant_outcome > dialysis_outcome
(34 real changes made)

. gen kidney_transplant_new = 0

. replace kidney_transplant_new = 1 if kidney_transplant_outcome!=. & ckd_group!=4/5
(30 real changes made)

. replace kidney_transplant_new = 0 if dialysis_outcome > kidney_transplant_outcome
(29 real changes made)

. drop dialysis_outcome

. drop kidney_transplant_outcome

. 
. * eGFR outcome classification
. gen sex = 1 if male == "Male"
(147 missing values generated)

. replace sex = 0 if male == "Female"
(147 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(101 real changes made, 101 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(101 missing values generated)

. gen min_creatinine_outcome=.
(237 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(86 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(50 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(86 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(50 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(87 real changes made)

. gen max_creatinine_outcome=.
(237 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(86 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(50 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(136 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(150 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(101 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(136 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(86 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(101 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(136 changes made to egfr_end)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(8 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(0 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(1 real change made)

. replace ckd_progression = 3 if dialysis_new==1
(2 real changes made)

. replace ckd_progression = 4 if kidney_transplant_new==1
(1 real change made)

. drop dialysis_new

. drop kidney_transplant_new

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 without kidney replacement therapy" 3 "Dialysis" 4 "Kidney transplant"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(7 real changes made)

. replace ethnicity=2 if ethnicity==3
(8 real changes made)

. replace ethnicity=3 if ethnicity==4
(5 real changes made)

. replace ethnicity=4 if ethnicity==6
(7 real changes made)

. replace ethnicity=6 if ethnicity==.
(52 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(215 missing values generated)

. replace region = 2 if region_string=="East"
(22 real changes made)

. replace region = 3 if region_string=="London"
(56 real changes made)

. replace region = 4 if region_string=="North East"
(20 real changes made)

. replace region = 5 if region_string=="North West"
(26 real changes made)

. replace region = 6 if region_string=="South East"
(23 real changes made)

. replace region = 7 if region_string=="South West"
(19 real changes made)

. replace region = 8 if region_string=="West Midlands"
(24 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(25 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(237 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(100 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(137 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. export delimited using "./output/2017_ckd_complete.csv", replace
file ./output/2017_ckd_complete.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\ckd-healthcare-use\logs/2017_ckd_complete.log
  log type:  text
 closed on:  30 Nov 2022, 21:55:51
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
