------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\ckd-healthcare-use\logs/2017_ckd.log
  log type:  text
 opened on:  11 Dec 2022, 20:52:10

. clear

. 
. import delimited ./output/input_2017.csv, delimiter(comma) varnames(1) case(preserve) 
(encoding automatically selected: ISO-8859-1)
(17 vars, 10,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(2,142 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(399 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(732 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |        668        9.93        9.93
           East Midlands |        675       10.03       19.96
                  London |      1,348       20.04       40.00
              North East |        648        9.63       49.64
              North West |        624        9.28       58.91
              South East |        670        9.96       68.87
              South West |        657        9.77       78.64
           West Midlands |        716       10.64       89.28
Yorkshire and The Humber |        721       10.72      100.00
-------------------------+-----------------------------------
                   Total |      6,727      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        324        4.82        4.82
          1 |      1,226       18.23       23.04
          2 |      1,260       18.73       41.77
          3 |      1,281       19.04       60.81
          4 |      1,337       19.88       80.69
          5 |      1,299       19.31      100.00
------------+-----------------------------------
      Total |      6,727      100.00

. drop if imd==0
(324 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(3,193 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(160 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(165 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(2,814 real changes made, 2,814 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(2,814 missing values generated)

. gen min_baseline_creatinine=.
(6,403 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(1,839 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(1,750 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(1,839 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(1,750 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(2,235 real changes made)

. gen max_baseline_creatinine=.
(6,403 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(1,839 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(1,750 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(3,589 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(4,168 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(2,814 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(3,589 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(1,839 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(535 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs               6,403
25%            0              0       Sum of wgt.       6,403

50%            0                      Mean           12.43542
                        Largest       Std. dev.      12.96983
75%     24.93198       41.35659
90%     29.08867       41.37986       Variance       168.2165
95%     31.34713       42.07492       Skewness       .2227376
99%     35.23731       42.52898       Kurtosis       1.308932

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |        313        5.46        5.46
         <= |        337        5.88       11.35
          = |      4,109       71.72       83.07
          > |        332        5.80       88.86
         >= |        316        5.52       94.38
          ~ |        322        5.62      100.00
------------+-----------------------------------
      Total |      5,729      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,535       55.21       55.21
          1 |      2,868       44.79      100.00
------------+-----------------------------------
      Total |      6,403      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,000       46.85       46.85
          1 |      3,403       53.15      100.00
------------+-----------------------------------
      Total |      6,403      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10                                 ///
>                                                 dialysis_opcs_4                                 ///
>                                                 kidney_transplant_primary_care  ///
>                                                 kidney_transplant_icd_10                ///
>                                                 kidney_transplant_opcs_4                {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,081       94.97       94.97
          1 |        322        5.03      100.00
------------+-----------------------------------
      Total |      6,403      100.00
(146 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,058       94.61       94.61
          1 |        345        5.39      100.00
------------+-----------------------------------
      Total |      6,403      100.00
(162 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,118       95.55       95.55
          1 |        285        4.45      100.00
------------+-----------------------------------
      Total |      6,403      100.00
(121 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,074       94.86       94.86
          1 |        329        5.14      100.00
------------+-----------------------------------
      Total |      6,403      100.00
(136 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,071       94.81       94.81
          1 |        332        5.19      100.00
------------+-----------------------------------
      Total |      6,403      100.00
(133 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,098       95.24       95.24
          1 |        305        4.76      100.00
------------+-----------------------------------
      Total |      6,403      100.00
(125 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,177       34.00       34.00
          1 |      4,226       66.00      100.00
------------+-----------------------------------
      Total |      6,403      100.00

. drop if ckd==0
(2,177 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. 
. export delimited using "./output/2017_ckd.csv", replace
file ./output/2017_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\ckd-healthcare-use\logs/2017_ckd.log
  log type:  text
 closed on:  11 Dec 2022, 20:52:11
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
