-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete_v2.log
  log type:  text
 opened on:  24 Mar 2023, 18:39:38

. clear

. 
. *Merge `dataset'_ckd_v2 with `dataset'_ckd_complete_v2
. capture noisily import delimited ./output/`dataset'_ckd_v2.csv, clear
(7 vars, 21,125 obs)

. tempfile `dataset'_ckd_v2

. save ``dataset'_ckd'_v2, replace
(note: file _v2.dta not found)
file _v2.dta saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete_v2.csv
> , clear
(210 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'_v2

    Result                           # of obs.
    -----------------------------------------
    not matched                        67,055
        from master                    47,965  (_merge==1)
        from using                     19,090  (_merge==2)

    matched                             2,035  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(67,055 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v2

. save ``dataset'_ckd_complete'_v2, replace
file _v2.dta saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd_v2.csv, clear
> tempfile 2017_ckd_v2
> save 2017_ckd_v2, replace
> capture noisily import delimited ./output/input_2017_ckd_complete_v2.csv, cle
> ar
> merge 1:1 patient_id using 2017_ckd_v2
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v2
> save 2017_ckd_complete_v2, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        181        8.89        8.89
Kidney transplant |        156        7.67       16.56
 Modality unclear |         43        2.11       18.67
          Pre KRT |      1,655       81.33      100.00
------------------+-----------------------------------
            Total |      2,035      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(784 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1251 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(181 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(156 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(43 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(643 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,259       61.87       61.87
  CKD stage 3 |        382       18.77       80.64
CKD stage 4/5 |         14        0.69       81.33
     Dialysis |        181        8.89       90.22
   Transplant |        156        7.67       97.89
  KRT unclear |         43        2.11      100.00
--------------+-----------------------------------
        Total |      2,035      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,259 |     1,259 
  CKD stage 3 |         0          0          0        382 |       382 
CKD stage 4/5 |         0          0          0         14 |        14 
     Dialysis |       181          0          0          0 |       181 
   Transplant |         0        156          0          0 |       156 
  KRT unclear |         0          0         43          0 |        43 
--------------+--------------------------------------------+----------
        Total |       181        156         43      1,655 |     2,035 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       126         71         50         18 |     1,259 
  CKD stage 3 |        46         16         16          2 |       382 
CKD stage 4/5 |         2          0          1          0 |        14 
     Dialysis |        19          8          5          0 |       181 
   Transplant |        17         11          8          4 |       156 
  KRT unclear |         4          1          5          1 |        43 
--------------+--------------------------------------------+----------
        Total |       214        107         85         25 |     2,035 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |       994 |     1,259 
  CKD stage 3 |       302 |       382 
CKD stage 4/5 |        11 |        14 
     Dialysis |       149 |       181 
   Transplant |       116 |       156 
  KRT unclear |        32 |        43 
--------------+-----------+----------
        Total |     1,604 |     2,035 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,110 missing values generated)

. replace sex = 0 if male == "Female"
(1,110 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(889 real changes made, 889 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(889 missing values generated)

. gen min_creatinine_outcome=.
(2,035 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(645 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(501 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(645 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(501 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(732 real changes made)

. gen max_creatinine_outcome=.
(2,035 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(645 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(501 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,146 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,303 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(889 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,146 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(645 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(889 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1146 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(182 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(9 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(1 real change made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(107 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(85 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(25 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(214 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,443       70.91       70.91
               CKD 3 |        152        7.47       78.38
     CKD 4/5 pre-KRT |          9        0.44       78.82
            Dialysis |        107        5.26       84.08
   Kidney transplant |         85        4.18       88.26
KRT unclear modality |         25        1.23       89.48
            Deceased |        214       10.52      100.00
---------------------+-----------------------------------
               Total |      2,035      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,259
  CKD stage |          90           0         382
  CKD stage |           2           0          14
   Dialysis |          57           0         181
  Transplan |          34           0         156
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   211.63489   116.37451       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,035         495           0        495        495

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,259
  CKD stage |          96           0         382
  CKD stage |           4           0          14
   Dialysis |          33           0         181
  Transplan |          24           0         156
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   258.70663   157.36177       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,035         546           0        546        546

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,259
  CKD stage |         124           0         382
  CKD stage |           0           0          14
   Dialysis |          51           0         181
  Transplan |          43           0         156
  KRT uncle |          22           0          43
------------+------------------------------------
      Total |    240.6855   126.60049       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,035         578           0        578        578

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,259
  CKD stage |          85           0         382
  CKD stage |           2           0          14
   Dialysis |          37           0         181
  Transplan |          56           0         156
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   200.70516   109.76748       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,035         476           0        476        476

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,259
  CKD stage |          75           0         382
  CKD stage |           0           0          14
   Dialysis |          61           0         181
  Transplan |          65           0         156
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   243.72973   140.88478       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,035         566           0        566        566

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,259
  CKD stage |         124           0         382
  CKD stage |           8           0          14
   Dialysis |          21           0         181
  Transplan |          29           0         156
  KRT uncle |           1           0          43
------------+------------------------------------
      Total |   222.94447   122.76751       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,035         499           0        499        499

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,259
  CKD stage |         101           0         382
  CKD stage |          11           0          14
   Dialysis |          65           0         181
  Transplan |          35           0         156
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   231.31744   125.91591       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,035         554           0        554        554

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,259
  CKD stage |         107           0         382
  CKD stage |           3           0          14
   Dialysis |          64           0         181
  Transplan |          52           0         156
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |    249.1543   134.86156       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,035         597           0        597        597

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,259
  CKD stage |          89           0         382
  CKD stage |           4           0          14
   Dialysis |          49           0         181
  Transplan |          26           0         156
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   243.60786    144.3245       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,035         537           0        537        537

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,259
  CKD stage |         100           0         382
  CKD stage |           2           0          14
   Dialysis |          62           0         181
  Transplan |          42           0         156
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   247.99951   138.81909       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,035         573           0        573        573

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,259
  CKD stage |         110           0         382
  CKD stage |           0           0          14
   Dialysis |          62           0         181
  Transplan |          53           0         156
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   245.65111   131.97439       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,035         579           0        579        579

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,259
  CKD stage |         111           0         382
  CKD stage |           7           0          14
   Dialysis |          21           0         181
  Transplan |          30           0         156
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |    217.6285   122.09257       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,035         488           0        488        488

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,259
  CKD stage |         101           0         382
  CKD stage |           4           0          14
   Dialysis |          58           0         181
  Transplan |          38           0         156
  KRT uncle |           1           0          43
------------+------------------------------------
      Total |   239.90319   134.13249       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,035         546           0        546        546

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,259
  CKD stage |          79           0         382
  CKD stage |           0           0          14
   Dialysis |          35           0         181
  Transplan |          31           0         156
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |       237.6    145.3709       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,035         502           0        502        502

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,259
  CKD stage |          98           0         382
  CKD stage |           0           0          14
   Dialysis |          63           0         181
  Transplan |          30           0         156
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   214.67174   115.44202       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,035         509           0        509        509

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,259
  CKD stage |          98           0         382
  CKD stage |           0           0          14
   Dialysis |          35           0         181
  Transplan |          27           0         156
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   244.12236   144.20283       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,035         530           0        530        530

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,259
  CKD stage |          77           0         382
  CKD stage |           0           0          14
   Dialysis |          34           0         181
  Transplan |          71           0         156
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   242.31155   142.94709       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,035         554           0        554        554

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,259
  CKD stage |         122           0         382
  CKD stage |           3           0          14
   Dialysis |          31           0         181
  Transplan |          37           0         156
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |    255.2457   143.95617       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,035         573           0        573        573

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,259
  CKD stage |         112           0         382
  CKD stage |           3           0          14
   Dialysis |          61           0         181
  Transplan |          33           0         156
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |    246.3656   135.29766       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         570           0        570        570

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,259
  CKD stage |          98           0         382
  CKD stage |           1           0          14
   Dialysis |          47           0         181
  Transplan |          41           0         156
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   223.37887   123.28202       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         520           0        520        520

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,259
  CKD stage |          64           0         382
  CKD stage |           3           0          14
   Dialysis |          36           0         181
  Transplan |          32           0         156
  KRT uncle |          23           0          43
------------+------------------------------------
      Total |   224.19361   139.01318       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         491           0        491        491

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,259
  CKD stage |          91           0         382
  CKD stage |           8           0          14
   Dialysis |          62           0         181
  Transplan |          69           0         156
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   238.45897   130.10531       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         578           0        578        578

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,259
  CKD stage |         129           0         382
  CKD stage |           2           0          14
   Dialysis |          33           0         181
  Transplan |          26           0         156
  KRT uncle |          26           0          43
------------+------------------------------------
      Total |    249.9543   138.66226       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,035         572           0        572        572

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,259
  CKD stage |          74           0         382
  CKD stage |           5           0          14
   Dialysis |          48           0         181
  Transplan |          19           0         156
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   230.33808   140.49484       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,035         502           0        502        502

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         242           0       1,259
  CKD stage |          95           0         382
  CKD stage |           4           0          14
   Dialysis |          85           0         181
  Transplan |          28           0         156
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   177.47617   84.476989       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,035         463           0        463        463

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,259
  CKD stage |          53           0         382
  CKD stage |          10           0          14
   Dialysis |          41           0         181
  Transplan |          30           0         156
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   246.44865    160.1313       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,035         522           0        522        522

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,259
  CKD stage |         143           0         382
  CKD stage |           0           0          14
   Dialysis |          37           0         181
  Transplan |          24           0         156
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   219.08796   111.53531       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,035         519           0        519        519

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         395           0       1,259
  CKD stage |         114           0         382
  CKD stage |           4           0          14
   Dialysis |          72           0         181
  Transplan |          52           0         156
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |    276.3199   152.63037       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,035         643           0        643        643

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,259
  CKD stage |          80           0         382
  CKD stage |           5           0          14
   Dialysis |          41           0         181
  Transplan |          63           0         156
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   235.47322   136.32834       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,035         548           0        548        548

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,259
  CKD stage |          90           0         382
  CKD stage |           4           0          14
   Dialysis |          42           0         181
  Transplan |          53           0         156
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   231.05553    130.8564       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,035         537           0        537        537

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,259
  CKD stage |          62           0         382
  CKD stage |           0           0          14
   Dialysis |          33           0         181
  Transplan |          44           0         156
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   233.99017   146.90755       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         494           0        494        494

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,259
  CKD stage |          83           0         382
  CKD stage |           0           0          14
   Dialysis |          13           0         181
  Transplan |          47           0         156
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   211.69975   125.46608       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         461           0        461        461

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,259
  CKD stage |          93           0         382
  CKD stage |           1           0          14
   Dialysis |          51           0         181
  Transplan |          45           0         156
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   208.64079   112.65545       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         489           0        489        489

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,259
  CKD stage |          98           0         382
  CKD stage |           0           0          14
   Dialysis |          25           0         181
  Transplan |          44           0         156
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   221.53956    126.0689       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         495           0        495        495

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         383           0       1,259
  CKD stage |         120           0         382
  CKD stage |           6           0          14
   Dialysis |          22           0         181
  Transplan |          48           0         156
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   265.55676   152.23073       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,035         598           0        598        598

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,259
  CKD stage |          85           0         382
  CKD stage |           1           0          14
   Dialysis |          47           0         181
  Transplan |          16           0         156
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   230.75577    137.9012       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,035         500           0        500        500

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,259
  CKD stage |         135           0         382
  CKD stage |           4           0          14
   Dialysis |          64           0         181
  Transplan |          27           0         156
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   213.33415   103.56854       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,035         529           0        529        529

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,259
  CKD stage |         124           0         382
  CKD stage |           7           0          14
   Dialysis |          29           0         181
  Transplan |          35           0         156
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   239.04177   132.06857       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,035         540           0        540        540

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,259
  CKD stage |         106           0         382
  CKD stage |           0           0          14
   Dialysis |          29           0         181
  Transplan |          49           0         156
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   218.38133   118.93349       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,035         511           0        511        511

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,259
  CKD stage |         110           0         382
  CKD stage |           0           0          14
   Dialysis |          55           0         181
  Transplan |          14           0         156
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   244.55577    139.3373       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,035         539           0        539        539

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,259
  CKD stage |          80           0         382
  CKD stage |           7           0          14
   Dialysis |          51           0         181
  Transplan |          38           0         156
  KRT uncle |          23           0          43
------------+------------------------------------
      Total |   239.53612   141.33174       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,035         549           0        549        549

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,259
  CKD stage |          94           0         382
  CKD stage |           3           0          14
   Dialysis |          52           0         181
  Transplan |          29           0         156
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   222.06093   124.97527       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,035         506           0        506        506

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,259
  CKD stage |         105           0         382
  CKD stage |           8           0          14
   Dialysis |          62           0         181
  Transplan |          19           0         156
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   213.85012   114.64378       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,035         509           0        509        509

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         242           0       1,259
  CKD stage |          95           0         382
  CKD stage |           0           0          14
   Dialysis |          56           0         181
  Transplan |          66           0         156
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   177.67666   83.508845       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,035         463           0        463        463

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,259
  CKD stage |         120           0         382
  CKD stage |           4           0          14
   Dialysis |          41           0         181
  Transplan |          34           0         156
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   228.10369   122.73671       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,035         525           0        525        525

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,259
  CKD stage |          82           0         382
  CKD stage |           0           0          14
   Dialysis |          67           0         181
  Transplan |          68           0         156
  KRT uncle |          21           0          43
------------+------------------------------------
      Total |   219.41572   117.16411       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         549           0        549        549

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,259
  CKD stage |         103           0         382
  CKD stage |           8           0          14
   Dialysis |          37           0         181
  Transplan |          43           0         156
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   225.89287   125.62434       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,035         518           0        518        518

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,259
  CKD stage |          72           0         382
  CKD stage |           4           0          14
   Dialysis |          31           0         181
  Transplan |          55           0         156
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   244.23784   149.27283       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,035         541           0        541        541

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,259
  CKD stage |          79           0         382
  CKD stage |           2           0          14
   Dialysis |          65           0         181
  Transplan |          19           0         156
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   191.85111   105.94451       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,035         451           0        451        451

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,259
  CKD stage |         104           0         382
  CKD stage |           3           0          14
   Dialysis |          51           0         181
  Transplan |          50           0         156
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   203.99558   103.68711       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,035         510           0        510        510

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,259
  CKD stage |         117           0         382
  CKD stage |          15           0          14
   Dialysis |          26           0         181
  Transplan |          33           0         156
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   227.07764   125.33642       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,035         530           0        530        530

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,259
  CKD stage |          83           0         382
  CKD stage |           1           0          14
   Dialysis |          59           0         181
  Transplan |          47           0         156
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   239.88403   138.42699       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,035         545           0        545        545

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,259
  CKD stage |         106           0         382
  CKD stage |           3           0          14
   Dialysis |          46           0         181
  Transplan |          62           0         156
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   223.32187     117.171       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,035         545           0        545        545

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,259
  CKD stage |         108           0         382
  CKD stage |           3           0          14
   Dialysis |          48           0         181
  Transplan |          31           0         156
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   216.52826   116.29265       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,035         509           0        509        509

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,259
  CKD stage |          96           0         382
  CKD stage |           0           0          14
   Dialysis |          43           0         181
  Transplan |          48           0         156
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   236.04275   133.72974       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         535           0        535        535

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,259
  CKD stage |          70           0         382
  CKD stage |           6           0          14
   Dialysis |          37           0         181
  Transplan |          28           0         156
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   217.95823   133.23709       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         469           0        469        469

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,259
  CKD stage |         106           0         382
  CKD stage |           0           0          14
   Dialysis |          31           0         181
  Transplan |          37           0         156
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |    206.4398   111.54821       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         480           0        480        480

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,259
  CKD stage |          70           0         382
  CKD stage |           0           0          14
   Dialysis |          34           0         181
  Transplan |          29           0         156
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   227.62555   141.29393       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         477           0        477        477

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         396           0       1,259
  CKD stage |         120           0         382
  CKD stage |           0           0          14
   Dialysis |          38           0         181
  Transplan |          48           0         156
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |    274.6855   156.80081       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,035         607           0        607        607

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         411           0       1,259
  CKD stage |         120           0         382
  CKD stage |           0           0          14
   Dialysis |          76           0         181
  Transplan |          44           0         156
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   287.27125    159.2647       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,035         667           0        667        667

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,259
  CKD stage |         123           0         382
  CKD stage |           5           0          14
   Dialysis |          67           0         181
  Transplan |          25           0         156
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   220.60885   112.06885       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,035         540           0        540        540

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,259
  CKD stage |          90           0         382
  CKD stage |           4           0          14
   Dialysis |          65           0         181
  Transplan |          30           0         156
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   241.06781   138.62606       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,035         545           0        545        545

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,259
  CKD stage |          75           0         382
  CKD stage |           0           0          14
   Dialysis |          32           0         181
  Transplan |          37           0         156
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   213.06192   126.85482       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,035         469           0        469        469

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,259
  CKD stage |          97           0         382
  CKD stage |           4           0          14
   Dialysis |          47           0         181
  Transplan |          39           0         156
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   206.84619   111.41803       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,035         488           0        488        488

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,259
  CKD stage |         108           0         382
  CKD stage |           0           0          14
   Dialysis |          64           0         181
  Transplan |          32           0         156
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   217.43096   113.66299       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,035         524           0        524        524

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         270           0       1,259
  CKD stage |         109           0         382
  CKD stage |           2           0          14
   Dialysis |          41           0         181
  Transplan |          56           0         156
  KRT uncle |          23           0          43
------------+------------------------------------
      Total |   195.94201   96.664152       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,035         501           0        501        501

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,259
  CKD stage |          42           0         382
  CKD stage |           0           0          14
   Dialysis |          61           0         181
  Transplan |          25           0         156
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   195.51351   122.00283       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,035         431           0        431        431

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,259
  CKD stage |          89           0         382
  CKD stage |           8           0          14
   Dialysis |          58           0         181
  Transplan |          42           0         156
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   256.13759   149.68049       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,035         581           0        581        581

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,259
  CKD stage |          97           0         382
  CKD stage |          11           0          14
   Dialysis |          52           0         181
  Transplan |          25           0         156
  KRT uncle |          21           0          43
------------+------------------------------------
      Total |   222.00737   123.88606       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,035         524           0        524        524

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,259
  CKD stage |          99           0         382
  CKD stage |           1           0          14
   Dialysis |          39           0         181
  Transplan |          58           0         156
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   236.32039   132.26154       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         540           0        540        540

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,259
  CKD stage |         103           0         382
  CKD stage |           3           0          14
   Dialysis |          37           0         181
  Transplan |          41           0         156
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |    256.7656   149.67328       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,035         567           0        567        567

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,259
  CKD stage |         133           0         382
  CKD stage |           7           0          14
   Dialysis |          25           0         181
  Transplan |          45           0         156
  KRT uncle |           1           0          43
------------+------------------------------------
      Total |   213.83587   109.62422       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,035         507           0        507        507

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,259
  CKD stage |         104           0         382
  CKD stage |           0           0          14
   Dialysis |          63           0         181
  Transplan |          39           0         156
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   218.11155   115.07963       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,035         516           0        516        516

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         392           0       1,259
  CKD stage |          81           0         382
  CKD stage |           2           0          14
   Dialysis |          62           0         181
  Transplan |          29           0         156
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   265.58182   161.81931       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,035         571           0        571        571

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,259
  CKD stage |          90           0         382
  CKD stage |           0           0          14
   Dialysis |          67           0         181
  Transplan |          35           0         156
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |    240.5543   136.58585       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,035         555           0        555        555

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,259
  CKD stage |         109           0         382
  CKD stage |           0           0          14
   Dialysis |          52           0         181
  Transplan |          46           0         156
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   218.67174   114.59567       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,035         520           0        520        520

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,259
  CKD stage |          79           0         382
  CKD stage |          13           0          14
   Dialysis |          66           0         181
  Transplan |          40           0         156
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   231.42801   132.54376       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,035         548           0        548        548

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,259
  CKD stage |         137           0         382
  CKD stage |           9           0          14
   Dialysis |          39           0         181
  Transplan |          39           0         156
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   243.45848   128.27587       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,035         577           0        577        577

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         262           0       1,259
  CKD stage |          98           0         382
  CKD stage |           5           0          14
   Dialysis |          14           0         181
  Transplan |          48           0         156
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   185.87027   99.653499       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         447           0        447        447

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,259
  CKD stage |          70           0         382
  CKD stage |           1           0          14
   Dialysis |          37           0         181
  Transplan |          40           0         156
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   201.49975   118.51221       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         447           0        447        447

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,259
  CKD stage |         150           0         382
  CKD stage |           5           0          14
   Dialysis |          62           0         181
  Transplan |          30           0         156
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   252.17641   128.09305       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         608           0        608        608

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,259
  CKD stage |          86           0         382
  CKD stage |           3           0          14
   Dialysis |          45           0         181
  Transplan |          19           0         156
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   207.92826   120.09107       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,035         458           0        458        458

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,259
  CKD stage |         130           0         382
  CKD stage |           5           0          14
   Dialysis |          54           0         181
  Transplan |          37           0         156
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   243.29779   127.64809       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,035         579           0        579        579

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,259
  CKD stage |         126           0         382
  CKD stage |           0           0          14
   Dialysis |          46           0         181
  Transplan |          25           0         156
  KRT uncle |          24           0          43
------------+------------------------------------
      Total |   260.93219   145.70059       2,035

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,035         594           0        594        594

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(88 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(71 real changes made)

. replace ethnicity=4 if ethnicity==6
(88 real changes made)

. replace ethnicity=6 if ethnicity==.
(513 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,821 missing values generated)

. replace region = 2 if region_string=="East"
(204 real changes made)

. replace region = 3 if region_string=="London"
(397 real changes made)

. replace region = 4 if region_string=="North East"
(206 real changes made)

. replace region = 5 if region_string=="North West"
(193 real changes made)

. replace region = 6 if region_string=="South East"
(199 real changes made)

. replace region = 7 if region_string=="South West"
(214 real changes made)

. replace region = 8 if region_string=="West Midlands"
(193 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(215 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,035 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(825 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,210 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v2.dta", replace
(note: file ./output/2017_ckd_complete_v2.dta not found)
file ./output/2017_ckd_complete_v2.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete_v2.log
  log type:  text
 closed on:  24 Mar 2023, 18:39:46
-------------------------------------------------------------------------------
