-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 opened on:   8 Jan 2023, 20:37:34

. clear

. 
. * Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 21,046 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(199 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,788
        from master                    47,871  (_merge==1)
        from using                     18,917  (_merge==2)

    matched                             2,129  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,788 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved

. 
. /* Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save 2017_ckd_complete, replace
> */
. 
. * Baseline dialysis & kidney transplant group classification
. drop dialysis_baseline_primary_care

. drop dialysis_baseline_icd_10

. drop dialysis_baseline_opcs_4

. drop kt_baseline_primary_care

. drop kt_baseline_icd_10

. drop kt_baseline_opcs_4

. gen dialysis_baseline = date(dialysis_baseline_date, "YMD")
(1,811 missing values generated)

. format dialysis_baseline %td

. drop dialysis_baseline_date

. gen kidney_transplant_baseline = date(kidney_transplant_baseline_date, "YMD")
(1,834 missing values generated)

. format kidney_transplant_baseline %td

. drop kidney_transplant_baseline_date

. sum dialysis_baseline, detail

                      dialysis_baseline
-------------------------------------------------------------
      Percentiles      Smallest
 1%         3930           3740
 5%         4707           3743
10%         5408           3899       Obs                 318
25%         8951           3930       Sum of Wgt.         318

50%      12963.5                      Mean           12627.48
                        Largest       Std. Dev.      4926.083
75%        16817          20678
90%        19480          20692       Variance       2.43e+07
95%        20235          20784       Skewness      -.0846196
99%        20678          20815       Kurtosis       1.870842

. sum kidney_transplant_baseline, detail

                 kidney_transplant_baseline
-------------------------------------------------------------
      Percentiles      Smallest
 1%         3901           3700
 5%         4334           3783
10%         4893           3901       Obs                 295
25%         7619           3906       Sum of Wgt.         295

50%        12485                      Mean           12477.55
                        Largest       Std. Dev.      5191.713
75%        17333          20760
90%        19257          20791       Variance       2.70e+07
95%        19949          20866       Skewness       -.107364
99%        20791          20879       Kurtosis       1.736539

. gen dialysis_baseline2 = dialysis_baseline - kidney_transplant_baseline
(2,101 missing values generated)

. gen dialysis_baseline3 = 0

. replace dialysis_baseline3 = 1 if dialysis_baseline2 > 0
(2,114 real changes made)

. gen kidney_transplant_baseline2 = kidney_transplant_baseline - dialysis_basel
> ine
(2,101 missing values generated)

. gen kidney_transplant_baseline3 = 0

. sum dialysis_baseline2, detail

                     dialysis_baseline2
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -13527         -13527
 5%       -12978         -12978
10%       -10799         -10799       Obs                  28
25%      -4227.5          -6161       Sum of Wgt.          28

50%       -330.5                      Mean             206.25
                        Largest       Std. Dev.      7441.827
75%         3368          11468
90%        11706          11706       Variance       5.54e+07
95%        14833          14833       Skewness       .2851308
99%        14854          14854       Kurtosis       2.726965

. sum kidney_transplant_baseline2, detail

                 kidney_transplant_baseline2
-------------------------------------------------------------
      Percentiles      Smallest
 1%       -14854         -14854
 5%       -14833         -14833
10%       -11706         -11706       Obs                  28
25%        -3368         -11468       Sum of Wgt.          28

50%        330.5                      Mean            -206.25
                        Largest       Std. Dev.      7441.827
75%       4227.5           6161
90%        10799          10799       Variance       5.54e+07
95%        12978          12978       Skewness      -.2851308
99%        13527          13527       Kurtosis       2.726965

. replace kidney_transplant_baseline3 = 1 if kidney_transplant_baseline2 > 0
(2,116 real changes made)

. gen dialysis = 0

. replace dialysis = 1 if dialysis_baseline!=.
(318 real changes made)

. replace dialysis = 0 if kidney_transplant_baseline > dialysis_baseline
(305 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline!=.
(295 real changes made)

. replace kidney_transplant = 0 if dialysis_baseline > kidney_transplant_baseli
> ne
(280 real changes made)

. drop dialysis_baseline

. drop kidney_transplant_baseline

. tab dialysis dialysis_baseline3, m

           |  dialysis_baseline3
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |        15      2,101 |     2,116 
         1 |         0         13 |        13 
-----------+----------------------+----------
     Total |        15      2,114 |     2,129 

. tab kidney_transplant kidney_transplant_baseline3, m

           | kidney_transplant_bas
kidney_tra |        eline3
   nsplant |         0          1 |     Total
-----------+----------------------+----------
         0 |        13      2,101 |     2,114 
         1 |         0         15 |        15 
-----------+----------------------+----------
     Total |        13      2,116 |     2,129 

. tab dialysis kidney_transplant, m

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,101         15 |     2,116 
         1 |        13          0 |        13 
-----------+----------------------+----------
     Total |     2,114         15 |     2,129 

. 
. * CKD stage classification based on baseline eGFR
. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(836 missing values generated)

. drop baseline_egfr

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1293 changes made)

. replace ckd_group = 4 if dialysis==1
(13 real changes made)

. drop dialysis

. replace ckd_group = 5 if kidney_transplant==1
(15 real changes made)

. drop kidney_transplant

. label define ckd_group 1 "eGFR ≥60 with albuminuria" 2 "CKD 3" 3 "CKD 4/5 wit
> hout kidney replacement therapy" 4 "Dialysis" 5 "Kidney transplant"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. 
. * Dialysis & kidney transplant outcome classification
. drop dialysis_outcome_primary_care

. drop dialysis_outcome_icd_10

. drop dialysis_outcome_opcs_4

. gen dialysis_outcome_date = date(dialysis_outcome, "YMD")
(1,816 missing values generated)

. format dialysis_outcome_date %td

. drop dialysis_outcome

. gen kidney_transplant_outcome_date = date(kidney_transplant_outcome, "YMD")
(2,027 missing values generated)

. format kidney_transplant_outcome_date %td

. drop kidney_transplant_outcome

. sum dialysis_outcome_date, detail

                    dialysis_outcome_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%        20919          20912
 5%        20931          20913
10%        20945          20916       Obs                 313
25%        21001          20919       Sum of Wgt.         313

50%        21086                      Mean            21093.2
                        Largest       Std. Dev.      105.5565
75%        21192          21271
90%        21237          21274       Variance       11142.18
95%        21251          21274       Skewness       .0058506
99%        21271          21274       Kurtosis       1.762394

. sum kidney_transplant_outcome_date, detail

               kidney_transplant_outcome_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%        20926          20918
 5%        20940          20926
10%        20959          20935       Obs                 102
25%        21006          20937       Sum of Wgt.         102

50%      21101.5                      Mean           21097.52
                        Largest       Std. Dev.      106.4401
75%        21203          21262
90%        21235          21263       Variance        11329.5
95%        21252          21266       Skewness       .0096934
99%        21266          21269       Kurtosis       1.646723

. gen index_date = mdy(04, 01, 2017)

. gen dialysis_outcome = dialysis_outcome_date - index_date
(1,816 missing values generated)

. gen kidney_transplant_outcome = kidney_transplant_outcome_date - index_date
(2,027 missing values generated)

. sum dialysis_outcome, detail

                      dialysis_outcome
-------------------------------------------------------------
      Percentiles      Smallest
 1%            9              2
 5%           21              3
10%           35              6       Obs                 313
25%           91              9       Sum of Wgt.         313

50%          176                      Mean           183.2045
                        Largest       Std. Dev.      105.5565
75%          282            361
90%          327            364       Variance       11142.18
95%          341            364       Skewness       .0058506
99%          361            364       Kurtosis       1.762394

. sum kidney_transplant_outcome, detail

                  kidney_transplant_outcome
-------------------------------------------------------------
      Percentiles      Smallest
 1%           16              8
 5%           30             16
10%           49             25       Obs                 102
25%           96             27       Sum of Wgt.         102

50%        191.5                      Mean           187.5196
                        Largest       Std. Dev.      106.4401
75%          293            352
90%          325            353       Variance        11329.5
95%          342            356       Skewness       .0096934
99%          356            359       Kurtosis       1.646723

. gen dialysis_outcome2 = dialysis_outcome_date - kidney_transplant_outcome_dat
> e
(2,114 missing values generated)

. gen dialysis_outcome3 = 0

. replace dialysis_outcome3 = 1 if dialysis_outcome2 > 0
(2,121 real changes made)

. gen kidney_transplant_outcome2 = kidney_transplant_outcome_date - dialysis_ou
> tcome_date
(2,114 missing values generated)

. gen kidney_transplant_outcome3 = 0

. replace kidney_transplant_outcome3 = 1 if kidney_transplant_outcome2 > 0
(2,122 real changes made)

. sum dialysis_outcome2, detail

                      dialysis_outcome2
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -191           -191
 5%         -191           -185
10%         -185           -130       Obs                  15
25%         -122           -122       Sum of Wgt.          15

50%          -14                      Mean          -2.133333
                        Largest       Std. Dev.      136.1789
75%           84             84
90%          212            168       Variance        18544.7
95%          261            212       Skewness       .4846098
99%          261            261       Kurtosis       2.375572

. sum kidney_transplant_outcome2, detail

                 kidney_transplant_outcome2
-------------------------------------------------------------
      Percentiles      Smallest
 1%         -261           -261
 5%         -261           -212
10%         -212           -168       Obs                  15
25%          -84            -84       Sum of Wgt.          15

50%           14                      Mean           2.133333
                        Largest       Std. Dev.      136.1789
75%          122            122
90%          185            130       Variance        18544.7
95%          191            185       Skewness      -.4846098
99%          191            191       Kurtosis       2.375572

. gen dialysis_new = 0

. replace dialysis_new = 1 if dialysis_outcome_date!=.
(313 real changes made)

. replace dialysis_new = 0 if kidney_transplant_outcome_date > dialysis_outcome
> _date
(306 real changes made)

. replace dialysis_new = 0 if ckd_group==4
(0 real changes made)

. replace dialysis_new = 0 if ckd_group==5
(0 real changes made)

. gen kidney_transplant_new = 0

. replace kidney_transplant_new = 1 if kidney_transplant_outcome_date!=.
(102 real changes made)

. replace kidney_transplant_new = 0 if dialysis_outcome_date > kidney_transplan
> t_outcome_date
(94 real changes made)

. replace kidney_transplant_new = 0 if ckd_group==4
(0 real changes made)

. replace kidney_transplant_new = 0 if ckd_group==5
(0 real changes made)

. tab dialysis_new kidney_transplant_new, m

dialysis_n | kidney_transplant_new
        ew |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,114          8 |     2,122 
         1 |         7          0 |         7 
-----------+----------------------+----------
     Total |     2,121          8 |     2,129 

. tab dialysis_new dialysis_outcome3, m

dialysis_n |   dialysis_outcome3
        ew |         0          1 |     Total
-----------+----------------------+----------
         0 |         8      2,114 |     2,122 
         1 |         0          7 |         7 
-----------+----------------------+----------
     Total |         8      2,121 |     2,129 

. tab kidney_transplant_new kidney_transplant_outcome3, m

kidney_tra | kidney_transplant_out
nsplant_ne |         come3
         w |         0          1 |     Total
-----------+----------------------+----------
         0 |         7      2,114 |     2,121 
         1 |         0          8 |         8 
-----------+----------------------+----------
     Total |         7      2,122 |     2,129 

. drop dialysis_outcome_date

. drop kidney_transplant_outcome_date

. 
. * eGFR outcome classification based on updated mean eGFR over previous 18 mon
> ths by the end of year
. gen sex = 1 if male == "Male"
(1,163 missing values generated)

. replace sex = 0 if male == "Female"
(1,163 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(914 real changes made, 914 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(914 missing values generated)

. gen min_creatinine_outcome=.
(2,129 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(649 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(566 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(649 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(566 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(805 real changes made)

. gen max_creatinine_outcome=.
(2,129 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(649 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(566 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,215 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,324 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(914 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,215 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(649 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(914 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1215 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(120 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(5 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(8 real changes made)

. replace ckd_progression = 3 if dialysis_new==1
(7 real changes made)

. replace ckd_progression = 4 if kidney_transplant_new==1
(8 real changes made)

. replace ckd_progression = 5 if died==1
(213 real changes made)

. drop dialysis_new

. drop kidney_transplant_new

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 without 
> kidney replacement therapy" 3 "Dialysis" 4 "Kidney transplant" 5 "Died"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(75 real changes made)

. replace ethnicity=2 if ethnicity==3
(67 real changes made)

. replace ethnicity=3 if ethnicity==4
(86 real changes made)

. replace ethnicity=4 if ethnicity==6
(75 real changes made)

. replace ethnicity=6 if ethnicity==.
(534 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,935 missing values generated)

. replace region = 2 if region_string=="East"
(214 real changes made)

. replace region = 3 if region_string=="London"
(433 real changes made)

. replace region = 4 if region_string=="North East"
(222 real changes made)

. replace region = 5 if region_string=="North West"
(216 real changes made)

. replace region = 6 if region_string=="South East"
(217 real changes made)

. replace region = 7 if region_string=="South West"
(198 real changes made)

. replace region = 8 if region_string=="West Midlands"
(226 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(209 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,129 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(886 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,243 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2017_ckd_complete.dta not found)
file ./output/2017_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 closed on:   8 Jan 2023, 20:37:41
-------------------------------------------------------------------------------
