-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 opened on:  12 Jan 2023, 18:13:46

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,522 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,964 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,778 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,380       10.02       10.02
           East Midlands |      3,405       10.09       20.11
                  London |      6,764       20.05       40.16
              North East |      3,354        9.94       50.10
              North West |      3,344        9.91       60.02
              South East |      3,365        9.97       69.99
              South West |      3,367        9.98       79.97
           West Midlands |      3,340        9.90       89.87
Yorkshire and The Humber |      3,417       10.13      100.00
-------------------------+-----------------------------------
                   Total |     33,736      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,698        5.03        5.03
          1 |      6,327       18.75       23.79
          2 |      6,534       19.37       43.16
          3 |      6,391       18.94       62.10
          4 |      6,368       18.88       80.98
          5 |      6,418       19.02      100.00
------------+-----------------------------------
      Total |     33,736      100.00

. drop if imd==0
(1,698 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,132 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(803 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(789 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,969 real changes made, 13,969 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,969 missing values generated)

. gen min_baseline_creatinine=.
(32,038 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,347 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,722 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,347 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,722 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,502 real changes made)

. gen max_baseline_creatinine=.
(32,038 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,347 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,722 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,069 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,536 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,969 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,069 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,347 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,747 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,038
25%            0              0       Sum of Wgt.      32,038

50%     12.60988                      Mean            12.6167
                        Largest       Std. Dev.      13.02637
75%     25.07393       42.57103
90%     29.33555       42.61248       Variance       169.6863
95%     31.49075       43.21671       Skewness       .2028205
99%     35.53598       43.25228       Kurtosis        1.30192

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,564        5.44        5.44
         <= |      1,576        5.48       10.91
          = |     20,864       72.53       83.44
          > |      1,546        5.37       88.81
         >= |      1,646        5.72       94.54
          ~ |      1,572        5.46      100.00
------------+-----------------------------------
      Total |     28,768      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,498       54.62       54.62
          1 |     14,540       45.38      100.00
------------+-----------------------------------
      Total |     32,038      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,751       46.04       46.04
          1 |     17,287       53.96      100.00
------------+-----------------------------------
      Total |     32,038      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,474       95.12       95.12
          1 |      1,564        4.88      100.00
------------+-----------------------------------
      Total |     32,038      100.00
(739 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,429       94.98       94.98
          1 |      1,609        5.02      100.00
------------+-----------------------------------
      Total |     32,038      100.00
(704 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,444       95.02       95.02
          1 |      1,594        4.98      100.00
------------+-----------------------------------
      Total |     32,038      100.00
(679 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,430       94.98       94.98
          1 |      1,608        5.02      100.00
------------+-----------------------------------
      Total |     32,038      100.00
(626 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,461       95.08       95.08
          1 |      1,577        4.92      100.00
------------+-----------------------------------
      Total |     32,038      100.00
(614 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,407       94.91       94.91
          1 |      1,631        5.09      100.00
------------+-----------------------------------
      Total |     32,038      100.00
(571 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,818       33.77       33.77
          1 |     21,220       66.23      100.00
------------+-----------------------------------
      Total |     32,038      100.00

. drop if ckd==0
(10,818 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2017_ckd.csv not found)
file ./output/2017_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 closed on:  12 Jan 2023, 18:13:51
-------------------------------------------------------------------------------
