-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 opened on:  20 Sep 2023, 14:20:49

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(8 vars, 21,105 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(236 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,859
        from master                    47,877  (_merge==1)
        from using                     18,982  (_merge==2)

    matched                             2,123  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,859 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        195        9.19        9.19
Kidney transplant |        207        9.75       18.94
 Modality unclear |         37        1.74       20.68
          Pre KRT |      1,684       79.32      100.00
------------------+-----------------------------------
            Total |      2,123      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(863 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1260 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,260       59.35       59.35
          . |        863       40.65      100.00
------------+-----------------------------------
      Total |      2,123      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(195 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(22 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(136 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(287 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(9 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(37 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(6 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       114         81 |       195 
Kidney transplant |       207          0 |       207 
 Modality unclear |        37          0 |        37 
          Pre KRT |     1,684          0 |     1,684 
------------------+----------------------+----------
            Total |     2,042         81 |     2,123 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       184         11 |       195 
Kidney transplant |       178         29 |       207 
 Modality unclear |        31          6 |        37 
          Pre KRT |     1,452        232 |     1,684 
------------------+----------------------+----------
            Total |     1,845        278 |     2,123 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       195          0 |       195 
Kidney transplant |       207          0 |       207 
 Modality unclear |         6         31 |        37 
          Pre KRT |     1,684          0 |     1,684 
------------------+----------------------+----------
            Total |     2,092         31 |     2,123 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,764        278 |     2,042 
         1 |        81          0 |        81 
-----------+----------------------+----------
     Total |     1,845        278 |     2,123 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(863 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1260 changes made)

. replace ckd_group = 4 if dialysis==1
(81 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(278 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(31 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(669 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,316       61.99       61.99
         CKD stage 3 |        396       18.65       80.64
       CKD stage 4/5 |         21        0.99       81.63
            Dialysis |         81        3.82       85.45
          Transplant |        278       13.09       98.54
KRT unclear modality |         31        1.46      100.00
---------------------+-----------------------------------
               Total |      2,123      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        67        137          0      1,112 |     1,316 
         CKD stage 3 |        33         40          0        323 |       396 
       CKD stage 4/5 |         3          1          0         17 |        21 
            Dialysis |        81          0          0          0 |        81 
          Transplant |        11         29          6        232 |       278 
KRT unclear modality |         0          0         31          0 |        31 
---------------------+--------------------------------------------+----------
               Total |       195        207         37      1,684 |     2,123 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       117         72         50         12 |     1,316 
         CKD stage 3 |        38         18         18          5 |       396 
       CKD stage 4/5 |         1          0          0          0 |        21 
            Dialysis |         8          5          6          1 |        81 
          Transplant |        27         14         10          2 |       278 
KRT unclear modality |         3          2          0          0 |        31 
---------------------+--------------------------------------------+----------
               Total |       194        111         84         20 |     2,123 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,065 |     1,316 
         CKD stage 3 |       317 |       396 
       CKD stage 4/5 |        20 |        21 
            Dialysis |        61 |        81 
          Transplant |       225 |       278 
KRT unclear modality |        26 |        31 
---------------------+-----------+----------
               Total |     1,714 |     2,123 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,104 missing values generated)

. replace sex = 0 if male == "Female"
(1,104 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(941 real changes made, 941 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(941 missing values generated)

. gen min_creatinine_outcome=.
(2,123 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(600 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(582 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(600 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(582 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(728 real changes made)

. gen max_creatinine_outcome=.
(2,123 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(600 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(582 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,182 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,395 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(941 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,182 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(600 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(941 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1182 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(173 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(4 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(4 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(941 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1182 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,182       55.68       55.68
          . |        941       44.32      100.00
------------+-----------------------------------
      Total |      2,123      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(111 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(84 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(9 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(20 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(111 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(93 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(194 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,573       74.09       74.09
               CKD 3 |        134        6.31       80.41
     CKD 4/5 pre-KRT |          7        0.33       80.73
            Dialysis |        111        5.23       85.96
   Kidney transplant |         93        4.38       90.34
KRT unclear modality |         11        0.52       90.86
            Deceased |        194        9.14      100.00
---------------------+-----------------------------------
               Total |      2,123      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(863 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1260 changes made)

. replace access_egfr=0 if ckd_group==4
(81 real changes made)

. replace access_egfr=3 if access_egfr==.
(782 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,316
  CKD stage |          52           0         396
  CKD stage |          10           0          21
   Dialysis |          29           0          81
  Transplan |          89           0         278
  KRT uncle |           1           0          31
------------+------------------------------------
      Total |   244.48987   145.79229       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,123         539           0        539        539

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         258           0       1,316
  CKD stage |          85           0         396
  CKD stage |          13           0          21
   Dialysis |          27           0          81
  Transplan |          82           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   187.81112   90.836238       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,123         474           0        474        474

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,316
  CKD stage |         133           0         396
  CKD stage |           5           0          21
   Dialysis |          29           0          81
  Transplan |          84           0         278
  KRT uncle |          22           0          31
------------+------------------------------------
      Total |   231.30664   107.21147       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,123         586           0        586        586

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         273           0       1,316
  CKD stage |         104           0         396
  CKD stage |           0           0          21
   Dialysis |          14           0          81
  Transplan |          90           0         278
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |    201.0471   94.177743       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,123         488           0        488        488

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,316
  CKD stage |         107           0         396
  CKD stage |           8           0          21
   Dialysis |          25           0          81
  Transplan |          79           0         278
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   235.45125   121.01718       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,123         560           0        560        560

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,316
  CKD stage |         123           0         396
  CKD stage |           1           0          21
   Dialysis |          20           0          81
  Transplan |          87           0         278
  KRT uncle |          15           0          31
------------+------------------------------------
      Total |   236.16769   114.60784       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,123         570           0        570        570

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,316
  CKD stage |          67           0         396
  CKD stage |           4           0          21
   Dialysis |          29           0          81
  Transplan |          70           0         278
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   201.37824   111.26141       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,123         461           0        461        461

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,316
  CKD stage |          70           0         396
  CKD stage |          12           0          21
   Dialysis |          30           0          81
  Transplan |          76           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   241.36081   139.27088       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,123         547           0        547        547

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,316
  CKD stage |          95           0         396
  CKD stage |           9           0          21
   Dialysis |           8           0          81
  Transplan |          99           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   215.93311   106.75729       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,123         518           0        518        518

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,316
  CKD stage |          99           0         396
  CKD stage |          12           0          21
   Dialysis |          10           0          81
  Transplan |          54           0         278
  KRT uncle |          25           0          31
------------+------------------------------------
      Total |   239.02073   134.27557       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,123         543           0        543        543

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,316
  CKD stage |          80           0         396
  CKD stage |           8           0          21
   Dialysis |          18           0          81
  Transplan |          61           0         278
  KRT uncle |          11           0          31
------------+------------------------------------
      Total |   254.43099   150.83937       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,123         550           0        550        550

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,316
  CKD stage |          98           0         396
  CKD stage |           9           0          21
   Dialysis |          15           0          81
  Transplan |          75           0         278
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   236.59633   127.02369       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,123         544           0        544        544

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,316
  CKD stage |         102           0         396
  CKD stage |           0           0          21
   Dialysis |           1           0          81
  Transplan |          56           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |    222.4098   121.62176       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,123         484           0        484        484

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,316
  CKD stage |          85           0         396
  CKD stage |           4           0          21
   Dialysis |          30           0          81
  Transplan |          87           0         278
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   239.98493   129.88674       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,123         559           0        559        559

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,316
  CKD stage |         116           0         396
  CKD stage |           4           0          21
   Dialysis |          16           0          81
  Transplan |          66           0         278
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |   227.62082   116.52792       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,123         532           0        532        532

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,316
  CKD stage |          84           0         396
  CKD stage |           0           0          21
   Dialysis |          35           0          81
  Transplan |          84           0         278
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   266.12388    151.2643       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,123         593           0        593        593

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,316
  CKD stage |          71           0         396
  CKD stage |           3           0          21
   Dialysis |          25           0          81
  Transplan |          59           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   239.04145   142.21442       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,123         517           0        517        517

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,316
  CKD stage |         104           0         396
  CKD stage |           3           0          21
   Dialysis |          17           0          81
  Transplan |          75           0         278
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   228.28827   118.87734       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,123         521           0        521        521

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,316
  CKD stage |          76           0         396
  CKD stage |           9           0          21
   Dialysis |          10           0          81
  Transplan |          89           0         278
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   229.73764   126.63825       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,123         520           0        520        520

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,316
  CKD stage |         108           0         396
  CKD stage |           5           0          21
   Dialysis |          26           0          81
  Transplan |          55           0         278
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   257.22562    144.3831       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,123         570           0        570        570

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,316
  CKD stage |         115           0         396
  CKD stage |           7           0          21
   Dialysis |          17           0          81
  Transplan |          92           0         278
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |   268.09939   140.79695       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,123         621           0        621        621

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,316
  CKD stage |         108           0         396
  CKD stage |           5           0          21
   Dialysis |          31           0          81
  Transplan |          58           0         278
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   255.87659    142.2187       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,123         570           0        570        570

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         407           0       1,316
  CKD stage |         132           0         396
  CKD stage |           4           0          21
   Dialysis |          20           0          81
  Transplan |          94           0         278
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   290.08196   151.55243       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,123         661           0        661        661

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,316
  CKD stage |          86           0         396
  CKD stage |           4           0          21
   Dialysis |          14           0          81
  Transplan |          90           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   236.19077   127.42205       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,123         538           0        538        538

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         278           0       1,316
  CKD stage |          90           0         396
  CKD stage |           2           0          21
   Dialysis |          18           0          81
  Transplan |          66           0         278
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   198.50636   102.95947       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,123         457           0        457        457

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,316
  CKD stage |          52           0         396
  CKD stage |          16           0          21
   Dialysis |          16           0          81
  Transplan |          69           0         278
  KRT uncle |          16           0          31
------------+------------------------------------
      Total |   224.29675   135.45524       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         499           0        499        499

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,316
  CKD stage |         136           0         396
  CKD stage |          13           0          21
   Dialysis |          22           0          81
  Transplan |          58           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   282.63307   154.00814       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         639           0        639        639

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,316
  CKD stage |         112           0         396
  CKD stage |           2           0          21
   Dialysis |          11           0          81
  Transplan |          68           0         278
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   265.89072   147.55805       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         580           0        580        580

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,316
  CKD stage |         113           0         396
  CKD stage |           0           0          21
   Dialysis |          27           0          81
  Transplan |          71           0         278
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   248.36222   131.63991       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         561           0        561        561

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,316
  CKD stage |         118           0         396
  CKD stage |           0           0          21
   Dialysis |          10           0          81
  Transplan |          85           0         278
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   248.14602    127.2361       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,123         569           0        569        569

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,316
  CKD stage |         108           0         396
  CKD stage |           8           0          21
   Dialysis |           2           0          81
  Transplan |          79           0         278
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |    227.2049   116.91524       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,123         518           0        518        518

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,316
  CKD stage |         114           0         396
  CKD stage |           5           0          21
   Dialysis |          29           0          81
  Transplan |          56           0         278
  KRT uncle |          11           0          31
------------+------------------------------------
      Total |   269.18653   150.92213       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,123         601           0        601        601

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,316
  CKD stage |         101           0         396
  CKD stage |           4           0          21
   Dialysis |          30           0          81
  Transplan |          60           0         278
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   261.74941   148.36095       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,123         584           0        584        584

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,316
  CKD stage |         107           0         396
  CKD stage |           0           0          21
   Dialysis |          37           0          81
  Transplan |          86           0         278
  KRT uncle |          11           0          31
------------+------------------------------------
      Total |   226.81394   111.57117       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,123         554           0        554        554

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,316
  CKD stage |         172           0         396
  CKD stage |          12           0          21
   Dialysis |           6           0          81
  Transplan |          58           0         278
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   216.79275    96.52525       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,123         540           0        540        540

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,316
  CKD stage |         106           0         396
  CKD stage |          13           0          21
   Dialysis |          14           0          81
  Transplan |          93           0         278
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   236.03486   119.25354       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,123         561           0        561        561

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,316
  CKD stage |          96           0         396
  CKD stage |           4           0          21
   Dialysis |          34           0          81
  Transplan |          96           0         278
  KRT uncle |          16           0          31
------------+------------------------------------
      Total |   226.68959   112.73471       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,123         560           0        560        560

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,316
  CKD stage |         100           0         396
  CKD stage |           7           0          21
   Dialysis |          25           0          81
  Transplan |          48           0         278
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   257.89779   149.65729       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         561           0        561        561

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         265           0       1,316
  CKD stage |          52           0         396
  CKD stage |           0           0          21
   Dialysis |          24           0          81
  Transplan |         106           0         278
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   188.82148   99.397704       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         451           0        451        451

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,316
  CKD stage |          85           0         396
  CKD stage |           2           0          21
   Dialysis |          43           0          81
  Transplan |          74           0         278
  KRT uncle |          20           0          31
------------+------------------------------------
      Total |   241.97504   133.44245       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         570           0        570        570

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,316
  CKD stage |          70           0         396
  CKD stage |           4           0          21
   Dialysis |           9           0          81
  Transplan |          82           0         278
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   254.83043    150.5032       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         541           0        541        541

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         270           0       1,316
  CKD stage |         121           0         396
  CKD stage |           9           0          21
   Dialysis |          21           0          81
  Transplan |         110           0         278
  KRT uncle |          -1           0          31
------------+------------------------------------
      Total |   205.21667   86.091469       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,123         530           0        530        530

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,316
  CKD stage |          83           0         396
  CKD stage |           6           0          21
   Dialysis |          17           0          81
  Transplan |          74           0         278
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |   234.96844   131.19726       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,123         530           0        530        530

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,316
  CKD stage |          94           0         396
  CKD stage |           5           0          21
   Dialysis |          34           0          81
  Transplan |          47           0         278
  KRT uncle |          14           0          31
------------+------------------------------------
      Total |   217.40132   119.57539       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,123         504           0        504        504

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,316
  CKD stage |          87           0         396
  CKD stage |           8           0          21
   Dialysis |          19           0          81
  Transplan |          92           0         278
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   247.34903   134.78597       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,123         563           0        563        563

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,316
  CKD stage |         125           0         396
  CKD stage |           3           0          21
   Dialysis |          15           0          81
  Transplan |          76           0         278
  KRT uncle |          11           0          31
------------+------------------------------------
      Total |   232.39143   114.70474       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,123         550           0        550        550

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,316
  CKD stage |         122           0         396
  CKD stage |           1           0          21
   Dialysis |           6           0          81
  Transplan |          71           0         278
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   243.78756   126.86171       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,123         549           0        549        549

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,316
  CKD stage |         124           0         396
  CKD stage |           0           0          21
   Dialysis |          36           0          81
  Transplan |          68           0         278
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |   237.53698   119.18269       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,123         570           0        570        570

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,316
  CKD stage |         127           0         396
  CKD stage |          10           0          21
   Dialysis |          31           0          81
  Transplan |          76           0         278
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |    243.2016   121.01278       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,123         580           0        580        580

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,316
  CKD stage |         125           0         396
  CKD stage |           5           0          21
   Dialysis |           9           0          81
  Transplan |          72           0         278
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   242.72869   124.51673       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,123         554           0        554        554

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,316
  CKD stage |          99           0         396
  CKD stage |          10           0          21
   Dialysis |          25           0          81
  Transplan |          92           0         278
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   226.25153   113.55717       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,123         543           0        543        543

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,316
  CKD stage |         111           0         396
  CKD stage |           0           0          21
   Dialysis |          26           0          81
  Transplan |          64           0         278
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |    266.3674   147.99347       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,123         590           0        590        590

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,316
  CKD stage |         114           0         396
  CKD stage |           3           0          21
   Dialysis |          29           0          81
  Transplan |          71           0         278
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   210.26613    101.6104       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         508           0        508        508

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,316
  CKD stage |          93           0         396
  CKD stage |           5           0          21
   Dialysis |          40           0          81
  Transplan |          54           0         278
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   244.33679   138.46209       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,123         554           0        554        554

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,316
  CKD stage |          91           0         396
  CKD stage |           6           0          21
   Dialysis |          18           0          81
  Transplan |          65           0         278
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |   236.56006    131.8998       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,123         532           0        532        532

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,316
  CKD stage |         105           0         396
  CKD stage |           2           0          21
   Dialysis |          25           0          81
  Transplan |          84           0         278
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   244.91333   128.00103       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,123         568           0        568        568

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,316
  CKD stage |         114           0         396
  CKD stage |           3           0          21
   Dialysis |          19           0          81
  Transplan |          65           0         278
  KRT uncle |          11           0          31
------------+------------------------------------
      Total |   212.31512   105.52917       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,123         505           0        505        505

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,316
  CKD stage |         101           0         396
  CKD stage |           3           0          21
   Dialysis |          22           0          81
  Transplan |          83           0         278
  KRT uncle |          14           0          31
------------+------------------------------------
      Total |   257.65662   139.58813       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,123         589           0        589        589

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,316
  CKD stage |         110           0         396
  CKD stage |           0           0          21
   Dialysis |          12           0          81
  Transplan |          64           0         278
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   268.71691   151.52783       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,123         578           0        578        578

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,316
  CKD stage |          66           0         396
  CKD stage |           0           0          21
   Dialysis |          19           0          81
  Transplan |          60           0         278
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   249.08055   152.36199       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,123         518           0        518        518

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,316
  CKD stage |         100           0         396
  CKD stage |           0           0          21
   Dialysis |          29           0          81
  Transplan |          76           0         278
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   220.15968   112.31062       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,123         522           0        522        522

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,316
  CKD stage |          97           0         396
  CKD stage |           1           0          21
   Dialysis |          29           0          81
  Transplan |          90           0         278
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   259.19736   140.07356       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         591           0        591        591

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,316
  CKD stage |          89           0         396
  CKD stage |           0           0          21
   Dialysis |          27           0          81
  Transplan |          86           0         278
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   265.78804   149.32091       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         591           0        591        591

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,316
  CKD stage |          71           0         396
  CKD stage |          24           0          21
   Dialysis |          44           0          81
  Transplan |          72           0         278
  KRT uncle |           1           0          31
------------+------------------------------------
      Total |   237.84032   135.98977       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         556           0        556        556

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,316
  CKD stage |          85           0         396
  CKD stage |           3           0          21
   Dialysis |          33           0          81
  Transplan |          57           0         278
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   203.82525   109.76727       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         472           0        472        472

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         408           0       1,316
  CKD stage |          81           0         396
  CKD stage |          13           0          21
   Dialysis |          12           0          81
  Transplan |          54           0         278
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   275.73481   169.65913       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,123         572           0        572        572

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,316
  CKD stage |          89           0         396
  CKD stage |          18           0          21
   Dialysis |          39           0          81
  Transplan |          84           0         278
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   240.71785   128.86338       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,123         576           0        576        576

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,316
  CKD stage |          92           0         396
  CKD stage |           4           0          21
   Dialysis |          14           0          81
  Transplan |          51           0         278
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   219.76166   123.07245       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,123         482           0        482        482

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         453           0       1,316
  CKD stage |          72           0         396
  CKD stage |          13           0          21
   Dialysis |          19           0          81
  Transplan |          93           0         278
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   307.30994   186.80628       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,123         653           0        653        653

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,316
  CKD stage |          80           0         396
  CKD stage |           8           0          21
   Dialysis |           9           0          81
  Transplan |          88           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |    204.2845   105.77975       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,123         480           0        480        480

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,316
  CKD stage |         143           0         396
  CKD stage |           1           0          21
   Dialysis |          15           0          81
  Transplan |          65           0         278
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   242.86481    120.6275       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,123         562           0        562        562

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,316
  CKD stage |         131           0         396
  CKD stage |           8           0          21
   Dialysis |          36           0          81
  Transplan |          50           0         278
  KRT uncle |          14           0          31
------------+------------------------------------
      Total |   252.69618    133.6205       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,123         594           0        594        594

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         395           0       1,316
  CKD stage |          77           0         396
  CKD stage |           8           0          21
   Dialysis |          38           0          81
  Transplan |          73           0         278
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |   270.49223   159.44987       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,123         604           0        604        604

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,316
  CKD stage |         128           0         396
  CKD stage |           2           0          21
   Dialysis |          28           0          81
  Transplan |          82           0         278
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   241.64673   117.92698       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,123         582           0        582        582

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,316
  CKD stage |          87           0         396
  CKD stage |           5           0          21
   Dialysis |          12           0          81
  Transplan |          52           0         278
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   258.58031   154.78924       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,123         542           0        542        542

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,316
  CKD stage |         130           0         396
  CKD stage |           0           0          21
   Dialysis |           9           0          81
  Transplan |          76           0         278
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   249.71455    127.2841       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,123         567           0        567        567

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,316
  CKD stage |         137           0         396
  CKD stage |           5           0          21
   Dialysis |          33           0          81
  Transplan |          71           0         278
  KRT uncle |          16           0          31
------------+------------------------------------
      Total |   231.03533   109.32677       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         576           0        576        576

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,316
  CKD stage |         125           0         396
  CKD stage |           0           0          21
   Dialysis |          16           0          81
  Transplan |          51           0         278
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   250.14366   135.58378       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,123         553           0        553        553

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,316
  CKD stage |          83           0         396
  CKD stage |          12           0          21
   Dialysis |          26           0          81
  Transplan |          83           0         278
  KRT uncle |          20           0          31
------------+------------------------------------
      Total |   220.53509   116.38717       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,123         535           0        535        535

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,316
  CKD stage |          95           0         396
  CKD stage |           0           0          21
   Dialysis |          40           0          81
  Transplan |          63           0         278
  KRT uncle |          15           0          31
------------+------------------------------------
      Total |   232.89449   126.29153       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,123         544           0        544        544

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,316
  CKD stage |          90           0         396
  CKD stage |           7           0          21
   Dialysis |          11           0          81
  Transplan |          59           0         278
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |     206.065   111.21295       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,123         463           0        463        463

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,316
  CKD stage |          90           0         396
  CKD stage |          10           0          21
   Dialysis |          23           0          81
  Transplan |          87           0         278
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   246.28874   133.45611       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,123         572           0        572        572

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,316
  CKD stage |         123           0         396
  CKD stage |          27           0          21
   Dialysis |          32           0          81
  Transplan |          58           0         278
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   250.33961   132.11099       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,123         600           0        600        600

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,316
  CKD stage |          69           0         396
  CKD stage |           5           0          21
   Dialysis |          18           0          81
  Transplan |          62           0         278
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   219.64154   127.47838       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,123         485           0        485        485

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,316
  CKD stage |         117           0         396
  CKD stage |           8           0          21
   Dialysis |          23           0          81
  Transplan |          86           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   242.45219    121.4473       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,123         579           0        579        579

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,316
  CKD stage |          94           0         396
  CKD stage |           3           0          21
   Dialysis |          33           0          81
  Transplan |          71           0         278
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   247.08243   136.20829       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         564           0        564        564

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,316
  CKD stage |          99           0         396
  CKD stage |          10           0          21
   Dialysis |          15           0          81
  Transplan |          70           0         278
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   260.28403    146.4553       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         578           0        578        578

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,316
  CKD stage |         112           0         396
  CKD stage |           2           0          21
   Dialysis |          10           0          81
  Transplan |          72           0         278
  KRT uncle |           1           0          31
------------+------------------------------------
      Total |   234.05511   122.21561       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         525           0        525        525

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         407           0       1,316
  CKD stage |         104           0         396
  CKD stage |           0           0          21
   Dialysis |          32           0          81
  Transplan |          98           0         278
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   285.74282   156.07301       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,123         641           0        641        641

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,316
  CKD stage |          94           0         396
  CKD stage |          16           0          21
   Dialysis |          17           0          81
  Transplan |          76           0         278
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   238.51861   129.50799       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,123         548           0        548        548

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,316
  CKD stage |         106           0         396
  CKD stage |           9           0          21
   Dialysis |          26           0          81
  Transplan |          75           0         278
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   256.44089   138.70333       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,123         589           0        589        589

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(86 real changes made)

. replace ethnicity=2 if ethnicity==3
(102 real changes made)

. replace ethnicity=3 if ethnicity==4
(86 real changes made)

. replace ethnicity=4 if ethnicity==6
(86 real changes made)

. replace ethnicity=6 if ethnicity==.
(502 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,928 missing values generated)

. replace region = 2 if region_string=="East"
(186 real changes made)

. replace region = 3 if region_string=="London"
(422 real changes made)

. replace region = 4 if region_string=="North East"
(219 real changes made)

. replace region = 5 if region_string=="North West"
(188 real changes made)

. replace region = 6 if region_string=="South East"
(226 real changes made)

. replace region = 7 if region_string=="South West"
(240 real changes made)

. replace region = 8 if region_string=="West Midlands"
(211 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(236 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,123 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(817 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,306 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2017_ckd_complete.dta not found)
file ./output/2017_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,619
        from master                       498  (_merge==1)
        from using                      2,121  (_merge==2)

    matched                                 2  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(498 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,316
  CKD stage |           0           0         396
  CKD stage |           0           0          21
   Dialysis |           0           0          81
  Transplan |           0           0         278
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |           0           0       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,123           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,316
  CKD stage |           0           0         396
  CKD stage |           0           0          21
   Dialysis |           0           0          81
  Transplan |           0           0         278
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |           0           0       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,123           0           0          0          0

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,316
  CKD stage |           0           0         396
  CKD stage |           0           0          21
   Dialysis |           0           0          81
  Transplan |           0           0         278
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |           0           0       2,123

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,123           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2017_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 closed on:  20 Sep 2023, 14:20:54
-------------------------------------------------------------------------------
