-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 opened on:   6 Jan 2023, 19:45:29

. clear

. 
. * Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 21,046 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(199 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,756
        from master                    47,855  (_merge==1)
        from using                     18,901  (_merge==2)

    matched                             2,145  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,756 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved

. 
. * Baseline dialysis & kidney transplant group classification
. drop dialysis_baseline_primary_care

. drop dialysis_baseline_icd_10

. drop dialysis_baseline_opcs_4

. drop kt_baseline_primary_care

. drop kt_baseline_icd_10

. drop kt_baseline_opcs_4

. gen dialysis_baseline = date(dialysis_baseline_date, "YMD")
(1,833 missing values generated)

. format dialysis_baseline %td

. drop dialysis_baseline_date

. gen kidney_transplant_baseline = date(kidney_transplant_baseline_date, "YMD")
(1,830 missing values generated)

. format kidney_transplant_baseline %td

. drop kidney_transplant_baseline_date

. gen dialysis = 0

. replace dialysis = 1 if dialysis_baseline!=.
(312 real changes made)

. replace dialysis = 0 if kidney_transplant_baseline > dialysis_baseline
(285 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline!=.
(315 real changes made)

. replace kidney_transplant = 0 if dialysis_baseline > kidney_transplant_baseli
> ne
(296 real changes made)

. drop dialysis_baseline

. drop kidney_transplant_baseline

. tab dialysis kidney_transplant, m

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,099         19 |     2,118 
         1 |        27          0 |        27 
-----------+----------------------+----------
     Total |     2,126         19 |     2,145 

. 
. * CKD stage classification based on baseline eGFR
. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(813 missing values generated)

. drop baseline_egfr

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1332 changes made)

. replace ckd_group = 4 if dialysis==1
(27 real changes made)

. drop dialysis

. replace ckd_group = 5 if kidney_transplant==1
(19 real changes made)

. drop kidney_transplant

. label define ckd_group 1 "eGFR ≥60 with albuminuria" 2 "CKD 3" 3 "CKD 4/5 wit
> hout kidney replacement therapy" 4 "Dialysis" 5 "Kidney transplant"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. 
. * Dialysis & kidney transplant outcome classification
. drop dialysis_outcome_primary_care

. drop dialysis_outcome_icd_10

. drop dialysis_outcome_opcs_4

. gen dialysis_outcome_date = date(dialysis_outcome, "YMD")
(1,848 missing values generated)

. format dialysis_outcome_date %td

. drop dialysis_outcome

. gen kidney_transplant_outcome_date = date(kidney_transplant_outcome, "YMD")
(2,026 missing values generated)

. format kidney_transplant_outcome_date %td

. drop kidney_transplant_outcome

. gen dialysis_new = 0

. replace dialysis_new = 1 if dialysis_outcome_date!=.
(297 real changes made)

. replace dialysis_new = 0 if kidney_transplant_outcome_date > dialysis_outcome
> _date
(291 real changes made)

. replace dialysis_new = 0 if ckd_group==4/5
(0 real changes made)

. gen kidney_transplant_new = 0

. replace kidney_transplant_new = 1 if kidney_transplant_outcome_date!=.
(119 real changes made)

. replace kidney_transplant_new = 0 if dialysis_outcome_date > kidney_transplan
> t_outcome_date
(110 real changes made)

. replace dialysis_new = 0 if ckd_group==4/5
(0 real changes made)

. tab dialysis_new kidney_transplant_new, m

dialysis_n | kidney_transplant_new
        ew |         0          1 |     Total
-----------+----------------------+----------
         0 |     2,130          9 |     2,139 
         1 |         6          0 |         6 
-----------+----------------------+----------
     Total |     2,136          9 |     2,145 

. drop dialysis_outcome_date

. drop kidney_transplant_outcome_date

. 
. * eGFR outcome classification based on updated mean eGFR over previous 18 mon
> ths by the end of year
. gen sex = 1 if male == "Male"
(1,089 missing values generated)

. replace sex = 0 if male == "Female"
(1,089 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(928 real changes made, 928 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(928 missing values generated)

. gen min_creatinine_outcome=.
(2,145 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(608 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(609 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(608 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(609 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(762 real changes made)

. gen max_creatinine_outcome=.
(2,145 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(608 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(609 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,217 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,383 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(928 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,217 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(608 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(928 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1217 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(119 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(6 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(3 real changes made)

. replace ckd_progression = 3 if dialysis_new==1
(6 real changes made)

. replace ckd_progression = 4 if kidney_transplant_new==1
(9 real changes made)

. replace ckd_progression = 5 if died==1
(221 real changes made)

. drop dialysis_new

. drop kidney_transplant_new

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 without 
> kidney replacement therapy" 3 "Dialysis" 4 "Kidney transplant" 5 "Died"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(83 real changes made)

. replace ethnicity=2 if ethnicity==3
(88 real changes made)

. replace ethnicity=3 if ethnicity==4
(76 real changes made)

. replace ethnicity=4 if ethnicity==6
(83 real changes made)

. replace ethnicity=6 if ethnicity==.
(511 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,935 missing values generated)

. replace region = 2 if region_string=="East"
(225 real changes made)

. replace region = 3 if region_string=="London"
(400 real changes made)

. replace region = 4 if region_string=="North East"
(218 real changes made)

. replace region = 5 if region_string=="North West"
(198 real changes made)

. replace region = 6 if region_string=="South East"
(228 real changes made)

. replace region = 7 if region_string=="South West"
(231 real changes made)

. replace region = 8 if region_string=="West Midlands"
(214 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(221 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,145 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(875 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,270 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2017_ckd_complete.dta not found)
file ./output/2017_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 closed on:   6 Jan 2023, 19:45:33
-------------------------------------------------------------------------------
