-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 opened on:  12 Sep 2023, 12:49:15

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(8 vars, 21,105 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(235 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,949
        from master                    47,922  (_merge==1)
        from using                     19,027  (_merge==2)

    matched                             2,078  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,949 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        193        9.29        9.29
Kidney transplant |        194        9.34       18.62
 Modality unclear |         45        2.17       20.79
          Pre KRT |      1,646       79.21      100.00
------------------+-----------------------------------
            Total |      2,078      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(830 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1248 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,248       60.06       60.06
          . |        830       39.94      100.00
------------+-----------------------------------
      Total |      2,078      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(193 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(21 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(134 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(326 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(9 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(45 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(9 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       113         80 |       193 
Kidney transplant |       194          0 |       194 
 Modality unclear |        45          0 |        45 
          Pre KRT |     1,646          0 |     1,646 
------------------+----------------------+----------
            Total |     1,998         80 |     2,078 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       172         21 |       193 
Kidney transplant |       167         27 |       194 
 Modality unclear |        36          9 |        45 
          Pre KRT |     1,386        260 |     1,646 
------------------+----------------------+----------
            Total |     1,761        317 |     2,078 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       193          0 |       193 
Kidney transplant |       194          0 |       194 
 Modality unclear |         9         36 |        45 
          Pre KRT |     1,646          0 |     1,646 
------------------+----------------------+----------
            Total |     2,042         36 |     2,078 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,681        317 |     1,998 
         1 |        80          0 |        80 
-----------+----------------------+----------
     Total |     1,761        317 |     2,078 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(830 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1248 changes made)

. replace ckd_group = 4 if dialysis==1
(80 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(317 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(36 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(595 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,230       59.19       59.19
         CKD stage 3 |        402       19.35       78.54
       CKD stage 4/5 |         13        0.63       79.16
            Dialysis |         80        3.85       83.01
          Transplant |        317       15.26       98.27
KRT unclear modality |         36        1.73      100.00
---------------------+-----------------------------------
               Total |      2,078      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        55        128          0      1,047 |     1,230 
         CKD stage 3 |        36         36          0        330 |       402 
       CKD stage 4/5 |         1          3          0          9 |        13 
            Dialysis |        80          0          0          0 |        80 
          Transplant |        21         27          9        260 |       317 
KRT unclear modality |         0          0         36          0 |        36 
---------------------+--------------------------------------------+----------
               Total |       193        194         45      1,646 |     2,078 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       127         61         49          8 |     1,230 
         CKD stage 3 |        38         10         20          7 |       402 
       CKD stage 4/5 |         1          1          1          1 |        13 
            Dialysis |         8          6          0          1 |        80 
          Transplant |        31         13         17          2 |       317 
KRT unclear modality |         6          2          1          1 |        36 
---------------------+--------------------------------------------+----------
               Total |       211         93         88         20 |     2,078 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |       985 |     1,230 
         CKD stage 3 |       327 |       402 
       CKD stage 4/5 |         9 |        13 
            Dialysis |        65 |        80 
          Transplant |       254 |       317 
KRT unclear modality |        26 |        36 
---------------------+-----------+----------
               Total |     1,666 |     2,078 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,097 missing values generated)

. replace sex = 0 if male == "Female"
(1,097 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(896 real changes made, 896 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(896 missing values generated)

. gen min_creatinine_outcome=.
(2,078 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(622 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(560 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(622 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(560 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(746 real changes made)

. gen max_creatinine_outcome=.
(2,078 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(622 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(560 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,182 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,332 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(896 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,182 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(622 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(896 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1182 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(198 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(7 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(5 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(896 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1182 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,182       56.88       56.88
          . |        896       43.12      100.00
------------+-----------------------------------
      Total |      2,078      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(93 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(88 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(14 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(20 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(93 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(102 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(211 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,493       71.85       71.85
               CKD 3 |        165        7.94       79.79
     CKD 4/5 pre-KRT |          8        0.38       80.17
            Dialysis |         93        4.48       84.65
   Kidney transplant |        102        4.91       89.56
KRT unclear modality |          6        0.29       89.85
            Deceased |        211       10.15      100.00
---------------------+-----------------------------------
               Total |      2,078      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(830 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1248 changes made)

. replace access_egfr=0 if ckd_group==4
(80 real changes made)

. replace access_egfr=3 if access_egfr==.
(750 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,230
  CKD stage |          77           0         402
  CKD stage |           0           0          13
   Dialysis |           9           0          80
  Transplan |         132           0         317
  KRT uncle |          10           0          36
------------+------------------------------------
      Total |   208.98364   104.67252       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,078         521           0        521        521

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,230
  CKD stage |         147           0         402
  CKD stage |           6           0          13
   Dialysis |           9           0          80
  Transplan |          87           0         317
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   255.25265   130.01959       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,078         613           0        613        613

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,230
  CKD stage |         112           0         402
  CKD stage |           1           0          13
   Dialysis |          19           0          80
  Transplan |          70           0         317
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |   214.80125   113.32313       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,078         509           0        509        509

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,230
  CKD stage |         103           0         402
  CKD stage |           1           0          13
   Dialysis |          18           0          80
  Transplan |          86           0         317
  KRT uncle |          12           0          36
------------+------------------------------------
      Total |   216.85419   112.66162       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,078         529           0        529        529

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         247           0       1,230
  CKD stage |          80           0         402
  CKD stage |           3           0          13
   Dialysis |          18           0          80
  Transplan |          97           0         317
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   177.25794   85.916262       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,078         449           0        449        449

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,230
  CKD stage |         124           0         402
  CKD stage |           7           0          13
   Dialysis |          22           0          80
  Transplan |          81           0         317
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   229.83349   117.05354       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,078         572           0        572        572

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,230
  CKD stage |          93           0         402
  CKD stage |          -1           0          13
   Dialysis |          27           0          80
  Transplan |          91           0         317
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |   228.91723    124.1778       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,078         546           0        546        546

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,230
  CKD stage |          74           0         402
  CKD stage |           4           0          13
   Dialysis |          19           0          80
  Transplan |          96           0         317
  KRT uncle |           2           0          36
------------+------------------------------------
      Total |   242.24928   141.74246       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,078         554           0        554        554

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,230
  CKD stage |          97           0         402
  CKD stage |           0           0          13
   Dialysis |          10           0          80
  Transplan |          66           0         317
  KRT uncle |          17           0          36
------------+------------------------------------
      Total |    199.9846   107.70865       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,078         478           0        478        478

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,230
  CKD stage |         102           0         402
  CKD stage |           4           0          13
   Dialysis |          33           0          80
  Transplan |          60           0         317
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |   227.96728   129.13171       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,078         538           0        538        538

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,230
  CKD stage |         106           0         402
  CKD stage |           0           0          13
   Dialysis |          11           0          80
  Transplan |         108           0         317
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |   241.61598   126.64844       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,078         570           0        570        570

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         250           0       1,230
  CKD stage |          97           0         402
  CKD stage |           0           0          13
   Dialysis |          12           0          80
  Transplan |          95           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   181.85419   84.446012       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,078         463           0        463        463

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,230
  CKD stage |         104           0         402
  CKD stage |          13           0          13
   Dialysis |          24           0          80
  Transplan |          71           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   215.01347   114.79664       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,078         530           0        530        530

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,230
  CKD stage |          90           0         402
  CKD stage |           3           0          13
   Dialysis |          30           0          80
  Transplan |          73           0         317
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   219.20308   122.41021       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,078         520           0        520        520

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,230
  CKD stage |         106           0         402
  CKD stage |           0           0          13
   Dialysis |          30           0          80
  Transplan |          92           0         317
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   219.38017   110.73797       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,078         549           0        549        549

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,230
  CKD stage |         100           0         402
  CKD stage |           8           0          13
   Dialysis |          11           0          80
  Transplan |          70           0         317
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |   221.82483   123.46347       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,078         520           0        520        520

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,230
  CKD stage |          93           0         402
  CKD stage |           0           0          13
   Dialysis |          26           0          80
  Transplan |          91           0         317
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   240.26997   133.24387       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,078         573           0        573        573

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,230
  CKD stage |          84           0         402
  CKD stage |           0           0          13
   Dialysis |          21           0          80
  Transplan |          82           0         317
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |    243.3359   142.63452       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,078         553           0        553        553

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,230
  CKD stage |          78           0         402
  CKD stage |           1           0          13
   Dialysis |          15           0          80
  Transplan |         104           0         317
  KRT uncle |           1           0          36
------------+------------------------------------
      Total |    216.2334   117.06737       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,078         511           0        511        511

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,230
  CKD stage |          94           0         402
  CKD stage |           3           0          13
   Dialysis |          32           0          80
  Transplan |         104           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   199.41723   95.154794       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,078         519           0        519        519

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,230
  CKD stage |         101           0         402
  CKD stage |           7           0          13
   Dialysis |          18           0          80
  Transplan |          80           0         317
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   223.73773   121.10011       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,078         533           0        533        533

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,230
  CKD stage |          92           0         402
  CKD stage |          14           0          13
   Dialysis |          24           0          80
  Transplan |         113           0         317
  KRT uncle |          12           0          36
------------+------------------------------------
      Total |   217.97353   109.05002       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,078         562           0        562        562

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,230
  CKD stage |          82           0         402
  CKD stage |           6           0          13
   Dialysis |          35           0          80
  Transplan |          90           0         317
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |   215.15014   116.41241       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,078         529           0        529        529

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,230
  CKD stage |         134           0         402
  CKD stage |           0           0          13
   Dialysis |          10           0          80
  Transplan |          57           0         317
  KRT uncle |          21           0          36
------------+------------------------------------
      Total |   213.53369   109.62698       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,078         523           0        523        523

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,230
  CKD stage |         109           0         402
  CKD stage |           1           0          13
   Dialysis |          32           0          80
  Transplan |         101           0         317
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |   217.08277   105.44008       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,078         546           0        546        546

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,230
  CKD stage |         107           0         402
  CKD stage |           2           0          13
   Dialysis |          16           0          80
  Transplan |          75           0         317
  KRT uncle |          20           0          36
------------+------------------------------------
      Total |   230.81569    125.9096       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         554           0        554        554

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         264           0       1,230
  CKD stage |         123           0         402
  CKD stage |           5           0          13
   Dialysis |          25           0          80
  Transplan |          83           0         317
  KRT uncle |          18           0          36
------------+------------------------------------
      Total |   194.02791   87.284024       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         518           0        518        518

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,230
  CKD stage |          82           0         402
  CKD stage |           0           0          13
   Dialysis |          17           0          80
  Transplan |          78           0         317
  KRT uncle |          10           0          36
------------+------------------------------------
      Total |    210.8999   117.98793       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         495           0        495        495

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,230
  CKD stage |          91           0         402
  CKD stage |           0           0          13
   Dialysis |          12           0          80
  Transplan |          61           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   204.51059   115.22248       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         472           0        472        472

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,230
  CKD stage |          98           0         402
  CKD stage |           8           0          13
   Dialysis |          10           0          80
  Transplan |          68           0         317
  KRT uncle |          15           0          36
------------+------------------------------------
      Total |    209.9692   114.86172       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,078         503           0        503        503

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,230
  CKD stage |          87           0         402
  CKD stage |          10           0          13
   Dialysis |          26           0          80
  Transplan |          85           0         317
  KRT uncle |           2           0          36
------------+------------------------------------
      Total |    213.7974   115.78838       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,078         519           0        519        519

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         262           0       1,230
  CKD stage |         119           0         402
  CKD stage |          11           0          13
   Dialysis |           7           0          80
  Transplan |          74           0         317
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   189.95525   90.182095       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,078         486           0        486        486

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,230
  CKD stage |         107           0         402
  CKD stage |           8           0          13
   Dialysis |          22           0          80
  Transplan |          89           0         317
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   238.26997   127.73429       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,078         573           0        573        573

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         260           0       1,230
  CKD stage |         104           0         402
  CKD stage |          10           0          13
   Dialysis |          17           0          80
  Transplan |          72           0         317
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |     185.718   91.767848       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,078         463           0        463        463

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,230
  CKD stage |          73           0         402
  CKD stage |           5           0          13
   Dialysis |          10           0          80
  Transplan |          76           0         317
  KRT uncle |          18           0          36
------------+------------------------------------
      Total |   216.44899   126.77061       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,078         503           0        503        503

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,230
  CKD stage |         115           0         402
  CKD stage |           0           0          13
   Dialysis |          10           0          80
  Transplan |          69           0         317
  KRT uncle |           2           0          36
------------+------------------------------------
      Total |   245.09865   138.15472       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,078         554           0        554        554

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,230
  CKD stage |         125           0         402
  CKD stage |           9           0          13
   Dialysis |          26           0          80
  Transplan |          50           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |    221.8436   120.24275       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,078         538           0        538        538

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,230
  CKD stage |         102           0         402
  CKD stage |           0           0          13
   Dialysis |          22           0          80
  Transplan |          86           0         317
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |    208.9923   106.53154       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         511           0        511        511

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,230
  CKD stage |          94           0         402
  CKD stage |           4           0          13
   Dialysis |          35           0          80
  Transplan |         106           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   230.62368   119.83834       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         577           0        577        577

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,230
  CKD stage |          59           0         402
  CKD stage |           1           0          13
   Dialysis |          14           0          80
  Transplan |          64           0         317
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   230.19779   147.19628       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         497           0        497        497

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,230
  CKD stage |         105           0         402
  CKD stage |           7           0          13
   Dialysis |          22           0          80
  Transplan |          84           0         317
  KRT uncle |          21           0          36
------------+------------------------------------
      Total |   203.07748   100.39188       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         524           0        524        524

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,230
  CKD stage |         107           0         402
  CKD stage |           3           0          13
   Dialysis |          38           0          80
  Transplan |          95           0         317
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   265.93551   146.93072       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,078         641           0        641        641

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,230
  CKD stage |          64           0         402
  CKD stage |           4           0          13
   Dialysis |          27           0          80
  Transplan |          52           0         317
  KRT uncle |          14           0          36
------------+------------------------------------
      Total |   193.27623   116.90768       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,078         451           0        451        451

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,230
  CKD stage |         102           0         402
  CKD stage |           0           0          13
   Dialysis |          24           0          80
  Transplan |          84           0         317
  KRT uncle |          12           0          36
------------+------------------------------------
      Total |   200.00674   99.267548       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,078         503           0        503        503

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,230
  CKD stage |          90           0         402
  CKD stage |           6           0          13
   Dialysis |          29           0          80
  Transplan |          81           0         317
  KRT uncle |           6           0          36
------------+------------------------------------
      Total |   206.23244   109.25326       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,078         508           0        508        508

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,230
  CKD stage |          97           0         402
  CKD stage |           0           0          13
   Dialysis |          12           0          80
  Transplan |          82           0         317
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |   245.41771   140.60644       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,078         552           0        552        552

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,230
  CKD stage |         104           0         402
  CKD stage |           5           0          13
   Dialysis |          16           0          80
  Transplan |          75           0         317
  KRT uncle |          14           0          36
------------+------------------------------------
      Total |   224.23099   121.77198       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,078         538           0        538        538

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,230
  CKD stage |          65           0         402
  CKD stage |           5           0          13
   Dialysis |          17           0          80
  Transplan |          94           0         317
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   211.75505   120.80689       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,078         496           0        496        496

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         259           0       1,230
  CKD stage |          95           0         402
  CKD stage |           3           0          13
   Dialysis |          14           0          80
  Transplan |          88           0         317
  KRT uncle |          15           0          36
------------+------------------------------------
      Total |   185.92637   89.890646       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,078         474           0        474        474

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,230
  CKD stage |         109           0         402
  CKD stage |           3           0          13
   Dialysis |          38           0          80
  Transplan |          55           0         317
  KRT uncle |          14           0          36
------------+------------------------------------
      Total |   215.28681   117.16563       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,078         530           0        530        530

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,230
  CKD stage |          77           0         402
  CKD stage |           7           0          13
   Dialysis |          18           0          80
  Transplan |          91           0         317
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   226.81328   128.94098       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,078         537           0        537        537

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,230
  CKD stage |         135           0         402
  CKD stage |           6           0          13
   Dialysis |          25           0          80
  Transplan |          88           0         317
  KRT uncle |          16           0          36
------------+------------------------------------
      Total |   222.53609   104.91046       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,078         577           0        577        577

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,230
  CKD stage |         112           0         402
  CKD stage |           6           0          13
   Dialysis |          14           0          80
  Transplan |         103           0         317
  KRT uncle |          15           0          36
------------+------------------------------------
      Total |   218.15833   105.69553       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         554           0        554        554

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,230
  CKD stage |          71           0         402
  CKD stage |           0           0          13
   Dialysis |          27           0          80
  Transplan |          78           0         317
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   221.53513   130.12332       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,078         512           0        512        512

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         259           0       1,230
  CKD stage |         114           0         402
  CKD stage |           1           0          13
   Dialysis |          30           0          80
  Transplan |          81           0         317
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   188.99904   86.831992       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,078         492           0        492        492

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,230
  CKD stage |         120           0         402
  CKD stage |           0           0          13
   Dialysis |          15           0          80
  Transplan |         114           0         317
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   213.49952    96.55912       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,078         544           0        544        544

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,230
  CKD stage |         119           0         402
  CKD stage |           7           0          13
   Dialysis |           5           0          80
  Transplan |          88           0         317
  KRT uncle |           6           0          36
------------+------------------------------------
      Total |   204.29788   97.957447       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,078         508           0        508        508

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,230
  CKD stage |         113           0         402
  CKD stage |           6           0          13
   Dialysis |          19           0          80
  Transplan |          78           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |    208.1155   104.51032       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,078         518           0        518        518

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,230
  CKD stage |          86           0         402
  CKD stage |           1           0          13
   Dialysis |          13           0          80
  Transplan |          72           0         317
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |   236.62031   139.96489       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,078         532           0        532        532

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,230
  CKD stage |          87           0         402
  CKD stage |           4           0          13
   Dialysis |          15           0          80
  Transplan |         119           0         317
  KRT uncle |          12           0          36
------------+------------------------------------
      Total |   212.77719   106.23044       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,078         536           0        536        536

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,230
  CKD stage |         101           0         402
  CKD stage |           0           0          13
   Dialysis |          15           0          80
  Transplan |          99           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   218.86862   111.64334       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,078         534           0        534        534

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,230
  CKD stage |          76           0         402
  CKD stage |           0           0          13
   Dialysis |          12           0          80
  Transplan |          78           0         317
  KRT uncle |          14           0          36
------------+------------------------------------
      Total |   222.63811   130.20929       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         510           0        510        510

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,230
  CKD stage |          98           0         402
  CKD stage |           0           0          13
   Dialysis |          36           0          80
  Transplan |          64           0         317
  KRT uncle |          16           0          36
------------+------------------------------------
      Total |   222.16554   123.78961       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         538           0        538        538

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         256           0       1,230
  CKD stage |         114           0         402
  CKD stage |           6           0          13
   Dialysis |           9           0          80
  Transplan |         105           0         317
  KRT uncle |          26           0          36
------------+------------------------------------
      Total |   190.43648   82.097635       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         516           0        516        516

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,230
  CKD stage |         134           0         402
  CKD stage |           2           0          13
   Dialysis |          24           0          80
  Transplan |         119           0         317
  KRT uncle |          14           0          36
------------+------------------------------------
      Total |   261.89654    127.9384       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         659           0        659        659

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,230
  CKD stage |         100           0         402
  CKD stage |           6           0          13
   Dialysis |          27           0          80
  Transplan |         114           0         317
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   204.92397   95.023536       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,078         540           0        540        540

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,230
  CKD stage |          85           0         402
  CKD stage |           3           0          13
   Dialysis |          29           0          80
  Transplan |          66           0         317
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |   240.14485    143.9504       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,078         542           0        542        542

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,230
  CKD stage |          79           0         402
  CKD stage |           0           0          13
   Dialysis |          17           0          80
  Transplan |          74           0         317
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   196.14726   108.01372       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,078         468           0        468        468

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,230
  CKD stage |          98           0         402
  CKD stage |          -2           0          13
   Dialysis |          15           0          80
  Transplan |          67           0         317
  KRT uncle |          14           0          36
------------+------------------------------------
      Total |   205.19394   110.98402       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,078         488           0        488        488

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,230
  CKD stage |         109           0         402
  CKD stage |           3           0          13
   Dialysis |          12           0          80
  Transplan |          81           0         317
  KRT uncle |           1           0          36
------------+------------------------------------
      Total |   222.76227   117.99367       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,078         525           0        525        525

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,230
  CKD stage |         113           0         402
  CKD stage |           4           0          13
   Dialysis |          30           0          80
  Transplan |         111           0         317
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   208.79066   94.204313       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,078         550           0        550        550

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         229           0       1,230
  CKD stage |         131           0         402
  CKD stage |           3           0          13
   Dialysis |          12           0          80
  Transplan |          68           0         317
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   171.97064   74.183442       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,078         456           0        456        456

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,230
  CKD stage |         127           0         402
  CKD stage |           0           0          13
   Dialysis |           9           0          80
  Transplan |          68           0         317
  KRT uncle |          17           0          36
------------+------------------------------------
      Total |   222.03657   115.20721       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,078         536           0        536        536

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,230
  CKD stage |         132           0         402
  CKD stage |           6           0          13
   Dialysis |          15           0          80
  Transplan |          70           0         317
  KRT uncle |           2           0          36
------------+------------------------------------
      Total |   227.46102   117.33488       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,078         547           0        547        547

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,230
  CKD stage |         103           0         402
  CKD stage |           0           0          13
   Dialysis |          34           0          80
  Transplan |          66           0         317
  KRT uncle |           3           0          36
------------+------------------------------------
      Total |   246.81232   142.41273       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,078         570           0        570        570

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,230
  CKD stage |          65           0         402
  CKD stage |           6           0          13
   Dialysis |          12           0          80
  Transplan |          77           0         317
  KRT uncle |          23           0          36
------------+------------------------------------
      Total |   206.93696     121.278       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,078         490           0        490        490

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         270           0       1,230
  CKD stage |          99           0         402
  CKD stage |           1           0          13
   Dialysis |          21           0          80
  Transplan |          84           0         317
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   192.71944   94.891833       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         482           0        482        482

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,230
  CKD stage |         108           0         402
  CKD stage |          11           0          13
   Dialysis |          28           0          80
  Transplan |          81           0         317
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   203.28296   100.24757       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,078         524           0        524        524

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,230
  CKD stage |          84           0         402
  CKD stage |           0           0          13
   Dialysis |           7           0          80
  Transplan |          90           0         317
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |   223.94418   125.51164       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,078         516           0        516        516

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,230
  CKD stage |         115           0         402
  CKD stage |           2           0          13
   Dialysis |           9           0          80
  Transplan |          86           0         317
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |    263.1078   147.50087       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,078         601           0        601        601

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,230
  CKD stage |         131           0         402
  CKD stage |           0           0          13
   Dialysis |          17           0          80
  Transplan |          43           0         317
  KRT uncle |          16           0          36
------------+------------------------------------
      Total |   202.12175   105.76387       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,078         493           0        493        493

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,230
  CKD stage |          98           0         402
  CKD stage |           7           0          13
   Dialysis |          15           0          80
  Transplan |          58           0         317
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |    229.2257   133.67453       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,078         525           0        525        525

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,230
  CKD stage |          93           0         402
  CKD stage |           2           0          13
   Dialysis |          21           0          80
  Transplan |         102           0         317
  KRT uncle |           3           0          36
------------+------------------------------------
      Total |   220.87777   115.02027       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,078         536           0        536        536

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,230
  CKD stage |          62           0         402
  CKD stage |           3           0          13
   Dialysis |          11           0          80
  Transplan |          85           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   243.38402    150.9525       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,078         538           0        538        538

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,230
  CKD stage |         108           0         402
  CKD stage |           3           0          13
   Dialysis |           5           0          80
  Transplan |          95           0         317
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   226.26275   117.55207       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,078         537           0        537        537

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,230
  CKD stage |         109           0         402
  CKD stage |           0           0          13
   Dialysis |          36           0          80
  Transplan |          78           0         317
  KRT uncle |          12           0          36
------------+------------------------------------
      Total |   234.64678   125.89773       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         573           0        573        573

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,230
  CKD stage |         102           0         402
  CKD stage |           2           0          13
   Dialysis |          24           0          80
  Transplan |          57           0         317
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |   226.47209   129.94599       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         518           0        518        518

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,230
  CKD stage |         120           0         402
  CKD stage |           6           0          13
   Dialysis |          16           0          80
  Transplan |          91           0         317
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   218.40568   106.89872       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         545           0        545        545

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,230
  CKD stage |          89           0         402
  CKD stage |           5           0          13
   Dialysis |          29           0          80
  Transplan |          78           0         317
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   218.05727   120.13894       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,078         527           0        527        527

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,230
  CKD stage |          98           0         402
  CKD stage |           4           0          13
   Dialysis |           9           0          80
  Transplan |         101           0         317
  KRT uncle |          24           0          36
------------+------------------------------------
      Total |   229.89365   121.04865       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,078         565           0        565        565

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,230
  CKD stage |         126           0         402
  CKD stage |          10           0          13
   Dialysis |           7           0          80
  Transplan |          83           0         317
  KRT uncle |          20           0          36
------------+------------------------------------
      Total |   236.59913   122.41156       2,078

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,078         582           0        582        582

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(72 real changes made)

. replace ethnicity=2 if ethnicity==3
(68 real changes made)

. replace ethnicity=3 if ethnicity==4
(63 real changes made)

. replace ethnicity=4 if ethnicity==6
(72 real changes made)

. replace ethnicity=6 if ethnicity==.
(539 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,877 missing values generated)

. replace region = 2 if region_string=="East"
(183 real changes made)

. replace region = 3 if region_string=="London"
(439 real changes made)

. replace region = 4 if region_string=="North East"
(197 real changes made)

. replace region = 5 if region_string=="North West"
(202 real changes made)

. replace region = 6 if region_string=="South East"
(209 real changes made)

. replace region = 7 if region_string=="South West"
(219 real changes made)

. replace region = 8 if region_string=="West Midlands"
(221 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(207 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,078 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(822 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,256 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2017_ckd_complete.dta not found)
file ./output/2017_ckd_complete.dta saved

. export delimited using "./output/`dataset'_ckd_complete.csv", replace
(note: file ./output/2017_ckd_complete.csv not found)
file ./output/2017_ckd_complete.csv saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 closed on:  12 Sep 2023, 12:49:26
-------------------------------------------------------------------------------
