-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 opened on:   9 Feb 2023, 22:09:43

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 20,947 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,793
        from master                    47,923  (_merge==1)
        from using                     18,870  (_merge==2)

    matched                             2,077  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,793 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save 2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        190        9.15        9.15
Kidney transplant |        177        8.52       17.67
 Modality unclear |         49        2.36       20.03
          Pre KRT |      1,661       79.97      100.00
------------------+-----------------------------------
            Total |      2,077      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(854 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1223 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(190 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(177 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(49 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(692 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,276       61.43       61.43
  CKD stage 3 |        368       17.72       79.15
CKD stage 4/5 |         17        0.82       79.97
     Dialysis |        190        9.15       89.12
   Transplant |        177        8.52       97.64
  KRT unclear |         49        2.36      100.00
--------------+-----------------------------------
        Total |      2,077      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,276 |     1,276 
  CKD stage 3 |         0          0          0        368 |       368 
CKD stage 4/5 |         0          0          0         17 |        17 
     Dialysis |       190          0          0          0 |       190 
   Transplant |         0        177          0          0 |       177 
  KRT unclear |         0          0         49          0 |        49 
--------------+--------------------------------------------+----------
        Total |       190        177         49      1,661 |     2,077 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       114         66         39         11 |     1,276 
  CKD stage 3 |        38         20         19          6 |       368 
CKD stage 4/5 |         2          0          1          0 |        17 
     Dialysis |        24         12          9          1 |       190 
   Transplant |        22          7          6          2 |       177 
  KRT unclear |         0          3          1          2 |        49 
--------------+--------------------------------------------+----------
        Total |       200        108         75         22 |     2,077 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |     1,046 |     1,276 
  CKD stage 3 |       285 |       368 
CKD stage 4/5 |        14 |        17 
     Dialysis |       144 |       190 
   Transplant |       140 |       177 
  KRT unclear |        43 |        49 
--------------+-----------+----------
        Total |     1,672 |     2,077 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,100 missing values generated)

. replace sex = 0 if male == "Female"
(1,100 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(890 real changes made, 890 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(890 missing values generated)

. gen min_creatinine_outcome=.
(2,077 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(641 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(546 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(641 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(546 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(778 real changes made)

. gen max_creatinine_outcome=.
(2,077 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(641 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(546 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,187 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,299 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(890 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,187 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(641 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(890 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1187 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(182 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(8 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(108 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(75 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(22 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(200 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,515       72.94       72.94
               CKD 3 |        148        7.13       80.07
     CKD 4/5 pre-KRT |          9        0.43       80.50
            Dialysis |        108        5.20       85.70
   Kidney transplant |         75        3.61       89.31
KRT unclear modality |         22        1.06       90.37
            Deceased |        200        9.63      100.00
---------------------+-----------------------------------
               Total |      2,077      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,276
  CKD stage |          85           0         368
  CKD stage |          11           0          17
   Dialysis |          35           0         190
  Transplan |          38           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   256.57776   159.21159       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,077         564           0        564        564

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,276
  CKD stage |         105           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          49           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   205.27106   107.57239       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,077         512           0        512        512

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,276
  CKD stage |          62           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          32           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   217.21329   135.15857       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,077         483           0        483        483

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,276
  CKD stage |         117           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          29           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   251.25181   147.58703       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,077         555           0        555        555

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,276
  CKD stage |          81           0         368
  CKD stage |           5           0          17
   Dialysis |          62           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   244.97593   143.26796       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,077         568           0        568        568

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,276
  CKD stage |         105           0         368
  CKD stage |           6           0          17
   Dialysis |          69           0         190
  Transplan |          42           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   201.36447   102.50836       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,077         511           0        511        511

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,276
  CKD stage |         107           0         368
  CKD stage |          11           0          17
   Dialysis |          55           0         190
  Transplan |          41           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |    212.1844   112.82138       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,077         527           0        527        527

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          45           0         190
  Transplan |          35           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   223.35725   125.46172       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,077         512           0        512        512

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,276
  CKD stage |          88           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          45           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   258.43813    154.2957       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,077         576           0        576        576

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,276
  CKD stage |         120           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   204.94222   105.56389       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,077         517           0        517        517

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,276
  CKD stage |          86           0         368
  CKD stage |           5           0          17
   Dialysis |          63           0         190
  Transplan |          44           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   251.27203   148.03995       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,077         583           0        583        583

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,276
  CKD stage |         102           0         368
  CKD stage |           8           0          17
   Dialysis |          55           0         190
  Transplan |          47           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   216.41695   117.29742       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,077         521           0        521        521

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,276
  CKD stage |          87           0         368
  CKD stage |           9           0          17
   Dialysis |          46           0         190
  Transplan |          23           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   203.55031   118.24193       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,077         463           0        463        463

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,276
  CKD stage |          94           0         368
  CKD stage |          10           0          17
   Dialysis |          49           0         190
  Transplan |          33           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   213.53346   120.71519       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         506           0        506        506

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,276
  CKD stage |         100           0         368
  CKD stage |           6           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   243.48435   139.57995       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         566           0        566        566

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,276
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          41           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   211.39384   114.98271       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         508           0        508        508

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,276
  CKD stage |          94           0         368
  CKD stage |           7           0          17
   Dialysis |          45           0         190
  Transplan |          39           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   198.24844   108.57666       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         478           0        478        478

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,276
  CKD stage |         116           0         368
  CKD stage |           4           0          17
   Dialysis |          72           0         190
  Transplan |          47           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   225.57053   116.27687       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         566           0        566        566

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,276
  CKD stage |         117           0         368
  CKD stage |           5           0          17
   Dialysis |          46           0         190
  Transplan |          42           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   220.94319   118.94459       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         527           0        527        527

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,276
  CKD stage |         143           0         368
  CKD stage |          13           0          17
   Dialysis |          47           0         190
  Transplan |          56           0         177
  KRT uncle |          29           0          49
------------+------------------------------------
      Total |   205.37313    95.27957       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         565           0        565        565

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,276
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          34           0         190
  Transplan |          60           0         177
  KRT uncle |          16           0          49
------------+------------------------------------
      Total |   197.91045   102.27393       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         495           0        495        495

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |          79           0         368
  CKD stage |          16           0          17
   Dialysis |          52           0         190
  Transplan |          67           0         177
  KRT uncle |           7           0          49
------------+------------------------------------
      Total |   221.96533   125.62209       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         542           0        542        542

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,276
  CKD stage |         141           0         368
  CKD stage |           0           0          17
   Dialysis |          68           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   266.45113   142.84813       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         641           0        641        641

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |          70           0         368
  CKD stage |           3           0          17
   Dialysis |          53           0         190
  Transplan |          80           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   232.04911   134.24611       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         557           0        557        557

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,276
  CKD stage |          53           0         368
  CKD stage |           7           0          17
   Dialysis |          22           0         190
  Transplan |          69           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   204.22003   126.59437       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,077         460           0        460        460

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,276
  CKD stage |          65           0         368
  CKD stage |           2           0          17
   Dialysis |          44           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |    251.4208   160.11233       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         544           0        544        544

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,276
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          55           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   236.91286   130.09105       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         568           0        568        568

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,276
  CKD stage |         102           0         368
  CKD stage |           3           0          17
   Dialysis |          48           0         190
  Transplan |          49           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   239.41647   136.00083       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         556           0        556        556

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,276
  CKD stage |          66           0         368
  CKD stage |           7           0          17
   Dialysis |          46           0         190
  Transplan |          53           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   225.07703   136.67069       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         506           0        506        506

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,276
  CKD stage |         113           0         368
  CKD stage |           3           0          17
   Dialysis |          51           0         190
  Transplan |          61           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   236.16418   126.51232       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         582           0        582        582

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,276
  CKD stage |         111           0         368
  CKD stage |           2           0          17
   Dialysis |          24           0         190
  Transplan |          64           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   241.33799   136.93673       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         558           0        558        558

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,276
  CKD stage |          86           0         368
  CKD stage |           4           0          17
   Dialysis |          71           0         190
  Transplan |          37           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   209.97833   116.04004       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         505           0        505        505

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,276
  CKD stage |         131           0         368
  CKD stage |           0           0          17
   Dialysis |          48           0         190
  Transplan |          38           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   249.26336   136.67091       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         586           0        586        586

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |         102           0         368
  CKD stage |           0           0          17
   Dialysis |          66           0         190
  Transplan |          24           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   216.69716   119.91405       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         506           0        506        506

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,276
  CKD stage |          91           0         368
  CKD stage |          11           0          17
   Dialysis |          78           0         190
  Transplan |          40           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   226.82138   124.97191       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         562           0        562        562

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         259           0       1,276
  CKD stage |          83           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   183.47183   96.203796       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         473           0        473        473

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,276
  CKD stage |         109           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          45           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   247.13288   143.21306       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,077         555           0        555        555

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,276
  CKD stage |         123           0         368
  CKD stage |           7           0          17
   Dialysis |          57           0         190
  Transplan |          56           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   232.91719   121.22351       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,077         578           0        578        578

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |          92           0         368
  CKD stage |           1           0          17
   Dialysis |          60           0         190
  Transplan |          49           0         177
  KRT uncle |          28           0          49
------------+------------------------------------
      Total |    234.2831   131.74745       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,077         568           0        568        568

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,276
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          51           0         190
  Transplan |          44           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   241.37891   138.61265       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,077         548           0        548        548

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,276
  CKD stage |          91           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          61           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   230.53972   133.03408       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,077         539           0        539        539

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,276
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          53           0         190
  Transplan |          54           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   262.09629   150.21495       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,077         604           0        604        604

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,276
  CKD stage |         106           0         368
  CKD stage |          15           0          17
   Dialysis |          52           0         190
  Transplan |          66           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   228.21473   120.99981       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,077         583           0        583        583

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,276
  CKD stage |         114           0         368
  CKD stage |           6           0          17
   Dialysis |          55           0         190
  Transplan |          50           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   231.75445   124.85204       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,077         558           0        558        558

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,276
  CKD stage |          84           0         368
  CKD stage |           0           0          17
   Dialysis |          71           0         190
  Transplan |          66           0         177
  KRT uncle |          25           0          49
------------+------------------------------------
      Total |   221.72605   119.53245       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,077         562           0        562        562

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,276
  CKD stage |         104           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          55           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   238.50072    134.7942       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         551           0        551        551

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,276
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   233.43958   125.95504       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         574           0        574        574

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,276
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          51           0         190
  Transplan |          79           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   266.68272   150.37554       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,077         641           0        641        641

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,276
  CKD stage |          99           0         368
  CKD stage |          14           0          17
   Dialysis |          39           0         190
  Transplan |          28           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |    228.2104   134.15356       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,077         514           0        514        514

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,276
  CKD stage |          69           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          32           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |    204.7299   126.02128       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         452           0        452        452

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,276
  CKD stage |         113           0         368
  CKD stage |           2           0          17
   Dialysis |          52           0         190
  Transplan |          37           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |    219.8363   118.78639       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         525           0        525        525

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,276
  CKD stage |          89           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          44           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   232.52431   138.05195       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         529           0        529        529

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,276
  CKD stage |          98           0         368
  CKD stage |           2           0          17
   Dialysis |          37           0         190
  Transplan |          86           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   209.53828   109.64571       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         527           0        527        527

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,276
  CKD stage |          85           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          30           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   198.38325   111.78332       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         475           0        475        475

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         406           0       1,276
  CKD stage |         122           0         368
  CKD stage |           1           0          17
   Dialysis |          22           0         190
  Transplan |          61           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   278.77901   163.00795       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         634           0        634        634

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         404           0       1,276
  CKD stage |          83           0         368
  CKD stage |           7           0          17
   Dialysis |          81           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   274.82812   163.65495       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         636           0        636        636

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,276
  CKD stage |          73           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          56           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   208.44632   122.62651       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         473           0        473        473

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,276
  CKD stage |          93           0         368
  CKD stage |           4           0          17
   Dialysis |          54           0         190
  Transplan |          38           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |    271.2778   164.72353       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         600           0        600        600

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |          93           0         368
  CKD stage |           0           0          17
   Dialysis |          33           0         190
  Transplan |          46           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   221.02311   127.58838       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         510           0        510        510

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,276
  CKD stage |         111           0         368
  CKD stage |           6           0          17
   Dialysis |          39           0         190
  Transplan |          36           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   259.49591   152.82508       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         584           0        584        584

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,276
  CKD stage |         101           0         368
  CKD stage |           3           0          17
   Dialysis |          36           0         190
  Transplan |          83           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   214.71642   113.23504       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,077         538           0        538        538

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         416           0       1,276
  CKD stage |          92           0         368
  CKD stage |           9           0          17
   Dialysis |          37           0         190
  Transplan |          42           0         177
  KRT uncle |          26           0          49
------------+------------------------------------
      Total |   279.51998   173.18017       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,077         622           0        622        622

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          75           0         368
  CKD stage |           9           0          17
   Dialysis |          30           0         190
  Transplan |          63           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   212.13529    124.3569       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,077         496           0        496        496

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,276
  CKD stage |         102           0         368
  CKD stage |           5           0          17
   Dialysis |          41           0         190
  Transplan |          50           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   238.83052   136.84838       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,077         550           0        550        550

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,276
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          45           0         190
  Transplan |          50           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   215.33462   121.90486       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,077         501           0        501        501

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,276
  CKD stage |         120           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   210.15503   110.49998       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,077         510           0        510        510

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |         132           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          36           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   239.46654   127.78152       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,077         575           0        575        575

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,276
  CKD stage |         100           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          33           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   213.33847   117.43574       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,077         510           0        510        510

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          63           0         190
  Transplan |          62           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   217.79634   117.21887       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,077         544           0        544        544

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,276
  CKD stage |          89           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   225.31825   129.48012       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         518           0        518        518

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,276
  CKD stage |          96           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   217.47665   124.77424       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         500           0        500        500

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,276
  CKD stage |          93           0         368
  CKD stage |           9           0          17
   Dialysis |          84           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   242.23207   133.09688       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,077         604           0        604        604

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,276
  CKD stage |          92           0         368
  CKD stage |           0           0          17
   Dialysis |          38           0         190
  Transplan |          63           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   244.86856   142.56209       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,077         567           0        567        567

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,276
  CKD stage |          80           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   232.04429   137.05132       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         524           0        524        524

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,276
  CKD stage |         119           0         368
  CKD stage |           3           0          17
   Dialysis |          46           0         190
  Transplan |          52           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   271.63505   155.09021       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         632           0        632        632

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         278           0       1,276
  CKD stage |          87           0         368
  CKD stage |           8           0          17
   Dialysis |          42           0         190
  Transplan |          49           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   194.68753   106.28184       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         481           0        481        481

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          42           0         190
  Transplan |          54           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |    232.3895   134.21641       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         546           0        546        546

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          61           0         190
  Transplan |          28           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   214.92826   121.26743       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         517           0        517        517

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,276
  CKD stage |         127           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   217.36928   115.77388       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         519           0        519        519

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,276
  CKD stage |          94           0         368
  CKD stage |           4           0          17
   Dialysis |          53           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   199.51372   108.21324       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         479           0        479        479

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,276
  CKD stage |          93           0         368
  CKD stage |           3           0          17
   Dialysis |          52           0         190
  Transplan |          35           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   215.51613   121.92795       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         503           0        503        503

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,276
  CKD stage |          49           0         368
  CKD stage |           7           0          17
   Dialysis |          58           0         190
  Transplan |          33           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   196.50602   120.84431       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         450           0        450        450

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,276
  CKD stage |          98           0         368
  CKD stage |           5           0          17
   Dialysis |          51           0         190
  Transplan |          21           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   224.13674   130.53229       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         501           0        501        501

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,276
  CKD stage |          75           0         368
  CKD stage |           1           0          17
   Dialysis |          46           0         190
  Transplan |          46           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   221.89071     132.043       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         502           0        502        502

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(81 real changes made)

. replace ethnicity=2 if ethnicity==3
(76 real changes made)

. replace ethnicity=3 if ethnicity==4
(82 real changes made)

. replace ethnicity=4 if ethnicity==6
(81 real changes made)

. replace ethnicity=6 if ethnicity==.
(524 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,841 missing values generated)

. replace region = 2 if region_string=="East"
(193 real changes made)

. replace region = 3 if region_string=="London"
(413 real changes made)

. replace region = 4 if region_string=="North East"
(223 real changes made)

. replace region = 5 if region_string=="North West"
(207 real changes made)

. replace region = 6 if region_string=="South East"
(199 real changes made)

. replace region = 7 if region_string=="South West"
(205 real changes made)

. replace region = 8 if region_string=="West Midlands"
(221 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(180 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,077 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(829 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,248 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2017_ckd_complete.dta not found)
file ./output/2017_ckd_complete.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 closed on:   9 Feb 2023, 22:09:56
-------------------------------------------------------------------------------
