-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_nockd_complete.log
  log type:  text
 opened on:  29 Apr 2024, 13:16:21

. clear

. 
. *Merge `dataset'_nockd with `dataset'_nockd_complete
. capture noisily import delimited ./output/`dataset'_nockd.csv, clear
(17 vars, 10,901 obs)

. tempfile `dataset'_nockd

. save ``dataset'_nockd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_nockd_complete.csv,
>  clear
(87 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_nockd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        58,733
        from master                    48,916  (_merge==1)
        from using                      9,817  (_merge==2)

    matched                             1,084  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(58,733 observations deleted)

. drop _merge

. tempfile `dataset'_nockd_complete

. save ``dataset'_nockd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_nockd.csv, clear
> tempfile 2017_nockd
> save ./output/2017_nockd, replace
> capture noisily import delimited ./output/input_2017_nockd_complete.csv, clea
> r
> merge 1:1 patient_id using ./output/2017_nockd
> keep if _merge==3
> drop _merge
> tempfile 2017_nockd_complete
> save ./output/2017_nockd_complete, replace
> */
. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(520 missing values generated)

. replace sex = 0 if male == "Female"
(520 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(503 real changes made, 503 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(503 missing values generated)

. gen min_creatinine_outcome=.
(1,084 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(280 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(301 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(280 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(301 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(359 real changes made)

. gen max_creatinine_outcome=.
(1,084 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(280 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(301 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(581 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(725 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(503 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(581 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(280 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(503 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 581 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2
(135 real changes made)

. replace ckd_progression = 2 if egfr_end==3
(9 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(503 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 581 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        581       53.60       53.60
          . |        503       46.40      100.00
------------+-----------------------------------
      Total |      1,084      100.00

. *NB - might need to change "" to . with dummy data
. replace modality_outcome = "Unchanged" if modality_outcome_date==.
(162 real changes made)

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(15 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(15 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(2 real changes made)

. *NB - might need to change "" to . with dummy data
. replace ckd_progression = 5 if modality_outcome=="Modality unclear" & modalit
> y_outcome_date!=.
(4 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(15 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(17 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(27 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |        886       81.73       81.73
               CKD 3 |        129       11.90       93.63
     CKD 4/5 pre-KRT |          8        0.74       94.37
            Dialysis |         15        1.38       95.76
   Kidney transplant |         17        1.57       97.32
KRT unclear modality |          2        0.18       97.51
            Deceased |         27        2.49      100.00
---------------------+-----------------------------------
               Total |      1,084      100.00

. gen ckd_group = 0

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(30 real changes made)

. replace ethnicity=2 if ethnicity==3
(46 real changes made)

. replace ethnicity=3 if ethnicity==4
(41 real changes made)

. replace ethnicity=4 if ethnicity==6
(30 real changes made)

. replace ethnicity=6 if ethnicity==.
(278 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(997 missing values generated)

. replace region = 2 if region_string=="East"
(109 real changes made)

. replace region = 3 if region_string=="London"
(231 real changes made)

. replace region = 4 if region_string=="North East"
(98 real changes made)

. replace region = 5 if region_string=="North West"
(118 real changes made)

. replace region = 6 if region_string=="South East"
(120 real changes made)

. replace region = 7 if region_string=="South West"
(101 real changes made)

. replace region = 8 if region_string=="West Midlands"
(100 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(120 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(1,084 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(446 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(638 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. *Age bands for standardisation
. egen agecat = cut(age), at(0,18,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,
> 200)

. drop if agecat==0
(0 observations deleted)

. 
. *Age-standardisation weights (European Standard Population 2013)
. gen weight = .
(1,084 missing values generated)

. replace weight = 0.027261 if agecat==18
(34 real changes made)

. replace weight = 0.074349 if agecat==20
(113 real changes made)

. replace weight = 0.074349 if agecat==25
(97 real changes made)

. replace weight = 0.080545 if agecat==30
(100 real changes made)

. replace weight = 0.086741 if agecat==35
(102 real changes made)

. replace weight = 0.086741 if agecat==40
(85 real changes made)

. replace weight = 0.086741 if agecat==45
(94 real changes made)

. replace weight = 0.086741 if agecat==50
(97 real changes made)

. replace weight = 0.080545 if agecat==55
(81 real changes made)

. replace weight = 0.074349 if agecat==60
(75 real changes made)

. replace weight = 0.068154 if agecat==65
(68 real changes made)

. replace weight = 0.061958 if agecat==70
(50 real changes made)

. replace weight = 0.049566 if agecat==75
(41 real changes made)

. replace weight = 0.030979 if agecat==80
(26 real changes made)

. replace weight = 0.018587 if agecat==85
(10 real changes made)

. replace weight = 0.012392 if agecat==90
(11 real changes made)

. 
. *Age standardised counts for each non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions icd1_days icd2_days icd3_days ic
> d4_days icd5_days icd6_days icd7_days icd8_days icd9_days icd10_days icd11_da
> ys icd12_days icd13_days icd14_days icd15_days icd16_days icd17_days icd18_da
> ys icd19_days icd20_days icd21_days icd22_days {
  2. replace `aggregate' = `aggregate' * weight
  3. }
variable hospital_days was byte now float
(78 real changes made)
variable critical_care_days was byte now float
(83 real changes made)
variable emergency_days was byte now float
(98 real changes made)
variable op_appts was byte now float
(95 real changes made)
variable neph_appts was byte now float
(103 real changes made)
variable tx_appts was byte now float
(81 real changes made)
variable gp_interactions was byte now float
(111 real changes made)
variable icd1_days was byte now float
(105 real changes made)
variable icd2_days was byte now float
(95 real changes made)
variable icd3_days was byte now float
(92 real changes made)
variable icd4_days was byte now float
(86 real changes made)
variable icd5_days was byte now float
(89 real changes made)
variable icd6_days was byte now float
(87 real changes made)
variable icd7_days was byte now float
(99 real changes made)
variable icd8_days was byte now float
(98 real changes made)
variable icd9_days was byte now float
(94 real changes made)
variable icd10_days was byte now float
(112 real changes made)
variable icd11_days was byte now float
(90 real changes made)
variable icd12_days was byte now float
(97 real changes made)
variable icd13_days was byte now float
(95 real changes made)
variable icd14_days was byte now float
(83 real changes made)
variable icd15_days was byte now float
(100 real changes made)
variable icd16_days was byte now float
(75 real changes made)
variable icd17_days was byte now float
(82 real changes made)
variable icd18_days was byte now float
(105 real changes made)
variable icd19_days was byte now float
(79 real changes made)
variable icd20_days was byte now float
(95 real changes made)
variable icd21_days was byte now float
(94 real changes made)
variable icd22_days was byte now float
(97 real changes made)

. 
. * Create variable for age-standardised total # of each aggregated outcome
. * `var'_`aggregate' = age-standardised total # of each aggregated outcome ove
> rall stratified by ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = age-standardised total # of each aggregated outcome
>  in each CKD group stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions icd1_days icd2_days icd3_days ic
> d4_days icd5_days icd6_days icd7_days icd8_days icd9_days icd10_days icd11_da
> ys icd12_days icd13_days icd14_days icd15_days icd16_days icd17_days icd18_da
> ys icd19_days icd20_days icd21_days icd22_days {
  2. egen overall_std_`aggregate' = total(`aggregate')
  3. bysort ckd_group: egen std_`aggregate' = total(`aggregate')
  4. foreach var of varlist ethnicity imd region urban {
  5. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  6. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  7. }
  8. }

. 
. foreach binary of varlist fistula_formation pd_insertion blood_pressure album
> inuria creatinine icd1 icd2 icd3 icd4 icd5 icd6 icd7 icd8 icd9 icd10 icd11 ic
> d12 icd13 icd14 icd15 icd16 icd17 icd18 icd19 icd20 icd21 icd22 {
  2. gen esp_`binary' = `binary' * weight
  3. egen overall_std_`binary' = total(esp_`binary')
  4. bysort ckd_group: egen std_`binary' = total(esp_`binary')
  5. foreach var of varlist ethnicity imd region urban {
  6. bysort `var': egen `var'_`binary' = total(esp_`binary')
  7. bysort `var' ckd_group: egen `var'_`binary'_ckd = total(esp_`binary')
  8. }
  9. }

. 
. /*Merge cost data
> save "./output/`dataset'_ckd_complete.dta", replace
> capture noisily import delimited ./output/costs_`dataset'.csv, clear
> keep patient_id apcs_cost ec_cost opa_cost
> merge 1:1 patient_id using ./output/`dataset'_ckd_complete
> drop if _merge==1
> foreach cost of varlist apcs_cost ec_cost opa_cost {
> sum `cost', d
> bysort ckd_group: egen total_`cost' = total(`cost')
> egen overall_`cost' = total(`cost')
> tab ckd_group, sum(total_`cost')
> sum overall_`cost'
> foreach var of varlist ethnicity imd region urban {
> bysort `var': egen `var'_`cost' = total(`cost')
> bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
> }
> }*/
. 
. save "./output/`dataset'_nockd_complete.dta", replace
(note: file ./output/2017_nockd_complete.dta not found)
file ./output/2017_nockd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_nockd_complete.log
  log type:  text
 closed on:  29 Apr 2024, 13:16:33
-------------------------------------------------------------------------------
