-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 opened on:  16 Dec 2022, 12:25:26

. clear

. 
. import delimited ./output/input_2017.csv, delimiter(comma) varnames(1) case(p
> reserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,442 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,972 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,796 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,448       10.20       10.20
           East Midlands |      3,336        9.87       20.08
                  London |      6,751       19.98       40.06
              North East |      3,326        9.84       49.90
              North West |      3,294        9.75       59.65
              South East |      3,389       10.03       69.68
              South West |      3,337        9.88       79.55
           West Midlands |      3,538       10.47       90.02
Yorkshire and The Humber |      3,371        9.98      100.00
-------------------------+-----------------------------------
                   Total |     33,790      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,597        4.73        4.73
          1 |      6,449       19.09       23.81
          2 |      6,414       18.98       42.79
          3 |      6,398       18.93       61.73
          4 |      6,573       19.45       81.18
          5 |      6,359       18.82      100.00
------------+-----------------------------------
      Total |     33,790      100.00

. drop if imd==0
(1,597 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,121 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(786 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(786 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,146 real changes made, 14,146 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,146 missing values generated)

. gen min_baseline_creatinine=.
(32,193 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,237 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,810 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,237 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,810 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,480 real changes made)

. gen max_baseline_creatinine=.
(32,193 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,237 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,810 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,047 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,713 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,146 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,047 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,237 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,696 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,193
25%            0              0       Sum of Wgt.      32,193

50%     10.15521                      Mean           12.53231
                        Largest       Std. Dev.      12.99751
75%     25.05397       41.78029
90%     29.21602       42.06333       Variance       168.9353
95%     31.37868        42.3614       Skewness       .2079141
99%     35.30199       43.58812       Kurtosis       1.295696

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,629        5.62        5.62
         <= |      1,563        5.39       11.01
          = |     20,939       72.23       83.24
          > |      1,577        5.44       88.68
         >= |      1,653        5.70       94.38
          ~ |      1,630        5.62      100.00
------------+-----------------------------------
      Total |     28,991      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,644       54.81       54.81
          1 |     14,549       45.19      100.00
------------+-----------------------------------
      Total |     32,193      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,948       46.43       46.43
          1 |     17,245       53.57      100.00
------------+-----------------------------------
      Total |     32,193      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,590       95.02       95.02
          1 |      1,603        4.98      100.00
------------+-----------------------------------
      Total |     32,193      100.00
(746 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,574       94.97       94.97
          1 |      1,619        5.03      100.00
------------+-----------------------------------
      Total |     32,193      100.00
(702 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,565       94.94       94.94
          1 |      1,628        5.06      100.00
------------+-----------------------------------
      Total |     32,193      100.00
(695 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,605       95.07       95.07
          1 |      1,588        4.93      100.00
------------+-----------------------------------
      Total |     32,193      100.00
(608 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,599       95.05       95.05
          1 |      1,594        4.95      100.00
------------+-----------------------------------
      Total |     32,193      100.00
(622 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,626       95.13       95.13
          1 |      1,567        4.87      100.00
------------+-----------------------------------
      Total |     32,193      100.00
(531 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,044       34.31       34.31
          1 |     21,149       65.69      100.00
------------+-----------------------------------
      Total |     32,193      100.00

. drop if ckd==0
(11,044 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/2017_ckd.csv", replace
(note: file ./output/2017_ckd.csv not found)
file ./output/2017_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 closed on:  16 Dec 2022, 12:25:28
-------------------------------------------------------------------------------
