-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 opened on:  21 Nov 2023, 18:28:28

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(8 vars, 21,105 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(236 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,779
        from master                    47,837  (_merge==1)
        from using                     18,942  (_merge==2)

    matched                             2,163  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,779 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        191        8.83        8.83
Kidney transplant |        195        9.02       17.85
 Modality unclear |         36        1.66       19.51
          Pre KRT |      1,741       80.49      100.00
------------------+-----------------------------------
            Total |      2,163      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(879 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1284 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,284       59.36       59.36
          . |        879       40.64      100.00
------------+-----------------------------------
      Total |      2,163      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(191 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(23 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(133 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(310 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(8 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(36 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(4 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       110         81 |       191 
Kidney transplant |       195          0 |       195 
 Modality unclear |        36          0 |        36 
          Pre KRT |     1,741          0 |     1,741 
------------------+----------------------+----------
            Total |     2,082         81 |     2,163 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       174         17 |       191 
Kidney transplant |       167         28 |       195 
 Modality unclear |        32          4 |        36 
          Pre KRT |     1,488        253 |     1,741 
------------------+----------------------+----------
            Total |     1,861        302 |     2,163 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       191          0 |       191 
Kidney transplant |       195          0 |       195 
 Modality unclear |         4         32 |        36 
          Pre KRT |     1,741          0 |     1,741 
------------------+----------------------+----------
            Total |     2,131         32 |     2,163 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,780        302 |     2,082 
         1 |        81          0 |        81 
-----------+----------------------+----------
     Total |     1,861        302 |     2,163 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(879 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1284 changes made)

. replace ckd_group = 4 if dialysis==1
(81 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(302 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(32 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(665 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,331       61.53       61.53
         CKD stage 3 |        401       18.54       80.07
       CKD stage 4/5 |         16        0.74       80.81
            Dialysis |         81        3.74       84.56
          Transplant |        302       13.96       98.52
KRT unclear modality |         32        1.48      100.00
---------------------+-----------------------------------
               Total |      2,163      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        54        134          0      1,143 |     1,331 
         CKD stage 3 |        38         32          0        331 |       401 
       CKD stage 4/5 |         1          1          0         14 |        16 
            Dialysis |        81          0          0          0 |        81 
          Transplant |        17         28          4        253 |       302 
KRT unclear modality |         0          0         32          0 |        32 
---------------------+--------------------------------------------+----------
               Total |       191        195         36      1,741 |     2,163 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       136         80         64         12 |     1,331 
         CKD stage 3 |        32         21         14          5 |       401 
       CKD stage 4/5 |         0          0          0          0 |        16 
            Dialysis |         8          3          5          1 |        81 
          Transplant |        28         17         13          5 |       302 
KRT unclear modality |         3          1          0          0 |        32 
---------------------+--------------------------------------------+----------
               Total |       207        122         96         23 |     2,163 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,039 |     1,331 
         CKD stage 3 |       329 |       401 
       CKD stage 4/5 |        16 |        16 
            Dialysis |        64 |        81 
          Transplant |       239 |       302 
KRT unclear modality |        28 |        32 
---------------------+-----------+----------
               Total |     1,715 |     2,163 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,080 missing values generated)

. replace sex = 0 if male == "Female"
(1,080 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(982 real changes made, 982 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(982 missing values generated)

. gen min_creatinine_outcome=.
(2,163 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(594 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(587 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(594 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(587 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(746 real changes made)

. gen max_creatinine_outcome=.
(2,163 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(594 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(587 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,181 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,417 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(982 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,181 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(594 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(982 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1181 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(187 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(4 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(5 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(982 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1181 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,181       54.60       54.60
          . |        982       45.40      100.00
------------+-----------------------------------
      Total |      2,163      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(122 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(96 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(15 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(23 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(122 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(111 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(207 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,558       72.03       72.03
               CKD 3 |        149        6.89       78.92
     CKD 4/5 pre-KRT |          8        0.37       79.29
            Dialysis |        122        5.64       84.93
   Kidney transplant |        111        5.13       90.06
KRT unclear modality |          8        0.37       90.43
            Deceased |        207        9.57      100.00
---------------------+-----------------------------------
               Total |      2,163      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(879 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1284 changes made)

. replace access_egfr=0 if ckd_group==4
(81 real changes made)

. replace access_egfr=3 if access_egfr==.
(798 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes (including by month)
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         390           0       1,331
  CKD stage |         117           0         401
  CKD stage |           7           0          16
   Dialysis |          34           0          81
  Transplan |          64           0         302
  KRT uncle |           8           0          32
------------+------------------------------------
      Total |   272.05594   150.81436       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,163         620           0        620        620

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,331
  CKD stage |         124           0         401
  CKD stage |           4           0          16
   Dialysis |          23           0          81
  Transplan |          77           0         302
  KRT uncle |          24           0          32
------------+------------------------------------
      Total |   236.20435   117.12958       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,163         579           0        579        579

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,331
  CKD stage |         123           0         401
  CKD stage |           6           0          16
   Dialysis |          20           0          81
  Transplan |          95           0         302
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   278.78132   146.32686       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,163         643           0        643        643

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,331
  CKD stage |         121           0         401
  CKD stage |           7           0          16
   Dialysis |          34           0          81
  Transplan |          68           0         302
  KRT uncle |          11           0          32
------------+------------------------------------
      Total |   259.86269   138.63135       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,163         609           0        609        609

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,331
  CKD stage |         123           0         401
  CKD stage |           3           0          16
   Dialysis |          22           0          81
  Transplan |          90           0         302
  KRT uncle |           8           0          32
------------+------------------------------------
      Total |   224.63014   105.45192       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,163         552           0        552        552

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,331
  CKD stage |          86           0         401
  CKD stage |           0           0          16
   Dialysis |          13           0          81
  Transplan |         107           0         302
  KRT uncle |          17           0          32
------------+------------------------------------
      Total |   237.76329   124.55364       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,163         558           0        558        558

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,331
  CKD stage |          99           0         401
  CKD stage |           0           0          16
   Dialysis |          29           0          81
  Transplan |          71           0         302
  KRT uncle |          10           0          32
------------+------------------------------------
      Total |   225.18169   118.65955       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,163         527           0        527        527

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,331
  CKD stage |         105           0         401
  CKD stage |           0           0          16
   Dialysis |          21           0          81
  Transplan |          87           0         302
  KRT uncle |          14           0          32
------------+------------------------------------
      Total |   252.90153   134.29404       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,163         585           0        585        585

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,331
  CKD stage |          69           0         401
  CKD stage |           5           0          16
   Dialysis |          12           0          81
  Transplan |          91           0         302
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |   227.95146   127.64404       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,163         514           0        514        514

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,331
  CKD stage |         101           0         401
  CKD stage |           5           0          16
   Dialysis |          22           0          81
  Transplan |          93           0         302
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   248.66112   130.78593       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,163         579           0        579        579

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,331
  CKD stage |         107           0         401
  CKD stage |           4           0          16
   Dialysis |          25           0          81
  Transplan |          72           0         302
  KRT uncle |          15           0          32
------------+------------------------------------
      Total |   202.75959   98.313712       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,163         502           0        502        502

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         405           0       1,331
  CKD stage |         117           0         401
  CKD stage |           4           0          16
   Dialysis |          27           0          81
  Transplan |          86           0         302
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   283.98474    154.5777       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,163         641           0        641        641

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,331
  CKD stage |         127           0         401
  CKD stage |           5           0          16
   Dialysis |          15           0          81
  Transplan |          64           0         302
  KRT uncle |          13           0          32
------------+------------------------------------
      Total |   222.18354   110.49577       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,163         531           0        531        531

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,331
  CKD stage |          86           0         401
  CKD stage |           5           0          16
   Dialysis |          17           0          81
  Transplan |          78           0         302
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   225.69441   122.89268       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,163         511           0        511        511

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,331
  CKD stage |         105           0         401
  CKD stage |           3           0          16
   Dialysis |          30           0          81
  Transplan |          74           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   248.77716   134.43819       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,163         566           0        566        566

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,331
  CKD stage |          60           0         401
  CKD stage |           4           0          16
   Dialysis |          15           0          81
  Transplan |          82           0         302
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   240.45585   143.12098       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,163         519           0        519        519

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,331
  CKD stage |         120           0         401
  CKD stage |           0           0          16
   Dialysis |          15           0          81
  Transplan |          68           0         302
  KRT uncle |           1           0          32
------------+------------------------------------
      Total |   216.30698   107.48546       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,163         503           0        503        503

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,331
  CKD stage |          83           0         401
  CKD stage |           5           0          16
   Dialysis |          23           0          81
  Transplan |          85           0         302
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   221.46186   118.06138       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,163         516           0        516        516

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,331
  CKD stage |         107           0         401
  CKD stage |           1           0          16
   Dialysis |          26           0          81
  Transplan |         101           0         302
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |   213.42996   98.870607       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,163         529           0        529        529

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,331
  CKD stage |         108           0         401
  CKD stage |           0           0          16
   Dialysis |          39           0          81
  Transplan |          75           0         302
  KRT uncle |          11           0          32
------------+------------------------------------
      Total |    235.7975   121.78327       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,163         564           0        564        564

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,331
  CKD stage |          97           0         401
  CKD stage |           5           0          16
   Dialysis |          18           0          81
  Transplan |          52           0         302
  KRT uncle |          14           0          32
------------+------------------------------------
      Total |   245.22561   141.41292       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,163         542           0        542        542

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,331
  CKD stage |          91           0         401
  CKD stage |           2           0          16
   Dialysis |          28           0          81
  Transplan |         111           0         302
  KRT uncle |           8           0          32
------------+------------------------------------
      Total |   235.38465   118.69337       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,163         568           0        568        568

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,331
  CKD stage |          77           0         401
  CKD stage |           6           0          16
   Dialysis |          33           0          81
  Transplan |          41           0         302
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   258.29265   160.88083       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,163         549           0        549        549

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,331
  CKD stage |         120           0         401
  CKD stage |           0           0          16
   Dialysis |          37           0          81
  Transplan |          63           0         302
  KRT uncle |          17           0          32
------------+------------------------------------
      Total |   256.05178   137.14749       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,163         600           0        600        600

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,331
  CKD stage |         133           0         401
  CKD stage |           3           0          16
   Dialysis |          25           0          81
  Transplan |          71           0         302
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   246.68192   124.73023       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,163         581           0        581        581

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,331
  CKD stage |         106           0         401
  CKD stage |          18           0          16
   Dialysis |          24           0          81
  Transplan |          76           0         302
  KRT uncle |          14           0          32
------------+------------------------------------
      Total |   228.41331   117.31082       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         558           0        558        558

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,331
  CKD stage |         102           0         401
  CKD stage |           4           0          16
   Dialysis |           9           0          81
  Transplan |          68           0         302
  KRT uncle |           8           0          32
------------+------------------------------------
      Total |   205.49422   105.07819       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         478           0        478        478

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,331
  CKD stage |         159           0         401
  CKD stage |           0           0          16
   Dialysis |          22           0          81
  Transplan |          70           0         302
  KRT uncle |          18           0          32
------------+------------------------------------
      Total |   232.94498   106.86893       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         582           0        582        582

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,331
  CKD stage |         134           0         401
  CKD stage |           4           0          16
   Dialysis |          22           0          81
  Transplan |          48           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   211.46417   105.19124       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         499           0        499        499

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,331
  CKD stage |          88           0         401
  CKD stage |           5           0          16
   Dialysis |           6           0          81
  Transplan |         121           0         302
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   268.02173   144.84768       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,163         608           0        608        608

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,331
  CKD stage |         117           0         401
  CKD stage |           4           0          16
   Dialysis |           1           0          81
  Transplan |         106           0         302
  KRT uncle |          17           0          32
------------+------------------------------------
      Total |   233.72076   111.81751       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,163         565           0        565        565

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         416           0       1,331
  CKD stage |          77           0         401
  CKD stage |           0           0          16
   Dialysis |          30           0          81
  Transplan |          77           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   282.13454   169.89406       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,163         600           0        600        600

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,331
  CKD stage |          75           0         401
  CKD stage |           6           0          16
   Dialysis |          36           0          81
  Transplan |          67           0         302
  KRT uncle |          18           0          32
------------+------------------------------------
      Total |   241.52057   140.15804       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,163         554           0        554        554

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,331
  CKD stage |         113           0         401
  CKD stage |           1           0          16
   Dialysis |          23           0          81
  Transplan |          74           0         302
  KRT uncle |          10           0          32
------------+------------------------------------
      Total |    216.2871   106.72905       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,163         520           0        520        520

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,331
  CKD stage |         119           0         401
  CKD stage |           4           0          16
   Dialysis |          12           0          81
  Transplan |          52           0         302
  KRT uncle |           8           0          32
------------+------------------------------------
      Total |   242.82987   133.11005       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,163         541           0        541        541

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,331
  CKD stage |         120           0         401
  CKD stage |           3           0          16
   Dialysis |          28           0          81
  Transplan |          93           0         302
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |   216.11743   98.349789       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,163         545           0        545        545

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,331
  CKD stage |         106           0         401
  CKD stage |           3           0          16
   Dialysis |          32           0          81
  Transplan |         117           0         302
  KRT uncle |           8           0          32
------------+------------------------------------
      Total |   270.54323   138.70216       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,163         645           0        645        645

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,331
  CKD stage |         135           0         401
  CKD stage |           3           0          16
   Dialysis |           2           0          81
  Transplan |          50           0         302
  KRT uncle |          14           0          32
------------+------------------------------------
      Total |   218.76375   111.23684       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         507           0        507        507

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,331
  CKD stage |         129           0         401
  CKD stage |          11           0          16
   Dialysis |          47           0          81
  Transplan |          80           0         302
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   229.01896   107.32746       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         586           0        586        586

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,331
  CKD stage |         126           0         401
  CKD stage |           3           0          16
   Dialysis |          24           0          81
  Transplan |          89           0         302
  KRT uncle |          20           0          32
------------+------------------------------------
      Total |   216.06889   97.487215       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         553           0        553        553

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,331
  CKD stage |          82           0         401
  CKD stage |           0           0          16
   Dialysis |           7           0          81
  Transplan |          93           0         302
  KRT uncle |          14           0          32
------------+------------------------------------
      Total |   241.56681   133.34057       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         542           0        542        542

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,331
  CKD stage |         119           0         401
  CKD stage |           0           0          16
   Dialysis |          20           0          81
  Transplan |         103           0         302
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   248.35969   121.82688       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,163         592           0        592        592

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         403           0       1,331
  CKD stage |         100           0         401
  CKD stage |           1           0          16
   Dialysis |          20           0          81
  Transplan |          65           0         302
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |    276.4896   161.13262       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,163         598           0        598        598

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,331
  CKD stage |         138           0         401
  CKD stage |           2           0          16
   Dialysis |          39           0          81
  Transplan |          87           0         302
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   234.34582   107.55429       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,163         588           0        588        588

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,331
  CKD stage |          88           0         401
  CKD stage |           4           0          16
   Dialysis |          11           0          81
  Transplan |          97           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   256.74757   142.04594       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,163         568           0        568        568

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,331
  CKD stage |         147           0         401
  CKD stage |           0           0          16
   Dialysis |          18           0          81
  Transplan |          96           0         302
  KRT uncle |          18           0          32
------------+------------------------------------
      Total |   265.58345   127.72643       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,163         643           0        643        643

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,331
  CKD stage |          92           0         401
  CKD stage |           2           0          16
   Dialysis |          21           0          81
  Transplan |          78           0         302
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   254.06889   142.56214       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,163         566           0        566        566

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         404           0       1,331
  CKD stage |         111           0         401
  CKD stage |           1           0          16
   Dialysis |          23           0          81
  Transplan |          67           0         302
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   279.50624   158.91585       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,163         613           0        613        613

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,331
  CKD stage |          93           0         401
  CKD stage |           4           0          16
   Dialysis |          37           0          81
  Transplan |          67           0         302
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   231.17984   125.92472       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,163         538           0        538        538

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,331
  CKD stage |          79           0         401
  CKD stage |           4           0          16
   Dialysis |          24           0          81
  Transplan |          97           0         302
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   216.21313   112.33111       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,163         510           0        510        510

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         391           0       1,331
  CKD stage |         128           0         401
  CKD stage |           7           0          16
   Dialysis |          23           0          81
  Transplan |          72           0         302
  KRT uncle |          10           0          32
------------+------------------------------------
      Total |   275.44521    148.3178       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,163         631           0        631        631

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,331
  CKD stage |         125           0         401
  CKD stage |           1           0          16
   Dialysis |          45           0          81
  Transplan |          78           0         302
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |    255.5104   130.27008       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,163         611           0        611        611

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,331
  CKD stage |          74           0         401
  CKD stage |           7           0          16
   Dialysis |          34           0          81
  Transplan |          78           0         302
  KRT uncle |          15           0          32
------------+------------------------------------
      Total |   221.22191   121.71754       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         525           0        525        525

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,331
  CKD stage |         108           0         401
  CKD stage |           0           0          16
   Dialysis |          17           0          81
  Transplan |         102           0         302
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   258.93158   134.61082       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,163         594           0        594        594

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,331
  CKD stage |          99           0         401
  CKD stage |           7           0          16
   Dialysis |          30           0          81
  Transplan |          51           0         302
  KRT uncle |          10           0          32
------------+------------------------------------
      Total |   239.70828   135.76194       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,163         543           0        543        543

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,331
  CKD stage |         118           0         401
  CKD stage |          11           0          16
   Dialysis |          16           0          81
  Transplan |          62           0         302
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |   270.10171   151.07113       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,163         604           0        604        604

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,331
  CKD stage |         102           0         401
  CKD stage |          10           0          16
   Dialysis |          16           0          81
  Transplan |          77           0         302
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   228.52057   119.80781       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,163         530           0        530        530

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,331
  CKD stage |         122           0         401
  CKD stage |           5           0          16
   Dialysis |          31           0          81
  Transplan |          74           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   231.67453   115.32274       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,163         553           0        553        553

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         408           0       1,331
  CKD stage |          93           0         401
  CKD stage |          16           0          16
   Dialysis |          26           0          81
  Transplan |          61           0         302
  KRT uncle |          11           0          32
------------+------------------------------------
      Total |   278.07536   165.14279       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,163         615           0        615        615

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         261           0       1,331
  CKD stage |          88           0         401
  CKD stage |           7           0          16
   Dialysis |          14           0          81
  Transplan |          82           0         302
  KRT uncle |          13           0          32
------------+------------------------------------
      Total |   189.13777   92.378137       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,163         465           0        465        465

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,331
  CKD stage |         114           0         401
  CKD stage |           2           0          16
   Dialysis |          15           0          81
  Transplan |          84           0         302
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |      248.27    129.3182       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,163         569           0        569        569

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,331
  CKD stage |          77           0         401
  CKD stage |           5           0          16
   Dialysis |          33           0          81
  Transplan |          78           0         302
  KRT uncle |          15           0          32
------------+------------------------------------
      Total |   235.87887   132.27444       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         548           0        548        548

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,331
  CKD stage |          89           0         401
  CKD stage |           0           0          16
   Dialysis |          27           0          81
  Transplan |          94           0         302
  KRT uncle |          15           0          32
------------+------------------------------------
      Total |   252.99815   137.57321       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         586           0        586        586

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,331
  CKD stage |          82           0         401
  CKD stage |           7           0          16
   Dialysis |          44           0          81
  Transplan |          85           0         302
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   225.78456   119.86923       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         545           0        545        545

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,331
  CKD stage |          92           0         401
  CKD stage |           0           0          16
   Dialysis |          35           0          81
  Transplan |          60           0         302
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |    233.6343   130.43074       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         532           0        532        532

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,331
  CKD stage |         109           0         401
  CKD stage |           0           0          16
   Dialysis |          18           0          81
  Transplan |          51           0         302
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   237.30975   131.92772       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,163         524           0        524        524

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,331
  CKD stage |         121           0         401
  CKD stage |           4           0          16
   Dialysis |          13           0          81
  Transplan |         104           0         302
  KRT uncle |          16           0          32
------------+------------------------------------
      Total |   261.07767   131.01524       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,163         621           0        621        621

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,331
  CKD stage |          88           0         401
  CKD stage |          10           0          16
   Dialysis |          30           0          81
  Transplan |          70           0         302
  KRT uncle |          16           0          32
------------+------------------------------------
      Total |   212.12668   112.01574       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,163         514           0        514        514

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,331
  CKD stage |          90           0         401
  CKD stage |           2           0          16
   Dialysis |          34           0          81
  Transplan |          84           0         302
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |   201.51687   99.127316       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,163         498           0        498        498

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,331
  CKD stage |          98           0         401
  CKD stage |           5           0          16
   Dialysis |          26           0          81
  Transplan |          62           0         302
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |   237.72862   131.86917       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,163         536           0        536        536

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,331
  CKD stage |         130           0         401
  CKD stage |           3           0          16
   Dialysis |          37           0          81
  Transplan |          52           0         302
  KRT uncle |          14           0          32
------------+------------------------------------
      Total |   240.96394   125.73184       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,163         574           0        574        574

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,331
  CKD stage |         102           0         401
  CKD stage |           7           0          16
   Dialysis |           9           0          81
  Transplan |          85           0         302
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   258.30421   141.47814       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,163         577           0        577        577

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         412           0       1,331
  CKD stage |         111           0         401
  CKD stage |           0           0          16
   Dialysis |          22           0          81
  Transplan |          49           0         302
  KRT uncle |           1           0          32
------------+------------------------------------
      Total |   281.78225   166.43602       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,163         595           0        595        595

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,331
  CKD stage |          89           0         401
  CKD stage |           5           0          16
   Dialysis |          27           0          81
  Transplan |         102           0         302
  KRT uncle |           8           0          32
------------+------------------------------------
      Total |   242.35691   127.25497       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,163         573           0        573        573

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,331
  CKD stage |         122           0         401
  CKD stage |           1           0          16
   Dialysis |          19           0          81
  Transplan |          71           0         302
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |   251.75774   132.86275       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,163         572           0        572        572

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,331
  CKD stage |          78           0         401
  CKD stage |           4           0          16
   Dialysis |           3           0          81
  Transplan |          68           0         302
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   200.79057   110.22233       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,163         446           0        446        446

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,331
  CKD stage |          95           0         401
  CKD stage |          -1           0          16
   Dialysis |          20           0          81
  Transplan |          76           0         302
  KRT uncle |          10           0          32
------------+------------------------------------
      Total |    229.7166   123.00481       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         526           0        526        526

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,331
  CKD stage |          85           0         401
  CKD stage |           0           0          16
   Dialysis |          12           0          81
  Transplan |          93           0         302
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   236.65372   128.21914       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,163         533           0        533        533

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,331
  CKD stage |          90           0         401
  CKD stage |           7           0          16
   Dialysis |          23           0          81
  Transplan |          89           0         302
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   258.96394   143.97763       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,163         583           0        583        583

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         409           0       1,331
  CKD stage |         102           0         401
  CKD stage |          13           0          16
   Dialysis |          10           0          81
  Transplan |          68           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   280.55247     163.763       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,163         602           0        602        602

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,331
  CKD stage |          83           0         401
  CKD stage |           4           0          16
   Dialysis |          24           0          81
  Transplan |          62           0         302
  KRT uncle |          12           0          32
------------+------------------------------------
      Total |   233.75312   133.87296       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,163         524           0        524        524

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,331
  CKD stage |         104           0         401
  CKD stage |           7           0          16
   Dialysis |          13           0          81
  Transplan |          77           0         302
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |   220.77208   113.40064       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,163         514           0        514        514

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,331
  CKD stage |          87           0         401
  CKD stage |           1           0          16
   Dialysis |          14           0          81
  Transplan |          44           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   205.56264     117.092       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,163         443           0        443        443

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         394           0       1,331
  CKD stage |          78           0         401
  CKD stage |           2           0          16
   Dialysis |          26           0          81
  Transplan |          68           0         302
  KRT uncle |          17           0          32
------------+------------------------------------
      Total |   267.64216   160.33411       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,163         585           0        585        585

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         396           0       1,331
  CKD stage |          96           0         401
  CKD stage |           3           0          16
   Dialysis |          20           0          81
  Transplan |          88           0         302
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |    274.5779   154.65955       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,163         606           0        606        606

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,331
  CKD stage |         118           0         401
  CKD stage |           5           0          16
   Dialysis |          12           0          81
  Transplan |          74           0         302
  KRT uncle |           1           0          32
------------+------------------------------------
      Total |   217.31392   107.29835       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         510           0        510        510

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,331
  CKD stage |         123           0         401
  CKD stage |           4           0          16
   Dialysis |          21           0          81
  Transplan |         122           0         302
  KRT uncle |          -1           0          32
------------+------------------------------------
      Total |   246.77994   114.29257       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         604           0        604        604

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,331
  CKD stage |          88           0         401
  CKD stage |           1           0          16
   Dialysis |          20           0          81
  Transplan |          86           0         302
  KRT uncle |          10           0          32
------------+------------------------------------
      Total |   261.21267   147.38283       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         582           0        582        582

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,331
  CKD stage |          81           0         401
  CKD stage |           2           0          16
   Dialysis |          32           0          81
  Transplan |          74           0         302
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   253.65511   146.54318       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,163         560           0        560        560

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,331
  CKD stage |         136           0         401
  CKD stage |           0           0          16
   Dialysis |          16           0          81
  Transplan |          87           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   255.79288   127.22394       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,163         593           0        593        593

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,331
  CKD stage |         103           0         401
  CKD stage |           4           0          16
   Dialysis |          16           0          81
  Transplan |          60           0         302
  KRT uncle |          16           0          32
------------+------------------------------------
      Total |   203.71244   104.74244       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,163         484           0        484        484

. 
. 
. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(84 real changes made)

. replace ethnicity=2 if ethnicity==3
(76 real changes made)

. replace ethnicity=3 if ethnicity==4
(83 real changes made)

. replace ethnicity=4 if ethnicity==6
(84 real changes made)

. replace ethnicity=6 if ethnicity==.
(557 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,921 missing values generated)

. replace region = 2 if region_string=="East"
(203 real changes made)

. replace region = 3 if region_string=="London"
(404 real changes made)

. replace region = 4 if region_string=="North East"
(227 real changes made)

. replace region = 5 if region_string=="North West"
(205 real changes made)

. replace region = 6 if region_string=="South East"
(215 real changes made)

. replace region = 7 if region_string=="South West"
(218 real changes made)

. replace region = 8 if region_string=="West Midlands"
(211 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(238 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,163 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(862 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,301 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. *Age bands for standardisation
. egen agecat = cut(age), at(0,18,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,
> 200)

. drop if agecat==0
(0 observations deleted)

. 
. *Age-standardisation weights (European Standard Population 2013)
. gen weight = .
(2,163 missing values generated)

. replace weight = 0.027261 if agecat==18
(49 real changes made)

. replace weight = 0.074349 if agecat==20
(167 real changes made)

. replace weight = 0.074349 if agecat==25
(202 real changes made)

. replace weight = 0.080545 if agecat==30
(163 real changes made)

. replace weight = 0.086741 if agecat==35
(158 real changes made)

. replace weight = 0.086741 if agecat==40
(164 real changes made)

. replace weight = 0.086741 if agecat==45
(183 real changes made)

. replace weight = 0.086741 if agecat==50
(188 real changes made)

. replace weight = 0.080545 if agecat==55
(181 real changes made)

. replace weight = 0.074349 if agecat==60
(165 real changes made)

. replace weight = 0.068154 if agecat==65
(145 real changes made)

. replace weight = 0.061958 if agecat==70
(148 real changes made)

. replace weight = 0.049566 if agecat==75
(102 real changes made)

. replace weight = 0.030979 if agecat==80
(83 real changes made)

. replace weight = 0.018587 if agecat==85
(40 real changes made)

. replace weight = 0.012392 if agecat==90
(25 real changes made)

. 
. 
. *Age standardised counts for each non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. replace `aggregate' = `aggregate' * weight
  3. }
variable hospital_days was byte now float
(197 real changes made)
variable critical_care_days was byte now float
(182 real changes made)
variable emergency_days was byte now float
(217 real changes made)
variable op_appts was byte now float
(204 real changes made)
variable neph_appts was byte now float
(185 real changes made)
variable tx_appts was byte now float
(195 real changes made)
variable gp_interactions was byte now float
(177 real changes made)

. 
. * Create variable for age-standardised total # of each aggregated outcome
. * `var'_`aggregate' = age-standardised total # of each aggregated outcome ove
> rall stratified by ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = age-standardised total # of each aggregated outcome
>  in each CKD group stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. egen overall_std_`aggregate' = total(`aggregate')
  3. bysort ckd_group: egen std_`aggregate' = total(`aggregate')
  4. foreach var of varlist ethnicity imd region urban {
  5. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  6. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  7. }
  8. }

. 
. foreach binary of varlist fistula_formation pd_insertion blood_pressure album
> inuria creatinine {
  2. gen esp_`binary' = `binary' * weight
  3. egen overall_std_`binary' = total(esp_`binary')
  4. bysort ckd_group: egen std_`binary' = total(esp_`binary')
  5. foreach var of varlist ethnicity imd region urban {
  6. bysort `var': egen `var'_`binary' = total(esp_`binary')
  7. bysort `var' ckd_group: egen `var'_`binary'_ckd = total(esp_`binary')
  8. }
  9. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2017_ckd_complete.dta not found)
file ./output/2017_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,661
        from master                       499  (_merge==1)
        from using                      2,162  (_merge==2)

    matched                                 1  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(499 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,331
  CKD stage |           0           0         401
  CKD stage |           0           0          16
   Dialysis |           0           0          81
  Transplan |           0           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |           0           0       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,163           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,331
  CKD stage |           0           0         401
  CKD stage |           0           0          16
   Dialysis |           0           0          81
  Transplan |           0           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |           0           0       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,163           0           0          0          0

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,331
  CKD stage |           0           0         401
  CKD stage |           0           0          16
   Dialysis |           0           0          81
  Transplan |           0           0         302
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |           0           0       2,163

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,163           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2017_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd_complete.log
  log type:  text
 closed on:  21 Nov 2023, 18:28:36
-------------------------------------------------------------------------------
