-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_nockd_complete.log
  log type:  text
 opened on:  24 Apr 2024, 15:46:49

. clear

. 
. *Merge `dataset'_nockd with `dataset'_nockd_complete
. capture noisily import delimited ./output/`dataset'_nockd.csv, clear
(17 vars, 10,901 obs)

. tempfile `dataset'_nockd

. save ``dataset'_nockd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_nockd_complete.csv,
>  clear
(87 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_nockd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        58,705
        from master                    48,902  (_merge==1)
        from using                      9,803  (_merge==2)

    matched                             1,098  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(58,705 observations deleted)

. drop _merge

. tempfile `dataset'_nockd_complete

. save ``dataset'_nockd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_nockd.csv, clear
> tempfile 2017_nockd
> save ./output/2017_nockd, replace
> capture noisily import delimited ./output/input_2017_nockd_complete.csv, clea
> r
> merge 1:1 patient_id using ./output/2017_nockd
> keep if _merge==3
> drop _merge
> tempfile 2017_nockd_complete
> save ./output/2017_nockd_complete, replace
> */
. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(549 missing values generated)

. replace sex = 0 if male == "Female"
(549 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(487 real changes made, 487 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(487 missing values generated)

. gen min_creatinine_outcome=.
(1,098 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(302 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(309 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(302 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(309 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(397 real changes made)

. gen max_creatinine_outcome=.
(1,098 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(302 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(309 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(611 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(701 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(487 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(611 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(302 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(487 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 611 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2
(178 real changes made)

. replace ckd_progression = 2 if egfr_end==3
(3 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(487 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 611 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        611       55.65       55.65
          . |        487       44.35      100.00
------------+-----------------------------------
      Total |      1,098      100.00

. *NB - might need to change "" to . with dummy data
. replace modality_outcome = "Unchanged" if modality_outcome_date==""
type mismatch
r(109);

end of do-file
r(109);

end of do-file

r(109);


