-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 opened on:  30 Nov 2022, 21:54:18

. clear

. 
. import delimited ./output/input_2017.csv, delimiter(comma) varnames(1) case(p
> reserve) 
(14 vars, 10,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(2,056 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(400 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(778 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |        661        9.77        9.77
           East Midlands |        682       10.08       19.85
                  London |      1,362       20.13       39.98
              North East |        656        9.70       49.67
              North West |        699       10.33       60.01
              South East |        671        9.92       69.92
              South West |        636        9.40       79.32
           West Midlands |        696       10.29       89.61
Yorkshire and The Humber |        703       10.39      100.00
-------------------------+-----------------------------------
                   Total |      6,766      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        381        5.63        5.63
          1 |      1,283       18.96       24.59
          2 |      1,275       18.84       43.44
          3 |      1,282       18.95       62.39
          4 |      1,250       18.47       80.86
          5 |      1,295       19.14      100.00
------------+-----------------------------------
      Total |      6,766      100.00

. drop if imd==0
(381 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(2,772 real changes made, 2,772 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(2,772 missing values generated)

. gen min_baseline_creatinine=.
(6,385 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(1,830 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(1,783 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(1,830 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(1,783 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(2,268 real changes made)

. gen max_baseline_creatinine=.
(6,385 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(1,830 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(1,783 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(3,613 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(4,117 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(2,772 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(3,613 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(1,830 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = 0

. replace ckd = 1 if baseline_egfr <60
(1,009 real changes made)

. *replace ckd = 1 if albuminuria >3
. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. replace ckd = 1 if `krt'==1
  3. drop `krt'
  4. }
(272 real changes made)
(245 real changes made)
(230 real changes made)
(226 real changes made)
(217 real changes made)
(215 real changes made)

. drop if ckd==0
(3,971 observations deleted)

. drop ckd

. 
. export delimited using "./output/2017_ckd.csv", replace
(note: file ./output/2017_ckd.csv not found)
file ./output/2017_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 closed on:  30 Nov 2022, 21:54:25
-------------------------------------------------------------------------------
