-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 opened on:   7 Jun 2024, 10:20:52

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve)
(18 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,651 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,978 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,697 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,440       10.22       10.22
           East Midlands |      3,387       10.06       20.27
                  London |      6,736       20.00       40.28
              North East |      3,398       10.09       50.37
              North West |      3,416       10.14       60.51
              South East |      3,273        9.72       70.23
              South West |      3,323        9.87       80.10
           West Midlands |      3,257        9.67       89.77
Yorkshire and The Humber |      3,444       10.23      100.00
-------------------------+-----------------------------------
                   Total |     33,674      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,658        4.92        4.92
          1 |      6,313       18.75       23.67
          2 |      6,308       18.73       42.40
          3 |      6,470       19.21       61.62
          4 |      6,511       19.34       80.95
          5 |      6,414       19.05      100.00
------------+-----------------------------------
      Total |     33,674      100.00

. drop if imd==0
(1,658 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * Code sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. save ./output/input_`dataset', replace
(note: file ./output/input_2017.dta not found)
file ./output/input_2017.dta saved

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,925 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(805 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(771 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,098 real changes made, 14,098 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,098 missing values generated)

. gen min_baseline_creatinine=.
(32,016 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,104 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,814 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,104 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,814 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,328 real changes made)

. gen max_baseline_creatinine=.
(32,016 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,104 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,814 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,918 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,688 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,098 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,918 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,104 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,723 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,016
25%            0              0       Sum of Wgt.      32,016

50%            0                      Mean           12.44518
                        Largest       Std. Dev.       13.0006
75%     24.92498       44.05759
90%     29.20168       44.16964       Variance       169.0156
95%     31.46682        45.5535       Skewness       .2254479
99%     35.46292       45.89649       Kurtosis       1.311767

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,664        5.77        5.77
         <= |      1,603        5.56       11.33
          = |     20,773       72.02       83.34
          > |      1,570        5.44       88.79
         >= |      1,546        5.36       94.15
          ~ |      1,688        5.85      100.00
------------+-----------------------------------
      Total |     28,844      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,667       55.18       55.18
   Albuminuria |     14,349       44.82      100.00
---------------+-----------------------------------
         Total |     32,016      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,944       46.68       46.68
          1 |     17,072       53.32      100.00
------------+-----------------------------------
      Total |     32,016      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14098 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17918 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,098 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,443       95.09       95.09
          1 |      1,573        4.91      100.00
------------+-----------------------------------
      Total |     32,016      100.00
(1,573 real changes made)
(714 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,392       94.93       94.93
          1 |      1,624        5.07      100.00
------------+-----------------------------------
      Total |     32,016      100.00
(1,558 real changes made)
(733 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,411       94.99       94.99
          1 |      1,605        5.01      100.00
------------+-----------------------------------
      Total |     32,016      100.00
(1,450 real changes made)
(686 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,439       95.07       95.07
          1 |      1,577        4.93      100.00
------------+-----------------------------------
      Total |     32,016      100.00
(1,348 real changes made)
(659 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,401       94.96       94.96
          1 |      1,615        5.04      100.00
------------+-----------------------------------
      Total |     32,016      100.00
(1,312 real changes made)
(627 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,401       94.96       94.96
          1 |      1,615        5.04      100.00
------------+-----------------------------------
      Total |     32,016      100.00
(1,242 real changes made)
(555 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,701      4,634 |    10,335 
 eGFR >=60 |     5,269      4,377 |     9,646 
  eGFR <60 |     1,990      1,562 |     3,552 
       KRT |     4,707      3,776 |     8,483 
-----------+----------------------+----------
     Total |    17,667     14,349 |    32,016 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,970       34.26       34.26
          1 |     21,046       65.74      100.00
------------+-----------------------------------
      Total |     32,016      100.00

. drop if ckd==0
(10,970 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,634 |     4,634 
 eGFR >=60 |         0      4,377 |     4,377 
  eGFR <60 |     1,990      1,562 |     3,552 
       KRT |     4,707      3,776 |     8,483 
-----------+----------------------+----------
     Total |     6,697     14,349 |    21,046 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2017_ckd.csv not found)
file ./output/2017_ckd.csv saved

. 
. *Create dataset of non-CKD
. merge 1:1 patient_id using ./output/input_`dataset'
(label sexLab already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,970
        from master                         0  (_merge==1)
        from using                     10,970  (_merge==2)

    matched                            21,046  (_merge==3)
    -----------------------------------------

. keep if _merge==2
(21,046 observations deleted)

. drop _merge

. 
. export delimited using "./output/`dataset'_nockd.csv", replace
(note: file ./output/2017_nockd.csv not found)
file ./output/2017_nockd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2017_ckd.log
  log type:  text
 closed on:   7 Jun 2024, 10:20:55
-------------------------------------------------------------------------------
