-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_complete.log
  log type:  text
 opened on:   9 Feb 2023, 15:15:43

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 21,089 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,881
        from master                    47,896  (_merge==1)
        from using                     18,985  (_merge==2)

    matched                             2,104  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,881 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save 2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        171        8.13        8.13
Kidney transplant |        179        8.51       16.63
 Modality unclear |         43        2.04       18.68
          Pre KRT |      1,711       81.32      100.00
------------------+-----------------------------------
            Total |      2,104      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(879 missing values generated)

. drop baseline_egfr

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1225 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(171 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(179 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(43 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |        636       30.23       30.23
  CKD stage 3 |        353       16.78       47.01
CKD stage 4/5 |         15        0.71       47.72
     Dialysis |        171        8.13       55.85
   Transplant |        179        8.51       64.35
  KRT unclear |         43        2.04       66.40
            . |        707       33.60      100.00
--------------+-----------------------------------
        Total |      2,104      100.00

. drop if ckd_group==.
(707 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0        636 |       636 
  CKD stage 3 |         0          0          0        353 |       353 
CKD stage 4/5 |         0          0          0         15 |        15 
     Dialysis |       171          0          0          0 |       171 
   Transplant |         0        179          0          0 |       179 
  KRT unclear |         0          0         43          0 |        43 
--------------+--------------------------------------------+----------
        Total |       171        179         43      1,004 |     1,397 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |        71         33         22          5 |       636 
  CKD stage 3 |        42         12         11          6 |       353 
CKD stage 4/5 |         1          2          1          0 |        15 
     Dialysis |        10         14          5          1 |       171 
   Transplant |        14          7          9          1 |       179 
  KRT unclear |         4          5          1          0 |        43 
--------------+--------------------------------------------+----------
        Total |       142         73         49         13 |     1,397 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |       505 |       636 
  CKD stage 3 |       282 |       353 
CKD stage 4/5 |        11 |        15 
     Dialysis |       141 |       171 
   Transplant |       148 |       179 
  KRT unclear |        33 |        43 
--------------+-----------+----------
        Total |     1,120 |     1,397 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(757 missing values generated)

. replace sex = 0 if male == "Female"
(757 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(629 real changes made, 629 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(629 missing values generated)

. gen min_creatinine_outcome=.
(1,397 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(406 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(362 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(406 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(362 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(490 real changes made)

. gen max_creatinine_outcome=.
(1,397 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(406 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(362 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(768 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(907 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(629 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(768 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(406 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(629 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 768 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(82 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(3 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(9 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(73 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(49 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(13 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(142 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,042       74.59       74.59
               CKD 3 |         68        4.87       79.46
     CKD 4/5 pre-KRT |         10        0.72       80.17
            Dialysis |         73        5.23       85.40
   Kidney transplant |         49        3.51       88.90
KRT unclear modality |         13        0.93       89.84
            Deceased |        142       10.16      100.00
---------------------+-----------------------------------
               Total |      1,397      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         162           0         636
  CKD stage |          96           0         353
  CKD stage |           0           0          15
   Dialysis |          51           0         171
  Transplan |          65           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   112.95061    48.83285       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      1,397         386           0        386        386

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         127           0         636
  CKD stage |         123           0         353
  CKD stage |           0           0          15
   Dialysis |          38           0         171
  Transplan |          38           0         179
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   98.849678   41.995023       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      1,397         340           0        340        340

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         636
  CKD stage |          88           0         353
  CKD stage |           0           0          15
   Dialysis |          61           0         171
  Transplan |          26           0         179
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   111.73944   59.070469       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      1,397         360           0        360        360

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         183           0         636
  CKD stage |          82           0         353
  CKD stage |           2           0          15
   Dialysis |          63           0         171
  Transplan |          42           0         179
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   117.73228   61.726299       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      1,397         391           0        391        391

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         171           0         636
  CKD stage |         110           0         353
  CKD stage |           0           0          15
   Dialysis |          21           0         171
  Transplan |          30           0         179
  KRT uncle |          30           0          43
------------+------------------------------------
      Total |   112.98282   61.679674       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      1,397         362           0        362        362

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         173           0         636
  CKD stage |         103           0         353
  CKD stage |          -1           0          15
   Dialysis |          48           0         171
  Transplan |          30           0         179
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   115.01861   59.039843       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      1,397         370           0        370        370

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         187           0         636
  CKD stage |          96           0         353
  CKD stage |           0           0          15
   Dialysis |          27           0         171
  Transplan |          63           0         179
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   121.26127   64.444661       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      1,397         389           0        389        389

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         146           0         636
  CKD stage |         140           0         353
  CKD stage |           0           0          15
   Dialysis |          45           0         171
  Transplan |          46           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   113.55404   47.813729       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      1,397         387           0        387        387

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         185           0         636
  CKD stage |          68           0         353
  CKD stage |           8           0          15
   Dialysis |          20           0         171
  Transplan |          50           0         179
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   110.53114   70.051383       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      1,397         337           0        337        337

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         193           0         636
  CKD stage |          82           0         353
  CKD stage |           9           0          15
   Dialysis |          39           0         171
  Transplan |          37           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   118.56621   70.495245       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      1,397         372           0        372        372

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         160           0         636
  CKD stage |         123           0         353
  CKD stage |           0           0          15
   Dialysis |          44           0         171
  Transplan |          52           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   116.34001    50.32137       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      1,397         391           0        391        391

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         186           0         636
  CKD stage |          90           0         353
  CKD stage |          13           0          15
   Dialysis |          27           0         171
  Transplan |          30           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   115.01646   69.145079       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      1,397         356           0        356        356

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         165           0         636
  CKD stage |          77           0         353
  CKD stage |           7           0          15
   Dialysis |          40           0         171
  Transplan |          72           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |    109.0179   53.594657       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      1,397         369           0        369        369

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         636
  CKD stage |         117           0         353
  CKD stage |           4           0          15
   Dialysis |          64           0         171
  Transplan |          33           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   120.22047   55.854858       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,397         398           0        398        398

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         216           0         636
  CKD stage |          93           0         353
  CKD stage |           7           0          15
   Dialysis |          57           0         171
  Transplan |          25           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   132.18397   80.229192       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,397         401           0        401        401

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         226           0         636
  CKD stage |          80           0         353
  CKD stage |           9           0          15
   Dialysis |          58           0         171
  Transplan |          47           0         179
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |    136.6607   83.056024       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,397         431           0        431        431

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         146           0         636
  CKD stage |         100           0         353
  CKD stage |           9           0          15
   Dialysis |          50           0         171
  Transplan |          62           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   106.20544   41.896927       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,397         377           0        377        377

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         184           0         636
  CKD stage |          86           0         353
  CKD stage |          11           0          15
   Dialysis |          37           0         171
  Transplan |          53           0         179
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   117.46027   63.449465       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,397         388           0        388        388

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         182           0         636
  CKD stage |          66           0         353
  CKD stage |           3           0          15
   Dialysis |          24           0         171
  Transplan |          56           0         179
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   109.95705   67.589946       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         340           0        340        340

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         636
  CKD stage |          99           0         353
  CKD stage |           3           0          15
   Dialysis |          50           0         171
  Transplan |          24           0         179
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   104.63064   52.060656       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         339           0        339        339

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         135           0         636
  CKD stage |         105           0         353
  CKD stage |           2           0          15
   Dialysis |          22           0         171
  Transplan |          46           0         179
  KRT uncle |          22           0          43
------------+------------------------------------
      Total |   97.277738   44.347968       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         332           0        332        332

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         164           0         636
  CKD stage |          96           0         353
  CKD stage |           1           0          15
   Dialysis |          29           0         171
  Transplan |          64           0         179
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   111.02004   53.680202       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         365           0        365        365

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         183           0         636
  CKD stage |          57           0         353
  CKD stage |           5           0          15
   Dialysis |          42           0         171
  Transplan |          33           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   107.38511   69.977538       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,397         328           0        328        328

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         132           0         636
  CKD stage |         110           0         353
  CKD stage |           5           0          15
   Dialysis |          39           0         171
  Transplan |          47           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   99.047244   40.661374       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,397         343           0        343        343

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         153           0         636
  CKD stage |          98           0         353
  CKD stage |           4           0          15
   Dialysis |          33           0         171
  Transplan |          32           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   102.72369   52.905653       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      1,397         324           0        324        324

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         133           0         636
  CKD stage |          85           0         353
  CKD stage |           4           0          15
   Dialysis |          52           0         171
  Transplan |          37           0         179
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   93.792412   40.022127       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,397         331           0        331        331

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         180           0         636
  CKD stage |          82           0         353
  CKD stage |           1           0          15
   Dialysis |          29           0         171
  Transplan |          40           0         179
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   111.93772   65.127358       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,397         351           0        351        351

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         158           0         636
  CKD stage |          65           0         353
  CKD stage |           6           0          15
   Dialysis |          83           0         171
  Transplan |          46           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   104.84324   50.612825       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,397         370           0        370        370

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         143           0         636
  CKD stage |          69           0         353
  CKD stage |           6           0          15
   Dialysis |          55           0         171
  Transplan |          45           0         179
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   95.315676   45.394954       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,397         325           0        325        325

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         636
  CKD stage |          92           0         353
  CKD stage |           3           0          15
   Dialysis |          38           0         171
  Transplan |          68           0         179
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   107.18468   47.160325       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,397         369           0        369        369

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         176           0         636
  CKD stage |          85           0         353
  CKD stage |          14           0          15
   Dialysis |          30           0         171
  Transplan |          38           0         179
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   110.57266   63.278401       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         352           0        352        352

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         134           0         636
  CKD stage |         107           0         353
  CKD stage |           7           0          15
   Dialysis |          48           0         171
  Transplan |          75           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   104.06442   35.346263       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         386           0        386        386

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         155           0         636
  CKD stage |         104           0         353
  CKD stage |          13           0          15
   Dialysis |          28           0         171
  Transplan |          30           0         179
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   104.74803   54.051878       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         346           0        346        346

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         181           0         636
  CKD stage |          79           0         353
  CKD stage |           2           0          15
   Dialysis |          51           0         171
  Transplan |          32           0         179
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   113.06729   64.528573       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         356           0        356        356

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         148           0         636
  CKD stage |          97           0         353
  CKD stage |           0           0          15
   Dialysis |          44           0         171
  Transplan |          40           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   102.86185   47.111481       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,397         344           0        344        344

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         161           0         636
  CKD stage |          96           0         353
  CKD stage |           0           0          15
   Dialysis |          42           0         171
  Transplan |          64           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   111.20401   50.088509       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,397         373           0        373        373

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         181           0         636
  CKD stage |          87           0         353
  CKD stage |           4           0          15
   Dialysis |          47           0         171
  Transplan |          56           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   117.60344   60.611877       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      1,397         383           0        383        383

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         161           0         636
  CKD stage |         106           0         353
  CKD stage |           2           0          15
   Dialysis |          53           0         171
  Transplan |          56           0         179
  KRT uncle |          24           0          43
------------+------------------------------------
      Total |   114.50465   47.893052       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      1,397         402           0        402        402

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         157           0         636
  CKD stage |         123           0         353
  CKD stage |           3           0          15
   Dialysis |          36           0         171
  Transplan |          55           0         179
  KRT uncle |          21           0          43
------------+------------------------------------
      Total |   114.68862   49.525539       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      1,397         395           0        395        395

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         182           0         636
  CKD stage |         104           0         353
  CKD stage |           2           0          15
   Dialysis |          45           0         171
  Transplan |          69           0         179
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   123.72298   58.031027       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      1,397         409           0        409        409

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         155           0         636
  CKD stage |          76           0         353
  CKD stage |           2           0          15
   Dialysis |          22           0         171
  Transplan |          53           0         179
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   99.828919   53.503033       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      1,397         326           0        326        326

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         157           0         636
  CKD stage |          98           0         353
  CKD stage |           1           0          15
   Dialysis |          31           0         171
  Transplan |          34           0         179
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   104.58554   54.583727       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      1,397         327           0        327        327

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         186           0         636
  CKD stage |         137           0         353
  CKD stage |           5           0          15
   Dialysis |          35           0         171
  Transplan |          63           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   131.95276   61.194292       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      1,397         434           0        434        434

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         178           0         636
  CKD stage |         100           0         353
  CKD stage |           6           0          15
   Dialysis |          38           0         171
  Transplan |          40           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   116.26915   61.791606       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      1,397         366           0        366        366

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         636
  CKD stage |         101           0         353
  CKD stage |           1           0          15
   Dialysis |          69           0         171
  Transplan |          38           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   109.04939   47.460854       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      1,397         366           0        366        366

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         181           0         636
  CKD stage |          63           0         353
  CKD stage |           4           0          15
   Dialysis |          39           0         171
  Transplan |          38           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |    108.2534   67.642719       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         333           0        333        333

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         147           0         636
  CKD stage |          75           0         353
  CKD stage |           5           0          15
   Dialysis |          22           0         171
  Transplan |          42           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   94.372226   51.427965       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,397         303           0        303        303

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         158           0         636
  CKD stage |         102           0         353
  CKD stage |           1           0          15
   Dialysis |          46           0         171
  Transplan |          62           0         179
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   111.44452   48.251245       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      1,397         374           0        374        374

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         157           0         636
  CKD stage |         103           0         353
  CKD stage |           0           0          15
   Dialysis |          47           0         171
  Transplan |          61           0         179
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   111.25626   47.690819       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      1,397         374           0        374        374

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         130           0         636
  CKD stage |         122           0         353
  CKD stage |           0           0          15
   Dialysis |          53           0         171
  Transplan |          26           0         179
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   100.23049   42.961532       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,397         344           0        344        344

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         155           0         636
  CKD stage |          85           0         353
  CKD stage |          16           0          15
   Dialysis |          43           0         171
  Transplan |          37           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   102.34288   51.924391       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,397         340           0        340        340

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         194           0         636
  CKD stage |          98           0         353
  CKD stage |           5           0          15
   Dialysis |          73           0         171
  Transplan |          40           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   127.65999   64.275818       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,397         425           0        425        425

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         161           0         636
  CKD stage |         102           0         353
  CKD stage |           3           0          15
   Dialysis |          57           0         171
  Transplan |          31           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   110.42162   52.575261       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,397         366           0        366        366

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         169           0         636
  CKD stage |          98           0         353
  CKD stage |           0           0          15
   Dialysis |          27           0         171
  Transplan |          43           0         179
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   111.07087   58.577625       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,397         355           0        355        355

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         177           0         636
  CKD stage |          88           0         353
  CKD stage |           2           0          15
   Dialysis |          27           0         171
  Transplan |          53           0         179
  KRT uncle |          25           0          43
------------+------------------------------------
      Total |   113.70437   61.336073       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         372           0        372        372

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         166           0         636
  CKD stage |          67           0         353
  CKD stage |           5           0          15
   Dialysis |          50           0         171
  Transplan |          32           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   103.02362   59.224841       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         328           0        328        328

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         191           0         636
  CKD stage |          93           0         353
  CKD stage |           0           0          15
   Dialysis |          50           0         171
  Transplan |          56           0         179
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   124.24266   63.845482       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         406           0        406        406

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         182           0         636
  CKD stage |          64           0         353
  CKD stage |           3           0          15
   Dialysis |          47           0         171
  Transplan |          49           0         179
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   111.70866   65.036283       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         365           0        365        365

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         106           0         636
  CKD stage |          91           0         353
  CKD stage |           1           0          15
   Dialysis |          55           0         171
  Transplan |          37           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   82.828203   29.898141       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,397         293           0        293        293

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         137           0         636
  CKD stage |          95           0         353
  CKD stage |           2           0          15
   Dialysis |          74           0         171
  Transplan |          44           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   101.55476   37.924362       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,397         367           0        367        367

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         139           0         636
  CKD stage |          72           0         353
  CKD stage |           0           0          15
   Dialysis |          38           0         171
  Transplan |          50           0         179
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   92.871152   44.533066       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      1,397         310           0        310        310

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         203           0         636
  CKD stage |         101           0         353
  CKD stage |           3           0          15
   Dialysis |          27           0         171
  Transplan |          55           0         179
  KRT uncle |          28           0          43
------------+------------------------------------
      Total |    129.1854   71.793993       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      1,397         417           0        417        417

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         183           0         636
  CKD stage |         110           0         353
  CKD stage |           1           0          15
   Dialysis |          50           0         171
  Transplan |          43           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   123.05655   60.905527       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      1,397         397           0        397        397

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         167           0         636
  CKD stage |          82           0         353
  CKD stage |           5           0          15
   Dialysis |          57           0         171
  Transplan |          26           0         179
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   107.29563   58.065303       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      1,397         343           0        343        343

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         636
  CKD stage |          94           0         353
  CKD stage |           0           0          15
   Dialysis |          57           0         171
  Transplan |          33           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   105.52971   49.387016       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      1,397         353           0        353        353

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         197           0         636
  CKD stage |         110           0         353
  CKD stage |          -1           0          15
   Dialysis |          50           0         171
  Transplan |          47           0         179
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   129.89048   66.700246       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      1,397         412           0        412        412

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         174           0         636
  CKD stage |          93           0         353
  CKD stage |           3           0          15
   Dialysis |          32           0         171
  Transplan |          55           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   113.80387   59.443095       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      1,397         360           0        360        360

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         166           0         636
  CKD stage |          85           0         353
  CKD stage |          13           0          15
   Dialysis |          56           0         171
  Transplan |          61           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   112.23121   51.417502       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      1,397         393           0        393        393

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         124           0         636
  CKD stage |         115           0         353
  CKD stage |          -1           0          15
   Dialysis |          81           0         171
  Transplan |          71           0         179
  KRT uncle |           2           0          43
------------+------------------------------------
      Total |   104.57409   29.255195       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      1,397         392           0        392        392

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         210           0         636
  CKD stage |          75           0         353
  CKD stage |           4           0          15
   Dialysis |          34           0         171
  Transplan |          63           0         179
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   127.04868   77.543826       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         393           0        393        393

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         141           0         636
  CKD stage |          88           0         353
  CKD stage |           3           0          15
   Dialysis |          52           0         171
  Transplan |          27           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   96.592699   45.899473       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,397         321           0        321        321

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         163           0         636
  CKD stage |          94           0         353
  CKD stage |           8           0          15
   Dialysis |          34           0         171
  Transplan |          26           0         179
  KRT uncle |           1           0          43
------------+------------------------------------
      Total |   105.56979   58.436754       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      1,397         326           0        326        326

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         143           0         636
  CKD stage |          80           0         353
  CKD stage |           9           0          15
   Dialysis |          45           0         171
  Transplan |          47           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   97.313529   44.660248       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      1,397         336           0        336        336

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         171           0         636
  CKD stage |         108           0         353
  CKD stage |           3           0          15
   Dialysis |          55           0         171
  Transplan |          25           0         179
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |   115.10737   58.845823       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,397         362           0        362        362

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         179           0         636
  CKD stage |          96           0         353
  CKD stage |           2           0          15
   Dialysis |          61           0         171
  Transplan |          43           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   118.87044   58.999973       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,397         385           0        385        385

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         176           0         636
  CKD stage |          92           0         353
  CKD stage |           0           0          15
   Dialysis |          53           0         171
  Transplan |          68           0         179
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   119.09664   54.811019       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,397         406           0        406        406

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         179           0         636
  CKD stage |         109           0         353
  CKD stage |           9           0          15
   Dialysis |          50           0         171
  Transplan |          22           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   118.53185   62.593906       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,397         384           0        384        384

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         173           0         636
  CKD stage |          62           0         353
  CKD stage |           0           0          15
   Dialysis |          42           0         171
  Transplan |          69           0         179
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   108.83966   59.877538       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,397         360           0        360        360

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         144           0         636
  CKD stage |          78           0         353
  CKD stage |           5           0          15
   Dialysis |          51           0         171
  Transplan |          47           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   98.047244   44.434144       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         340           0        340        340

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         162           0         636
  CKD stage |         142           0         353
  CKD stage |           1           0          15
   Dialysis |          38           0         171
  Transplan |          48           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   120.75376   54.209725       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         401           0        401        401

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         159           0         636
  CKD stage |          82           0         353
  CKD stage |           4           0          15
   Dialysis |          42           0         171
  Transplan |          60           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   106.07087   51.351868       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         350           0        350        350

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         227           0         636
  CKD stage |          93           0         353
  CKD stage |           7           0          15
   Dialysis |          21           0         171
  Transplan |          45           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   135.34789    87.43739       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,397         396           0        396        396

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         185           0         636
  CKD stage |         109           0         353
  CKD stage |           6           0          15
   Dialysis |          48           0         171
  Transplan |          50           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |    124.2355   61.277374       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,397         402           0        402        402

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         184           0         636
  CKD stage |         107           0         353
  CKD stage |           4           0          15
   Dialysis |          35           0         171
  Transplan |          13           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |    117.1675    68.97605       1,397

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,397         355           0        355        355

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(54 real changes made)

. replace ethnicity=2 if ethnicity==3
(60 real changes made)

. replace ethnicity=3 if ethnicity==4
(51 real changes made)

. replace ethnicity=4 if ethnicity==6
(54 real changes made)

. replace ethnicity=6 if ethnicity==.
(355 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,249 missing values generated)

. replace region = 2 if region_string=="East"
(138 real changes made)

. replace region = 3 if region_string=="London"
(272 real changes made)

. replace region = 4 if region_string=="North East"
(120 real changes made)

. replace region = 5 if region_string=="North West"
(142 real changes made)

. replace region = 6 if region_string=="South East"
(157 real changes made)

. replace region = 7 if region_string=="South West"
(139 real changes made)

. replace region = 8 if region_string=="West Midlands"
(141 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(140 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(1,397 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(542 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(855 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2018_ckd_complete.dta not found)
file ./output/2018_ckd_complete.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_complete.log
  log type:  text
 closed on:   9 Feb 2023, 15:15:51
-------------------------------------------------------------------------------
