-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd.log
  log type:  text
 opened on:  31 Jan 2023, 11:45:20

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,624 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(2,004 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,669 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,413       10.13       10.13
           East Midlands |      3,453       10.25       20.37
                  London |      6,651       19.73       40.11
              North East |      3,402       10.09       50.20
              North West |      3,368        9.99       60.19
              South East |      3,349        9.94       70.13
              South West |      3,402       10.09       80.22
           West Midlands |      3,347        9.93       90.16
Yorkshire and The Humber |      3,318        9.84      100.00
-------------------------+-----------------------------------
                   Total |     33,703      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,734        5.14        5.14
          1 |      6,331       18.78       23.93
          2 |      6,433       19.09       43.02
          3 |      6,360       18.87       61.89
          4 |      6,395       18.97       80.86
          5 |      6,450       19.14      100.00
------------+-----------------------------------
      Total |     33,703      100.00

. drop if imd==0
(1,734 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,967 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(782 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(777 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,980 real changes made, 13,980 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,980 missing values generated)

. gen min_baseline_creatinine=.
(31,969 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,205 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,784 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,205 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,784 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,469 real changes made)

. gen max_baseline_creatinine=.
(31,969 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,205 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,784 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,989 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,500 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,980 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,989 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,205 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,722 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,969
25%            0              0       Sum of Wgt.      31,969

50%            0                      Mean           12.47052
                        Largest       Std. Dev.      12.96845
75%     24.93649       42.29859
90%      29.1797       42.40285       Variance       168.1808
95%     31.35162       42.53271       Skewness       .2139797
99%     35.13568       43.65651       Kurtosis       1.299608

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,530        5.33        5.33
         <= |      1,601        5.58       10.90
          = |     20,729       72.19       83.09
          > |      1,661        5.78       88.88
         >= |      1,623        5.65       94.53
          ~ |      1,571        5.47      100.00
------------+-----------------------------------
      Total |     28,715      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,561       54.93       54.93
          1 |     14,408       45.07      100.00
------------+-----------------------------------
      Total |     31,969      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,839       46.42       46.42
          1 |     17,130       53.58      100.00
------------+-----------------------------------
      Total |     31,969      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,366       94.99       94.99
          1 |      1,603        5.01      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(747 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,347       94.93       94.93
          1 |      1,622        5.07      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(741 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,367       94.99       94.99
          1 |      1,602        5.01      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(672 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,405       95.11       95.11
          1 |      1,564        4.89      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(629 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,357       94.96       94.96
          1 |      1,612        5.04      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(600 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,351       94.94       94.94
          1 |      1,618        5.06      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(570 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,880       34.03       34.03
          1 |     21,089       65.97      100.00
------------+-----------------------------------
      Total |     31,969      100.00

. drop if ckd==0
(10,880 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2018_ckd.csv not found)
file ./output/2018_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd.log
  log type:  text
 closed on:  31 Jan 2023, 11:45:22
-------------------------------------------------------------------------------
