-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_complete.log
  log type:  text
 opened on:  20 Sep 2023, 14:21:59

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(8 vars, 21,015 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(236 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,917
        from master                    47,951  (_merge==1)
        from using                     18,966  (_merge==2)

    matched                             2,049  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,917 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        184        8.98        8.98
Kidney transplant |        204        9.96       18.94
 Modality unclear |         38        1.85       20.79
          Pre KRT |      1,623       79.21      100.00
------------------+-----------------------------------
            Total |      2,049      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(808 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1241 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,241       60.57       60.57
          . |        808       39.43      100.00
------------+-----------------------------------
      Total |      2,049      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(184 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(26 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(147 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(277 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(7 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(38 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(6 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       121         63 |       184 
Kidney transplant |       204          0 |       204 
 Modality unclear |        38          0 |        38 
          Pre KRT |     1,623          0 |     1,623 
------------------+----------------------+----------
            Total |     1,986         63 |     2,049 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       169         15 |       184 
Kidney transplant |       183         21 |       204 
 Modality unclear |        32          6 |        38 
          Pre KRT |     1,395        228 |     1,623 
------------------+----------------------+----------
            Total |     1,779        270 |     2,049 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       184          0 |       184 
Kidney transplant |       204          0 |       204 
 Modality unclear |         6         32 |        38 
          Pre KRT |     1,623          0 |     1,623 
------------------+----------------------+----------
            Total |     2,017         32 |     2,049 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,716        270 |     1,986 
         1 |        63          0 |        63 
-----------+----------------------+----------
     Total |     1,779        270 |     2,049 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(808 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1241 changes made)

. replace ckd_group = 4 if dialysis==1
(63 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(270 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(32 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(627 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,275       62.23       62.23
         CKD stage 3 |        394       19.23       81.45
       CKD stage 4/5 |         15        0.73       82.19
            Dialysis |         63        3.07       85.26
          Transplant |        270       13.18       98.44
KRT unclear modality |         32        1.56      100.00
---------------------+-----------------------------------
               Total |      2,049      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        75        144          0      1,056 |     1,275 
         CKD stage 3 |        29         39          0        326 |       394 
       CKD stage 4/5 |         2          0          0         13 |        15 
            Dialysis |        63          0          0          0 |        63 
          Transplant |        15         21          6        228 |       270 
KRT unclear modality |         0          0         32          0 |        32 
---------------------+--------------------------------------------+----------
               Total |       184        204         38      1,623 |     2,049 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       125         79         54         11 |     1,275 
         CKD stage 3 |        51         17         26          5 |       394 
       CKD stage 4/5 |         5          1          0          0 |        15 
            Dialysis |         7          3          0          1 |        63 
          Transplant |        30          9         11          3 |       270 
KRT unclear modality |         3          0          1          0 |        32 
---------------------+--------------------------------------------+----------
               Total |       221        109         92         20 |     2,049 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,006 |     1,275 
         CKD stage 3 |       295 |       394 
       CKD stage 4/5 |         9 |        15 
            Dialysis |        52 |        63 
          Transplant |       217 |       270 
KRT unclear modality |        28 |        32 
---------------------+-----------+----------
               Total |     1,607 |     2,049 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,046 missing values generated)

. replace sex = 0 if male == "Female"
(1,046 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(857 real changes made, 857 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(857 missing values generated)

. gen min_creatinine_outcome=.
(2,049 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(599 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(593 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(599 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(593 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(754 real changes made)

. gen max_creatinine_outcome=.
(2,049 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(599 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(593 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,192 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,295 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(857 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,192 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(599 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(857 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1192 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(192 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(7 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(3 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(857 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1192 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,192       58.17       58.17
          . |        857       41.83      100.00
------------+-----------------------------------
      Total |      2,049      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(109 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(92 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(10 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(20 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(109 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(102 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(221 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,450       70.77       70.77
               CKD 3 |        149        7.27       78.04
     CKD 4/5 pre-KRT |          8        0.39       78.43
            Dialysis |        109        5.32       83.75
   Kidney transplant |        102        4.98       88.73
KRT unclear modality |         10        0.49       89.21
            Deceased |        221       10.79      100.00
---------------------+-----------------------------------
               Total |      2,049      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(808 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1241 changes made)

. replace access_egfr=0 if ckd_group==4
(63 real changes made)

. replace access_egfr=3 if access_egfr==.
(745 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,275
  CKD stage |          62           0         394
  CKD stage |           7           0          15
   Dialysis |          23           0          63
  Transplan |          77           0         270
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   232.01367   134.03851       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,049         512           0        512        512

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         257           0       1,275
  CKD stage |          54           0         394
  CKD stage |           1           0          15
   Dialysis |          12           0          63
  Transplan |          85           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   181.87994   97.677259       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,049         409           0        409        409

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,275
  CKD stage |         115           0         394
  CKD stage |           5           0          15
   Dialysis |           6           0          63
  Transplan |          73           0         270
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |   226.23768   112.44215       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,049         520           0        520        520

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         421           0       1,275
  CKD stage |          97           0         394
  CKD stage |           0           0          15
   Dialysis |          20           0          63
  Transplan |          42           0         270
  KRT uncle |           1           0          32
------------+------------------------------------
      Total |   286.78624    173.5264       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,049         581           0        581        581

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         267           0       1,275
  CKD stage |         108           0         394
  CKD stage |           7           0          15
   Dialysis |          10           0          63
  Transplan |          60           0         270
  KRT uncle |          25           0          32
------------+------------------------------------
      Total |   195.56467   94.069813       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,049         477           0        477        477

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,275
  CKD stage |         123           0         394
  CKD stage |           8           0          15
   Dialysis |          27           0          63
  Transplan |          79           0         270
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   250.35969   124.80646       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,049         590           0        590        590

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,275
  CKD stage |          98           0         394
  CKD stage |           2           0          15
   Dialysis |          11           0          63
  Transplan |          74           0         270
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |   225.02099   116.99482       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,049         504           0        504        504

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,275
  CKD stage |          79           0         394
  CKD stage |           9           0          15
   Dialysis |           8           0          63
  Transplan |          40           0         270
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |    206.2367   118.93516       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,049         436           0        436        436

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,275
  CKD stage |          83           0         394
  CKD stage |           2           0          15
   Dialysis |          19           0          63
  Transplan |          50           0         270
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   212.40654   118.58507       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,049         464           0        464        464

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,275
  CKD stage |          98           0         394
  CKD stage |           5           0          15
   Dialysis |          23           0          63
  Transplan |          58           0         270
  KRT uncle |          11           0          32
------------+------------------------------------
      Total |   243.32504   134.29506       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,049         542           0        542        542

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,275
  CKD stage |          74           0         394
  CKD stage |           0           0          15
   Dialysis |          17           0          63
  Transplan |          82           0         270
  KRT uncle |           8           0          32
------------+------------------------------------
      Total |    211.1142   112.44807       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,049         479           0        479        479

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,275
  CKD stage |         129           0         394
  CKD stage |           0           0          15
   Dialysis |          12           0          63
  Transplan |          58           0         270
  KRT uncle |          10           0          32
------------+------------------------------------
      Total |     208.449   98.422958       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,049         491           0        491        491

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         391           0       1,275
  CKD stage |         119           0         394
  CKD stage |           1           0          15
   Dialysis |          25           0          63
  Transplan |          80           0         270
  KRT uncle |          20           0          32
------------+------------------------------------
      Total |   277.81406   146.80808       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,049         636           0        636        636

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         276           0       1,275
  CKD stage |          93           0         394
  CKD stage |           4           0          15
   Dialysis |          32           0          63
  Transplan |          88           0         270
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |   202.29673   95.899936       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,049         497           0        497        497

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,275
  CKD stage |         107           0         394
  CKD stage |           7           0          15
   Dialysis |          17           0          63
  Transplan |          50           0         270
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |     253.694   142.06926       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,049         549           0        549        549

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,275
  CKD stage |          82           0         394
  CKD stage |           4           0          15
   Dialysis |          23           0          63
  Transplan |          93           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   223.52465   115.99138       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,049         515           0        515        515

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,275
  CKD stage |          97           0         394
  CKD stage |           6           0          15
   Dialysis |           9           0          63
  Transplan |          82           0         270
  KRT uncle |          15           0          32
------------+------------------------------------
      Total |   262.73548   143.94524       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,049         583           0        583        583

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,275
  CKD stage |          70           0         394
  CKD stage |           2           0          15
   Dialysis |          26           0          63
  Transplan |          91           0         270
  KRT uncle |          18           0          32
------------+------------------------------------
      Total |   221.31235   118.52708       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,049         520           0        520        520

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,275
  CKD stage |         148           0         394
  CKD stage |           5           0          15
   Dialysis |          21           0          63
  Transplan |          63           0         270
  KRT uncle |          13           0          32
------------+------------------------------------
      Total |   235.52269   110.50425       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,049         568           0        568        568

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,275
  CKD stage |          90           0         394
  CKD stage |           4           0          15
   Dialysis |           5           0          63
  Transplan |          75           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   231.47145   125.19151       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,049         502           0        502        502

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,275
  CKD stage |          72           0         394
  CKD stage |           4           0          15
   Dialysis |          23           0          63
  Transplan |          65           0         270
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   254.04978   150.62414       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,049         538           0        538        538

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,275
  CKD stage |         104           0         394
  CKD stage |           0           0          15
   Dialysis |           8           0          63
  Transplan |          50           0         270
  KRT uncle |          12           0          32
------------+------------------------------------
      Total |   242.32016   134.89669       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,049         520           0        520        520

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,275
  CKD stage |         101           0         394
  CKD stage |          16           0          15
   Dialysis |          16           0          63
  Transplan |          56           0         270
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   245.24549   135.92107       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,049         542           0        542        542

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,275
  CKD stage |          84           0         394
  CKD stage |           9           0          15
   Dialysis |          20           0          63
  Transplan |          68           0         270
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   239.92728   134.38094       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,049         530           0        530        530

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,275
  CKD stage |         140           0         394
  CKD stage |           3           0          15
   Dialysis |           4           0          63
  Transplan |          44           0         270
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   244.50805   127.20566       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,049         536           0        536        536

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,275
  CKD stage |         133           0         394
  CKD stage |           7           0          15
   Dialysis |          11           0          63
  Transplan |          72           0         270
  KRT uncle |          16           0          32
------------+------------------------------------
      Total |   260.95754   132.45776       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         601           0        601        601

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,275
  CKD stage |          94           0         394
  CKD stage |           6           0          15
   Dialysis |          16           0          63
  Transplan |          81           0         270
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   243.38702   130.29995       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         544           0        544        544

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,275
  CKD stage |         104           0         394
  CKD stage |           8           0          15
   Dialysis |          28           0          63
  Transplan |          51           0         270
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |   231.25573   124.55444       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         527           0        527        527

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,275
  CKD stage |          76           0         394
  CKD stage |           4           0          15
   Dialysis |          21           0          63
  Transplan |          46           0         270
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |    232.9795   138.07941       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         491           0        491        491

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,275
  CKD stage |         144           0         394
  CKD stage |           2           0          15
   Dialysis |          31           0          63
  Transplan |          66           0         270
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   261.45974   129.93345       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,049         609           0        609        609

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,275
  CKD stage |          53           0         394
  CKD stage |          12           0          15
   Dialysis |          24           0          63
  Transplan |          72           0         270
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |   201.09907   114.63191       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,049         460           0        460        460

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,275
  CKD stage |         100           0         394
  CKD stage |           2           0          15
   Dialysis |          11           0          63
  Transplan |          62           0         270
  KRT uncle |          16           0          32
------------+------------------------------------
      Total |   225.25622   119.30426       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,049         508           0        508        508

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,275
  CKD stage |         111           0         394
  CKD stage |           4           0          15
   Dialysis |          24           0          63
  Transplan |          83           0         270
  KRT uncle |          10           0          32
------------+------------------------------------
      Total |   250.99366      128.58       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,049         582           0        582        582

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,275
  CKD stage |          87           0         394
  CKD stage |           0           0          15
   Dialysis |           2           0          63
  Transplan |          82           0         270
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   226.20449    120.4252       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,049         497           0        497        497

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,275
  CKD stage |          61           0         394
  CKD stage |           4           0          15
   Dialysis |          12           0          63
  Transplan |          69           0         270
  KRT uncle |          15           0          32
------------+------------------------------------
      Total |   224.30942   131.05474       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,049         487           0        487        487

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,275
  CKD stage |         101           0         394
  CKD stage |           3           0          15
   Dialysis |          16           0          63
  Transplan |          73           0         270
  KRT uncle |          17           0          32
------------+------------------------------------
      Total |   265.65447   146.61409       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,049         589           0        589        589

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,275
  CKD stage |          96           0         394
  CKD stage |           3           0          15
   Dialysis |          20           0          63
  Transplan |          77           0         270
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |    234.6652   123.56942       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,049         531           0        531        531

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,275
  CKD stage |         121           0         394
  CKD stage |           8           0          15
   Dialysis |          15           0          63
  Transplan |          62           0         270
  KRT uncle |          11           0          32
------------+------------------------------------
      Total |   241.20595   124.13053       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         553           0        553        553

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,275
  CKD stage |          84           0         394
  CKD stage |           3           0          15
   Dialysis |          20           0          63
  Transplan |          91           0         270
  KRT uncle |          11           0          32
------------+------------------------------------
      Total |   223.71791   115.67519       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         522           0        522        522

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,275
  CKD stage |         111           0         394
  CKD stage |           7           0          15
   Dialysis |          13           0          63
  Transplan |          95           0         270
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   239.12884   117.22682       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         561           0        561        561

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,275
  CKD stage |          76           0         394
  CKD stage |           4           0          15
   Dialysis |          21           0          63
  Transplan |         121           0         270
  KRT uncle |          10           0          32
------------+------------------------------------
      Total |   234.24451   119.67629       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         558           0        558        558

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,275
  CKD stage |         109           0         394
  CKD stage |           6           0          15
   Dialysis |          17           0          63
  Transplan |          66           0         270
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   248.05905   132.54946       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,049         551           0        551        551

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,275
  CKD stage |         102           0         394
  CKD stage |           0           0          15
   Dialysis |          18           0          63
  Transplan |          48           0         270
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   210.78868   111.39374       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,049         471           0        471        471

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,275
  CKD stage |         100           0         394
  CKD stage |           7           0          15
   Dialysis |          19           0          63
  Transplan |          57           0         270
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |    247.0937   137.31413       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,049         540           0        540        540

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,275
  CKD stage |         100           0         394
  CKD stage |           0           0          15
   Dialysis |          14           0          63
  Transplan |          88           0         270
  KRT uncle |          17           0          32
------------+------------------------------------
      Total |   206.99658   97.954851       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,049         501           0        501        501

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,275
  CKD stage |         128           0         394
  CKD stage |           0           0          15
   Dialysis |          23           0          63
  Transplan |          47           0         270
  KRT uncle |           1           0          32
------------+------------------------------------
      Total |   207.62714   100.94322       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,049         482           0        482        482

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,275
  CKD stage |          99           0         394
  CKD stage |           0           0          15
   Dialysis |          10           0          63
  Transplan |          88           0         270
  KRT uncle |          18           0          32
------------+------------------------------------
      Total |   229.72035    116.0586       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,049         534           0        534        534

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,275
  CKD stage |         122           0         394
  CKD stage |           0           0          15
   Dialysis |          11           0          63
  Transplan |          80           0         270
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   223.58272   105.98123       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,049         522           0        522        522

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         261           0       1,275
  CKD stage |         108           0         394
  CKD stage |           0           0          15
   Dialysis |          25           0          63
  Transplan |          49           0         270
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   190.43241   93.310692       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,049         445           0        445        445

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,275
  CKD stage |         128           0         394
  CKD stage |           0           0          15
   Dialysis |          18           0          63
  Transplan |          64           0         270
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |   232.23963    114.4283       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,049         538           0        538        538

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,275
  CKD stage |         109           0         394
  CKD stage |           7           0          15
   Dialysis |          16           0          63
  Transplan |          51           0         270
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   219.95559   115.28896       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,049         496           0        496        496

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         413           0       1,275
  CKD stage |          90           0         394
  CKD stage |           0           0          15
   Dialysis |           8           0          63
  Transplan |          60           0         270
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   282.49634   168.46681       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,049         574           0        574        574

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,275
  CKD stage |         114           0         394
  CKD stage |           0           0          15
   Dialysis |          11           0          63
  Transplan |          61           0         270
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |    228.2367   117.61347       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         508           0        508        508

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,275
  CKD stage |          60           0         394
  CKD stage |           3           0          15
   Dialysis |          25           0          63
  Transplan |          74           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   230.53441   134.64167       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,049         497           0        497        497

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         265           0       1,275
  CKD stage |          94           0         394
  CKD stage |           3           0          15
   Dialysis |          12           0          63
  Transplan |          71           0         270
  KRT uncle |          13           0          32
------------+------------------------------------
      Total |    192.9224   94.093394       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,049         458           0        458        458

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,275
  CKD stage |         121           0         394
  CKD stage |           0           0          15
   Dialysis |           7           0          63
  Transplan |          41           0         270
  KRT uncle |          13           0          32
------------+------------------------------------
      Total |   241.89898   131.58913       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,049         524           0        524        524

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,275
  CKD stage |          75           0         394
  CKD stage |           0           0          15
   Dialysis |           4           0          63
  Transplan |          40           0         270
  KRT uncle |          12           0          32
------------+------------------------------------
      Total |   216.01318   128.00286       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,049         446           0        446        446

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         276           0       1,275
  CKD stage |          81           0         394
  CKD stage |           3           0          15
   Dialysis |          24           0          63
  Transplan |          52           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   194.92972   105.09218       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,049         436           0        436        436

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,275
  CKD stage |         119           0         394
  CKD stage |           3           0          15
   Dialysis |          17           0          63
  Transplan |          48           0         270
  KRT uncle |          15           0          32
------------+------------------------------------
      Total |   255.24256   139.43654       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,049         564           0        564        564

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,275
  CKD stage |          88           0         394
  CKD stage |           7           0          15
   Dialysis |          18           0          63
  Transplan |          57           0         270
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   227.92338    126.9533       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,049         498           0        498        498

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         399           0       1,275
  CKD stage |         107           0         394
  CKD stage |           6           0          15
   Dialysis |          10           0          63
  Transplan |          63           0         270
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |    277.5388   157.40332       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,049         587           0        587        587

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,275
  CKD stage |         107           0         394
  CKD stage |           2           0          15
   Dialysis |          18           0          63
  Transplan |          79           0         270
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |     220.143   108.19147       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         512           0        512        512

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,275
  CKD stage |          85           0         394
  CKD stage |           5           0          15
   Dialysis |          16           0          63
  Transplan |          80           0         270
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   234.05027   126.71439       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         521           0        521        521

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,275
  CKD stage |         103           0         394
  CKD stage |           2           0          15
   Dialysis |          17           0          63
  Transplan |          77           0         270
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   202.90093     97.0109       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         479           0        479        479

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,275
  CKD stage |          72           0         394
  CKD stage |           3           0          15
   Dialysis |           8           0          63
  Transplan |          64           0         270
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |   260.38799   156.69026       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         538           0        538        538

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,275
  CKD stage |         108           0         394
  CKD stage |           1           0          15
   Dialysis |           0           0          63
  Transplan |          44           0         270
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   223.28306   121.59821       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,049         474           0        474        474

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,275
  CKD stage |          86           0         394
  CKD stage |          16           0          15
   Dialysis |          17           0          63
  Transplan |          98           0         270
  KRT uncle |          12           0          32
------------+------------------------------------
      Total |   225.66569   114.60344       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,049         543           0        543        543

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,275
  CKD stage |          81           0         394
  CKD stage |           4           0          15
   Dialysis |          18           0          63
  Transplan |          77           0         270
  KRT uncle |          18           0          32
------------+------------------------------------
      Total |   209.52855   109.30165       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,049         492           0        492        492

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,275
  CKD stage |          95           0         394
  CKD stage |           7           0          15
   Dialysis |          12           0          63
  Transplan |          62           0         270
  KRT uncle |          15           0          32
------------+------------------------------------
      Total |   214.39043   112.56139       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,049         492           0        492        492

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,275
  CKD stage |         141           0         394
  CKD stage |           6           0          15
   Dialysis |          12           0          63
  Transplan |          65           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   260.72474   132.31907       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,049         585           0        585        585

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,275
  CKD stage |         113           0         394
  CKD stage |           4           0          15
   Dialysis |          20           0          63
  Transplan |          63           0         270
  KRT uncle |           7           0          32
------------+------------------------------------
      Total |   252.30649   134.92189       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,049         563           0        563        563

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,275
  CKD stage |         115           0         394
  CKD stage |           0           0          15
   Dialysis |          16           0          63
  Transplan |          88           0         270
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   247.71254   124.19902       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,049         567           0        567        567

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,275
  CKD stage |         124           0         394
  CKD stage |           2           0          15
   Dialysis |           7           0          63
  Transplan |          69           0         270
  KRT uncle |           1           0          32
------------+------------------------------------
      Total |   269.63836   144.02922       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,049         583           0        583        583

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,275
  CKD stage |          90           0         394
  CKD stage |           4           0          15
   Dialysis |          20           0          63
  Transplan |          69           0         270
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   261.66374   148.93201       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,049         562           0        562        562

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,275
  CKD stage |          89           0         394
  CKD stage |           0           0          15
   Dialysis |          20           0          63
  Transplan |          69           0         270
  KRT uncle |           4           0          32
------------+------------------------------------
      Total |   227.87164   123.14286       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,049         505           0        505        505

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,275
  CKD stage |         101           0         394
  CKD stage |           3           0          15
   Dialysis |          23           0          63
  Transplan |          59           0         270
  KRT uncle |          12           0          32
------------+------------------------------------
      Total |   252.74622   140.21634       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,049         559           0        559        559

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,275
  CKD stage |          89           0         394
  CKD stage |           5           0          15
   Dialysis |           7           0          63
  Transplan |          76           0         270
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   205.37628   104.92803       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         465           0        465        465

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,275
  CKD stage |         115           0         394
  CKD stage |           0           0          15
   Dialysis |          14           0          63
  Transplan |          34           0         270
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   212.54954   113.09105       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,049         467           0        467        467

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,275
  CKD stage |          85           0         394
  CKD stage |           0           0          15
   Dialysis |          15           0          63
  Transplan |          59           0         270
  KRT uncle |           1           0          32
------------+------------------------------------
      Total |   212.51684   115.97499       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,049         462           0        462        462

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,275
  CKD stage |          99           0         394
  CKD stage |           0           0          15
   Dialysis |          13           0          63
  Transplan |          69           0         270
  KRT uncle |           5           0          32
------------+------------------------------------
      Total |   247.01806    134.7996       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,049         537           0        537        537

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,275
  CKD stage |          89           0         394
  CKD stage |           2           0          15
   Dialysis |          19           0          63
  Transplan |          53           0         270
  KRT uncle |          17           0          32
------------+------------------------------------
      Total |   265.77452    156.4584       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,049         567           0        567        567

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,275
  CKD stage |          90           0         394
  CKD stage |           3           0          15
   Dialysis |          13           0          63
  Transplan |          49           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |   243.21816   140.83199       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,049         507           0        507        507

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,275
  CKD stage |         132           0         394
  CKD stage |           2           0          15
   Dialysis |           7           0          63
  Transplan |          82           0         270
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   249.88189   122.52383       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,049         568           0        568        568

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,275
  CKD stage |          64           0         394
  CKD stage |           0           0          15
   Dialysis |          16           0          63
  Transplan |          46           0         270
  KRT uncle |          14           0          32
------------+------------------------------------
      Total |   260.51342   164.01214       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,049         528           0        528        528

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,275
  CKD stage |         115           0         394
  CKD stage |           0           0          15
   Dialysis |          19           0          63
  Transplan |          33           0         270
  KRT uncle |           2           0          32
------------+------------------------------------
      Total |   200.68619   104.23517       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,049         448           0        448        448

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,275
  CKD stage |         136           0         394
  CKD stage |           5           0          15
   Dialysis |          21           0          63
  Transplan |          58           0         270
  KRT uncle |           6           0          32
------------+------------------------------------
      Total |   223.73548   107.09102       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         530           0        530        530

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,275
  CKD stage |          94           0         394
  CKD stage |           2           0          15
   Dialysis |          13           0          63
  Transplan |          97           0         270
  KRT uncle |           3           0          32
------------+------------------------------------
      Total |   242.26257   125.58246       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         548           0        548        548

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,275
  CKD stage |          71           0         394
  CKD stage |           6           0          15
   Dialysis |          14           0          63
  Transplan |          39           0         270
  KRT uncle |          16           0          32
------------+------------------------------------
      Total |   219.25964   131.26848       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         467           0        467        467

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,275
  CKD stage |         120           0         394
  CKD stage |           3           0          15
   Dialysis |           9           0          63
  Transplan |          88           0         270
  KRT uncle |          11           0          32
------------+------------------------------------
      Total |    284.6652   151.09566       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,049         632           0        632        632

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,275
  CKD stage |          88           0         394
  CKD stage |           3           0          15
   Dialysis |          12           0          63
  Transplan |          62           0         270
  KRT uncle |           9           0          32
------------+------------------------------------
      Total |    216.0327   116.63332       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,049         480           0        480        480

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,275
  CKD stage |         107           0         394
  CKD stage |           4           0          15
   Dialysis |          30           0          63
  Transplan |          56           0         270
  KRT uncle |           1           0          32
------------+------------------------------------
      Total |   250.44412   137.08227       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,049         554           0        554        554

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(83 real changes made)

. replace ethnicity=2 if ethnicity==3
(76 real changes made)

. replace ethnicity=3 if ethnicity==4
(68 real changes made)

. replace ethnicity=4 if ethnicity==6
(83 real changes made)

. replace ethnicity=6 if ethnicity==.
(517 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,846 missing values generated)

. replace region = 2 if region_string=="East"
(215 real changes made)

. replace region = 3 if region_string=="London"
(423 real changes made)

. replace region = 4 if region_string=="North East"
(182 real changes made)

. replace region = 5 if region_string=="North West"
(209 real changes made)

. replace region = 6 if region_string=="South East"
(206 real changes made)

. replace region = 7 if region_string=="South West"
(202 real changes made)

. replace region = 8 if region_string=="West Midlands"
(210 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(199 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,049 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(796 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,253 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2018_ckd_complete.dta not found)
file ./output/2018_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,547
        from master                       499  (_merge==1)
        from using                      2,048  (_merge==2)

    matched                                 1  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(499 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,275
  CKD stage |           0           0         394
  CKD stage |           0           0          15
   Dialysis |           0           0          63
  Transplan |           0           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |           0           0       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,049           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,275
  CKD stage |           0           0         394
  CKD stage |           0           0          15
   Dialysis |           0           0          63
  Transplan |           0           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |           0           0       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,049           0           0          0          0

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,275
  CKD stage |           0           0         394
  CKD stage |           0           0          15
   Dialysis |           0           0          63
  Transplan |           0           0         270
  KRT uncle |           0           0          32
------------+------------------------------------
      Total |           0           0       2,049

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,049           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2018_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_complete.log
  log type:  text
 closed on:  20 Sep 2023, 14:22:02
-------------------------------------------------------------------------------
