-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_complete.log
  log type:  text
 opened on:   9 Feb 2023, 22:10:08

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 21,089 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,881
        from master                    47,896  (_merge==1)
        from using                     18,985  (_merge==2)

    matched                             2,104  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,881 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save 2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        171        8.13        8.13
Kidney transplant |        179        8.51       16.63
 Modality unclear |         43        2.04       18.68
          Pre KRT |      1,711       81.32      100.00
------------------+-----------------------------------
            Total |      2,104      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(879 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1225 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(171 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(179 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(43 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(707 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,343       63.83       63.83
  CKD stage 3 |        353       16.78       80.61
CKD stage 4/5 |         15        0.71       81.32
     Dialysis |        171        8.13       89.45
   Transplant |        179        8.51       97.96
  KRT unclear |         43        2.04      100.00
--------------+-----------------------------------
        Total |      2,104      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,343 |     1,343 
  CKD stage 3 |         0          0          0        353 |       353 
CKD stage 4/5 |         0          0          0         15 |        15 
     Dialysis |       171          0          0          0 |       171 
   Transplant |         0        179          0          0 |       179 
  KRT unclear |         0          0         43          0 |        43 
--------------+--------------------------------------------+----------
        Total |       171        179         43      1,711 |     2,104 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       148         76         55         10 |     1,343 
  CKD stage 3 |        42         12         11          6 |       353 
CKD stage 4/5 |         1          2          1          0 |        15 
     Dialysis |        10         14          5          1 |       171 
   Transplant |        14          7          9          1 |       179 
  KRT unclear |         4          5          1          0 |        43 
--------------+--------------------------------------------+----------
        Total |       219        116         82         18 |     2,104 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |     1,054 |     1,343 
  CKD stage 3 |       282 |       353 
CKD stage 4/5 |        11 |        15 
     Dialysis |       141 |       171 
   Transplant |       148 |       179 
  KRT unclear |        33 |        43 
--------------+-----------+----------
        Total |     1,669 |     2,104 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,129 missing values generated)

. replace sex = 0 if male == "Female"
(1,129 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(935 real changes made, 935 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(935 missing values generated)

. gen min_creatinine_outcome=.
(2,104 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(607 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(562 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(607 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(562 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(746 real changes made)

. gen max_creatinine_outcome=.
(2,104 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(607 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(562 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,169 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,358 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(935 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,169 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(607 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(935 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1169 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(180 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(10 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(9 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(116 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(82 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(18 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(219 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,511       71.82       71.82
               CKD 3 |        142        6.75       78.56
     CKD 4/5 pre-KRT |         16        0.76       79.33
            Dialysis |        116        5.51       84.84
   Kidney transplant |         82        3.90       88.74
KRT unclear modality |         18        0.86       89.59
            Deceased |        219       10.41      100.00
---------------------+-----------------------------------
               Total |      2,104      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,343
  CKD stage |          96           0         353
  CKD stage |           0           0          15
   Dialysis |          51           0         171
  Transplan |          65           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   241.13641   128.34744       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,104         561           0        561        561

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,343
  CKD stage |         123           0         353
  CKD stage |           0           0          15
   Dialysis |          38           0         171
  Transplan |          38           0         179
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   221.92776   113.64551       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,104         518           0        518        518

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,343
  CKD stage |          88           0         353
  CKD stage |           0           0          15
   Dialysis |          61           0         171
  Transplan |          26           0         179
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   257.73527   148.85684       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,104         557           0        557        557

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,343
  CKD stage |          82           0         353
  CKD stage |           2           0          15
   Dialysis |          63           0         171
  Transplan |          42           0         179
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   246.89971   138.91747       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,104         559           0        559        559

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         400           0       1,343
  CKD stage |         110           0         353
  CKD stage |           0           0          15
   Dialysis |          21           0         171
  Transplan |          30           0         179
  KRT uncle |          30           0          43
------------+------------------------------------
      Total |   278.65067   163.26862       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,104         591           0        591        591

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,343
  CKD stage |         103           0         353
  CKD stage |          -1           0          15
   Dialysis |          48           0         171
  Transplan |          30           0         179
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   230.88641   125.52149       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,104         521           0        521        521

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,343
  CKD stage |          96           0         353
  CKD stage |           0           0          15
   Dialysis |          27           0         171
  Transplan |          63           0         179
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   244.84221   135.73908       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,104         548           0        548        548

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,343
  CKD stage |         140           0         353
  CKD stage |           0           0          15
   Dialysis |          45           0         171
  Transplan |          46           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   243.82034   122.37295       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,104         574           0        574        574

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,343
  CKD stage |          68           0         353
  CKD stage |           8           0          15
   Dialysis |          20           0         171
  Transplan |          50           0         179
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   256.19487    157.1053       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,104         526           0        526        526

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,343
  CKD stage |          82           0         353
  CKD stage |           9           0          15
   Dialysis |          39           0         171
  Transplan |          37           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |     268.048   160.08628       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,104         567           0        567        567

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,343
  CKD stage |         123           0         353
  CKD stage |           0           0          15
   Dialysis |          44           0         171
  Transplan |          52           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   263.77899   140.71563       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,104         599           0        599        599

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,343
  CKD stage |          90           0         353
  CKD stage |          13           0          15
   Dialysis |          27           0         171
  Transplan |          30           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   230.78517   133.25326       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,104         500           0        500        500

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,343
  CKD stage |          77           0         353
  CKD stage |           7           0          15
   Dialysis |          40           0         171
  Transplan |          72           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   207.61787   110.22598       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,104         494           0        494        494

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,343
  CKD stage |         117           0         353
  CKD stage |           4           0          15
   Dialysis |          64           0         171
  Transplan |          33           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   226.98289   115.51715       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,104         538           0        538        538

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         400           0       1,343
  CKD stage |          93           0         353
  CKD stage |           7           0          15
   Dialysis |          57           0         171
  Transplan |          25           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   277.79705    163.5226       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,104         585           0        585        585

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         448           0       1,343
  CKD stage |          80           0         353
  CKD stage |           9           0          15
   Dialysis |          58           0         171
  Transplan |          47           0         179
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   308.38546   185.91384       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,104         653           0        653        653

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,343
  CKD stage |         100           0         353
  CKD stage |           9           0          15
   Dialysis |          50           0         171
  Transplan |          62           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   247.87738   132.79235       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,104         578           0        578        578

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,343
  CKD stage |          86           0         353
  CKD stage |          11           0          15
   Dialysis |          37           0         171
  Transplan |          53           0         179
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   267.48099   155.51732       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,104         588           0        588        588

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,343
  CKD stage |          66           0         353
  CKD stage |           3           0          15
   Dialysis |          24           0         171
  Transplan |          56           0         179
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   250.97576   152.00952       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         523           0        523        523

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,343
  CKD stage |          99           0         353
  CKD stage |           3           0          15
   Dialysis |          50           0         171
  Transplan |          24           0         179
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   240.58365   135.09089       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         526           0        526        526

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,343
  CKD stage |         105           0         353
  CKD stage |           2           0          15
   Dialysis |          22           0         171
  Transplan |          46           0         179
  KRT uncle |          22           0          43
------------+------------------------------------
      Total |   212.72101   112.96386       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         493           0        493        493

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,343
  CKD stage |          96           0         353
  CKD stage |           1           0          15
   Dialysis |          29           0         171
  Transplan |          64           0         179
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   254.56939    142.6694       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         562           0        562        562

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,343
  CKD stage |          57           0         353
  CKD stage |           5           0          15
   Dialysis |          42           0         171
  Transplan |          33           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   248.32747   153.94996       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         509           0        509        509

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,343
  CKD stage |         110           0         353
  CKD stage |           5           0          15
   Dialysis |          39           0         171
  Transplan |          47           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   212.88783   108.74903       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,104         504           0        504        504

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,343
  CKD stage |          98           0         353
  CKD stage |           4           0          15
   Dialysis |          33           0         171
  Transplan |          32           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   240.89639   137.33745       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,104         514           0        514        514

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,343
  CKD stage |          85           0         353
  CKD stage |           4           0          15
   Dialysis |          52           0         171
  Transplan |          37           0         179
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   222.50095   122.44088       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,104         512           0        512        512

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,343
  CKD stage |          82           0         353
  CKD stage |           1           0          15
   Dialysis |          29           0         171
  Transplan |          40           0         179
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   265.02329    158.8615       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,104         555           0        555        555

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,343
  CKD stage |          65           0         353
  CKD stage |           6           0          15
   Dialysis |          83           0         171
  Transplan |          46           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   238.87738   134.85775       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,104         552           0        552        552

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,343
  CKD stage |          69           0         353
  CKD stage |           6           0          15
   Dialysis |          55           0         171
  Transplan |          45           0         179
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   236.44724   136.65555       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,104         521           0        521        521

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,343
  CKD stage |          92           0         353
  CKD stage |           3           0          15
   Dialysis |          38           0         171
  Transplan |          68           0         179
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |     237.173    128.3472       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,104         548           0        548        548

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,343
  CKD stage |          85           0         353
  CKD stage |          14           0          15
   Dialysis |          30           0         171
  Transplan |          38           0         179
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |    253.8365   149.98045       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         542           0        542        542

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,343
  CKD stage |         107           0         353
  CKD stage |           7           0          15
   Dialysis |          48           0         171
  Transplan |          75           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   230.93394   115.80346       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         569           0        569        569

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,343
  CKD stage |         104           0         353
  CKD stage |          13           0          15
   Dialysis |          28           0         171
  Transplan |          30           0         179
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   203.97576    108.8314       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         475           0        475        475

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,343
  CKD stage |          79           0         353
  CKD stage |           2           0          15
   Dialysis |          51           0         171
  Transplan |          32           0         179
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   255.89639   150.95901       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         544           0        544        544

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,343
  CKD stage |          97           0         353
  CKD stage |           0           0          15
   Dialysis |          44           0         171
  Transplan |          40           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   234.20152   128.63094       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         526           0        526        526

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,343
  CKD stage |          96           0         353
  CKD stage |           0           0          15
   Dialysis |          42           0         171
  Transplan |          64           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   235.17253   125.82768       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,104         541           0        541        541

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         399           0       1,343
  CKD stage |          87           0         353
  CKD stage |           4           0          15
   Dialysis |          47           0         171
  Transplan |          56           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   278.05751   161.34842       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,104         601           0        601        601

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,343
  CKD stage |         106           0         353
  CKD stage |           2           0          15
   Dialysis |          53           0         171
  Transplan |          56           0         179
  KRT uncle |          24           0          43
------------+------------------------------------
      Total |   236.08745   122.12888       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,104         568           0        568        568

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,343
  CKD stage |         123           0         353
  CKD stage |           3           0          15
   Dialysis |          36           0         171
  Transplan |          55           0         179
  KRT uncle |          21           0          43
------------+------------------------------------
      Total |   248.26996   129.67217       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,104         582           0        582        582

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,343
  CKD stage |         104           0         353
  CKD stage |           2           0          15
   Dialysis |          45           0         171
  Transplan |          69           0         179
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   242.88165   127.76712       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,104         565           0        565        565

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,343
  CKD stage |          76           0         353
  CKD stage |           2           0          15
   Dialysis |          22           0         171
  Transplan |          53           0         179
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   223.68869   128.79453       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,104         491           0        491        491

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,343
  CKD stage |          98           0         353
  CKD stage |           1           0          15
   Dialysis |          31           0         171
  Transplan |          34           0         179
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   247.30656   142.04396       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,104         523           0        523        523

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,343
  CKD stage |         137           0         353
  CKD stage |           5           0          15
   Dialysis |          35           0         171
  Transplan |          63           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   257.98812   132.21535       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,104         603           0        603        603

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,343
  CKD stage |         100           0         353
  CKD stage |           6           0          15
   Dialysis |          38           0         171
  Transplan |          40           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   238.50333   132.47009       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,104         525           0        525        525

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,343
  CKD stage |         101           0         353
  CKD stage |           1           0          15
   Dialysis |          69           0         171
  Transplan |          38           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |    276.7096   155.72674       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,104         605           0        605        605

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,343
  CKD stage |          63           0         353
  CKD stage |           4           0          15
   Dialysis |          39           0         171
  Transplan |          38           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   244.40209   148.62203       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         508           0        508        508

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,343
  CKD stage |          75           0         353
  CKD stage |           5           0          15
   Dialysis |          22           0         171
  Transplan |          42           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   247.37785   149.05301       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         515           0        515        515

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,343
  CKD stage |         102           0         353
  CKD stage |           1           0          15
   Dialysis |          46           0         171
  Transplan |          62           0         179
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   273.26093   152.26061       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,104         603           0        603        603

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,343
  CKD stage |         103           0         353
  CKD stage |           0           0          15
   Dialysis |          47           0         171
  Transplan |          61           0         179
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   230.67158   120.15403       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,104         537           0        537        537

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,343
  CKD stage |         122           0         353
  CKD stage |           0           0          15
   Dialysis |          53           0         171
  Transplan |          26           0         179
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   233.42728   122.06251       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,104         537           0        537        537

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,343
  CKD stage |          85           0         353
  CKD stage |          16           0          15
   Dialysis |          43           0         171
  Transplan |          37           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   239.40067   137.24578       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,104         527           0        527        527

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,343
  CKD stage |          98           0         353
  CKD stage |           5           0          15
   Dialysis |          73           0         171
  Transplan |          40           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |    253.9962   137.95657       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,104         588           0        588        588

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,343
  CKD stage |         102           0         353
  CKD stage |           3           0          15
   Dialysis |          57           0         171
  Transplan |          31           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |    239.1212   130.32999       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,104         541           0        541        541

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,343
  CKD stage |          98           0         353
  CKD stage |           0           0          15
   Dialysis |          27           0         171
  Transplan |          43           0         179
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   240.32557    135.3141       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,104         527           0        527        527

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,343
  CKD stage |          88           0         353
  CKD stage |           2           0          15
   Dialysis |          27           0         171
  Transplan |          53           0         179
  KRT uncle |          25           0          43
------------+------------------------------------
      Total |   228.16635   127.09096       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         518           0        518        518

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,343
  CKD stage |          67           0         353
  CKD stage |           5           0          15
   Dialysis |          50           0         171
  Transplan |          32           0         179
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   240.99572   143.95275       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         511           0        511        511

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,343
  CKD stage |          93           0         353
  CKD stage |           0           0          15
   Dialysis |          50           0         171
  Transplan |          56           0         179
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |    258.3788   143.81139       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         581           0        581        581

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         416           0       1,343
  CKD stage |          64           0         353
  CKD stage |           3           0          15
   Dialysis |          47           0         171
  Transplan |          49           0         179
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   284.69249   174.66242       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         599           0        599        599

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,343
  CKD stage |          91           0         353
  CKD stage |           1           0          15
   Dialysis |          55           0         171
  Transplan |          37           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   216.36122   116.39822       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         490           0        490        490

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,343
  CKD stage |          95           0         353
  CKD stage |           2           0          15
   Dialysis |          74           0         171
  Transplan |          44           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   237.93536   126.01482       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,104         562           0        562        562

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,343
  CKD stage |          72           0         353
  CKD stage |           0           0          15
   Dialysis |          38           0         171
  Transplan |          50           0         179
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   225.18203   129.17267       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,104         493           0        493        493

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,343
  CKD stage |         101           0         353
  CKD stage |           3           0          15
   Dialysis |          27           0         171
  Transplan |          55           0         179
  KRT uncle |          28           0          43
------------+------------------------------------
      Total |    260.5865   146.74278       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,104         584           0        584        584

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,343
  CKD stage |         110           0         353
  CKD stage |           1           0          15
   Dialysis |          50           0         171
  Transplan |          43           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   271.49905    151.0433       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,104         598           0        598        598

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,343
  CKD stage |          82           0         353
  CKD stage |           5           0          15
   Dialysis |          57           0         171
  Transplan |          26           0         179
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |    232.0404    132.4759       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,104         507           0        507        507

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,343
  CKD stage |          94           0         353
  CKD stage |           0           0          15
   Dialysis |          57           0         171
  Transplan |          33           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   244.37215   136.20029       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,104         545           0        545        545

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         383           0       1,343
  CKD stage |         110           0         353
  CKD stage |          -1           0          15
   Dialysis |          50           0         171
  Transplan |          47           0         179
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   271.16635   150.11711       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,104         598           0        598        598

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,343
  CKD stage |          93           0         353
  CKD stage |           3           0          15
   Dialysis |          32           0         171
  Transplan |          55           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   247.65019   139.85532       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,104         538           0        538        538

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,343
  CKD stage |          85           0         353
  CKD stage |          13           0          15
   Dialysis |          56           0         171
  Transplan |          61           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   220.93869   116.33033       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,104         535           0        535        535

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,343
  CKD stage |         115           0         353
  CKD stage |          -1           0          15
   Dialysis |          81           0         171
  Transplan |          71           0         179
  KRT uncle |           2           0          43
------------+------------------------------------
      Total |   215.14591   97.337338       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,104         555           0        555        555

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,343
  CKD stage |          75           0         353
  CKD stage |           4           0          15
   Dialysis |          34           0         171
  Transplan |          63           0         179
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   235.98764     134.859       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         520           0        520        520

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,343
  CKD stage |          88           0         353
  CKD stage |           3           0          15
   Dialysis |          52           0         171
  Transplan |          27           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   248.75095   143.57057       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         536           0        536        536

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,343
  CKD stage |          94           0         353
  CKD stage |           8           0          15
   Dialysis |          34           0         171
  Transplan |          26           0         179
  KRT uncle |           1           0          43
------------+------------------------------------
      Total |   229.55038    131.1596       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,104         490           0        490        490

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,343
  CKD stage |          80           0         353
  CKD stage |           9           0          15
   Dialysis |          45           0         171
  Transplan |          47           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   228.19914   127.94431       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,104         517           0        517        517

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,343
  CKD stage |         108           0         353
  CKD stage |           3           0          15
   Dialysis |          55           0         171
  Transplan |          25           0         179
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |   265.38023   150.20705       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,104         568           0        568        568

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         430           0       1,343
  CKD stage |          96           0         353
  CKD stage |           2           0          15
   Dialysis |          61           0         171
  Transplan |          43           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   299.29087   174.55343       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,104         636           0        636        636

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,343
  CKD stage |          92           0         353
  CKD stage |           0           0          15
   Dialysis |          53           0         171
  Transplan |          68           0         179
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |    251.8365   136.47374       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,104         584           0        584        584

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,343
  CKD stage |         109           0         353
  CKD stage |           9           0          15
   Dialysis |          50           0         171
  Transplan |          22           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   251.83127   140.46305       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,104         561           0        561        561

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,343
  CKD stage |          62           0         353
  CKD stage |           0           0          15
   Dialysis |          42           0         171
  Transplan |          69           0         179
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   242.74144   141.52742       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,104         536           0        536        536

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,343
  CKD stage |          78           0         353
  CKD stage |           5           0          15
   Dialysis |          51           0         171
  Transplan |          47           0         179
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   218.80941   120.41789       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         505           0        505        505

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,343
  CKD stage |         142           0         353
  CKD stage |           1           0          15
   Dialysis |          38           0         171
  Transplan |          48           0         179
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   239.93441   119.96002       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         566           0        566        566

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,343
  CKD stage |          82           0         353
  CKD stage |           4           0          15
   Dialysis |          42           0         171
  Transplan |          60           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   237.47529   132.98103       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         528           0        528        528

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         421           0       1,343
  CKD stage |          93           0         353
  CKD stage |           7           0          15
   Dialysis |          21           0         171
  Transplan |          45           0         179
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   289.97719   175.27671       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         590           0        590        590

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         420           0       1,343
  CKD stage |         109           0         353
  CKD stage |           6           0          15
   Dialysis |          48           0         171
  Transplan |          50           0         179
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   294.65637    167.8762       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         637           0        637        637

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,343
  CKD stage |         107           0         353
  CKD stage |           4           0          15
   Dialysis |          35           0         171
  Transplan |          13           0         179
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   261.54183    152.9932       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,104         546           0        546        546

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(90 real changes made)

. replace ethnicity=2 if ethnicity==3
(86 real changes made)

. replace ethnicity=3 if ethnicity==4
(71 real changes made)

. replace ethnicity=4 if ethnicity==6
(90 real changes made)

. replace ethnicity=6 if ethnicity==.
(540 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,884 missing values generated)

. replace region = 2 if region_string=="East"
(212 real changes made)

. replace region = 3 if region_string=="London"
(419 real changes made)

. replace region = 4 if region_string=="North East"
(190 real changes made)

. replace region = 5 if region_string=="North West"
(216 real changes made)

. replace region = 6 if region_string=="South East"
(229 real changes made)

. replace region = 7 if region_string=="South West"
(211 real changes made)

. replace region = 8 if region_string=="West Midlands"
(209 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(198 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,104 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(802 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,302 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2018_ckd_complete.dta not found)
file ./output/2018_ckd_complete.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_complete.log
  log type:  text
 closed on:   9 Feb 2023, 22:10:18
-------------------------------------------------------------------------------
