-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_complete_v2.log
  log type:  text
 opened on:  24 Mar 2023, 18:42:19

. clear

. 
. *Merge `dataset'_ckd_v2 with `dataset'_ckd_complete_v2
. capture noisily import delimited ./output/`dataset'_ckd_v2.csv, clear
(7 vars, 20,935 obs)

. tempfile `dataset'_ckd_v2

. save ``dataset'_ckd'_v2, replace
(note: file _v2.dta not found)
file _v2.dta saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete_v2.csv
> , clear
(210 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'_v2

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,781
        from master                    47,923  (_merge==1)
        from using                     18,858  (_merge==2)

    matched                             2,077  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,781 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v2

. save ``dataset'_ckd_complete'_v2, replace
file _v2.dta saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd_v2.csv, clear
> tempfile 2017_ckd_v2
> save 2017_ckd_v2, replace
> capture noisily import delimited ./output/input_2017_ckd_complete_v2.csv, cle
> ar
> merge 1:1 patient_id using 2017_ckd_v2
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v2
> save 2017_ckd_complete_v2, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        202        9.73        9.73
Kidney transplant |        179        8.62       18.34
 Modality unclear |         42        2.02       20.37
          Pre KRT |      1,654       79.63      100.00
------------------+-----------------------------------
            Total |      2,077      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(808 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1269 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(202 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(179 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(42 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(640 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,261       60.71       60.71
  CKD stage 3 |        372       17.91       78.62
CKD stage 4/5 |         21        1.01       79.63
     Dialysis |        202        9.73       89.36
   Transplant |        179        8.62       97.98
  KRT unclear |         42        2.02      100.00
--------------+-----------------------------------
        Total |      2,077      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,261 |     1,261 
  CKD stage 3 |         0          0          0        372 |       372 
CKD stage 4/5 |         0          0          0         21 |        21 
     Dialysis |       202          0          0          0 |       202 
   Transplant |         0        179          0          0 |       179 
  KRT unclear |         0          0         42          0 |        42 
--------------+--------------------------------------------+----------
        Total |       202        179         42      1,654 |     2,077 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       153         40         66         13 |     1,261 
  CKD stage 3 |        47         19         18          5 |       372 
CKD stage 4/5 |         0          0          0          0 |        21 
     Dialysis |        25          6         10          1 |       202 
   Transplant |        19          4          8          0 |       179 
  KRT unclear |         5          1          1          1 |        42 
--------------+--------------------------------------------+----------
        Total |       249         70        103         20 |     2,077 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |       989 |     1,261 
  CKD stage 3 |       283 |       372 
CKD stage 4/5 |        21 |        21 
     Dialysis |       160 |       202 
   Transplant |       148 |       179 
  KRT unclear |        34 |        42 
--------------+-----------+----------
        Total |     1,635 |     2,077 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,109 missing values generated)

. replace sex = 0 if male == "Female"
(1,109 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(933 real changes made, 933 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(933 missing values generated)

. gen min_creatinine_outcome=.
(2,077 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(629 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(515 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(629 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(515 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(738 real changes made)

. gen max_creatinine_outcome=.
(2,077 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(629 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(515 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,144 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,339 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(933 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,144 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(629 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(933 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1144 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(180 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(7 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(4 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(70 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(103 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(20 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(249 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,486       71.55       71.55
               CKD 3 |        140        6.74       78.29
     CKD 4/5 pre-KRT |          9        0.43       78.72
            Dialysis |         70        3.37       82.09
   Kidney transplant |        103        4.96       87.05
KRT unclear modality |         20        0.96       88.01
            Deceased |        249       11.99      100.00
---------------------+-----------------------------------
               Total |      2,077      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,261
  CKD stage |          94           0         372
  CKD stage |           5           0          21
   Dialysis |          51           0         202
  Transplan |          51           0         179
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |    240.6986   140.66969       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,077         561           0        561        561

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,261
  CKD stage |          86           0         372
  CKD stage |           4           0          21
   Dialysis |          65           0         202
  Transplan |          58           0         179
  KRT uncle |           6           0          42
------------+------------------------------------
      Total |   207.20125   112.49022       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,077         516           0        516        516

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,261
  CKD stage |          99           0         372
  CKD stage |           2           0          21
   Dialysis |          43           0         202
  Transplan |          56           0         179
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   240.62975   139.78146       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,077         560           0        560        560

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,261
  CKD stage |          83           0         372
  CKD stage |           1           0          21
   Dialysis |          42           0         202
  Transplan |          39           0         179
  KRT uncle |          12           0          42
------------+------------------------------------
      Total |   221.70149   133.09169       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,077         505           0        505        505

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,261
  CKD stage |          70           0         372
  CKD stage |           7           0          21
   Dialysis |          45           0         202
  Transplan |          40           0         179
  KRT uncle |          23           0          42
------------+------------------------------------
      Total |   204.85604   122.49271       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,077         488           0        488        488

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,261
  CKD stage |          87           0         372
  CKD stage |          11           0          21
   Dialysis |          50           0         202
  Transplan |          44           0         179
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   236.29562   141.03015       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,077         544           0        544        544

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,261
  CKD stage |          74           0         372
  CKD stage |           2           0          21
   Dialysis |          45           0         202
  Transplan |          53           0         179
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |   194.86423   111.46539       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,077         469           0        469        469

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         395           0       1,261
  CKD stage |         126           0         372
  CKD stage |           0           0          21
   Dialysis |          69           0         202
  Transplan |          42           0         179
  KRT uncle |          17           0          42
------------+------------------------------------
      Total |   273.05585   153.76291       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,077         649           0        649        649

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,261
  CKD stage |          98           0         372
  CKD stage |           2           0          21
   Dialysis |          60           0         202
  Transplan |          57           0         179
  KRT uncle |          24           0          42
------------+------------------------------------
      Total |   239.47809   134.62651       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,077         588           0        588        588

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,261
  CKD stage |         110           0         372
  CKD stage |           9           0          21
   Dialysis |          40           0         202
  Transplan |          45           0         179
  KRT uncle |          20           0          42
------------+------------------------------------
      Total |   237.42369   135.67677       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,077         569           0        569        569

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,261
  CKD stage |          95           0         372
  CKD stage |           5           0          21
   Dialysis |          48           0         202
  Transplan |          48           0         179
  KRT uncle |          17           0          42
------------+------------------------------------
      Total |   232.02985   134.11731       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,077         552           0        552        552

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,261
  CKD stage |         104           0         372
  CKD stage |           4           0          21
   Dialysis |          50           0         202
  Transplan |          36           0         179
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   232.63024   134.00422       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,077         542           0        542        542

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,261
  CKD stage |          62           0         372
  CKD stage |           9           0          21
   Dialysis |          46           0         202
  Transplan |          50           0         179
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   205.90034   124.79144       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,077         480           0        480        480

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,261
  CKD stage |         107           0         372
  CKD stage |           8           0          21
   Dialysis |          39           0         202
  Transplan |          45           0         179
  KRT uncle |          20           0          42
------------+------------------------------------
      Total |   242.85026   141.16693       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         574           0        574        574

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,261
  CKD stage |         108           0         372
  CKD stage |           7           0          21
   Dialysis |          33           0         202
  Transplan |          39           0         179
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   214.94222   121.88662       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         505           0        505        505

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,261
  CKD stage |          99           0         372
  CKD stage |           6           0          21
   Dialysis |          49           0         202
  Transplan |          28           0         179
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   214.59605   122.94193       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         504           0        504        504

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,261
  CKD stage |         112           0         372
  CKD stage |          -2           0          21
   Dialysis |          70           0         202
  Transplan |          76           0         179
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |    219.4001   109.27799       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         573           0        573        573

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,261
  CKD stage |          74           0         372
  CKD stage |           8           0          21
   Dialysis |          61           0         202
  Transplan |          60           0         179
  KRT uncle |           1           0          42
------------+------------------------------------
      Total |   233.30958   138.10949       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         548           0        548        548

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,261
  CKD stage |         117           0         372
  CKD stage |           3           0          21
   Dialysis |          67           0         202
  Transplan |          51           0         179
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   213.00241   108.00467       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         545           0        545        545

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,261
  CKD stage |          96           0         372
  CKD stage |           5           0          21
   Dialysis |          41           0         202
  Transplan |          51           0         179
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   251.63987   150.81322       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         573           0        573        573

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,261
  CKD stage |          98           0         372
  CKD stage |           5           0          21
   Dialysis |          40           0         202
  Transplan |          36           0         179
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   215.29369   124.51549       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         496           0        496        496

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,261
  CKD stage |          86           0         372
  CKD stage |           0           0          21
   Dialysis |          42           0         202
  Transplan |          16           0         179
  KRT uncle |          22           0          42
------------+------------------------------------
      Total |     245.948   155.45026       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         536           0        536        536

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         249           0       1,261
  CKD stage |          97           0         372
  CKD stage |           6           0          21
   Dialysis |          76           0         202
  Transplan |          44           0         179
  KRT uncle |           0           0          42
------------+------------------------------------
      Total |   179.79153   87.950466       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         472           0        472        472

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         263           0       1,261
  CKD stage |          74           0         372
  CKD stage |          18           0          21
   Dialysis |          31           0         202
  Transplan |          56           0         179
  KRT uncle |          14           0          42
------------+------------------------------------
      Total |   181.23399   102.49545       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         456           0        456        456

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,261
  CKD stage |         114           0         372
  CKD stage |           6           0          21
   Dialysis |          56           0         202
  Transplan |          52           0         179
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |   218.23062   114.97482       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,077         548           0        548        548

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,261
  CKD stage |          90           0         372
  CKD stage |          13           0          21
   Dialysis |          44           0         202
  Transplan |          35           0         179
  KRT uncle |          17           0          42
------------+------------------------------------
      Total |   222.42032   131.18303       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         526           0        526        526

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,261
  CKD stage |         100           0         372
  CKD stage |           3           0          21
   Dialysis |          55           0         202
  Transplan |          44           0         179
  KRT uncle |          21           0          42
------------+------------------------------------
      Total |   217.53683   120.10523       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         536           0        536        536

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,261
  CKD stage |          89           0         372
  CKD stage |           6           0          21
   Dialysis |          68           0         202
  Transplan |          58           0         179
  KRT uncle |          12           0          42
------------+------------------------------------
      Total |   219.70727   120.50907       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         549           0        549        549

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         269           0       1,261
  CKD stage |         114           0         372
  CKD stage |           4           0          21
   Dialysis |          62           0         202
  Transplan |          44           0         179
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   193.79923   96.172015       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         503           0        503        503

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,261
  CKD stage |         113           0         372
  CKD stage |           1           0          21
   Dialysis |          49           0         202
  Transplan |          54           0         179
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |   232.06355   127.48392       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         561           0        561        561

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,261
  CKD stage |         122           0         372
  CKD stage |           3           0          21
   Dialysis |          53           0         202
  Transplan |          60           0         179
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   253.26095   139.85542       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         605           0        605        605

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,261
  CKD stage |          85           0         372
  CKD stage |           6           0          21
   Dialysis |         105           0         202
  Transplan |          46           0         179
  KRT uncle |          12           0          42
------------+------------------------------------
      Total |   225.80501   122.11471       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         577           0        577        577

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,261
  CKD stage |         106           0         372
  CKD stage |           7           0          21
   Dialysis |          62           0         202
  Transplan |          57           0         179
  KRT uncle |          12           0          42
------------+------------------------------------
      Total |   220.87819   117.25736       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         558           0        558        558

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,261
  CKD stage |          99           0         372
  CKD stage |          18           0          21
   Dialysis |          65           0         202
  Transplan |          45           0         179
  KRT uncle |           4           0          42
------------+------------------------------------
      Total |   210.33173    112.9267       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         531           0        531        531

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,261
  CKD stage |         106           0         372
  CKD stage |           1           0          21
   Dialysis |          40           0         202
  Transplan |          36           0         179
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   232.59268   135.55288       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         532           0        532        532

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,261
  CKD stage |          92           0         372
  CKD stage |          13           0          21
   Dialysis |          45           0         202
  Transplan |          36           0         179
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   236.11651   141.54301       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         542           0        542        542

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,261
  CKD stage |          85           0         372
  CKD stage |           0           0          21
   Dialysis |          54           0         202
  Transplan |          50           0         179
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |   224.63024    130.6099       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,077         523           0        523        523

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         254           0       1,261
  CKD stage |          64           0         372
  CKD stage |           1           0          21
   Dialysis |          52           0         202
  Transplan |          43           0         179
  KRT uncle |          14           0          42
------------+------------------------------------
      Total |   174.72894   99.013906       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,077         428           0        428        428

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,261
  CKD stage |          65           0         372
  CKD stage |           4           0          21
   Dialysis |          37           0         202
  Transplan |          25           0         179
  KRT uncle |          21           0          42
------------+------------------------------------
      Total |   207.89023   131.23354       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,077         465           0        465        465

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,261
  CKD stage |         108           0         372
  CKD stage |          15           0          21
   Dialysis |          56           0         202
  Transplan |          42           0         179
  KRT uncle |          30           0          42
------------+------------------------------------
      Total |   230.12614   127.01806       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,077         582           0        582        582

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,261
  CKD stage |          58           0         372
  CKD stage |           2           0          21
   Dialysis |          31           0         202
  Transplan |          49           0         179
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   197.51709   122.85119       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,077         444           0        444        444

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,261
  CKD stage |          76           0         372
  CKD stage |           1           0          21
   Dialysis |          47           0         202
  Transplan |          36           0         179
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |   251.01156   158.48448       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,077         549           0        549        549

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,261
  CKD stage |          92           0         372
  CKD stage |           5           0          21
   Dialysis |          61           0         202
  Transplan |          49           0         179
  KRT uncle |           6           0          42
------------+------------------------------------
      Total |   231.40636    132.2721       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,077         550           0        550        550

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,261
  CKD stage |          93           0         372
  CKD stage |           9           0          21
   Dialysis |          46           0         202
  Transplan |          37           0         179
  KRT uncle |          12           0          42
------------+------------------------------------
      Total |   225.61146   132.29426       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,077         528           0        528        528

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,261
  CKD stage |          82           0         372
  CKD stage |           2           0          21
   Dialysis |          47           0         202
  Transplan |          29           0         179
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   220.44872   133.50254       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,077         494           0        494        494

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,261
  CKD stage |          91           0         372
  CKD stage |          10           0          21
   Dialysis |          62           0         202
  Transplan |          28           0         179
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   216.85604   124.63131       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         515           0        515        515

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,261
  CKD stage |         136           0         372
  CKD stage |          12           0          21
   Dialysis |          58           0         202
  Transplan |          48           0         179
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   211.69957   103.90212       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         554           0        554        554

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,261
  CKD stage |          73           0         372
  CKD stage |           2           0          21
   Dialysis |          73           0         202
  Transplan |          44           0         179
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   250.50506   152.86284       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,077         568           0        568        568

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,261
  CKD stage |          65           0         372
  CKD stage |           8           0          21
   Dialysis |          57           0         202
  Transplan |          48           0         179
  KRT uncle |          22           0          42
------------+------------------------------------
      Total |   230.69909   141.11711       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,077         544           0        544        544

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,261
  CKD stage |          67           0         372
  CKD stage |           3           0          21
   Dialysis |          73           0         202
  Transplan |          33           0         179
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   244.50554   151.58373       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         558           0        558        558

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,261
  CKD stage |         110           0         372
  CKD stage |           2           0          21
   Dialysis |          61           0         202
  Transplan |          40           0         179
  KRT uncle |          -1           0          42
------------+------------------------------------
      Total |   213.64757   114.61313       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         516           0        516        516

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,261
  CKD stage |          75           0         372
  CKD stage |           2           0          21
   Dialysis |          55           0         202
  Transplan |          16           0         179
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   200.03178   120.46972       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         451           0        451        451

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,261
  CKD stage |         105           0         372
  CKD stage |           7           0          21
   Dialysis |          59           0         202
  Transplan |          66           0         179
  KRT uncle |          17           0          42
------------+------------------------------------
      Total |   225.53394    119.9797       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         575           0        575        575

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,261
  CKD stage |          92           0         372
  CKD stage |           7           0          21
   Dialysis |          48           0         202
  Transplan |          52           0         179
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |   237.07896   138.93258       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         552           0        552        552

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,261
  CKD stage |         106           0         372
  CKD stage |           3           0          21
   Dialysis |          63           0         202
  Transplan |          58           0         179
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   215.98219   113.55764       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         539           0        539        539

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,261
  CKD stage |          70           0         372
  CKD stage |           2           0          21
   Dialysis |          48           0         202
  Transplan |          38           0         179
  KRT uncle |          -5           0          42
------------+------------------------------------
      Total |   247.46461   157.86784       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         527           0        527        527

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,261
  CKD stage |         101           0         372
  CKD stage |          12           0          21
   Dialysis |          70           0         202
  Transplan |          49           0         179
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   208.06018    108.2186       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         542           0        542        542

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,261
  CKD stage |          90           0         372
  CKD stage |           0           0          21
   Dialysis |          68           0         202
  Transplan |          31           0         179
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   226.42369   131.30639       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         523           0        523        523

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,261
  CKD stage |         121           0         372
  CKD stage |           5           0          21
   Dialysis |          68           0         202
  Transplan |          50           0         179
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   206.46461   101.62239       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         539           0        539        539

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,261
  CKD stage |         104           0         372
  CKD stage |           2           0          21
   Dialysis |          53           0         202
  Transplan |          35           0         179
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   230.36688   131.87663       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         537           0        537        537

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,261
  CKD stage |          95           0         372
  CKD stage |           9           0          21
   Dialysis |          29           0         202
  Transplan |          39           0         179
  KRT uncle |           6           0          42
------------+------------------------------------
      Total |   226.18873   135.67192       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,077         512           0        512        512

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,261
  CKD stage |          72           0         372
  CKD stage |          14           0          21
   Dialysis |          32           0         202
  Transplan |          44           0         179
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   195.58257   116.87734       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,077         460           0        460        460

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,261
  CKD stage |          74           0         372
  CKD stage |           6           0          21
   Dialysis |          71           0         202
  Transplan |          73           0         179
  KRT uncle |           6           0          42
------------+------------------------------------
      Total |   231.84064   132.47729       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,077         568           0        568        568

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,261
  CKD stage |         101           0         372
  CKD stage |           6           0          21
   Dialysis |          43           0         202
  Transplan |          43           0         179
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   192.57246    103.2946       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,077         476           0        476        476

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,261
  CKD stage |          75           0         372
  CKD stage |           4           0          21
   Dialysis |          52           0         202
  Transplan |          41           0         179
  KRT uncle |           6           0          42
------------+------------------------------------
      Total |   213.42995   126.93961       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,077         493           0        493        493

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,261
  CKD stage |         114           0         372
  CKD stage |          12           0          21
   Dialysis |          36           0         202
  Transplan |          29           0         179
  KRT uncle |           4           0          42
------------+------------------------------------
      Total |   208.15118   116.12564       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,077         494           0        494        494

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,261
  CKD stage |         107           0         372
  CKD stage |          11           0          21
   Dialysis |          78           0         202
  Transplan |          33           0         179
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   239.36591   133.09767       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,077         584           0        584        584

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,261
  CKD stage |         107           0         372
  CKD stage |           8           0          21
   Dialysis |          54           0         202
  Transplan |          20           0         179
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   260.73279   157.67136       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,077         583           0        583        583

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,261
  CKD stage |          96           0         372
  CKD stage |           0           0          21
   Dialysis |          41           0         202
  Transplan |          53           0         179
  KRT uncle |          15           0          42
------------+------------------------------------
      Total |   223.97545   128.16608       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,077         531           0        531        531

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,261
  CKD stage |         102           0         372
  CKD stage |          11           0          21
   Dialysis |          33           0         202
  Transplan |          28           0         179
  KRT uncle |          15           0          42
------------+------------------------------------
      Total |    245.9066   149.89241       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         554           0        554        554

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,261
  CKD stage |          91           0         372
  CKD stage |           0           0          21
   Dialysis |          47           0         202
  Transplan |          43           0         179
  KRT uncle |          17           0          42
------------+------------------------------------
      Total |   235.59172   139.54393       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         545           0        545        545

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,261
  CKD stage |          63           0         372
  CKD stage |           4           0          21
   Dialysis |          73           0         202
  Transplan |          29           0         179
  KRT uncle |           4           0          42
------------+------------------------------------
      Total |   226.81945   140.12846       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,077         512           0        512        512

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,261
  CKD stage |         119           0         372
  CKD stage |          -2           0          21
   Dialysis |          91           0         202
  Transplan |          67           0         179
  KRT uncle |           1           0          42
------------+------------------------------------
      Total |   244.78912   125.13694       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,077         620           0        620        620

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,261
  CKD stage |          98           0         372
  CKD stage |          -1           0          21
   Dialysis |          50           0         202
  Transplan |          43           0         179
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   220.10737   124.37727       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         525           0        525        525

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,261
  CKD stage |         128           0         372
  CKD stage |           2           0          21
   Dialysis |          66           0         202
  Transplan |          48           0         179
  KRT uncle |          15           0          42
------------+------------------------------------
      Total |   246.90563   131.93076       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         610           0        610        610

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,261
  CKD stage |         123           0         372
  CKD stage |           8           0          21
   Dialysis |          42           0         202
  Transplan |          43           0         179
  KRT uncle |          13           0          42
------------+------------------------------------
      Total |   239.01541   133.30288       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         573           0        573        573

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,261
  CKD stage |          88           0         372
  CKD stage |           7           0          21
   Dialysis |          57           0         202
  Transplan |          30           0         179
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |    243.8416   147.96461       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         549           0        549        549

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,261
  CKD stage |          84           0         372
  CKD stage |           2           0          21
   Dialysis |          37           0         202
  Transplan |          51           0         179
  KRT uncle |          17           0          42
------------+------------------------------------
      Total |   203.71883   116.98771       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         488           0        488        488

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,261
  CKD stage |          83           0         372
  CKD stage |           3           0          21
   Dialysis |          61           0         202
  Transplan |          20           0         179
  KRT uncle |          14           0          42
------------+------------------------------------
      Total |   212.86567   125.73614       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         494           0        494        494

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,261
  CKD stage |          91           0         372
  CKD stage |           4           0          21
   Dialysis |          59           0         202
  Transplan |          33           0         179
  KRT uncle |           0           0          42
------------+------------------------------------
      Total |   208.27299   117.97066       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         489           0        489        489

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,261
  CKD stage |          96           0         372
  CKD stage |           0           0          21
   Dialysis |          19           0         202
  Transplan |          27           0         179
  KRT uncle |          21           0          42
------------+------------------------------------
      Total |   233.07318   144.80958       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         511           0        511        511

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,261
  CKD stage |         101           0         372
  CKD stage |           2           0          21
   Dialysis |          43           0         202
  Transplan |          51           0         179
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   216.25181   120.72396       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         516           0        516        516

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,261
  CKD stage |         105           0         372
  CKD stage |          19           0          21
   Dialysis |          63           0         202
  Transplan |          56           0         179
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |   242.54646    134.8626       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         598           0        598        598

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,261
  CKD stage |         110           0         372
  CKD stage |           2           0          21
   Dialysis |          47           0         202
  Transplan |          43           0         179
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |   243.14348   139.70342       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         567           0        567        567

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(87 real changes made)

. replace ethnicity=2 if ethnicity==3
(86 real changes made)

. replace ethnicity=3 if ethnicity==4
(88 real changes made)

. replace ethnicity=4 if ethnicity==6
(87 real changes made)

. replace ethnicity=6 if ethnicity==.
(517 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,865 missing values generated)

. replace region = 2 if region_string=="East"
(216 real changes made)

. replace region = 3 if region_string=="London"
(407 real changes made)

. replace region = 4 if region_string=="North East"
(208 real changes made)

. replace region = 5 if region_string=="North West"
(189 real changes made)

. replace region = 6 if region_string=="South East"
(215 real changes made)

. replace region = 7 if region_string=="South West"
(205 real changes made)

. replace region = 8 if region_string=="West Midlands"
(210 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(215 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,077 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(808 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,269 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v2.dta", replace
(note: file ./output/2018_ckd_complete_v2.dta not found)
file ./output/2018_ckd_complete_v2.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_complete_v2.log
  log type:  text
 closed on:  24 Mar 2023, 18:42:28
-------------------------------------------------------------------------------
