-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2018_nockd_complete.log
  log type:  text
 opened on:  21 Nov 2023, 18:24:40

. clear

. 
. *Merge `dataset'_nockd with `dataset'_nockd_complete
. capture noisily import delimited ./output/`dataset'_nockd.csv, clear
(18 vars, 11,038 obs)

. tempfile `dataset'_nockd

. save ``dataset'_nockd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_nockd_complete.csv,
>  clear
(24 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_nockd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        58,862
        from master                    48,912  (_merge==1)
        from using                      9,950  (_merge==2)

    matched                             1,088  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(58,862 observations deleted)

. drop _merge

. tempfile `dataset'_nockd_complete

. save ``dataset'_nockd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_nockd.csv, clear
> tempfile 2017_nockd
> save ./output/2017_nockd, replace
> capture noisily import delimited ./output/input_2017_nockd_complete.csv, clea
> r
> merge 1:1 patient_id using ./output/2017_nockd
> keep if _merge==3
> drop _merge
> tempfile 2017_nockd_complete
> save ./output/2017_nockd_complete, replace
> */
. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
variable sex already defined
r(110);

end of do-file
r(110);

end of do-file

r(110);


