-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd.log
  log type:  text
 opened on:   7 Jun 2024, 10:20:55

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve)
(18 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,599 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,946 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,749 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,395       10.07       10.07
           East Midlands |      3,488       10.35       20.42
                  London |      6,645       19.71       40.14
              North East |      3,434       10.19       50.32
              North West |      3,321        9.85       60.18
              South East |      3,322        9.86       70.03
              South West |      3,403       10.10       80.13
           West Midlands |      3,287        9.75       89.88
Yorkshire and The Humber |      3,411       10.12      100.00
-------------------------+-----------------------------------
                   Total |     33,706      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,651        4.90        4.90
          1 |      6,528       19.37       24.27
          2 |      6,445       19.12       43.39
          3 |      6,318       18.74       62.13
          4 |      6,290       18.66       80.79
          5 |      6,474       19.21      100.00
------------+-----------------------------------
      Total |     33,706      100.00

. drop if imd==0
(1,651 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * Code sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. save ./output/input_`dataset', replace
(note: file ./output/input_2018.dta not found)
file ./output/input_2018.dta saved

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,032 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(822 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(794 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,097 real changes made, 14,097 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,097 missing values generated)

. gen min_baseline_creatinine=.
(32,055 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,151 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,807 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,151 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,807 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,346 real changes made)

. gen max_baseline_creatinine=.
(32,055 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,151 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,807 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,958 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,709 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,097 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,958 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,151 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,647 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,055
25%            0              0       Sum of Wgt.      32,055

50%     8.103184                      Mean           12.46663
                        Largest       Std. Dev.      12.95679
75%     24.95802       42.26917
90%     29.13132       42.39992       Variance       167.8784
95%     31.36077       43.06004       Skewness       .2148864
99%     35.22755       43.58374       Kurtosis       1.303656

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,644        5.69        5.69
         <= |      1,602        5.54       11.23
          = |     20,920       72.38       83.61
          > |      1,606        5.56       89.17
         >= |      1,533        5.30       94.47
          ~ |      1,598        5.53      100.00
------------+-----------------------------------
      Total |     28,903      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,639       55.03       55.03
   Albuminuria |     14,416       44.97      100.00
---------------+-----------------------------------
         Total |     32,055      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,992       46.77       46.77
          1 |     17,063       53.23      100.00
------------+-----------------------------------
      Total |     32,055      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14097 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17958 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,097 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,477       95.08       95.08
          1 |      1,578        4.92      100.00
------------+-----------------------------------
      Total |     32,055      100.00
(1,578 real changes made)
(768 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,468       95.05       95.05
          1 |      1,587        4.95      100.00
------------+-----------------------------------
      Total |     32,055      100.00
(1,503 real changes made)
(702 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,457       95.01       95.01
          1 |      1,598        4.99      100.00
------------+-----------------------------------
      Total |     32,055      100.00
(1,426 real changes made)
(679 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,454       95.01       95.01
          1 |      1,601        4.99      100.00
------------+-----------------------------------
      Total |     32,055      100.00
(1,365 real changes made)
(634 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,479       95.08       95.08
          1 |      1,576        4.92      100.00
------------+-----------------------------------
      Total |     32,055      100.00
(1,270 real changes made)
(591 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,438       94.96       94.96
          1 |      1,617        5.04      100.00
------------+-----------------------------------
      Total |     32,055      100.00
(1,311 real changes made)
(639 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,665      4,624 |    10,289 
 eGFR >=60 |     5,314      4,433 |     9,747 
  eGFR <60 |     1,964      1,602 |     3,566 
       KRT |     4,696      3,757 |     8,453 
-----------+----------------------+----------
     Total |    17,639     14,416 |    32,055 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,979       34.25       34.25
          1 |     21,076       65.75      100.00
------------+-----------------------------------
      Total |     32,055      100.00

. drop if ckd==0
(10,979 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,624 |     4,624 
 eGFR >=60 |         0      4,433 |     4,433 
  eGFR <60 |     1,964      1,602 |     3,566 
       KRT |     4,696      3,757 |     8,453 
-----------+----------------------+----------
     Total |     6,660     14,416 |    21,076 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2018_ckd.csv not found)
file ./output/2018_ckd.csv saved

. 
. *Create dataset of non-CKD
. merge 1:1 patient_id using ./output/input_`dataset'
(label sexLab already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,979
        from master                         0  (_merge==1)
        from using                     10,979  (_merge==2)

    matched                            21,076  (_merge==3)
    -----------------------------------------

. keep if _merge==2
(21,076 observations deleted)

. drop _merge

. 
. export delimited using "./output/`dataset'_nockd.csv", replace
(note: file ./output/2018_nockd.csv not found)
file ./output/2018_nockd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd.log
  log type:  text
 closed on:   7 Jun 2024, 10:20:57
-------------------------------------------------------------------------------
