-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_v2.log
  log type:  text
 opened on:  24 Mar 2023, 17:53:46

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,739 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,930 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,723 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,337        9.93        9.93
           East Midlands |      3,294        9.80       19.73
                  London |      6,833       20.33       40.06
              North East |      3,358        9.99       50.05
              North West |      3,422       10.18       60.24
              South East |      3,346        9.96       70.19
              South West |      3,386       10.07       80.27
           West Midlands |      3,286        9.78       90.04
Yorkshire and The Humber |      3,346        9.96      100.00
-------------------------+-----------------------------------
                   Total |     33,608      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,691        5.03        5.03
          1 |      6,348       18.89       23.92
          2 |      6,486       19.30       43.22
          3 |      6,347       18.89       62.10
          4 |      6,307       18.77       80.87
          5 |      6,429       19.13      100.00
------------+-----------------------------------
      Total |     33,608      100.00

. drop if imd==0
(1,691 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,865 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(722 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(755 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,994 real changes made, 13,994 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,994 missing values generated)

. gen min_baseline_creatinine=.
(31,917 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,092 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,831 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,092 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,831 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,369 real changes made)

. gen max_baseline_creatinine=.
(31,917 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,092 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,831 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,923 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,548 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,994 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,923 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,092 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,594 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,917
25%            0              0       Sum of Wgt.      31,917

50%            0                      Mean           12.40108
                        Largest       Std. Dev.      12.96099
75%     24.95727        43.0619
90%     29.11342       43.46476       Variance       167.9873
95%     31.32962       43.96503       Skewness       .2243821
99%     35.04462        45.9745       Kurtosis       1.304761

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,497        5.23        5.23
         <= |      1,590        5.55       10.78
          = |     20,662       72.15       82.93
          > |      1,619        5.65       88.59
         >= |      1,705        5.95       94.54
          ~ |      1,563        5.46      100.00
------------+-----------------------------------
      Total |     28,636      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,529       54.92       54.92
   Albuminuria |     14,388       45.08      100.00
---------------+-----------------------------------
         Total |     31,917      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,935       46.79       46.79
          1 |     16,982       53.21      100.00
------------+-----------------------------------
      Total |     31,917      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(13994 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17923 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(13,994 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,336       95.05       95.05
          1 |      1,581        4.95      100.00
------------+-----------------------------------
      Total |     31,917      100.00
(1,581 real changes made)
(744 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,314       94.98       94.98
          1 |      1,603        5.02      100.00
------------+-----------------------------------
      Total |     31,917      100.00
(1,531 real changes made)
(727 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,300       94.93       94.93
          1 |      1,617        5.07      100.00
------------+-----------------------------------
      Total |     31,917      100.00
(1,456 real changes made)
(679 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,308       94.96       94.96
          1 |      1,609        5.04      100.00
------------+-----------------------------------
      Total |     31,917      100.00
(1,395 real changes made)
(644 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,316       94.98       94.98
          1 |      1,601        5.02      100.00
------------+-----------------------------------
      Total |     31,917      100.00
(1,317 real changes made)
(582 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,351       95.09       95.09
          1 |      1,566        4.91      100.00
------------+-----------------------------------
      Total |     31,917      100.00
(1,202 real changes made)
(577 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,637      4,611 |    10,248 
 eGFR >=60 |     5,345      4,287 |     9,632 
  eGFR <60 |     1,912      1,643 |     3,555 
       KRT |     4,635      3,847 |     8,482 
-----------+----------------------+----------
     Total |    17,529     14,388 |    31,917 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,982       34.41       34.41
          1 |     20,935       65.59      100.00
------------+-----------------------------------
      Total |     31,917      100.00

. drop if ckd==0
(10,982 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,611 |     4,611 
 eGFR >=60 |         0      4,287 |     4,287 
  eGFR <60 |     1,912      1,643 |     3,555 
       KRT |     4,635      3,847 |     8,482 
-----------+----------------------+----------
     Total |     6,547     14,388 |    20,935 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd_v2.csv", replace
(note: file ./output/2018_ckd_v2.csv not found)
file ./output/2018_ckd_v2.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2018_ckd_v2.log
  log type:  text
 closed on:  24 Mar 2023, 17:53:50
-------------------------------------------------------------------------------
