-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete.log
  log type:  text
 opened on:  20 Sep 2023, 14:23:15

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 21,041 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(236 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,575
        from master                    47,767  (_merge==1)
        from using                     18,808  (_merge==2)

    matched                             2,233  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,575 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        229       10.26       10.26
Kidney transplant |        180        8.06       18.32
 Modality unclear |         43        1.93       20.24
          Pre KRT |      1,781       79.76      100.00
------------------+-----------------------------------
            Total |      2,233      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(917 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1316 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,316       58.93       58.93
          . |        917       41.07      100.00
------------+-----------------------------------
      Total |      2,233      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(229 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(29 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(169 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(327 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(16 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(43 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(6 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       140         89 |       229 
Kidney transplant |       180          0 |       180 
 Modality unclear |        43          0 |        43 
          Pre KRT |     1,781          0 |     1,781 
------------------+----------------------+----------
            Total |     2,144         89 |     2,233 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       210         19 |       229 
Kidney transplant |       150         30 |       180 
 Modality unclear |        37          6 |        43 
          Pre KRT |     1,525        256 |     1,781 
------------------+----------------------+----------
            Total |     1,922        311 |     2,233 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       229          0 |       229 
Kidney transplant |       180          0 |       180 
 Modality unclear |         6         37 |        43 
          Pre KRT |     1,781          0 |     1,781 
------------------+----------------------+----------
            Total |     2,196         37 |     2,233 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,833        311 |     2,144 
         1 |        89          0 |        89 
-----------+----------------------+----------
     Total |     1,922        311 |     2,233 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(917 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1316 changes made)

. replace ckd_group = 4 if dialysis==1
(89 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(311 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(37 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(689 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,367       61.22       61.22
         CKD stage 3 |        405       18.14       79.36
       CKD stage 4/5 |         24        1.07       80.43
            Dialysis |         89        3.99       84.42
          Transplant |        311       13.93       98.34
KRT unclear modality |         37        1.66      100.00
---------------------+-----------------------------------
               Total |      2,233      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        76        126          0      1,165 |     1,367 
         CKD stage 3 |        41         23          0        341 |       405 
       CKD stage 4/5 |         4          1          0         19 |        24 
            Dialysis |        89          0          0          0 |        89 
          Transplant |        19         30          6        256 |       311 
KRT unclear modality |         0          0         37          0 |        37 
---------------------+--------------------------------------------+----------
               Total |       229        180         43      1,781 |     2,233 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       136         78         49         23 |     1,367 
         CKD stage 3 |        38         15         25          7 |       405 
       CKD stage 4/5 |         2          1          3          0 |        24 
            Dialysis |        12          5          3          1 |        89 
          Transplant |        32         18         14          6 |       311 
KRT unclear modality |         4          1          3          0 |        37 
---------------------+--------------------------------------------+----------
               Total |       224        118         97         37 |     2,233 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,081 |     1,367 
         CKD stage 3 |       320 |       405 
       CKD stage 4/5 |        18 |        24 
            Dialysis |        68 |        89 
          Transplant |       241 |       311 
KRT unclear modality |        29 |        37 
---------------------+-----------+----------
               Total |     1,757 |     2,233 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,209 missing values generated)

. replace sex = 0 if male == "Female"
(1,209 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(998 real changes made, 998 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(998 missing values generated)

. gen min_creatinine_outcome=.
(2,233 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(657 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(578 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(657 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(578 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(799 real changes made)

. gen max_creatinine_outcome=.
(2,233 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(657 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(578 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,235 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,434 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(998 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,235 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(657 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(998 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1235 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(195 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(9 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(3 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(998 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1235 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,235       55.31       55.31
          . |        998       44.69      100.00
------------+-----------------------------------
      Total |      2,233      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(118 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(97 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(16 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(37 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(118 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(113 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(224 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,587       71.07       71.07
               CKD 3 |        160        7.17       78.24
     CKD 4/5 pre-KRT |         10        0.45       78.68
            Dialysis |        118        5.28       83.97
   Kidney transplant |        113        5.06       89.03
KRT unclear modality |         21        0.94       89.97
            Deceased |        224       10.03      100.00
---------------------+-----------------------------------
               Total |      2,233      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(917 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1316 changes made)

. replace access_egfr=0 if ckd_group==4
(89 real changes made)

. replace access_egfr=3 if access_egfr==.
(828 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,367
  CKD stage |         112           0         405
  CKD stage |           9           0          24
   Dialysis |          34           0          89
  Transplan |          82           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |   260.42096   140.39335       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,233         615           0        615        615

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,367
  CKD stage |         135           0         405
  CKD stage |           6           0          24
   Dialysis |          36           0          89
  Transplan |          69           0         311
  KRT uncle |           9           0          37
------------+------------------------------------
      Total |   218.78549   104.35189       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,233         554           0        554        554

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,367
  CKD stage |         109           0         405
  CKD stage |           7           0          24
   Dialysis |          45           0          89
  Transplan |          91           0         311
  KRT uncle |           8           0          37
------------+------------------------------------
      Total |   270.13435     145.492       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,233         645           0        645        645

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,367
  CKD stage |         108           0         405
  CKD stage |           8           0          24
   Dialysis |          21           0          89
  Transplan |          83           0         311
  KRT uncle |          21           0          37
------------+------------------------------------
      Total |   255.86476   138.56466       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,233         606           0        606        606

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,367
  CKD stage |          94           0         405
  CKD stage |           0           0          24
   Dialysis |          13           0          89
  Transplan |          96           0         311
  KRT uncle |           6           0          37
------------+------------------------------------
      Total |   258.76803   143.72849       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,233         581           0        581        581

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,367
  CKD stage |         122           0         405
  CKD stage |           7           0          24
   Dialysis |          28           0          89
  Transplan |          57           0         311
  KRT uncle |          17           0          37
------------+------------------------------------
      Total |   235.39498    125.1756       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,233         564           0        564        564

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,367
  CKD stage |         105           0         405
  CKD stage |           8           0          24
   Dialysis |           9           0          89
  Transplan |          73           0         311
  KRT uncle |           6           0          37
------------+------------------------------------
      Total |   231.77474   125.30091       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,233         531           0        531        531

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,367
  CKD stage |         120           0         405
  CKD stage |           8           0          24
   Dialysis |          19           0          89
  Transplan |          91           0         311
  KRT uncle |          18           0          37
------------+------------------------------------
      Total |   268.82087   142.81029       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,233         637           0        637        637

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,367
  CKD stage |         127           0         405
  CKD stage |           1           0          24
   Dialysis |          14           0          89
  Transplan |          92           0         311
  KRT uncle |          14           0          37
------------+------------------------------------
      Total |   227.03627   108.56229       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,233         559           0        559        559

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,367
  CKD stage |          98           0         405
  CKD stage |           4           0          24
   Dialysis |          22           0          89
  Transplan |          97           0         311
  KRT uncle |           9           0          37
------------+------------------------------------
      Total |   244.16749   129.42454       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,233         576           0        576        576

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,367
  CKD stage |          90           0         405
  CKD stage |           3           0          24
   Dialysis |          19           0          89
  Transplan |          67           0         311
  KRT uncle |           2           0          37
------------+------------------------------------
      Total |   210.74384   114.74314       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,233         482           0        482        482

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,367
  CKD stage |         121           0         405
  CKD stage |          11           0          24
   Dialysis |          18           0          89
  Transplan |          92           0         311
  KRT uncle |          12           0          37
------------+------------------------------------
      Total |   237.81326   118.18831       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,233         584           0        584        584

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,367
  CKD stage |         127           0         405
  CKD stage |           4           0          24
   Dialysis |           6           0          89
  Transplan |          64           0         311
  KRT uncle |          10           0          37
------------+------------------------------------
      Total |   236.86386   125.27589       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,233         545           0        545        545

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,367
  CKD stage |         103           0         405
  CKD stage |           6           0          24
   Dialysis |          25           0          89
  Transplan |          62           0         311
  KRT uncle |          11           0          37
------------+------------------------------------
      Total |    254.4541   145.27409       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,233         576           0        576        576

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,367
  CKD stage |          98           0         405
  CKD stage |           8           0          24
   Dialysis |          31           0          89
  Transplan |          84           0         311
  KRT uncle |          12           0          37
------------+------------------------------------
      Total |   253.82759   139.49112       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,233         597           0        597        597

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,367
  CKD stage |          93           0         405
  CKD stage |          20           0          24
   Dialysis |          28           0          89
  Transplan |          83           0         311
  KRT uncle |           6           0          37
------------+------------------------------------
      Total |   197.59516   97.389792       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,233         504           0        504        504

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,367
  CKD stage |         105           0         405
  CKD stage |           5           0          24
   Dialysis |          13           0          89
  Transplan |          72           0         311
  KRT uncle |          30           0          37
------------+------------------------------------
      Total |    245.6283   135.16696       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,233         577           0        577        577

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         391           0       1,367
  CKD stage |          85           0         405
  CKD stage |           6           0          24
   Dialysis |          17           0          89
  Transplan |          72           0         311
  KRT uncle |           0           0          37
------------+------------------------------------
      Total |   265.54904   158.52476       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,233         571           0        571        571

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,367
  CKD stage |         130           0         405
  CKD stage |           3           0          24
   Dialysis |          22           0          89
  Transplan |          91           0         311
  KRT uncle |          10           0          37
------------+------------------------------------
      Total |    239.9588   117.20331       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,233         587           0        587        587

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,367
  CKD stage |         118           0         405
  CKD stage |           7           0          24
   Dialysis |          37           0          89
  Transplan |          90           0         311
  KRT uncle |          12           0          37
------------+------------------------------------
      Total |   244.43887   123.09523       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,233         605           0        605        605

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,367
  CKD stage |         106           0         405
  CKD stage |           4           0          24
   Dialysis |          29           0          89
  Transplan |          62           0         311
  KRT uncle |           6           0          37
------------+------------------------------------
      Total |   260.56292   148.98087       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,233         585           0        585        585

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,367
  CKD stage |          88           0         405
  CKD stage |           1           0          24
   Dialysis |          23           0          89
  Transplan |          54           0         311
  KRT uncle |          11           0          37
------------+------------------------------------
      Total |   206.40887   115.04317       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,233         474           0        474        474

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,367
  CKD stage |         116           0         405
  CKD stage |           8           0          24
   Dialysis |          34           0          89
  Transplan |          76           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |   259.07568   139.77213       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,233         610           0        610        610

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,367
  CKD stage |          94           0         405
  CKD stage |           0           0          24
   Dialysis |          31           0          89
  Transplan |          54           0         311
  KRT uncle |           6           0          37
------------+------------------------------------
      Total |   255.47246   151.26012       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,233         560           0        560        560

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,367
  CKD stage |         130           0         405
  CKD stage |           8           0          24
   Dialysis |           1           0          89
  Transplan |          97           0         311
  KRT uncle |           6           0          37
------------+------------------------------------
      Total |   244.23018   121.13258       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,233         580           0        580        580

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,367
  CKD stage |         109           0         405
  CKD stage |          15           0          24
   Dialysis |          14           0          89
  Transplan |          71           0         311
  KRT uncle |           2           0          37
------------+------------------------------------
      Total |   242.22481   132.25001       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         557           0        557        557

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,367
  CKD stage |          72           0         405
  CKD stage |           2           0          24
   Dialysis |          28           0          89
  Transplan |         104           0         311
  KRT uncle |          12           0          37
------------+------------------------------------
      Total |   211.30945   110.44541       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         516           0        516        516

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,367
  CKD stage |         118           0         405
  CKD stage |           5           0          24
   Dialysis |          23           0          89
  Transplan |          81           0         311
  KRT uncle |           6           0          37
------------+------------------------------------
      Total |   244.34304   127.31029       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         577           0        577        577

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,367
  CKD stage |          65           0         405
  CKD stage |           2           0          24
   Dialysis |          42           0          89
  Transplan |          61           0         311
  KRT uncle |           8           0          37
------------+------------------------------------
      Total |   218.01075   128.53786       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         498           0        498        498

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,367
  CKD stage |          85           0         405
  CKD stage |           7           0          24
   Dialysis |          16           0          89
  Transplan |         119           0         311
  KRT uncle |          11           0          37
------------+------------------------------------
      Total |   242.25123    127.3583       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,233         580           0        580        580

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,367
  CKD stage |         125           0         405
  CKD stage |          12           0          24
   Dialysis |          33           0          89
  Transplan |          68           0         311
  KRT uncle |           9           0          37
------------+------------------------------------
      Total |   238.20376   122.81037       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,233         581           0        581        581

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         405           0       1,367
  CKD stage |         103           0         405
  CKD stage |           1           0          24
   Dialysis |          29           0          89
  Transplan |          79           0         311
  KRT uncle |          22           0          37
------------+------------------------------------
      Total |   279.14823   159.17131       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,233         639           0        639        639

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,367
  CKD stage |         145           0         405
  CKD stage |           2           0          24
   Dialysis |           9           0          89
  Transplan |          62           0         311
  KRT uncle |          13           0          37
------------+------------------------------------
      Total |   247.95611   128.81011       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,233         578           0        578        578

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,367
  CKD stage |         113           0         405
  CKD stage |           5           0          24
   Dialysis |           8           0          89
  Transplan |          84           0         311
  KRT uncle |           8           0          37
------------+------------------------------------
      Total |   264.10345   145.02471       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,233         596           0        596        596

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         470           0       1,367
  CKD stage |         100           0         405
  CKD stage |           9           0          24
   Dialysis |           7           0          89
  Transplan |          91           0         311
  KRT uncle |          10           0          37
------------+------------------------------------
      Total |   319.07747    190.8092       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,233         687           0        687        687

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,367
  CKD stage |         130           0         405
  CKD stage |           3           0          24
   Dialysis |          29           0          89
  Transplan |          62           0         311
  KRT uncle |          10           0          37
------------+------------------------------------
      Total |   258.23735   139.32697       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,233         601           0        601        601

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         383           0       1,367
  CKD stage |         100           0         405
  CKD stage |           0           0          24
   Dialysis |           4           0          89
  Transplan |          63           0         311
  KRT uncle |          21           0          37
------------+------------------------------------
      Total |   261.88401   153.62933       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,233         571           0        571        571

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,367
  CKD stage |          98           0         405
  CKD stage |          11           0          24
   Dialysis |          23           0          89
  Transplan |          76           0         311
  KRT uncle |           1           0          37
------------+------------------------------------
      Total |   249.79579   139.70749       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         569           0        569        569

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,367
  CKD stage |          98           0         405
  CKD stage |           2           0          24
   Dialysis |          10           0          89
  Transplan |          71           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |   221.03583   119.75827       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         503           0        503        503

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,367
  CKD stage |          94           0         405
  CKD stage |           0           0          24
   Dialysis |          17           0          89
  Transplan |          88           0         311
  KRT uncle |           5           0          37
------------+------------------------------------
      Total |   255.34796    142.8412       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         572           0        572        572

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,367
  CKD stage |         120           0         405
  CKD stage |          13           0          24
   Dialysis |          33           0          89
  Transplan |          96           0         311
  KRT uncle |           9           0          37
------------+------------------------------------
      Total |   255.89969   130.09356       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         629           0        629        629

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,367
  CKD stage |          77           0         405
  CKD stage |           6           0          24
   Dialysis |          24           0          89
  Transplan |          56           0         311
  KRT uncle |          20           0          37
------------+------------------------------------
      Total |   263.70443   162.98675       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,233         576           0        576        576

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,367
  CKD stage |         141           0         405
  CKD stage |           7           0          24
   Dialysis |          48           0          89
  Transplan |          89           0         311
  KRT uncle |          19           0          37
------------+------------------------------------
      Total |   247.18898   116.82924       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,233         642           0        642        642

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,367
  CKD stage |         105           0         405
  CKD stage |           5           0          24
   Dialysis |          10           0          89
  Transplan |          61           0         311
  KRT uncle |          11           0          37
------------+------------------------------------
      Total |     227.133   124.91318       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,233         517           0        517        517

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,367
  CKD stage |          89           0         405
  CKD stage |           9           0          24
   Dialysis |          40           0          89
  Transplan |          69           0         311
  KRT uncle |          14           0          37
------------+------------------------------------
      Total |    213.1657   113.74316       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,233         524           0        524        524

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,367
  CKD stage |          92           0         405
  CKD stage |          15           0          24
   Dialysis |          25           0          89
  Transplan |          92           0         311
  KRT uncle |           0           0          37
------------+------------------------------------
      Total |   242.47156   131.31787       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,233         570           0        570        570

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         452           0       1,367
  CKD stage |         111           0         405
  CKD stage |           3           0          24
   Dialysis |          31           0          89
  Transplan |          73           0         311
  KRT uncle |          13           0          37
------------+------------------------------------
      Total |   308.48813   181.49075       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,233         683           0        683        683

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,367
  CKD stage |         115           0         405
  CKD stage |          11           0          24
   Dialysis |          32           0          89
  Transplan |          88           0         311
  KRT uncle |           5           0          37
------------+------------------------------------
      Total |   251.30228   130.73092       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,233         605           0        605        605

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         414           0       1,367
  CKD stage |         130           0         405
  CKD stage |           6           0          24
   Dialysis |          24           0          89
  Transplan |          70           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |    287.9073   160.68003       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,233         651           0        651        651

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,367
  CKD stage |         133           0         405
  CKD stage |           0           0          24
   Dialysis |          31           0          89
  Transplan |         116           0         311
  KRT uncle |           8           0          37
------------+------------------------------------
      Total |    266.9288   129.54622       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,233         656           0        656        656

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,367
  CKD stage |          97           0         405
  CKD stage |           8           0          24
   Dialysis |          20           0          89
  Transplan |         100           0         311
  KRT uncle |           2           0          37
------------+------------------------------------
      Total |   237.51724   124.13872       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,233         562           0        562        562

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,367
  CKD stage |         105           0         405
  CKD stage |           0           0          24
   Dialysis |          11           0          89
  Transplan |         101           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |    243.0309   126.38135       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,233         566           0        566        566

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,367
  CKD stage |          91           0         405
  CKD stage |           5           0          24
   Dialysis |          17           0          89
  Transplan |         101           0         311
  KRT uncle |           0           0          37
------------+------------------------------------
      Total |   239.44425   127.97014       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         554           0        554        554

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,367
  CKD stage |          79           0         405
  CKD stage |           1           0          24
   Dialysis |          13           0          89
  Transplan |          74           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |   216.89207   121.82523       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,233         487           0        487        487

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         251           0       1,367
  CKD stage |         133           0         405
  CKD stage |          14           0          24
   Dialysis |          19           0          89
  Transplan |          88           0         311
  KRT uncle |           6           0          37
------------+------------------------------------
      Total |   191.04299   79.858219       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,233         511           0        511        511

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,367
  CKD stage |         104           0         405
  CKD stage |           7           0          24
   Dialysis |           8           0          89
  Transplan |          84           0         311
  KRT uncle |          12           0          37
------------+------------------------------------
      Total |   250.92745   137.44908       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,233         574           0        574        574

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,367
  CKD stage |          67           0         405
  CKD stage |           1           0          24
   Dialysis |          29           0          89
  Transplan |          80           0         311
  KRT uncle |          12           0          37
------------+------------------------------------
      Total |   214.43529   120.81422       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,233         499           0        499        499

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,367
  CKD stage |          90           0         405
  CKD stage |           8           0          24
   Dialysis |          30           0          89
  Transplan |         106           0         311
  KRT uncle |          16           0          37
------------+------------------------------------
      Total |   246.89655   130.83085       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,233         600           0        600        600

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         423           0       1,367
  CKD stage |          95           0         405
  CKD stage |           8           0          24
   Dialysis |          14           0          89
  Transplan |          79           0         311
  KRT uncle |          11           0          37
------------+------------------------------------
      Total |   288.01164   170.63363       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,233         630           0        630        630

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,367
  CKD stage |         122           0         405
  CKD stage |           8           0          24
   Dialysis |          30           0          89
  Transplan |          77           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |   266.26556   143.55767       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,233         623           0        623        623

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,367
  CKD stage |          65           0         405
  CKD stage |           4           0          24
   Dialysis |          12           0          89
  Transplan |          94           0         311
  KRT uncle |          12           0          37
------------+------------------------------------
      Total |   198.84819    107.2321       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,233         470           0        470        470

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,367
  CKD stage |         115           0         405
  CKD stage |           7           0          24
   Dialysis |          13           0          89
  Transplan |         108           0         311
  KRT uncle |           5           0          37
------------+------------------------------------
      Total |   267.36767   139.86691       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         625           0        625        625

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,367
  CKD stage |         101           0         405
  CKD stage |           8           0          24
   Dialysis |          10           0          89
  Transplan |          83           0         311
  KRT uncle |          12           0          37
------------+------------------------------------
      Total |   255.23197   141.90269       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         581           0        581        581

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,367
  CKD stage |          84           0         405
  CKD stage |           9           0          24
   Dialysis |          40           0          89
  Transplan |          79           0         311
  KRT uncle |           8           0          37
------------+------------------------------------
      Total |   239.26377   133.56772       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         565           0        565        565

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         272           0       1,367
  CKD stage |         118           0         405
  CKD stage |           7           0          24
   Dialysis |          21           0          89
  Transplan |         101           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |   203.00985    89.70648       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         526           0        526        526

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,367
  CKD stage |         116           0         405
  CKD stage |           7           0          24
   Dialysis |          25           0          89
  Transplan |          64           0         311
  KRT uncle |          18           0          37
------------+------------------------------------
      Total |   267.01209   149.98976       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,233         615           0        615        615

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,367
  CKD stage |          71           0         405
  CKD stage |           9           0          24
   Dialysis |           5           0          89
  Transplan |          50           0         311
  KRT uncle |          17           0          37
------------+------------------------------------
      Total |   210.80699   126.67866       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,233         463           0        463        463

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         396           0       1,367
  CKD stage |         118           0         405
  CKD stage |           8           0          24
   Dialysis |          29           0          89
  Transplan |          58           0         311
  KRT uncle |          14           0          37
------------+------------------------------------
      Total |   273.37707   155.90703       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,233         623           0        623        623

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,367
  CKD stage |         119           0         405
  CKD stage |          10           0          24
   Dialysis |          20           0          89
  Transplan |         114           0         311
  KRT uncle |          21           0          37
------------+------------------------------------
      Total |   267.05643   135.14394       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,233         657           0        657        657

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,367
  CKD stage |         108           0         405
  CKD stage |           4           0          24
   Dialysis |          21           0          89
  Transplan |         101           0         311
  KRT uncle |           8           0          37
------------+------------------------------------
      Total |   280.15181   153.36183       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,233         643           0        643        643

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,367
  CKD stage |          94           0         405
  CKD stage |           4           0          24
   Dialysis |          41           0          89
  Transplan |          85           0         311
  KRT uncle |           1           0          37
------------+------------------------------------
      Total |   244.84416   133.14457       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,233         575           0        575        575

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         398           0       1,367
  CKD stage |          99           0         405
  CKD stage |          10           0          24
   Dialysis |          20           0          89
  Transplan |          89           0         311
  KRT uncle |           5           0          37
------------+------------------------------------
      Total |   274.98657   155.76713       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,233         621           0        621        621

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,367
  CKD stage |         114           0         405
  CKD stage |           7           0          24
   Dialysis |           5           0          89
  Transplan |          60           0         311
  KRT uncle |          10           0          37
------------+------------------------------------
      Total |   258.42857   147.36171       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,233         570           0        570        570

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         400           0       1,367
  CKD stage |          85           0         405
  CKD stage |           2           0          24
   Dialysis |          15           0          89
  Transplan |          95           0         311
  KRT uncle |           0           0          37
------------+------------------------------------
      Total |   274.13927   159.32463       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,233         597           0        597        597

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,367
  CKD stage |          99           0         405
  CKD stage |          11           0          24
   Dialysis |          12           0          89
  Transplan |          78           0         311
  KRT uncle |           1           0          37
------------+------------------------------------
      Total |   222.26914   118.23008       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,233         516           0        516        516

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,367
  CKD stage |         123           0         405
  CKD stage |           0           0          24
   Dialysis |          16           0          89
  Transplan |         101           0         311
  KRT uncle |          21           0          37
------------+------------------------------------
      Total |   252.84863   126.91985       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,233         613           0        613        613

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,367
  CKD stage |         140           0         405
  CKD stage |           0           0          24
   Dialysis |          28           0          89
  Transplan |          58           0         311
  KRT uncle |          17           0          37
------------+------------------------------------
      Total |   222.19481   109.61951       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         549           0        549        549

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,367
  CKD stage |          99           0         405
  CKD stage |           8           0          24
   Dialysis |          34           0          89
  Transplan |         101           0         311
  KRT uncle |           8           0          37
------------+------------------------------------
      Total |   232.55486   117.61044       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,233         575           0        575        575

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         427           0       1,367
  CKD stage |         103           0         405
  CKD stage |           3           0          24
   Dialysis |          19           0          89
  Transplan |          88           0         311
  KRT uncle |           8           0          37
------------+------------------------------------
      Total |   293.26064   169.25605       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,233         648           0        648        648

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,367
  CKD stage |          78           0         405
  CKD stage |           0           0          24
   Dialysis |          32           0          89
  Transplan |          74           0         311
  KRT uncle |          11           0          37
------------+------------------------------------
      Total |   222.42096   124.59754       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,233         516           0        516        516

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         399           0       1,367
  CKD stage |         105           0         405
  CKD stage |           4           0          24
   Dialysis |          27           0          89
  Transplan |          82           0         311
  KRT uncle |          10           0          37
------------+------------------------------------
      Total |    276.0094   155.74486       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,233         627           0        627        627

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         452           0       1,367
  CKD stage |         134           0         405
  CKD stage |          12           0          24
   Dialysis |          17           0          89
  Transplan |          75           0         311
  KRT uncle |          11           0          37
------------+------------------------------------
      Total |    312.4438   177.53641       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,233         701           0        701        701

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,367
  CKD stage |          91           0         405
  CKD stage |           5           0          24
   Dialysis |          38           0          89
  Transplan |         106           0         311
  KRT uncle |          20           0          37
------------+------------------------------------
      Total |   250.49172   132.45046       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,233         615           0        615        615

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,367
  CKD stage |          96           0         405
  CKD stage |           8           0          24
   Dialysis |          19           0          89
  Transplan |          86           0         311
  KRT uncle |          13           0          37
------------+------------------------------------
      Total |   237.36498   127.76006       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,233         560           0        560        560

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,367
  CKD stage |         110           0         405
  CKD stage |          11           0          24
   Dialysis |          36           0          89
  Transplan |          93           0         311
  KRT uncle |           4           0          37
------------+------------------------------------
      Total |   218.17689    104.6538       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,233         554           0        554        554

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,367
  CKD stage |         114           0         405
  CKD stage |           6           0          24
   Dialysis |          24           0          89
  Transplan |          92           0         311
  KRT uncle |           3           0          37
------------+------------------------------------
      Total |   262.29154   139.59701       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         611           0        611        611

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,367
  CKD stage |         108           0         405
  CKD stage |           7           0          24
   Dialysis |          12           0          89
  Transplan |          44           0         311
  KRT uncle |          15           0          37
------------+------------------------------------
      Total |   202.82624   109.72135       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         474           0        474        474

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,367
  CKD stage |         114           0         405
  CKD stage |           6           0          24
   Dialysis |          42           0          89
  Transplan |          73           0         311
  KRT uncle |          16           0          37
------------+------------------------------------
      Total |    242.8249   127.43639       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         594           0        594        594

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,367
  CKD stage |          79           0         405
  CKD stage |           0           0          24
   Dialysis |          20           0          89
  Transplan |         125           0         311
  KRT uncle |           5           0          37
------------+------------------------------------
      Total |   253.61487   137.08537       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,233         590           0        590        590

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,367
  CKD stage |         114           0         405
  CKD stage |          12           0          24
   Dialysis |          36           0          89
  Transplan |          97           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |   272.16749   144.45847       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,233         652           0        652        652

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         398           0       1,367
  CKD stage |          97           0         405
  CKD stage |          21           0          24
   Dialysis |          22           0          89
  Transplan |          71           0         311
  KRT uncle |           7           0          37
------------+------------------------------------
      Total |   272.34796   158.88121       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,233         616           0        616        616

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(80 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(76 real changes made)

. replace ethnicity=4 if ethnicity==6
(80 real changes made)

. replace ethnicity=6 if ethnicity==.
(578 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,997 missing values generated)

. replace region = 2 if region_string=="East"
(210 real changes made)

. replace region = 3 if region_string=="London"
(448 real changes made)

. replace region = 4 if region_string=="North East"
(238 real changes made)

. replace region = 5 if region_string=="North West"
(222 real changes made)

. replace region = 6 if region_string=="South East"
(242 real changes made)

. replace region = 7 if region_string=="South West"
(210 real changes made)

. replace region = 8 if region_string=="West Midlands"
(202 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(225 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,233 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(860 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,373 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2019_ckd_complete.dta not found)
file ./output/2019_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,727
        from master                       497  (_merge==1)
        from using                      2,230  (_merge==2)

    matched                                 3  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(497 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,367
  CKD stage |           0           0         405
  CKD stage |           0           0          24
   Dialysis |           0           0          89
  Transplan |           0           0         311
  KRT uncle |           0           0          37
------------+------------------------------------
      Total |           0           0       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,233           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,367
  CKD stage |           0           0         405
  CKD stage |           0           0          24
   Dialysis |           0           0          89
  Transplan |           0           0         311
  KRT uncle |           0           0          37
------------+------------------------------------
      Total |           0           0       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,233           0           0          0          0

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,367
  CKD stage |           0           0         405
  CKD stage |           0           0          24
   Dialysis |           0           0          89
  Transplan |           0           0         311
  KRT uncle |           0           0          37
------------+------------------------------------
      Total |           0           0       2,233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,233           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2019_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete.log
  log type:  text
 closed on:  20 Sep 2023, 14:23:17
-------------------------------------------------------------------------------
