-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd.log
  log type:  text
 opened on:  16 Dec 2022, 19:36:15

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,414 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,988 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,781 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,421       10.12       10.12
           East Midlands |      3,355        9.92       20.04
                  London |      6,769       20.02       40.05
              North East |      3,491       10.32       50.38
              North West |      3,297        9.75       60.13
              South East |      3,366        9.95       70.08
              South West |      3,420       10.11       80.19
           West Midlands |      3,416       10.10       90.29
Yorkshire and The Humber |      3,282        9.71      100.00
-------------------------+-----------------------------------
                   Total |     33,817      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,672        4.94        4.94
          1 |      6,450       19.07       24.02
          2 |      6,404       18.94       42.95
          3 |      6,479       19.16       62.11
          4 |      6,425       19.00       81.11
          5 |      6,387       18.89      100.00
------------+-----------------------------------
      Total |     33,817      100.00

. drop if imd==0
(1,672 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,067 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(803 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(766 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,056 real changes made, 14,056 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,056 missing values generated)

. gen min_baseline_creatinine=.
(32,145 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,275 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,814 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,275 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,814 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,476 real changes made)

. gen max_baseline_creatinine=.
(32,145 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,275 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,814 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,089 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,669 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,056 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,089 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,275 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,729 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,145
25%            0              0       Sum of Wgt.      32,145

50%            0                      Mean           12.50411
                        Largest       Std. Dev.      12.99501
75%     24.99165       43.30474
90%     29.21051       43.66942       Variance       168.8704
95%     31.41501       44.23431       Skewness       .2133694
99%     35.25118       46.99666       Kurtosis       1.301683

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,571        5.43        5.43
         <= |      1,552        5.36       10.79
          = |     20,975       72.48       83.27
          > |      1,675        5.79       89.06
         >= |      1,588        5.49       94.55
          ~ |      1,578        5.45      100.00
------------+-----------------------------------
      Total |     28,939      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,647       54.90       54.90
          1 |     14,498       45.10      100.00
------------+-----------------------------------
      Total |     32,145      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,918       46.41       46.41
          1 |     17,227       53.59      100.00
------------+-----------------------------------
      Total |     32,145      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,511       94.92       94.92
          1 |      1,634        5.08      100.00
------------+-----------------------------------
      Total |     32,145      100.00
(779 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,546       95.03       95.03
          1 |      1,599        4.97      100.00
------------+-----------------------------------
      Total |     32,145      100.00
(708 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,530       94.98       94.98
          1 |      1,615        5.02      100.00
------------+-----------------------------------
      Total |     32,145      100.00
(647 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,523       94.95       94.95
          1 |      1,622        5.05      100.00
------------+-----------------------------------
      Total |     32,145      100.00
(644 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,503       94.89       94.89
          1 |      1,642        5.11      100.00
------------+-----------------------------------
      Total |     32,145      100.00
(629 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,549       95.03       95.03
          1 |      1,596        4.97      100.00
------------+-----------------------------------
      Total |     32,145      100.00
(557 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,954       34.08       34.08
          1 |     21,191       65.92      100.00
------------+-----------------------------------
      Total |     32,145      100.00

. drop if ckd==0
(10,954 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2019_ckd.csv not found)
file ./output/2019_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd.log
  log type:  text
 closed on:  16 Dec 2022, 19:36:20
-------------------------------------------------------------------------------
