-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete.log
  log type:  text
 opened on:  12 Sep 2023, 14:35:24

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 21,041 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(235 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,833
        from master                    47,896  (_merge==1)
        from using                     18,937  (_merge==2)

    matched                             2,104  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,833 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        208        9.89        9.89
Kidney transplant |        193        9.17       19.06
 Modality unclear |         38        1.81       20.87
          Pre KRT |      1,665       79.13      100.00
------------------+-----------------------------------
            Total |      2,104      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(823 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1281 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,281       60.88       60.88
          . |        823       39.12      100.00
------------+-----------------------------------
      Total |      2,104      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(208 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(24 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(150 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(289 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(11 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(38 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(0 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       126         82 |       208 
Kidney transplant |       193          0 |       193 
 Modality unclear |        38          0 |        38 
          Pre KRT |     1,665          0 |     1,665 
------------------+----------------------+----------
            Total |     2,022         82 |     2,104 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       190         18 |       208 
Kidney transplant |       162         31 |       193 
 Modality unclear |        38          0 |        38 
          Pre KRT |     1,436        229 |     1,665 
------------------+----------------------+----------
            Total |     1,826        278 |     2,104 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       208          0 |       208 
Kidney transplant |       193          0 |       193 
 Modality unclear |         0         38 |        38 
          Pre KRT |     1,665          0 |     1,665 
------------------+----------------------+----------
            Total |     2,066         38 |     2,104 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,744        278 |     2,022 
         1 |        82          0 |        82 
-----------+----------------------+----------
     Total |     1,826        278 |     2,104 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(823 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1281 changes made)

. replace ckd_group = 4 if dialysis==1
(82 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(278 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(38 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(627 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,273       60.50       60.50
         CKD stage 3 |        416       19.77       80.28
       CKD stage 4/5 |         17        0.81       81.08
            Dialysis |         82        3.90       84.98
          Transplant |        278       13.21       98.19
KRT unclear modality |         38        1.81      100.00
---------------------+-----------------------------------
               Total |      2,104      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        64        126          0      1,083 |     1,273 
         CKD stage 3 |        44         35          0        337 |       416 
       CKD stage 4/5 |         0          1          0         16 |        17 
            Dialysis |        82          0          0          0 |        82 
          Transplant |        18         31          0        229 |       278 
KRT unclear modality |         0          0         38          0 |        38 
---------------------+--------------------------------------------+----------
               Total |       208        193         38      1,665 |     2,104 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       132         68         61          8 |     1,273 
         CKD stage 3 |        28         23         21          2 |       416 
       CKD stage 4/5 |         2          0          3          0 |        17 
            Dialysis |         7          6          2          0 |        82 
          Transplant |        25         17          7          2 |       278 
KRT unclear modality |         1          1          0          0 |        38 
---------------------+--------------------------------------------+----------
               Total |       195        115         94         12 |     2,104 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,004 |     1,273 
         CKD stage 3 |       342 |       416 
       CKD stage 4/5 |        12 |        17 
            Dialysis |        67 |        82 
          Transplant |       227 |       278 
KRT unclear modality |        36 |        38 
---------------------+-----------+----------
               Total |     1,688 |     2,104 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,108 missing values generated)

. replace sex = 0 if male == "Female"
(1,108 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(967 real changes made, 967 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(967 missing values generated)

. gen min_creatinine_outcome=.
(2,104 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(592 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(545 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(592 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(545 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(739 real changes made)

. gen max_creatinine_outcome=.
(2,104 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(592 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(545 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,137 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,365 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(967 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,137 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(592 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(967 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1137 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(176 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(8 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(3 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(967 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1137 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,137       54.04       54.04
          . |        967       45.96      100.00
------------+-----------------------------------
      Total |      2,104      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(115 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(94 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(9 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(12 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(115 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(103 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(195 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,544       73.38       73.38
               CKD 3 |        136        6.46       79.85
     CKD 4/5 pre-KRT |          8        0.38       80.23
            Dialysis |        115        5.47       85.69
   Kidney transplant |        103        4.90       90.59
KRT unclear modality |          3        0.14       90.73
            Deceased |        195        9.27      100.00
---------------------+-----------------------------------
               Total |      2,104      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(823 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1281 changes made)

. replace access_egfr=0 if ckd_group==4
(82 real changes made)

. replace access_egfr=3 if access_egfr==.
(741 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,273
  CKD stage |          86           0         416
  CKD stage |           3           0          17
   Dialysis |          14           0          82
  Transplan |          70           0         278
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   218.71008   122.84407       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,104         495           0        495        495

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,273
  CKD stage |          79           0         416
  CKD stage |           1           0          17
   Dialysis |          16           0          82
  Transplan |          59           0         278
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   240.90352   145.69525       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,104         527           0        527        527

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,273
  CKD stage |         128           0         416
  CKD stage |           0           0          17
   Dialysis |           9           0          82
  Transplan |          85           0         278
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   237.79848   119.77353       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,104         556           0        556        556

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,273
  CKD stage |         110           0         416
  CKD stage |           8           0          17
   Dialysis |          21           0          82
  Transplan |          52           0         278
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   213.59696   114.30916       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,104         504           0        504        504

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,273
  CKD stage |         102           0         416
  CKD stage |           6           0          17
   Dialysis |          15           0          82
  Transplan |          73           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   241.14354    133.7992       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,104         552           0        552        552

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,273
  CKD stage |          92           0         416
  CKD stage |           7           0          17
   Dialysis |          36           0          82
  Transplan |          46           0         278
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   211.63688   119.35776       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,104         497           0        497        497

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,273
  CKD stage |          98           0         416
  CKD stage |           0           0          17
   Dialysis |          14           0          82
  Transplan |          72           0         278
  KRT uncle |          21           0          38
------------+------------------------------------
      Total |    231.2923   127.29134       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,104         538           0        538        538

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,273
  CKD stage |          94           0         416
  CKD stage |           8           0          17
   Dialysis |          29           0          82
  Transplan |          71           0         278
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   242.35171   136.71197       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,104         566           0        566        566

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,273
  CKD stage |          95           0         416
  CKD stage |           6           0          17
   Dialysis |          35           0          82
  Transplan |          41           0         278
  KRT uncle |          20           0          38
------------+------------------------------------
      Total |   209.90589   117.99621       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,104         501           0        501        501

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,273
  CKD stage |         145           0         416
  CKD stage |           8           0          17
   Dialysis |          15           0          82
  Transplan |          79           0         278
  KRT uncle |          18           0          38
------------+------------------------------------
      Total |    227.0385   105.94943       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,104         574           0        574        574

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,273
  CKD stage |         139           0         416
  CKD stage |           7           0          17
   Dialysis |          22           0          82
  Transplan |          60           0         278
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   236.05941   120.36119       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,104         562           0        562        562

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,273
  CKD stage |         108           0         416
  CKD stage |           6           0          17
   Dialysis |          27           0          82
  Transplan |          62           0         278
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   218.47909   115.17034       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,104         528           0        528        528

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         259           0       1,273
  CKD stage |          96           0         416
  CKD stage |          15           0          17
   Dialysis |          34           0          82
  Transplan |          70           0         278
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   186.59791   91.053813       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,104         486           0        486        486

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,273
  CKD stage |         108           0         416
  CKD stage |           0           0          17
   Dialysis |          21           0          82
  Transplan |          59           0         278
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   243.83508   136.87398       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,104         557           0        557        557

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,273
  CKD stage |         114           0         416
  CKD stage |           3           0          17
   Dialysis |          29           0          82
  Transplan |         102           0         278
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   243.76046   122.16176       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,104         604           0        604        604

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,273
  CKD stage |         100           0         416
  CKD stage |          13           0          17
   Dialysis |          32           0          82
  Transplan |          42           0         278
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   208.40162   115.25033       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,104         499           0        499        499

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,273
  CKD stage |         127           0         416
  CKD stage |           3           0          17
   Dialysis |          18           0          82
  Transplan |          89           0         278
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   261.51378   136.73915       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,104         610           0        610        610

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,273
  CKD stage |         133           0         416
  CKD stage |           2           0          17
   Dialysis |          22           0          82
  Transplan |          72           0         278
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   225.63593   110.42712       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,104         551           0        551        551

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,273
  CKD stage |         128           0         416
  CKD stage |           2           0          17
   Dialysis |          34           0          82
  Transplan |          81           0         278
  KRT uncle |          18           0          38
------------+------------------------------------
      Total |   255.49049   131.54094       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,104         623           0        623        623

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,273
  CKD stage |         107           0         416
  CKD stage |           3           0          17
   Dialysis |          11           0          82
  Transplan |          82           0         278
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   242.46388   131.25805       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,104         554           0        554        554

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,273
  CKD stage |          88           0         416
  CKD stage |           2           0          17
   Dialysis |          25           0          82
  Transplan |          55           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   245.43013   146.47824       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,104         541           0        541        541

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,273
  CKD stage |          99           0         416
  CKD stage |           2           0          17
   Dialysis |           9           0          82
  Transplan |          94           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   226.72291    118.5614       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,104         533           0        533        533

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,273
  CKD stage |         120           0         416
  CKD stage |           0           0          17
   Dialysis |          19           0          82
  Transplan |          79           0         278
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   228.71578   115.49609       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,104         549           0        549        549

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,273
  CKD stage |         123           0         416
  CKD stage |           0           0          17
   Dialysis |          18           0          82
  Transplan |          42           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   218.88165   117.70911       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,104         502           0        502        502

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,273
  CKD stage |         145           0         416
  CKD stage |           6           0          17
   Dialysis |           9           0          82
  Transplan |          70           0         278
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   207.37595   94.380447       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,104         523           0        523        523

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,273
  CKD stage |          93           0         416
  CKD stage |           0           0          17
   Dialysis |          21           0          82
  Transplan |          64           0         278
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   257.00808   152.10075       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         559           0        559        559

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,273
  CKD stage |         135           0         416
  CKD stage |          -2           0          17
   Dialysis |          42           0          82
  Transplan |          98           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   213.23669   90.974296       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         565           0        565        565

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,273
  CKD stage |         108           0         416
  CKD stage |           5           0          17
   Dialysis |          20           0          82
  Transplan |          62           0         278
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |    228.5019   123.79332       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         538           0        538        538

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,273
  CKD stage |          75           0         416
  CKD stage |           5           0          17
   Dialysis |          23           0          82
  Transplan |          90           0         278
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |    259.0347   152.99835       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         589           0        589        589

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         398           0       1,273
  CKD stage |          89           0         416
  CKD stage |           0           0          17
   Dialysis |          33           0          82
  Transplan |          77           0         278
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   270.02471   159.16207       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         606           0        606        606

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         273           0       1,273
  CKD stage |          71           0         416
  CKD stage |           8           0          17
   Dialysis |           7           0          82
  Transplan |          63           0         278
  KRT uncle |          29           0          38
------------+------------------------------------
      Total |   188.39876   105.55954       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,104         451           0        451        451

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,273
  CKD stage |         143           0         416
  CKD stage |          15           0          17
   Dialysis |          20           0          82
  Transplan |          75           0         278
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   243.64116   120.71379       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,104         594           0        594        594

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,273
  CKD stage |         126           0         416
  CKD stage |           0           0          17
   Dialysis |          12           0          82
  Transplan |          86           0         278
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   219.14876   104.51079       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,104         541           0        541        541

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,273
  CKD stage |         102           0         416
  CKD stage |          11           0          17
   Dialysis |          21           0          82
  Transplan |          80           0         278
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   207.30466   104.09932       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,104         515           0        515        515

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,273
  CKD stage |         125           0         416
  CKD stage |           3           0          17
   Dialysis |          11           0          82
  Transplan |          78           0         278
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   233.32129   119.00434       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,104         544           0        544        544

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,273
  CKD stage |          57           0         416
  CKD stage |          10           0          17
   Dialysis |          30           0          82
  Transplan |          75           0         278
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   210.17205   124.10676       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,104         492           0        492        492

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,273
  CKD stage |         131           0         416
  CKD stage |           3           0          17
   Dialysis |          41           0          82
  Transplan |          91           0         278
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   221.95247   100.58022       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,104         583           0        583        583

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,273
  CKD stage |         116           0         416
  CKD stage |           5           0          17
   Dialysis |          23           0          82
  Transplan |          88           0         278
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   257.60266    137.2825       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         602           0        602        602

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,273
  CKD stage |         129           0         416
  CKD stage |           4           0          17
   Dialysis |           7           0          82
  Transplan |          50           0         278
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   232.84743   125.30829       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         530           0        530        530

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,273
  CKD stage |         136           0         416
  CKD stage |          11           0          17
   Dialysis |          17           0          82
  Transplan |          87           0         278
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   247.37785   122.79709       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         601           0        601        601

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,273
  CKD stage |          92           0         416
  CKD stage |           0           0          17
   Dialysis |          17           0          82
  Transplan |          67           0         278
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   211.19439    115.0239       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         488           0        488        488

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,273
  CKD stage |         111           0         416
  CKD stage |          15           0          17
   Dialysis |          18           0          82
  Transplan |          96           0         278
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   227.55798   112.67885       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         574           0        574        574

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         276           0       1,273
  CKD stage |         120           0         416
  CKD stage |           4           0          17
   Dialysis |          26           0          82
  Transplan |          69           0         278
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   200.95152   95.995951       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,104         499           0        499        499

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,273
  CKD stage |          89           0         416
  CKD stage |           5           0          17
   Dialysis |          23           0          82
  Transplan |          74           0         278
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   247.53375    142.6043       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,104         564           0        564        564

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,273
  CKD stage |         132           0         416
  CKD stage |          19           0          17
   Dialysis |          47           0          82
  Transplan |          65           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   222.56369   107.65037       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,104         578           0        578        578

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,273
  CKD stage |         104           0         416
  CKD stage |           3           0          17
   Dialysis |          14           0          82
  Transplan |          63           0         278
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   239.56749    134.6855       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,104         540           0        540        540

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,273
  CKD stage |         102           0         416
  CKD stage |           7           0          17
   Dialysis |          24           0          82
  Transplan |          99           0         278
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   231.18441   117.67591       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,104         574           0        574        574

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         275           0       1,273
  CKD stage |         122           0         416
  CKD stage |           0           0          17
   Dialysis |          32           0          82
  Transplan |         103           0         278
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   205.38165   89.233915       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,104         533           0        533        533

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,273
  CKD stage |         151           0         416
  CKD stage |           5           0          17
   Dialysis |           7           0          82
  Transplan |          22           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   236.51283   130.19796       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,104         529           0        529        529

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,273
  CKD stage |          99           0         416
  CKD stage |           3           0          17
   Dialysis |          39           0          82
  Transplan |          67           0         278
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   226.12975   122.38517       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,104         539           0        539        539

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,273
  CKD stage |          69           0         416
  CKD stage |           3           0          17
   Dialysis |          19           0          82
  Transplan |          65           0         278
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   244.01521    150.2965       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,104         531           0        531        531

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,273
  CKD stage |         109           0         416
  CKD stage |           8           0          17
   Dialysis |          23           0          82
  Transplan |          48           0         278
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   228.07462   127.10502       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,104         526           0        526        526

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,273
  CKD stage |         115           0         416
  CKD stage |           0           0          17
   Dialysis |          17           0          82
  Transplan |          84           0         278
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   240.97956   125.89944       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         566           0        566        566

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,273
  CKD stage |          98           0         416
  CKD stage |           8           0          17
   Dialysis |          14           0          82
  Transplan |          59           0         278
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   193.83365   101.13488       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         468           0        468        468

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,273
  CKD stage |          96           0         416
  CKD stage |           2           0          17
   Dialysis |          20           0          82
  Transplan |          40           0         278
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   212.19914   121.65197       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,104         477           0        477        477

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,273
  CKD stage |         101           0         416
  CKD stage |           2           0          17
   Dialysis |          21           0          82
  Transplan |          53           0         278
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |    234.8384   134.28742       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,104         525           0        525        525

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,273
  CKD stage |         122           0         416
  CKD stage |           1           0          17
   Dialysis |          16           0          82
  Transplan |          53           0         278
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   215.20913   112.08838       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,104         502           0        502        502

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,273
  CKD stage |         113           0         416
  CKD stage |           0           0          17
   Dialysis |          21           0          82
  Transplan |          65           0         278
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   245.58032   134.89173       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,104         566           0        566        566

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,273
  CKD stage |         103           0         416
  CKD stage |           2           0          17
   Dialysis |          46           0          82
  Transplan |          73           0         278
  KRT uncle |          18           0          38
------------+------------------------------------
      Total |   213.05086   107.68433       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,104         541           0        541        541

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,273
  CKD stage |         137           0         416
  CKD stage |          -2           0          17
   Dialysis |          21           0          82
  Transplan |          51           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   239.27567   126.29222       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,104         553           0        553        553

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,273
  CKD stage |         132           0         416
  CKD stage |           0           0          17
   Dialysis |          16           0          82
  Transplan |          87           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   231.97433   112.27672       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,104         563           0        563        563

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,273
  CKD stage |         115           0         416
  CKD stage |           0           0          17
   Dialysis |          15           0          82
  Transplan |          57           0         278
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   246.92443   138.57171       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         548           0        548        548

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,273
  CKD stage |         113           0         416
  CKD stage |           4           0          17
   Dialysis |          17           0          82
  Transplan |         112           0         278
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   244.24382   122.06722       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         592           0        592        592

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,273
  CKD stage |          85           0         416
  CKD stage |           1           0          17
   Dialysis |          19           0          82
  Transplan |          72           0         278
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   203.35076   109.63375       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         480           0        480        480

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,273
  CKD stage |          96           0         416
  CKD stage |           9           0          17
   Dialysis |          30           0          82
  Transplan |          72           0         278
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   256.89639   147.12217       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         597           0        597        597

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,273
  CKD stage |          76           0         416
  CKD stage |           5           0          17
   Dialysis |          39           0          82
  Transplan |          65           0         278
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   247.53137   148.30917       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         569           0        569        569

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,273
  CKD stage |          90           0         416
  CKD stage |           7           0          17
   Dialysis |          20           0          82
  Transplan |          75           0         278
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   233.11549   130.95153       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,104         534           0        534        534

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,273
  CKD stage |          80           0         416
  CKD stage |          16           0          17
   Dialysis |           9           0          82
  Transplan |          73           0         278
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   221.56892   126.54946       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,104         512           0        512        512

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,273
  CKD stage |          79           0         416
  CKD stage |           2           0          17
   Dialysis |          14           0          82
  Transplan |          55           0         278
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |    231.2115    139.2011       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,104         506           0        506        506

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,273
  CKD stage |         111           0         416
  CKD stage |           2           0          17
   Dialysis |          20           0          82
  Transplan |          79           0         278
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   268.04373   150.08362       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,104         606           0        606        606

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,273
  CKD stage |          98           0         416
  CKD stage |           4           0          17
   Dialysis |          30           0          82
  Transplan |          71           0         278
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   240.81939   133.76258       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,104         568           0        568        568

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,273
  CKD stage |         121           0         416
  CKD stage |           5           0          17
   Dialysis |          25           0          82
  Transplan |          55           0         278
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   227.22671   120.12026       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,104         539           0        539        539

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,273
  CKD stage |         100           0         416
  CKD stage |           3           0          17
   Dialysis |          41           0          82
  Transplan |          67           0         278
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   239.05703   132.32875       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,104         560           0        560        560

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,273
  CKD stage |          96           0         416
  CKD stage |           0           0          17
   Dialysis |          28           0          82
  Transplan |          63           0         278
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   261.39021   154.09581       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,104         575           0        575        575

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,273
  CKD stage |         123           0         416
  CKD stage |           0           0          17
   Dialysis |          36           0          82
  Transplan |          73           0         278
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   234.01901   118.66888       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,104         571           0        571        571

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,273
  CKD stage |         116           0         416
  CKD stage |           0           0          17
   Dialysis |          43           0          82
  Transplan |          87           0         278
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   248.52899   128.51183       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,104         600           0        600        600

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,273
  CKD stage |         119           0         416
  CKD stage |           6           0          17
   Dialysis |          42           0          82
  Transplan |          86           0         278
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   270.28422   144.74898       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         648           0        648        648

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,273
  CKD stage |          92           0         416
  CKD stage |           1           0          17
   Dialysis |          16           0          82
  Transplan |          84           0         278
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   267.97148    155.7889       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         601           0        601        601

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,273
  CKD stage |         116           0         416
  CKD stage |           0           0          17
   Dialysis |          33           0          82
  Transplan |          62           0         278
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   247.41873   135.11483       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,104         578           0        578        578

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,273
  CKD stage |          90           0         416
  CKD stage |           5           0          17
   Dialysis |          13           0          82
  Transplan |          63           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   235.54848   136.65404       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,104         524           0        524        524

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,273
  CKD stage |          63           0         416
  CKD stage |           6           0          17
   Dialysis |          14           0          82
  Transplan |          81           0         278
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   229.00523   136.95921       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,104         511           0        511        511

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,273
  CKD stage |          90           0         416
  CKD stage |           0           0          17
   Dialysis |          17           0          82
  Transplan |          68           0         278
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   203.58032   109.63589       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,104         470           0        470        470

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,273
  CKD stage |         110           0         416
  CKD stage |           0           0          17
   Dialysis |          12           0          82
  Transplan |          54           0         278
  KRT uncle |          21           0          38
------------+------------------------------------
      Total |   207.00713   109.02692       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,104         490           0        490        490

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,273
  CKD stage |          83           0         416
  CKD stage |           3           0          17
   Dialysis |          13           0          82
  Transplan |          63           0         278
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   210.09125   118.53182       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,104         483           0        483        483

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,273
  CKD stage |         123           0         416
  CKD stage |           0           0          17
   Dialysis |          35           0          82
  Transplan |          57           0         278
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |    221.4539   113.81043       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,104         530           0        530        530

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,273
  CKD stage |          75           0         416
  CKD stage |           6           0          17
   Dialysis |          12           0          82
  Transplan |          61           0         278
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   212.85409   124.84201       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         471           0        471        471

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,273
  CKD stage |          99           0         416
  CKD stage |          10           0          17
   Dialysis |          17           0          82
  Transplan |          64           0         278
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   251.64449   145.31164       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         570           0        570        570

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         273           0       1,273
  CKD stage |         113           0         416
  CKD stage |           9           0          17
   Dialysis |          14           0          82
  Transplan |          98           0         278
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   201.21103   91.726864       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         514           0        514        514

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,273
  CKD stage |          81           0         416
  CKD stage |           5           0          17
   Dialysis |          25           0          82
  Transplan |          78           0         278
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   238.54848   137.56338       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,104         541           0        541        541

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,273
  CKD stage |         105           0         416
  CKD stage |           2           0          17
   Dialysis |          15           0          82
  Transplan |         100           0         278
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   212.49144   103.24501       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,104         518           0        518        518

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,273
  CKD stage |         114           0         416
  CKD stage |           0           0          17
   Dialysis |          29           0          82
  Transplan |          63           0         278
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   223.38498   116.83856       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,104         533           0        533        533

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(97 real changes made)

. replace ethnicity=2 if ethnicity==3
(82 real changes made)

. replace ethnicity=3 if ethnicity==4
(68 real changes made)

. replace ethnicity=4 if ethnicity==6
(97 real changes made)

. replace ethnicity=6 if ethnicity==.
(511 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,899 missing values generated)

. replace region = 2 if region_string=="East"
(236 real changes made)

. replace region = 3 if region_string=="London"
(385 real changes made)

. replace region = 4 if region_string=="North East"
(228 real changes made)

. replace region = 5 if region_string=="North West"
(211 real changes made)

. replace region = 6 if region_string=="South East"
(206 real changes made)

. replace region = 7 if region_string=="South West"
(217 real changes made)

. replace region = 8 if region_string=="West Midlands"
(221 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(195 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,104 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(833 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,271 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2019_ckd_complete.dta not found)
file ./output/2019_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,602
        from master                       499  (_merge==1)
        from using                      2,103  (_merge==2)

    matched                                 1  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(499 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,273
  CKD stage |           0           0         416
  CKD stage |           0           0          17
   Dialysis |           0           0          82
  Transplan |           0           0         278
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |           0           0       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,104           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,273
  CKD stage |           0           0         416
  CKD stage |           0           0          17
   Dialysis |           0           0          82
  Transplan |           0           0         278
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |           0           0       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,104           0           0          0          0

                          opa_cost
-------------------------------------------------------------
      Percentiles      Smallest
 1%       49.352         49.352
 5%       49.352              .
10%       49.352              .       Obs                   1
25%       49.352              .       Sum of Wgt.           1

50%       49.352                      Mean             49.352
                        Largest       Std. Dev.             .
75%       49.352              .
90%       49.352              .       Variance              .
95%       49.352              .       Skewness              .
99%       49.352         49.352       Kurtosis              .

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |   49.352001           0       1,273
  CKD stage |           0           0         416
  CKD stage |           0           0          17
   Dialysis |           0           0          82
  Transplan |           0           0         278
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   29.859837   24.131092       2,104

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,104      49.352           0     49.352     49.352

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2019_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete.log
  log type:  text
 closed on:  12 Sep 2023, 14:35:34
-------------------------------------------------------------------------------
