-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete.log
  log type:  text
 opened on:  16 Dec 2022, 19:41:44

. clear

. 
. * Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 21,191 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(61 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,947
        from master                    47,878  (_merge==1)
        from using                     19,069  (_merge==2)

    matched                             2,122  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,947 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved

. 
. * Baseline dialysis & kidney transplant group classification
. drop dialysis_baseline_primary_care

. drop dialysis_baseline_icd_10

. drop dialysis_baseline_opcs_4

. drop kt_baseline_primary_care

. drop kt_baseline_icd_10

. drop kt_baseline_opcs_4

. gen dialysis_baseline = date(dialysis_baseline_date, "YMD")
(1,790 missing values generated)

. format dialysis_baseline %td

. drop dialysis_baseline_date

. gen kidney_transplant_baseline = date(kidney_transplant_baseline_date, "YMD")
(1,824 missing values generated)

. format kidney_transplant_baseline %td

. drop kidney_transplant_baseline_date

. gen dialysis = 0

. replace dialysis = 1 if dialysis_baseline!=.
(332 real changes made)

. replace dialysis = 0 if kidney_transplant_baseline > dialysis_baseline
(315 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline!=.
(298 real changes made)

. replace kidney_transplant = 0 if dialysis_baseline > kidney_transplant_baseli
> ne
(280 real changes made)

. drop dialysis_baseline

. drop kidney_transplant_baseline

. 
. * CKD stage classification
. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(832 missing values generated)

. drop baseline_egfr

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1290 changes made)

. gen pre_krt = ckd_group
(832 missing values generated)

. replace ckd_group = 4 if dialysis==1
(17 real changes made)

. drop dialysis

. replace ckd_group = 5 if kidney_transplant==1
(18 real changes made)

. drop kidney_transplant

. label define ckd_group 1 "eGFR ≥60 with albuminuria" 2 "CKD 3" 3 "CKD 4/5 wit
> hout kidney replacement therapy" 4 "Dialysis" 5 "Kidney transplant"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. label define pre_krt 1 "eGFR ≥60 with albuminuria" 2 "CKD 3" 3 "CKD 4/5 witho
> ut kidney replacement therapy"

. label values pre_krt pre_krt

. label var pre_krt "CKD group"

. 
. * Dialysis & kidney transplant outcome classification
. drop dialysis_outcome_primary_care

. drop dialysis_outcome_icd_10

. drop dialysis_outcome_opcs_4

. drop kt_outcome_primary_care

. drop kt_outcome_icd_10

. drop kt_outcome_opcs_4

. gen dialysis_outcome = date(dialysis_outcome_date, "YMD")
(1,835 missing values generated)

. format dialysis_outcome %td

. drop dialysis_outcome_date

. gen kidney_transplant_outcome = date(kidney_transplant_outcome_date, "YMD")
(1,829 missing values generated)

. format kidney_transplant_outcome %td

. drop kidney_transplant_outcome_date

. gen dialysis_new = 0

. replace dialysis_new = 1 if dialysis_outcome!=. & ckd_group!=4/5
(287 real changes made)

. replace dialysis_new = 0 if kidney_transplant_outcome > dialysis_outcome
(263 real changes made)

. gen kidney_transplant_new = 0

. replace kidney_transplant_new = 1 if kidney_transplant_outcome!=. & ckd_group
> !=4/5
(293 real changes made)

. replace kidney_transplant_new = 0 if dialysis_outcome > kidney_transplant_out
> come
(279 real changes made)

. drop dialysis_outcome

. drop kidney_transplant_outcome

. 
. * eGFR outcome classification
. gen sex = 1 if male == "Male"
(1,130 missing values generated)

. replace sex = 0 if male == "Female"
(1,130 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(893 real changes made, 893 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(893 missing values generated)

. gen min_creatinine_outcome=.
(2,122 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(657 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(572 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(657 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(572 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(777 real changes made)

. gen max_creatinine_outcome=.
(2,122 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(657 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(572 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,229 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,345 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(893 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,229 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(657 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(893 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1229 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(113 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(3 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(5 real changes made)

. replace ckd_progression = 3 if dialysis_new==1
(24 real changes made)

. replace ckd_progression = 4 if kidney_transplant_new==1
(14 real changes made)

. drop dialysis_new

. drop kidney_transplant_new

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 without 
> kidney replacement therapy" 3 "Dialysis" 4 "Kidney transplant"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(83 real changes made)

. replace ethnicity=2 if ethnicity==3
(74 real changes made)

. replace ethnicity=3 if ethnicity==4
(86 real changes made)

. replace ethnicity=4 if ethnicity==6
(83 real changes made)

. replace ethnicity=6 if ethnicity==.
(526 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,907 missing values generated)

. replace region = 2 if region_string=="East"
(208 real changes made)

. replace region = 3 if region_string=="London"
(411 real changes made)

. replace region = 4 if region_string=="North East"
(238 real changes made)

. replace region = 5 if region_string=="North West"
(193 real changes made)

. replace region = 6 if region_string=="South East"
(215 real changes made)

. replace region = 7 if region_string=="South West"
(230 real changes made)

. replace region = 8 if region_string=="West Midlands"
(197 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(215 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,122 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(889 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,233 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2019_ckd_complete.dta not found)
file ./output/2019_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete.log
  log type:  text
 closed on:  16 Dec 2022, 19:41:46
-------------------------------------------------------------------------------
