-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete.log
  log type:  text
 opened on:   9 Feb 2023, 22:11:43

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 20,935 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,641
        from master                    47,853  (_merge==1)
        from using                     18,788  (_merge==2)

    matched                             2,147  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,641 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save 2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        206        9.59        9.59
Kidney transplant |        205        9.55       19.14
 Modality unclear |         41        1.91       21.05
          Pre KRT |      1,695       78.95      100.00
------------------+-----------------------------------
            Total |      2,147      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(822 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1325 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(206 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(205 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(41 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(625 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,276       59.43       59.43
  CKD stage 3 |        398       18.54       77.97
CKD stage 4/5 |         21        0.98       78.95
     Dialysis |        206        9.59       88.54
   Transplant |        205        9.55       98.09
  KRT unclear |         41        1.91      100.00
--------------+-----------------------------------
        Total |      2,147      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,276 |     1,276 
  CKD stage 3 |         0          0          0        398 |       398 
CKD stage 4/5 |         0          0          0         21 |        21 
     Dialysis |       206          0          0          0 |       206 
   Transplant |         0        205          0          0 |       205 
  KRT unclear |         0          0         41          0 |        41 
--------------+--------------------------------------------+----------
        Total |       206        205         41      1,695 |     2,147 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       125         51         43         12 |     1,276 
  CKD stage 3 |        41         18         22          2 |       398 
CKD stage 4/5 |         1          1          1          0 |        21 
     Dialysis |        26         10          6          2 |       206 
   Transplant |        26          4         11          4 |       205 
  KRT unclear |         5          3          0          0 |        41 
--------------+--------------------------------------------+----------
        Total |       224         87         83         20 |     2,147 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |     1,045 |     1,276 
  CKD stage 3 |       315 |       398 
CKD stage 4/5 |        18 |        21 
     Dialysis |       162 |       206 
   Transplant |       160 |       205 
  KRT unclear |        33 |        41 
--------------+-----------+----------
        Total |     1,733 |     2,147 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,141 missing values generated)

. replace sex = 0 if male == "Female"
(1,141 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(950 real changes made, 950 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(950 missing values generated)

. gen min_creatinine_outcome=.
(2,147 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(647 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(550 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(647 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(550 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(741 real changes made)

. gen max_creatinine_outcome=.
(2,147 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(647 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(550 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,197 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,406 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(950 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,197 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(647 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(950 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1197 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(160 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(8 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(5 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(87 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(83 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(20 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(224 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,592       74.15       74.15
               CKD 3 |        130        6.05       80.20
     CKD 4/5 pre-KRT |         11        0.51       80.72
            Dialysis |         87        4.05       84.77
   Kidney transplant |         83        3.87       88.64
KRT unclear modality |         20        0.93       89.57
            Deceased |        224       10.43      100.00
---------------------+-----------------------------------
               Total |      2,147      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,276
  CKD stage |         134           0         398
  CKD stage |           0           0          21
   Dialysis |          55           0         206
  Transplan |          54           0         205
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |    251.7578   138.81707       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,147         615           0        615        615

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,276
  CKD stage |          98           0         398
  CKD stage |          11           0          21
   Dialysis |          60           0         206
  Transplan |          71           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   216.40941   116.77493       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,147         561           0        561        561

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,276
  CKD stage |          95           0         398
  CKD stage |           3           0          21
   Dialysis |          48           0         206
  Transplan |          58           0         205
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |   247.12483   148.58643       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,147         575           0        575        575

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,276
  CKD stage |         119           0         398
  CKD stage |           2           0          21
   Dialysis |          46           0         206
  Transplan |          52           0         205
  KRT uncle |          18           0          41
------------+------------------------------------
      Total |   233.27527   130.31757       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,147         576           0        576        576

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,276
  CKD stage |         118           0         398
  CKD stage |          18           0          21
   Dialysis |          54           0         206
  Transplan |          51           0         205
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |    199.2571   101.70066       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,147         530           0        530        530

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,276
  CKD stage |         101           0         398
  CKD stage |          11           0          21
   Dialysis |          61           0         206
  Transplan |          73           0         205
  KRT uncle |          16           0          41
------------+------------------------------------
      Total |    206.6884   106.85781       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,147         556           0        556        556

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          81           0         398
  CKD stage |           1           0          21
   Dialysis |          83           0         206
  Transplan |          63           0         205
  KRT uncle |          10           0          41
------------+------------------------------------
      Total |   213.43363   117.57793       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,147         548           0        548        548

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         392           0       1,276
  CKD stage |         105           0         398
  CKD stage |           7           0          21
   Dialysis |          40           0         206
  Transplan |          48           0         205
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |    260.9646    160.1639       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,147         594           0        594        594

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,276
  CKD stage |         106           0         398
  CKD stage |           1           0          21
   Dialysis |          55           0         206
  Transplan |          76           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   230.27294   125.74261       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,147         580           0        580        580

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,276
  CKD stage |         145           0         398
  CKD stage |           2           0          21
   Dialysis |          49           0         206
  Transplan |          52           0         205
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   215.01351   107.93762       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,147         556           0        556        556

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,276
  CKD stage |          78           0         398
  CKD stage |           6           0          21
   Dialysis |          46           0         206
  Transplan |          48           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   199.60456    117.4262       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,147         483           0        483        483

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,276
  CKD stage |          95           0         398
  CKD stage |           3           0          21
   Dialysis |          44           0         206
  Transplan |          47           0         205
  KRT uncle |          19           0          41
------------+------------------------------------
      Total |   241.26083   146.05439       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,147         569           0        569        569

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,276
  CKD stage |         112           0         398
  CKD stage |           2           0          21
   Dialysis |          55           0         206
  Transplan |          39           0         205
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |   202.21099   108.90138       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,147         502           0        502        502

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         240           0       1,276
  CKD stage |         115           0         398
  CKD stage |           3           0          21
   Dialysis |          82           0         206
  Transplan |          53           0         205
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |   177.12203   78.934972       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         504           0        504        504

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,276
  CKD stage |          73           0         398
  CKD stage |          16           0          21
   Dialysis |          51           0         206
  Transplan |          47           0         205
  KRT uncle |           0           0          41
------------+------------------------------------
      Total |   204.33675    122.4366       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         492           0        492        492

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,276
  CKD stage |          73           0         398
  CKD stage |           7           0          21
   Dialysis |          58           0         206
  Transplan |          53           0         205
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |   258.04145   163.71135       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         597           0        597        597

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,276
  CKD stage |         103           0         398
  CKD stage |           3           0          21
   Dialysis |          36           0         206
  Transplan |          69           0         205
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |   236.02608   137.18763       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         561           0        561        561

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,276
  CKD stage |         144           0         398
  CKD stage |           6           0          21
   Dialysis |          50           0         206
  Transplan |          43           0         205
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |   205.24639   102.05506       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         539           0        539        539

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,276
  CKD stage |         117           0         398
  CKD stage |           9           0          21
   Dialysis |          74           0         206
  Transplan |          48           0         205
  KRT uncle |           7           0          41
------------+------------------------------------
      Total |   246.35957   137.00569       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         613           0        613        613

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,276
  CKD stage |         103           0         398
  CKD stage |          14           0          21
   Dialysis |          50           0         206
  Transplan |          37           0         205
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |   245.15743   147.85088       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         574           0        574        574

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,276
  CKD stage |          96           0         398
  CKD stage |           2           0          21
   Dialysis |          34           0         206
  Transplan |          53           0         205
  KRT uncle |           7           0          41
------------+------------------------------------
      Total |   223.58547   132.71898       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         524           0        524        524

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,276
  CKD stage |         125           0         398
  CKD stage |           5           0          21
   Dialysis |          66           0         206
  Transplan |          39           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |    205.2068   104.85584       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         533           0        533        533

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,276
  CKD stage |         104           0         398
  CKD stage |          13           0          21
   Dialysis |          48           0         206
  Transplan |          56           0         205
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |   210.66372   115.93403       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         528           0        528        528

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,276
  CKD stage |         121           0         398
  CKD stage |          13           0          21
   Dialysis |          80           0         206
  Transplan |          58           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   229.69073   118.58736       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         607           0        607        607

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,276
  CKD stage |         119           0         398
  CKD stage |           4           0          21
   Dialysis |          58           0         206
  Transplan |          41           0         205
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |   240.39404     136.201       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,147         584           0        584        584

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,276
  CKD stage |         133           0         398
  CKD stage |           3           0          21
   Dialysis |          48           0         206
  Transplan |          75           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   223.23847   113.16702       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         582           0        582        582

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,276
  CKD stage |         123           0         398
  CKD stage |           2           0          21
   Dialysis |          57           0         206
  Transplan |          38           0         205
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |   206.26316    108.3469       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         524           0        524        524

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,276
  CKD stage |         115           0         398
  CKD stage |           3           0          21
   Dialysis |          50           0         206
  Transplan |          74           0         205
  KRT uncle |           7           0          41
------------+------------------------------------
      Total |   219.36563   115.43384       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         562           0        562        562

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |         114           0         398
  CKD stage |           7           0          21
   Dialysis |          49           0         206
  Transplan |          90           0         205
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |    225.3293   117.83811       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         584           0        584        584

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,276
  CKD stage |         106           0         398
  CKD stage |          12           0          21
   Dialysis |          62           0         206
  Transplan |          32           0         205
  KRT uncle |          18           0          41
------------+------------------------------------
      Total |   216.91942   121.88574       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         546           0        546        546

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,276
  CKD stage |          92           0         398
  CKD stage |           0           0          21
   Dialysis |          60           0         206
  Transplan |          53           0         205
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   215.23475   121.80287       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         528           0        528        528

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,276
  CKD stage |         138           0         398
  CKD stage |           8           0          21
   Dialysis |          45           0         206
  Transplan |          54           0         205
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |   209.36423   105.81831       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         543           0        543        543

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,276
  CKD stage |         109           0         398
  CKD stage |           8           0          21
   Dialysis |          50           0         206
  Transplan |          38           0         205
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   204.68514   112.97192       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         504           0        504        504

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,276
  CKD stage |          89           0         398
  CKD stage |           0           0          21
   Dialysis |          80           0         206
  Transplan |          53           0         205
  KRT uncle |          12           0          41
------------+------------------------------------
      Total |   205.38193   110.67558       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         530           0        530        530

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,276
  CKD stage |         109           0         398
  CKD stage |           9           0          21
   Dialysis |          56           0         206
  Transplan |          60           0         205
  KRT uncle |          14           0          41
------------+------------------------------------
      Total |   249.77783    143.2489       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         615           0        615        615

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,276
  CKD stage |         127           0         398
  CKD stage |           3           0          21
   Dialysis |          55           0         206
  Transplan |          53           0         205
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |   234.30927   127.09009       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         581           0        581        581

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,276
  CKD stage |          86           0         398
  CKD stage |           6           0          21
   Dialysis |          51           0         206
  Transplan |          65           0         205
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   199.51001    110.4902       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,147         501           0        501        501

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |         112           0         398
  CKD stage |          12           0          21
   Dialysis |          30           0         206
  Transplan |          45           0         205
  KRT uncle |          18           0          41
------------+------------------------------------
      Total |    212.6367   120.49467       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,147         527           0        527        527

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,276
  CKD stage |         132           0         398
  CKD stage |           0           0          21
   Dialysis |          24           0         206
  Transplan |          34           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   229.28691   132.40143       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,147         534           0        534        534

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,276
  CKD stage |          79           0         398
  CKD stage |           0           0          21
   Dialysis |          57           0         206
  Transplan |          39           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   220.72846   134.22671       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,147         515           0        515        515

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         405           0       1,276
  CKD stage |         104           0         398
  CKD stage |          12           0          21
   Dialysis |          32           0         206
  Transplan |          46           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   267.72939   167.70596       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,147         608           0        608        608

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,276
  CKD stage |         131           0         398
  CKD stage |           5           0          21
   Dialysis |          57           0         206
  Transplan |          45           0         205
  KRT uncle |          22           0          41
------------+------------------------------------
      Total |   241.34141   132.03213       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,147         608           0        608        608

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,276
  CKD stage |          87           0         398
  CKD stage |           4           0          21
   Dialysis |          70           0         206
  Transplan |          50           0         205
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   238.19842   140.93122       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,147         573           0        573        573

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,276
  CKD stage |         114           0         398
  CKD stage |           2           0          21
   Dialysis |          61           0         206
  Transplan |          50           0         205
  KRT uncle |           1           0          41
------------+------------------------------------
      Total |   218.41407   117.91536       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,147         542           0        542        542

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,276
  CKD stage |          95           0         398
  CKD stage |           4           0          21
   Dialysis |          35           0         206
  Transplan |          49           0         205
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |   220.73731   131.31178       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,147         517           0        517        517

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,276
  CKD stage |          98           0         398
  CKD stage |           1           0          21
   Dialysis |          37           0         206
  Transplan |          64           0         205
  KRT uncle |          10           0          41
------------+------------------------------------
      Total |   230.09641   134.43171       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         550           0        550        550

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,276
  CKD stage |          75           0         398
  CKD stage |          16           0          21
   Dialysis |          33           0         206
  Transplan |          54           0         205
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   209.15044   127.63384       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         500           0        500        500

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,276
  CKD stage |         111           0         398
  CKD stage |           5           0          21
   Dialysis |          27           0         206
  Transplan |          66           0         205
  KRT uncle |          15           0          41
------------+------------------------------------
      Total |   253.86213   151.02591       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,147         601           0        601        601

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,276
  CKD stage |         129           0         398
  CKD stage |          15           0          21
   Dialysis |          46           0         206
  Transplan |          41           0         205
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |   227.43922   125.17593       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,147         565           0        565        565

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         419           0       1,276
  CKD stage |          84           0         398
  CKD stage |           3           0          21
   Dialysis |          49           0         206
  Transplan |          36           0         205
  KRT uncle |          15           0          41
------------+------------------------------------
      Total |   273.04518   177.38797       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         606           0        606        606

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,276
  CKD stage |          98           0         398
  CKD stage |           0           0          21
   Dialysis |          50           0         206
  Transplan |          38           0         205
  KRT uncle |          12           0          41
------------+------------------------------------
      Total |   214.62599   124.29763       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         514           0        514        514

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,276
  CKD stage |          74           0         398
  CKD stage |          15           0          21
   Dialysis |          37           0         206
  Transplan |          69           0         205
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |   216.21565   129.88341       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         531           0        531        531

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |         145           0         398
  CKD stage |           8           0          21
   Dialysis |          36           0         206
  Transplan |          53           0         205
  KRT uncle |          18           0          41
------------+------------------------------------
      Total |   220.05449    113.9863       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         570           0        570        570

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,276
  CKD stage |          95           0         398
  CKD stage |          10           0          21
   Dialysis |          59           0         206
  Transplan |          56           0         205
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |   236.97578   137.71662       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         583           0        583        583

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,276
  CKD stage |         101           0         398
  CKD stage |          11           0          21
   Dialysis |          67           0         206
  Transplan |          46           0         205
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |   236.56917    136.1739       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         578           0        578        578

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,276
  CKD stage |         139           0         398
  CKD stage |           6           0          21
   Dialysis |          42           0         206
  Transplan |          50           0         205
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |   219.55799   115.21235       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         553           0        553        553

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,276
  CKD stage |          90           0         398
  CKD stage |           6           0          21
   Dialysis |          47           0         206
  Transplan |          58           0         205
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |   237.86819   142.69761       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         561           0        561        561

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,276
  CKD stage |          84           0         398
  CKD stage |          11           0          21
   Dialysis |          67           0         206
  Transplan |          49           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   198.71588    110.1197       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         509           0        509        509

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,276
  CKD stage |         125           0         398
  CKD stage |           9           0          21
   Dialysis |          37           0         206
  Transplan |          65           0         205
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   248.21658   140.39831       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         601           0        601        601

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,276
  CKD stage |         138           0         398
  CKD stage |           7           0          21
   Dialysis |          53           0         206
  Transplan |          48           0         205
  KRT uncle |           7           0          41
------------+------------------------------------
      Total |   225.03959    117.7421       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         572           0        572        572

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,276
  CKD stage |         109           0         398
  CKD stage |           1           0          21
   Dialysis |          36           0         206
  Transplan |          42           0         205
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |    203.8081   114.18233       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,147         495           0        495        495

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,276
  CKD stage |          82           0         398
  CKD stage |           4           0          21
   Dialysis |          45           0         206
  Transplan |          36           0         205
  KRT uncle |          14           0          41
------------+------------------------------------
      Total |   205.12343   123.08275       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,147         487           0        487        487

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,276
  CKD stage |          91           0         398
  CKD stage |           5           0          21
   Dialysis |          51           0         206
  Transplan |          44           0         205
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |   244.37541   149.37228       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,147         571           0        571        571

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,276
  CKD stage |          59           0         398
  CKD stage |           3           0          21
   Dialysis |          79           0         206
  Transplan |          46           0         205
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |   190.61248   111.27309       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,147         473           0        473        473

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         248           0       1,276
  CKD stage |          93           0         398
  CKD stage |           3           0          21
   Dialysis |          50           0         206
  Transplan |          39           0         205
  KRT uncle |          17           0          41
------------+------------------------------------
      Total |   173.50582   91.905328       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,147         450           0        450        450

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,276
  CKD stage |          73           0         398
  CKD stage |           2           0          21
   Dialysis |          47           0         206
  Transplan |          55           0         205
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |   201.12855   119.06247       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,147         482           0        482        482

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,276
  CKD stage |         128           0         398
  CKD stage |           9           0          21
   Dialysis |          43           0         206
  Transplan |          36           0         205
  KRT uncle |          15           0          41
------------+------------------------------------
      Total |   217.09269    118.6339       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,147         543           0        543        543

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,276
  CKD stage |         105           0         398
  CKD stage |           8           0          21
   Dialysis |          44           0         206
  Transplan |          36           0         205
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |   195.64183   108.09781       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,147         489           0        489        489

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,276
  CKD stage |         130           0         398
  CKD stage |           4           0          21
   Dialysis |          59           0         206
  Transplan |          46           0         205
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |    245.3456   135.58597       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,147         603           0        603        603

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,276
  CKD stage |          84           0         398
  CKD stage |           0           0          21
   Dialysis |          55           0         206
  Transplan |          51           0         205
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   244.57988   150.07953       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         566           0        566        566

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,276
  CKD stage |         149           0         398
  CKD stage |           2           0          21
   Dialysis |          68           0         206
  Transplan |          34           0         205
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |    254.4136   138.31303       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         622           0        622        622

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,276
  CKD stage |          88           0         398
  CKD stage |           4           0          21
   Dialysis |          50           0         206
  Transplan |          56           0         205
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |   231.03726   137.60544       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,147         547           0        547        547

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,276
  CKD stage |         119           0         398
  CKD stage |           7           0          21
   Dialysis |          51           0         206
  Transplan |          67           0         205
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |   209.37494    107.4387       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,147         542           0        542        542

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,276
  CKD stage |         147           0         398
  CKD stage |           6           0          21
   Dialysis |          51           0         206
  Transplan |          37           0         205
  KRT uncle |          15           0          41
------------+------------------------------------
      Total |   264.83372   149.52237       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         641           0        641        641

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,276
  CKD stage |          87           0         398
  CKD stage |           7           0          21
   Dialysis |          59           0         206
  Transplan |          52           0         205
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   197.44853   109.40262       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         495           0        495        495

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,276
  CKD stage |          84           0         398
  CKD stage |          12           0          21
   Dialysis |          77           0         206
  Transplan |          72           0         205
  KRT uncle |          14           0          41
------------+------------------------------------
      Total |   228.12669   127.46012       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         592           0        592        592

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,276
  CKD stage |         113           0         398
  CKD stage |           2           0          21
   Dialysis |          66           0         206
  Transplan |          69           0         205
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   238.48579    129.2375       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         602           0        602        602

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,276
  CKD stage |         112           0         398
  CKD stage |           4           0          21
   Dialysis |          36           0         206
  Transplan |          34           0         205
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |    246.3251   149.59998       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         560           0        560        560

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,276
  CKD stage |         102           0         398
  CKD stage |           8           0          21
   Dialysis |          39           0         206
  Transplan |          32           0         205
  KRT uncle |          12           0          41
------------+------------------------------------
      Total |   234.61854   142.68805       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         544           0        544        544

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,276
  CKD stage |          68           0         398
  CKD stage |          11           0          21
   Dialysis |          34           0         206
  Transplan |          56           0         205
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |   227.62692   145.00339       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         520           0        520        520

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,276
  CKD stage |         132           0         398
  CKD stage |           9           0          21
   Dialysis |          58           0         206
  Transplan |          53           0         205
  KRT uncle |           1           0          41
------------+------------------------------------
      Total |   262.23149   147.62035       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         635           0        635        635

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,276
  CKD stage |         106           0         398
  CKD stage |           5           0          21
   Dialysis |          46           0         206
  Transplan |          47           0         205
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   242.01723   143.28541       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         566           0        566        566

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,276
  CKD stage |         140           0         398
  CKD stage |           3           0          21
   Dialysis |          70           0         206
  Transplan |          50           0         205
  KRT uncle |          20           0          41
------------+------------------------------------
      Total |   229.81882   116.37917       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         606           0        606        606

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,276
  CKD stage |          99           0         398
  CKD stage |           0           0          21
   Dialysis |          62           0         206
  Transplan |          61           0         205
  KRT uncle |          14           0          41
------------+------------------------------------
      Total |   221.76293   122.45054       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         558           0        558        558

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(88 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(81 real changes made)

. replace ethnicity=4 if ethnicity==6
(88 real changes made)

. replace ethnicity=6 if ethnicity==.
(528 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,917 missing values generated)

. replace region = 2 if region_string=="East"
(230 real changes made)

. replace region = 3 if region_string=="London"
(427 real changes made)

. replace region = 4 if region_string=="North East"
(217 real changes made)

. replace region = 5 if region_string=="North West"
(193 real changes made)

. replace region = 6 if region_string=="South East"
(218 real changes made)

. replace region = 7 if region_string=="South West"
(220 real changes made)

. replace region = 8 if region_string=="West Midlands"
(194 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(218 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,147 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(845 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,302 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2019_ckd_complete.dta not found)
file ./output/2019_ckd_complete.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete.log
  log type:  text
 closed on:   9 Feb 2023, 22:11:53
-------------------------------------------------------------------------------
