-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_nockd_complete.log
  log type:  text
 opened on:  21 Nov 2023, 19:42:24

. clear

. 
. *Merge `dataset'_nockd with `dataset'_nockd_complete
. capture noisily import delimited ./output/`dataset'_nockd.csv, clear
(16 vars, 10,955 obs)

. tempfile `dataset'_nockd

. save ``dataset'_nockd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_nockd_complete.csv,
>  clear
(24 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_nockd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        58,813
        from master                    48,929  (_merge==1)
        from using                      9,884  (_merge==2)

    matched                             1,071  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(58,813 observations deleted)

. drop _merge

. tempfile `dataset'_nockd_complete

. save ``dataset'_nockd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_nockd.csv, clear
> tempfile 2017_nockd
> save ./output/2017_nockd, replace
> capture noisily import delimited ./output/input_2017_nockd_complete.csv, clea
> r
> merge 1:1 patient_id using ./output/2017_nockd
> keep if _merge==3
> drop _merge
> tempfile 2017_nockd_complete
> save ./output/2017_nockd_complete, replace
> */
. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(516 missing values generated)

. replace sex = 0 if male == "Female"
(516 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(462 real changes made, 462 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(462 missing values generated)

. gen min_creatinine_outcome=.
(1,071 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(306 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(303 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(306 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(303 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(376 real changes made)

. gen max_creatinine_outcome=.
(1,071 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(306 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(303 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(609 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(695 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(462 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(609 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(306 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(462 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 609 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2
(136 real changes made)

. replace ckd_progression = 2 if egfr_end==3
(11 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(462 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 609 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        609       56.86       56.86
          . |        462       43.14      100.00
------------+-----------------------------------
      Total |      1,071      100.00

. replace modality_outcome = "Unchanged" if modality_outcome_date==.
(179 real changes made)

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(15 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(8 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(1 real change made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear" & modalit
> y_outcome_date!=.
(3 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(15 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(9 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(37 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |        871       81.33       81.33
               CKD 3 |        127       11.86       93.18
     CKD 4/5 pre-KRT |         10        0.93       94.12
            Dialysis |         15        1.40       95.52
   Kidney transplant |          9        0.84       96.36
KRT unclear modality |          2        0.19       96.55
            Deceased |         37        3.45      100.00
---------------------+-----------------------------------
               Total |      1,071      100.00

. gen ckd_group = 0

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(47 real changes made)

. replace ethnicity=2 if ethnicity==3
(35 real changes made)

. replace ethnicity=3 if ethnicity==4
(44 real changes made)

. replace ethnicity=4 if ethnicity==6
(47 real changes made)

. replace ethnicity=6 if ethnicity==.
(268 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(958 missing values generated)

. replace region = 2 if region_string=="East"
(129 real changes made)

. replace region = 3 if region_string=="London"
(207 real changes made)

. replace region = 4 if region_string=="North East"
(106 real changes made)

. replace region = 5 if region_string=="North West"
(107 real changes made)

. replace region = 6 if region_string=="South East"
(110 real changes made)

. replace region = 7 if region_string=="South West"
(106 real changes made)

. replace region = 8 if region_string=="West Midlands"
(78 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(115 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(1,071 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(446 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(625 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. *Age bands for standardisation
. egen agecat = cut(age), at(0,18,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,
> 200)

. drop if agecat==0
(0 observations deleted)

. 
. *Age-standardisation weights (European Standard Population 2013)
. gen weight = .
(1,071 missing values generated)

. replace weight = 0.027261 if agecat==18
(35 real changes made)

. replace weight = 0.074349 if agecat==20
(78 real changes made)

. replace weight = 0.074349 if agecat==25
(103 real changes made)

. replace weight = 0.080545 if agecat==30
(99 real changes made)

. replace weight = 0.086741 if agecat==35
(119 real changes made)

. replace weight = 0.086741 if agecat==40
(77 real changes made)

. replace weight = 0.086741 if agecat==45
(83 real changes made)

. replace weight = 0.086741 if agecat==50
(97 real changes made)

. replace weight = 0.080545 if agecat==55
(78 real changes made)

. replace weight = 0.074349 if agecat==60
(65 real changes made)

. replace weight = 0.068154 if agecat==65
(64 real changes made)

. replace weight = 0.061958 if agecat==70
(70 real changes made)

. replace weight = 0.049566 if agecat==75
(34 real changes made)

. replace weight = 0.030979 if agecat==80
(41 real changes made)

. replace weight = 0.018587 if agecat==85
(18 real changes made)

. replace weight = 0.012392 if agecat==90
(10 real changes made)

. 
. save "./output/`dataset'_nockd_complete.dta", replace
(note: file ./output/2019_nockd_complete.dta not found)
file ./output/2019_nockd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_nockd_complete.log
  log type:  text
 closed on:  21 Nov 2023, 19:42:25
-------------------------------------------------------------------------------
