-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd.log
  log type:  text
 opened on:  12 Jan 2023, 18:19:48

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,461 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,971 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,797 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,438       10.18       10.18
           East Midlands |      3,337        9.88       20.06
                  London |      6,658       19.72       39.78
              North East |      3,378       10.00       49.78
              North West |      3,312        9.81       59.59
              South East |      3,376       10.00       69.58
              South West |      3,440       10.19       79.77
           West Midlands |      3,372        9.98       89.75
Yorkshire and The Humber |      3,460       10.25      100.00
-------------------------+-----------------------------------
                   Total |     33,771      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,639        4.85        4.85
          1 |      6,344       18.79       23.64
          2 |      6,419       19.01       42.65
          3 |      6,365       18.85       61.49
          4 |      6,441       19.07       80.57
          5 |      6,563       19.43      100.00
------------+-----------------------------------
      Total |     33,771      100.00

. drop if imd==0
(1,639 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,006 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(847 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(823 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,207 real changes made, 14,207 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,207 missing values generated)

. gen min_baseline_creatinine=.
(32,132 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,057 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,868 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,057 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,868 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,306 real changes made)

. gen max_baseline_creatinine=.
(32,132 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,057 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,868 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,925 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,826 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,207 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,925 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,057 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,704 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,132
25%            0              0       Sum of Wgt.      32,132

50%            0                      Mean           12.44905
                        Largest       Std. Dev.      12.98125
75%     24.96891       41.57521
90%     29.17638        41.7338       Variance       168.5129
95%     31.42225       42.05271       Skewness       .2187445
99%     35.10447       42.24569       Kurtosis       1.299333

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,681        5.82        5.82
         <= |      1,657        5.74       11.55
          = |     20,754       71.84       83.39
          > |      1,571        5.44       88.83
         >= |      1,594        5.52       94.34
          ~ |      1,634        5.66      100.00
------------+-----------------------------------
      Total |     28,891      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,796       55.38       55.38
          1 |     14,336       44.62      100.00
------------+-----------------------------------
      Total |     32,132      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,092       46.97       46.97
          1 |     17,040       53.03      100.00
------------+-----------------------------------
      Total |     32,132      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,528       95.01       95.01
          1 |      1,604        4.99      100.00
------------+-----------------------------------
      Total |     32,132      100.00
(732 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,479       94.86       94.86
          1 |      1,653        5.14      100.00
------------+-----------------------------------
      Total |     32,132      100.00
(742 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,510       94.95       94.95
          1 |      1,622        5.05      100.00
------------+-----------------------------------
      Total |     32,132      100.00
(678 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,516       94.97       94.97
          1 |      1,616        5.03      100.00
------------+-----------------------------------
      Total |     32,132      100.00
(651 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,532       95.02       95.02
          1 |      1,600        4.98      100.00
------------+-----------------------------------
      Total |     32,132      100.00
(617 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,547       95.07       95.07
          1 |      1,585        4.93      100.00
------------+-----------------------------------
      Total |     32,132      100.00
(577 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,095       34.53       34.53
          1 |     21,037       65.47      100.00
------------+-----------------------------------
      Total |     32,132      100.00

. drop if ckd==0
(11,095 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2019_ckd.csv not found)
file ./output/2019_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd.log
  log type:  text
 closed on:  12 Jan 2023, 18:19:50
-------------------------------------------------------------------------------
