-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd.log
  log type:  text
 opened on:  31 Jan 2023, 11:38:52

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,555 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,971 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,771 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,427       10.17       10.17
           East Midlands |      3,342        9.92       20.08
                  London |      6,827       20.26       40.34
              North East |      3,445       10.22       50.56
              North West |      3,223        9.56       60.13
              South East |      3,488       10.35       70.47
              South West |      3,340        9.91       80.38
           West Midlands |      3,328        9.87       90.26
Yorkshire and The Humber |      3,283        9.74      100.00
-------------------------+-----------------------------------
                   Total |     33,703      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,702        5.05        5.05
          1 |      6,395       18.97       24.02
          2 |      6,414       19.03       43.06
          3 |      6,363       18.88       61.94
          4 |      6,394       18.97       80.91
          5 |      6,435       19.09      100.00
------------+-----------------------------------
      Total |     33,703      100.00

. drop if imd==0
(1,702 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,952 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(791 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(824 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,085 real changes made, 14,085 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,085 missing values generated)

. gen min_baseline_creatinine=.
(32,001 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,049 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,867 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,049 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,867 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,359 real changes made)

. gen max_baseline_creatinine=.
(32,001 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,049 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,867 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,916 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,642 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,085 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,916 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,049 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,620 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,001
25%            0              0       Sum of Wgt.      32,001

50%            0                      Mean            12.4805
                        Largest       Std. Dev.      13.00008
75%     24.99933       42.47625
90%     29.20658       42.50178       Variance        169.002
95%     31.41286       42.83437       Skewness       .2162971
99%      35.3014       45.30292       Kurtosis       1.299723

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,564        5.43        5.43
         <= |      1,629        5.65       11.08
          = |     20,884       72.45       83.53
          > |      1,568        5.44       88.97
         >= |      1,524        5.29       94.26
          ~ |      1,655        5.74      100.00
------------+-----------------------------------
      Total |     28,824      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,664       55.20       55.20
          1 |     14,337       44.80      100.00
------------+-----------------------------------
      Total |     32,001      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,044       47.01       47.01
          1 |     16,957       52.99      100.00
------------+-----------------------------------
      Total |     32,001      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,379       94.93       94.93
          1 |      1,622        5.07      100.00
------------+-----------------------------------
      Total |     32,001      100.00
(763 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,360       94.87       94.87
          1 |      1,641        5.13      100.00
------------+-----------------------------------
      Total |     32,001      100.00
(726 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,388       94.96       94.96
          1 |      1,613        5.04      100.00
------------+-----------------------------------
      Total |     32,001      100.00
(673 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,364       94.88       94.88
          1 |      1,637        5.12      100.00
------------+-----------------------------------
      Total |     32,001      100.00
(628 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,404       95.01       95.01
          1 |      1,597        4.99      100.00
------------+-----------------------------------
      Total |     32,001      100.00
(587 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,380       94.93       94.93
          1 |      1,621        5.07      100.00
------------+-----------------------------------
      Total |     32,001      100.00
(601 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,066       34.58       34.58
          1 |     20,935       65.42      100.00
------------+-----------------------------------
      Total |     32,001      100.00

. drop if ckd==0
(11,066 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2019_ckd.csv not found)
file ./output/2019_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd.log
  log type:  text
 closed on:  31 Jan 2023, 11:38:55
-------------------------------------------------------------------------------
