-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd.log
  log type:  text
 opened on:   7 Jun 2024, 10:21:13

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve)
(18 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,586 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,987 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,732 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,396       10.08       10.08
           East Midlands |      3,360        9.97       20.05
                  London |      6,738       20.00       40.05
              North East |      3,378       10.03       50.07
              North West |      3,477       10.32       60.39
              South East |      3,353        9.95       70.34
              South West |      3,292        9.77       80.11
           West Midlands |      3,390       10.06       90.17
Yorkshire and The Humber |      3,311        9.83      100.00
-------------------------+-----------------------------------
                   Total |     33,695      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,656        4.91        4.91
          1 |      6,366       18.89       23.81
          2 |      6,520       19.35       43.16
          3 |      6,383       18.94       62.10
          4 |      6,326       18.77       80.88
          5 |      6,444       19.12      100.00
------------+-----------------------------------
      Total |     33,695      100.00

. drop if imd==0
(1,656 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * Code sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. save ./output/input_`dataset', replace
(note: file ./output/input_2019.dta not found)
file ./output/input_2019.dta saved

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,053 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(759 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(790 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,041 real changes made, 14,041 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,041 missing values generated)

. gen min_baseline_creatinine=.
(32,039 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,294 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,704 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,294 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,704 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,426 real changes made)

. gen max_baseline_creatinine=.
(32,039 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,294 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,704 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,998 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,613 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,041 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,998 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,294 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,722 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,039
25%            0              0       Sum of Wgt.      32,039

50%     10.67599                      Mean            12.5453
                        Largest       Std. Dev.      13.01772
75%      25.0504       41.03096
90%     29.29795       41.66463       Variance        169.461
95%     31.52275       41.98762       Skewness       .2124845
99%     35.37062       42.95688       Kurtosis       1.303412

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,538        5.33        5.33
         <= |      1,598        5.54       10.87
          = |     20,843       72.24       83.11
          > |      1,617        5.60       88.71
         >= |      1,649        5.72       94.43
          ~ |      1,607        5.57      100.00
------------+-----------------------------------
      Total |     28,852      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,535       54.73       54.73
   Albuminuria |     14,504       45.27      100.00
---------------+-----------------------------------
         Total |     32,039      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,813       46.23       46.23
          1 |     17,226       53.77      100.00
------------+-----------------------------------
      Total |     32,039      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14041 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17998 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,041 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,428       94.97       94.97
          1 |      1,611        5.03      100.00
------------+-----------------------------------
      Total |     32,039      100.00
(1,611 real changes made)
(714 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,466       95.09       95.09
          1 |      1,573        4.91      100.00
------------+-----------------------------------
      Total |     32,039      100.00
(1,497 real changes made)
(707 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,394       94.87       94.87
          1 |      1,645        5.13      100.00
------------+-----------------------------------
      Total |     32,039      100.00
(1,486 real changes made)
(649 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,434       94.99       94.99
          1 |      1,605        5.01      100.00
------------+-----------------------------------
      Total |     32,039      100.00
(1,359 real changes made)
(662 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,437       95.00       95.00
          1 |      1,602        5.00      100.00
------------+-----------------------------------
      Total |     32,039      100.00
(1,314 real changes made)
(625 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,446       95.03       95.03
          1 |      1,593        4.97      100.00
------------+-----------------------------------
      Total |     32,039      100.00
(1,243 real changes made)
(613 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,614      4,686 |    10,300 
 eGFR >=60 |     5,229      4,360 |     9,589 
  eGFR <60 |     2,029      1,611 |     3,640 
       KRT |     4,663      3,847 |     8,510 
-----------+----------------------+----------
     Total |    17,535     14,504 |    32,039 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,843       33.84       33.84
          1 |     21,196       66.16      100.00
------------+-----------------------------------
      Total |     32,039      100.00

. drop if ckd==0
(10,843 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,686 |     4,686 
 eGFR >=60 |         0      4,360 |     4,360 
  eGFR <60 |     2,029      1,611 |     3,640 
       KRT |     4,663      3,847 |     8,510 
-----------+----------------------+----------
     Total |     6,692     14,504 |    21,196 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2019_ckd.csv not found)
file ./output/2019_ckd.csv saved

. 
. *Create dataset of non-CKD
. merge 1:1 patient_id using ./output/input_`dataset'
(label sexLab already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,843
        from master                         0  (_merge==1)
        from using                     10,843  (_merge==2)

    matched                            21,196  (_merge==3)
    -----------------------------------------

. keep if _merge==2
(21,196 observations deleted)

. drop _merge

. 
. export delimited using "./output/`dataset'_nockd.csv", replace
(note: file ./output/2019_nockd.csv not found)
file ./output/2019_nockd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd.log
  log type:  text
 closed on:   7 Jun 2024, 10:21:15
-------------------------------------------------------------------------------
