-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete_v2.log
  log type:  text
 opened on:  24 Mar 2023, 18:41:13

. clear

. 
. *Merge `dataset'_ckd_v2 with `dataset'_ckd_complete_v2
. capture noisily import delimited ./output/`dataset'_ckd_v2.csv, clear
(7 vars, 21,041 obs)

. tempfile `dataset'_ckd_v2

. save ``dataset'_ckd'_v2, replace
(note: file _v2.dta not found)
file _v2.dta saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete_v2.csv
> , clear
(210 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'_v2

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,699
        from master                    47,829  (_merge==1)
        from using                     18,870  (_merge==2)

    matched                             2,171  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,699 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v2

. save ``dataset'_ckd_complete'_v2, replace
file _v2.dta saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd_v2.csv, clear
> tempfile 2017_ckd_v2
> save 2017_ckd_v2, replace
> capture noisily import delimited ./output/input_2017_ckd_complete_v2.csv, cle
> ar
> merge 1:1 patient_id using 2017_ckd_v2
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v2
> save 2017_ckd_complete_v2, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        209        9.63        9.63
Kidney transplant |        173        7.97       17.60
 Modality unclear |         46        2.12       19.71
          Pre KRT |      1,743       80.29      100.00
------------------+-----------------------------------
            Total |      2,171      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(861 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1310 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(209 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(173 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(46 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(695 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,343       61.86       61.86
  CKD stage 3 |        383       17.64       79.50
CKD stage 4/5 |         17        0.78       80.29
     Dialysis |        209        9.63       89.91
   Transplant |        173        7.97       97.88
  KRT unclear |         46        2.12      100.00
--------------+-----------------------------------
        Total |      2,171      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,343 |     1,343 
  CKD stage 3 |         0          0          0        383 |       383 
CKD stage 4/5 |         0          0          0         17 |        17 
     Dialysis |       209          0          0          0 |       209 
   Transplant |         0        173          0          0 |       173 
  KRT unclear |         0          0         46          0 |        46 
--------------+--------------------------------------------+----------
        Total |       209        173         46      1,743 |     2,171 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       140         82         54         15 |     1,343 
  CKD stage 3 |        40         16         12          2 |       383 
CKD stage 4/5 |         1          2          0          1 |        17 
     Dialysis |        22         13          9          3 |       209 
   Transplant |        21         12          2          0 |       173 
  KRT unclear |         1          2          3          0 |        46 
--------------+--------------------------------------------+----------
        Total |       225        127         80         21 |     2,171 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |     1,052 |     1,343 
  CKD stage 3 |       313 |       383 
CKD stage 4/5 |        13 |        17 
     Dialysis |       162 |       209 
   Transplant |       138 |       173 
  KRT unclear |        40 |        46 
--------------+-----------+----------
        Total |     1,718 |     2,171 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,161 missing values generated)

. replace sex = 0 if male == "Female"
(1,161 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(942 real changes made, 942 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(942 missing values generated)

. gen min_creatinine_outcome=.
(2,171 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(640 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(589 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(640 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(589 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(775 real changes made)

. gen max_creatinine_outcome=.
(2,171 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(640 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(589 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,229 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,396 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(942 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,229 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(640 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(942 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1229 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(195 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(6 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(4 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(127 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(80 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(21 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(225 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,556       71.67       71.67
               CKD 3 |        154        7.09       78.77
     CKD 4/5 pre-KRT |          8        0.37       79.13
            Dialysis |        127        5.85       84.98
   Kidney transplant |         80        3.68       88.67
KRT unclear modality |         21        0.97       89.64
            Deceased |        225       10.36      100.00
---------------------+-----------------------------------
               Total |      2,171      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,343
  CKD stage |          87           0         383
  CKD stage |           0           0          17
   Dialysis |          56           0         209
  Transplan |          38           0         173
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   256.06357   152.28606       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,171         571           0        571        571

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,343
  CKD stage |         110           0         383
  CKD stage |           8           0          17
   Dialysis |          67           0         209
  Transplan |          41           0         173
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   242.79641    131.8742       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,171         580           0        580        580

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,343
  CKD stage |          89           0         383
  CKD stage |          16           0          17
   Dialysis |          52           0         209
  Transplan |          64           0         173
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |    243.9369    138.3506       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,171         585           0        585        585

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,343
  CKD stage |         114           0         383
  CKD stage |           0           0          17
   Dialysis |          48           0         209
  Transplan |          35           0         173
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   221.29433   119.38613       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,171         517           0        517        517

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,343
  CKD stage |          78           0         383
  CKD stage |          -1           0          17
   Dialysis |          54           0         209
  Transplan |          40           0         173
  KRT uncle |          18           0          46
------------+------------------------------------
      Total |   225.42377   131.27413       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,171         517           0        517        517

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,343
  CKD stage |          64           0         383
  CKD stage |           8           0          17
   Dialysis |          39           0         209
  Transplan |          40           0         173
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   215.14003   131.44096       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,171         475           0        475        475

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,343
  CKD stage |          91           0         383
  CKD stage |           9           0          17
   Dialysis |          63           0         209
  Transplan |          53           0         173
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   243.73515   137.42017       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,171         576           0        576        576

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,343
  CKD stage |          97           0         383
  CKD stage |           8           0          17
   Dialysis |          29           0         209
  Transplan |          46           0         173
  KRT uncle |           0           0          46
------------+------------------------------------
      Total |   259.94104   156.91357       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,171         562           0        562        562

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,343
  CKD stage |         119           0         383
  CKD stage |           0           0          17
   Dialysis |          52           0         209
  Transplan |          57           0         173
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   260.79134   143.60071       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,171         606           0        606        606

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,343
  CKD stage |          85           0         383
  CKD stage |           4           0          17
   Dialysis |          31           0         209
  Transplan |          26           0         173
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |   247.79456   154.28747       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,171         517           0        517        517

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,343
  CKD stage |         124           0         383
  CKD stage |           3           0          17
   Dialysis |          69           0         209
  Transplan |          28           0         173
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   262.92077   145.28967       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,171         607           0        607        607

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,343
  CKD stage |          85           0         383
  CKD stage |           3           0          17
   Dialysis |          54           0         209
  Transplan |          38           0         173
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |    246.1778   145.77733       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,171         551           0        551        551

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,343
  CKD stage |          70           0         383
  CKD stage |           3           0          17
   Dialysis |          53           0         209
  Transplan |          68           0         173
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   230.87333   134.34455       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,171         536           0        536        536

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,343
  CKD stage |          85           0         383
  CKD stage |           3           0          17
   Dialysis |          48           0         209
  Transplan |          51           0         173
  KRT uncle |          18           0          46
------------+------------------------------------
      Total |   213.37955   118.78698       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,171         511           0        511        511

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,343
  CKD stage |         136           0         383
  CKD stage |           7           0          17
   Dialysis |          57           0         209
  Transplan |          30           0         173
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |    257.9719   139.73044       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,171         607           0        607        607

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,343
  CKD stage |          91           0         383
  CKD stage |           6           0          17
   Dialysis |          46           0         209
  Transplan |          48           0         173
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   253.47259   149.33363       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,171         572           0        572        572

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,343
  CKD stage |          84           0         383
  CKD stage |          10           0          17
   Dialysis |          54           0         209
  Transplan |          38           0         173
  KRT uncle |           2           0          46
------------+------------------------------------
      Total |   227.92584     132.192       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,171         519           0        519        519

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,343
  CKD stage |         104           0         383
  CKD stage |           9           0          17
   Dialysis |          45           0         209
  Transplan |          34           0         173
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   230.40949   129.96998       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,171         532           0        532        532

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         421           0       1,343
  CKD stage |          86           0         383
  CKD stage |           3           0          17
   Dialysis |          53           0         209
  Transplan |          44           0         173
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |    284.4924   174.50948       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         619           0        619        619

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,343
  CKD stage |         126           0         383
  CKD stage |           6           0          17
   Dialysis |          62           0         209
  Transplan |          38           0         173
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   244.37034   129.55665       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         590           0        590        590

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,343
  CKD stage |          72           0         383
  CKD stage |           5           0          17
   Dialysis |          47           0         209
  Transplan |          51           0         173
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   260.85859   161.08574       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         568           0        568        568

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,343
  CKD stage |         111           0         383
  CKD stage |           4           0          17
   Dialysis |          84           0         209
  Transplan |          53           0         173
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   263.51635   142.04365       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         637           0        637        637

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,343
  CKD stage |          96           0         383
  CKD stage |           2           0          17
   Dialysis |          52           0         209
  Transplan |          43           0         173
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   210.56011    114.0629       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,171         502           0        502        502

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,343
  CKD stage |          91           0         383
  CKD stage |           4           0          17
   Dialysis |          67           0         209
  Transplan |          48           0         173
  KRT uncle |           5           0          46
------------+------------------------------------
      Total |    238.0304   133.34918       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,171         557           0        557        557

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,343
  CKD stage |         102           0         383
  CKD stage |           2           0          17
   Dialysis |          32           0         209
  Transplan |          45           0         173
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   242.02027   140.52066       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,171         542           0        542        542

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,343
  CKD stage |          90           0         383
  CKD stage |           3           0          17
   Dialysis |          31           0         209
  Transplan |          19           0         173
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   240.96315   147.99534       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,171         515           0        515        515

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,343
  CKD stage |         152           0         383
  CKD stage |           3           0          17
   Dialysis |          54           0         209
  Transplan |          61           0         173
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |    241.9544   117.88667       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,171         615           0        615        615

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,343
  CKD stage |         102           0         383
  CKD stage |           4           0          17
   Dialysis |          77           0         209
  Transplan |          30           0         173
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   222.34777   118.49871       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,171         540           0        540        540

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         423           0       1,343
  CKD stage |          84           0         383
  CKD stage |           4           0          17
   Dialysis |          55           0         209
  Transplan |          36           0         173
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   284.93966   176.50291       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,171         614           0        614        614

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,343
  CKD stage |          91           0         383
  CKD stage |          17           0          17
   Dialysis |          46           0         209
  Transplan |          60           0         173
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   232.13911   130.70329       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,171         554           0        554        554

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,343
  CKD stage |          86           0         383
  CKD stage |           4           0          17
   Dialysis |          37           0         209
  Transplan |          39           0         173
  KRT uncle |          18           0          46
------------+------------------------------------
      Total |   221.44634   129.12711       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         506           0        506        506

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,343
  CKD stage |          63           0         383
  CKD stage |           0           0          17
   Dialysis |          46           0         209
  Transplan |          40           0         173
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |    216.9392   131.62588       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         481           0        481        481

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,343
  CKD stage |         105           0         383
  CKD stage |           9           0          17
   Dialysis |          54           0         209
  Transplan |          49           0         173
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   213.00046   111.19287       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         532           0        532        532

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,343
  CKD stage |         102           0         383
  CKD stage |           0           0          17
   Dialysis |          53           0         209
  Transplan |          54           0         173
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   246.06541   137.43046       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         576           0        576        576

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,343
  CKD stage |         122           0         383
  CKD stage |          10           0          17
   Dialysis |          34           0         209
  Transplan |          67           0         173
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   223.36757   115.87746       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,171         552           0        552        552

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,343
  CKD stage |          95           0         383
  CKD stage |           0           0          17
   Dialysis |          72           0         209
  Transplan |          38           0         173
  KRT uncle |          20           0          46
------------+------------------------------------
      Total |   247.98618   139.88466       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,171         582           0        582        582

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,343
  CKD stage |         126           0         383
  CKD stage |           0           0          17
   Dialysis |          66           0         209
  Transplan |          29           0         173
  KRT uncle |          22           0          46
------------+------------------------------------
      Total |   256.53293   139.50066       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,171         607           0        607        607

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,343
  CKD stage |          93           0         383
  CKD stage |           7           0          17
   Dialysis |          93           0         209
  Transplan |          55           0         173
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   231.05712   120.67268       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,171         583           0        583        583

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,343
  CKD stage |         127           0         383
  CKD stage |           0           0          17
   Dialysis |          50           0         209
  Transplan |          32           0         173
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |   214.79595   111.08792       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,171         511           0        511        511

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,343
  CKD stage |         113           0         383
  CKD stage |          10           0          17
   Dialysis |          87           0         209
  Transplan |          35           0         173
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   247.86043   132.03752       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,171         603           0        603        603

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,343
  CKD stage |         113           0         383
  CKD stage |           0           0          17
   Dialysis |          57           0         209
  Transplan |          58           0         173
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   246.21419   132.55543       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,171         590           0        590        590

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,343
  CKD stage |          97           0         383
  CKD stage |           4           0          17
   Dialysis |          24           0         209
  Transplan |          47           0         173
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   254.87702   153.21011       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,171         561           0        561        561

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,343
  CKD stage |          92           0         383
  CKD stage |           1           0          17
   Dialysis |          49           0         209
  Transplan |          56           0         173
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   252.08291   145.97153       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,171         576           0        576        576

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,343
  CKD stage |         118           0         383
  CKD stage |           4           0          17
   Dialysis |          76           0         209
  Transplan |          52           0         173
  KRT uncle |          22           0          46
------------+------------------------------------
      Total |   205.36665   96.022127       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,171         551           0        551        551

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,343
  CKD stage |         112           0         383
  CKD stage |           2           0          17
   Dialysis |          85           0         209
  Transplan |          71           0         173
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   238.67112   118.87984       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,171         615           0        615        615

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,343
  CKD stage |          75           0         383
  CKD stage |           5           0          17
   Dialysis |          43           0         209
  Transplan |          44           0         173
  KRT uncle |          26           0          46
------------+------------------------------------
      Total |   228.70106   135.89281       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         528           0        528        528

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,343
  CKD stage |         121           0         383
  CKD stage |           1           0          17
   Dialysis |          59           0         209
  Transplan |          46           0         173
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   241.21741   128.14556       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,171         576           0        576        576

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,343
  CKD stage |          96           0         383
  CKD stage |           0           0          17
   Dialysis |          53           0         209
  Transplan |          54           0         173
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   204.71257    107.4185       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,171         501           0        501        501

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,343
  CKD stage |         103           0         383
  CKD stage |           8           0          17
   Dialysis |          67           0         209
  Transplan |          50           0         173
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   269.64579   153.03384       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,171         633           0        633        633

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,343
  CKD stage |         113           0         383
  CKD stage |           7           0          17
   Dialysis |          33           0         209
  Transplan |          51           0         173
  KRT uncle |          19           0          46
------------+------------------------------------
      Total |   236.10456   130.72912       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,171         560           0        560        560

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,343
  CKD stage |         128           0         383
  CKD stage |           6           0          17
   Dialysis |          57           0         209
  Transplan |          80           0         173
  KRT uncle |           0           0          46
------------+------------------------------------
      Total |   262.75725   137.51803       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,171         640           0        640        640

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,343
  CKD stage |         114           0         383
  CKD stage |           0           0          17
   Dialysis |          54           0         209
  Transplan |          31           0         173
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   214.10871   113.40522       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,171         506           0        506        506

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,343
  CKD stage |         101           0         383
  CKD stage |           2           0          17
   Dialysis |          79           0         209
  Transplan |          26           0         173
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   226.23261    122.5691       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,171         536           0        536        536

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,343
  CKD stage |         127           0         383
  CKD stage |           4           0          17
   Dialysis |          72           0         209
  Transplan |          31           0         173
  KRT uncle |          20           0          46
------------+------------------------------------
      Total |   261.76555   141.64622       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,171         625           0        625        625

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,343
  CKD stage |         111           0         383
  CKD stage |           1           0          17
   Dialysis |          47           0         209
  Transplan |          36           0         173
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |   237.99263   133.37888       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         539           0        539        539

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,343
  CKD stage |          89           0         383
  CKD stage |           5           0          17
   Dialysis |          60           0         209
  Transplan |          45           0         173
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   206.54537    111.1706       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         501           0        501        501

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         397           0       1,343
  CKD stage |         113           0         383
  CKD stage |          11           0          17
   Dialysis |          65           0         209
  Transplan |          42           0         173
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   275.38277   156.44874       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         636           0        636        636

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,343
  CKD stage |         110           0         383
  CKD stage |           6           0          17
   Dialysis |          57           0         209
  Transplan |          41           0         173
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   247.32197   137.63931       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         574           0        574        574

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,343
  CKD stage |          96           0         383
  CKD stage |           0           0          17
   Dialysis |          56           0         209
  Transplan |          63           0         173
  KRT uncle |          -1           0          46
------------+------------------------------------
      Total |   238.27176   131.95114       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,171         555           0        555        555

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,343
  CKD stage |         108           0         383
  CKD stage |           0           0          17
   Dialysis |          69           0         209
  Transplan |          39           0         173
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   222.12713   116.29989       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,171         543           0        543        543

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,343
  CKD stage |         107           0         383
  CKD stage |           9           0          17
   Dialysis |          47           0         209
  Transplan |          43           0         173
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   226.32335     123.724       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,171         539           0        539        539

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,343
  CKD stage |          74           0         383
  CKD stage |           5           0          17
   Dialysis |          51           0         209
  Transplan |          41           0         173
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |   225.47536   133.74007       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,171         504           0        504        504

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,343
  CKD stage |          65           0         383
  CKD stage |           8           0          17
   Dialysis |          33           0         209
  Transplan |          51           0         173
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   221.20405   135.21621       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,171         491           0        491        491

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         409           0       1,343
  CKD stage |         128           0         383
  CKD stage |           1           0          17
   Dialysis |          79           0         209
  Transplan |          43           0         173
  KRT uncle |          20           0          46
------------+------------------------------------
      Total |   287.05573   157.28626       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,171         680           0        680        680

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,343
  CKD stage |         113           0         383
  CKD stage |           2           0          17
   Dialysis |          41           0         209
  Transplan |          37           0         173
  KRT uncle |          17           0          46
------------+------------------------------------
      Total |   243.10088   137.06765       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,171         559           0        559        559

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,343
  CKD stage |         127           0         383
  CKD stage |           1           0          17
   Dialysis |          83           0         209
  Transplan |          32           0         173
  KRT uncle |          29           0          46
------------+------------------------------------
      Total |   253.79226   132.68633       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,171         628           0        628        628

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         395           0       1,343
  CKD stage |          82           0         383
  CKD stage |           0           0          17
   Dialysis |          69           0         209
  Transplan |          54           0         173
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   269.99539   159.72535       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,171         611           0        611        611

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,343
  CKD stage |          70           0         383
  CKD stage |           0           0          17
   Dialysis |          42           0         209
  Transplan |          31           0         173
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   239.96039   149.61384       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,171         512           0        512        512

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,343
  CKD stage |          94           0         383
  CKD stage |           4           0          17
   Dialysis |          26           0         209
  Transplan |          19           0         173
  KRT uncle |           5           0          46
------------+------------------------------------
      Total |   237.25058   145.44696       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,171         498           0        498        498

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,343
  CKD stage |         117           0         383
  CKD stage |          11           0          17
   Dialysis |          59           0         209
  Transplan |          75           0         173
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   224.44864   110.81605       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         586           0        586        586

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         403           0       1,343
  CKD stage |         118           0         383
  CKD stage |           2           0          17
   Dialysis |          44           0         209
  Transplan |          49           0         173
  KRT uncle |           5           0          46
------------+------------------------------------
      Total |   278.37863   160.68472       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,171         621           0        621        621

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,343
  CKD stage |         110           0         383
  CKD stage |           6           0          17
   Dialysis |          32           0         209
  Transplan |          28           0         173
  KRT uncle |          24           0          46
------------+------------------------------------
      Total |   227.55827   129.15236       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,171         527           0        527        527

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         397           0       1,343
  CKD stage |          76           0         383
  CKD stage |           0           0          17
   Dialysis |          56           0         209
  Transplan |          40           0         173
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   267.89175   164.91822       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,171         584           0        584        584

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,343
  CKD stage |         113           0         383
  CKD stage |           0           0          17
   Dialysis |          33           0         209
  Transplan |          64           0         173
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   223.92538   119.67579       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,171         537           0        537        537

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,343
  CKD stage |          71           0         383
  CKD stage |           8           0          17
   Dialysis |          45           0         209
  Transplan |          40           0         173
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   239.84109   147.17148       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,171         525           0        525        525

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         406           0       1,343
  CKD stage |          52           0         383
  CKD stage |           0           0          17
   Dialysis |          59           0         209
  Transplan |          51           0         173
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   270.28466   173.06226       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,171         578           0        578        578

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,343
  CKD stage |         118           0         383
  CKD stage |           5           0          17
   Dialysis |          66           0         209
  Transplan |          42           0         173
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   269.48825   150.24749       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,171         624           0        624        624

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,343
  CKD stage |          60           0         383
  CKD stage |           2           0          17
   Dialysis |          65           0         209
  Transplan |          39           0         173
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   223.20866   133.81727       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,171         510           0        510        510

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,343
  CKD stage |          68           0         383
  CKD stage |           2           0          17
   Dialysis |          59           0         209
  Transplan |          55           0         173
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |    225.8936   131.66251       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         527           0        527        527

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,343
  CKD stage |          67           0         383
  CKD stage |           0           0          17
   Dialysis |          27           0         209
  Transplan |          35           0         173
  KRT uncle |           1           0          46
------------+------------------------------------
      Total |   197.24459   120.18902       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         421           0        421        421

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,343
  CKD stage |          84           0         383
  CKD stage |           3           0          17
   Dialysis |          59           0         209
  Transplan |          52           0         173
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   210.41824   114.89933       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         506           0        506        506

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,343
  CKD stage |         104           0         383
  CKD stage |           0           0          17
   Dialysis |          36           0         209
  Transplan |          26           0         173
  KRT uncle |          17           0          46
------------+------------------------------------
      Total |   225.91156   129.64516       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,171         509           0        509        509

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,343
  CKD stage |         102           0         383
  CKD stage |           2           0          17
   Dialysis |          49           0         209
  Transplan |          32           0         173
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   232.59604   132.20843       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,171         524           0        524        524

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,343
  CKD stage |          83           0         383
  CKD stage |           2           0          17
   Dialysis |          43           0         209
  Transplan |          43           0         173
  KRT uncle |          30           0          46
------------+------------------------------------
      Total |   233.18701   136.76038       2,171

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,171         541           0        541        541

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(82 real changes made)

. replace ethnicity=2 if ethnicity==3
(70 real changes made)

. replace ethnicity=3 if ethnicity==4
(77 real changes made)

. replace ethnicity=4 if ethnicity==6
(82 real changes made)

. replace ethnicity=6 if ethnicity==.
(562 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,943 missing values generated)

. replace region = 2 if region_string=="East"
(233 real changes made)

. replace region = 3 if region_string=="London"
(414 real changes made)

. replace region = 4 if region_string=="North East"
(238 real changes made)

. replace region = 5 if region_string=="North West"
(231 real changes made)

. replace region = 6 if region_string=="South East"
(221 real changes made)

. replace region = 7 if region_string=="South West"
(195 real changes made)

. replace region = 8 if region_string=="West Midlands"
(200 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(211 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,171 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(868 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,303 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v2.dta", replace
(note: file ./output/2019_ckd_complete_v2.dta not found)
file ./output/2019_ckd_complete_v2.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete_v2.log
  log type:  text
 closed on:  24 Mar 2023, 18:41:20
-------------------------------------------------------------------------------
