-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete_v3.log
  log type:  text
 opened on:  21 Apr 2023, 07:54:36

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 20,935 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00014.000001 not found)
file /tmp/St00014.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,641
        from master                    47,853  (_merge==1)
        from using                     18,788  (_merge==2)

    matched                             2,147  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,641 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v3

. save ``dataset'_ckd_complete_v3', replace
(note: file /tmp/St00014.000002 not found)
file /tmp/St00014.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v3
> save 2017_ckd_complete_v3, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        206        9.59        9.59
Kidney transplant |        205        9.55       19.14
 Modality unclear |         41        1.91       21.05
          Pre KRT |      1,695       78.95      100.00
------------------+-----------------------------------
            Total |      2,147      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(822 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1325 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,325       61.71       61.71
          . |        822       38.29      100.00
------------+-----------------------------------
      Total |      2,147      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(206 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(23 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(149 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(315 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(14 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       126         80 |       206 
Kidney transplant |       205          0 |       205 
 Modality unclear |        41          0 |        41 
          Pre KRT |     1,695          0 |     1,695 
------------------+----------------------+----------
            Total |     2,067         80 |     2,147 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       184         22 |       206 
Kidney transplant |       173         32 |       205 
 Modality unclear |        35          6 |        41 
          Pre KRT |     1,454        241 |     1,695 
------------------+----------------------+----------
            Total |     1,846        301 |     2,147 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(822 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1325 changes made)

. replace ckd_group = 4 if dialysis==1
(80 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(301 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(41 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(607 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,292       60.18       60.18
         CKD stage 3 |        420       19.56       79.74
       CKD stage 4/5 |         19        0.88       80.62
            Dialysis |         80        3.73       84.35
          Transplant |        295       13.74       98.09
KRT unclear modality |         41        1.91      100.00
---------------------+-----------------------------------
               Total |      2,147      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        65        128          0      1,099 |     1,292 
         CKD stage 3 |        39         45          0        336 |       420 
       CKD stage 4/5 |         0          0          0         19 |        19 
            Dialysis |        80          0          0          0 |        80 
          Transplant |        22         32          0        241 |       295 
KRT unclear modality |         0          0         41          0 |        41 
---------------------+--------------------------------------------+----------
               Total |       206        205         41      1,695 |     2,147 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       136         48         46         10 |     1,292 
         CKD stage 3 |        45         20         24          6 |       420 
       CKD stage 4/5 |         1          1          1          0 |        19 
            Dialysis |        12          2          1          1 |        80 
          Transplant |        25         13         11          3 |       295 
KRT unclear modality |         5          3          0          0 |        41 
---------------------+--------------------------------------------+----------
               Total |       224         87         83         20 |     2,147 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,052 |     1,292 
         CKD stage 3 |       325 |       420 
       CKD stage 4/5 |        16 |        19 
            Dialysis |        64 |        80 
          Transplant |       243 |       295 
KRT unclear modality |        33 |        41 
---------------------+-----------+----------
               Total |     1,733 |     2,147 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,141 missing values generated)

. replace sex = 0 if male == "Female"
(1,141 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(950 real changes made, 950 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(950 missing values generated)

. gen min_creatinine_outcome=.
(2,147 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(647 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(550 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(647 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(550 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(741 real changes made)

. gen max_creatinine_outcome=.
(2,147 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(647 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(550 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,197 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,406 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(950 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,197 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(647 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(950 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1197 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(168 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(6 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(5 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(950 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1197 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,197       55.75       55.75
          . |        950       44.25      100.00
------------+-----------------------------------
      Total |      2,147      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(87 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(83 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(13 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(20 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(87 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(96 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(224 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,588       73.96       73.96
               CKD 3 |        135        6.29       80.25
     CKD 4/5 pre-KRT |         10        0.47       80.72
            Dialysis |         87        4.05       84.77
   Kidney transplant |         96        4.47       89.24
KRT unclear modality |          7        0.33       89.57
            Deceased |        224       10.43      100.00
---------------------+-----------------------------------
               Total |      2,147      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,292
  CKD stage |         139           0         420
  CKD stage |           0           0          19
   Dialysis |          25           0          80
  Transplan |          91           0         295
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   252.60224   125.31185       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,147         615           0        615        615

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,292
  CKD stage |         112           0         420
  CKD stage |          11           0          19
   Dialysis |          30           0          80
  Transplan |          96           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   218.82347   105.47835       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,147         561           0        561        561

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,292
  CKD stage |         102           0         420
  CKD stage |           3           0          19
   Dialysis |          24           0          80
  Transplan |         114           0         295
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |   235.16022   118.66551       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,147         575           0        575        575

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,292
  CKD stage |         112           0         420
  CKD stage |           0           0          19
   Dialysis |          22           0          80
  Transplan |          54           0         295
  KRT uncle |          18           0          41
------------+------------------------------------
      Total |   253.14765   145.55824       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,147         576           0        576        576

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,292
  CKD stage |         111           0         420
  CKD stage |           8           0          19
   Dialysis |          14           0          80
  Transplan |          82           0         295
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   218.46949   111.06877       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,147         530           0        530        530

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,292
  CKD stage |         118           0         420
  CKD stage |          11           0          19
   Dialysis |          37           0          80
  Transplan |          69           0         295
  KRT uncle |          16           0          41
------------+------------------------------------
      Total |   217.88542   109.29834       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,147         556           0        556        556

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,292
  CKD stage |         104           0         420
  CKD stage |           0           0          19
   Dialysis |          44           0          80
  Transplan |          78           0         295
  KRT uncle |          10           0          41
------------+------------------------------------
      Total |   220.64462   113.69478       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,147         548           0        548        548

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         391           0       1,292
  CKD stage |         102           0         420
  CKD stage |           7           0          19
   Dialysis |          25           0          80
  Transplan |          67           0         295
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |     265.483   155.57981       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,147         594           0        594        594

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,292
  CKD stage |          97           0         420
  CKD stage |           0           0          19
   Dialysis |          27           0          80
  Transplan |          72           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   255.70983   147.74352       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,147         580           0        580        580

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,292
  CKD stage |         131           0         420
  CKD stage |           2           0          19
   Dialysis |          24           0          80
  Transplan |          98           0         295
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   216.47508   97.486901       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,147         556           0        556        556

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,292
  CKD stage |          68           0         420
  CKD stage |           6           0          19
   Dialysis |          22           0          80
  Transplan |          54           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |    216.7401   132.39489       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,147         483           0        483        483

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,292
  CKD stage |         103           0         420
  CKD stage |           0           0          19
   Dialysis |          21           0          80
  Transplan |          70           0         295
  KRT uncle |          19           0          41
------------+------------------------------------
      Total |   245.14252   137.66562       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,147         569           0        569        569

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,292
  CKD stage |         132           0         420
  CKD stage |           2           0          19
   Dialysis |           7           0          80
  Transplan |          57           0         295
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |   214.53982   109.52004       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,147         502           0        502        502

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         267           0       1,292
  CKD stage |         119           0         420
  CKD stage |           3           0          19
   Dialysis |          35           0          80
  Transplan |          69           0         295
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |   194.97299   91.440727       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         504           0        504        504

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,292
  CKD stage |          67           0         420
  CKD stage |          11           0          19
   Dialysis |          21           0          80
  Transplan |          68           0         295
  KRT uncle |           0           0          41
------------+------------------------------------
      Total |   218.90498   131.07841       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         492           0        492        492

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,292
  CKD stage |          83           0         420
  CKD stage |           7           0          19
   Dialysis |          28           0          80
  Transplan |          84           0         295
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |   259.00792   151.94847       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         597           0        597        597

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,292
  CKD stage |         102           0         420
  CKD stage |           3           0          19
   Dialysis |          10           0          80
  Transplan |          87           0         295
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |   247.17653    136.6988       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         561           0        561        561

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,292
  CKD stage |         126           0         420
  CKD stage |           6           0          19
   Dialysis |          28           0          80
  Transplan |          85           0         295
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |   207.93479   95.355984       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         539           0        539        539

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         390           0       1,292
  CKD stage |         121           0         420
  CKD stage |           9           0          19
   Dialysis |          11           0          80
  Transplan |          75           0         295
  KRT uncle |           7           0          41
------------+------------------------------------
      Total |   269.28878   150.55383       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         613           0        613        613

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,292
  CKD stage |         112           0         420
  CKD stage |          14           0          19
   Dialysis |          19           0          80
  Transplan |          75           0         295
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |   243.74243   132.50234       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         574           0        574        574

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,292
  CKD stage |          93           0         420
  CKD stage |           2           0          19
   Dialysis |           7           0          80
  Transplan |          72           0         295
  KRT uncle |           7           0          41
------------+------------------------------------
      Total |   234.90498   134.28586       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         524           0        524        524

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,292
  CKD stage |         118           0         420
  CKD stage |           5           0          19
   Dialysis |          24           0          80
  Transplan |          65           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   220.87704   114.56756       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         533           0        533        533

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,292
  CKD stage |         100           0         420
  CKD stage |          13           0          19
   Dialysis |          22           0          80
  Transplan |          67           0         295
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |   224.71449   123.59017       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         528           0        528        528

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,292
  CKD stage |         139           0         420
  CKD stage |          13           0          19
   Dialysis |          40           0          80
  Transplan |          78           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |    237.0666   114.99833       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         607           0        607        607

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,292
  CKD stage |         139           0         420
  CKD stage |           4           0          19
   Dialysis |          25           0          80
  Transplan |          65           0         295
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |   241.90126   124.26361       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,147         584           0        584        584

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,292
  CKD stage |         138           0         420
  CKD stage |           3           0          19
   Dialysis |          22           0          80
  Transplan |          85           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   235.26828   113.81837       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         582           0        582        582

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,292
  CKD stage |         117           0         420
  CKD stage |           2           0          19
   Dialysis |          20           0          80
  Transplan |          91           0         295
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |   206.66511   96.550288       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         524           0        524        524

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,292
  CKD stage |         133           0         420
  CKD stage |           3           0          19
   Dialysis |           4           0          80
  Transplan |          74           0         295
  KRT uncle |           7           0          41
------------+------------------------------------
      Total |   241.69818   125.61098       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         562           0        562        562

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,292
  CKD stage |         136           0         420
  CKD stage |           7           0          19
   Dialysis |           6           0          80
  Transplan |          73           0         295
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   253.01304    133.7977       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         584           0        584        584

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,292
  CKD stage |         113           0         420
  CKD stage |          12           0          19
   Dialysis |          23           0          80
  Transplan |          80           0         295
  KRT uncle |          18           0          41
------------+------------------------------------
      Total |   214.93526   106.63891       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         546           0        546        546

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,292
  CKD stage |         103           0         420
  CKD stage |           0           0          19
   Dialysis |          37           0          80
  Transplan |          58           0         295
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   223.41966   122.77781       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         528           0        528        528

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,292
  CKD stage |         133           0         420
  CKD stage |           8           0          19
   Dialysis |           1           0          80
  Transplan |          95           0         295
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |   220.40708    103.1897       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         543           0        543        543

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,292
  CKD stage |         117           0         420
  CKD stage |           8           0          19
   Dialysis |          20           0          80
  Transplan |          54           0         295
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   212.91523   112.47662       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         504           0        504        504

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,292
  CKD stage |          82           0         420
  CKD stage |           0           0          19
   Dialysis |          37           0          80
  Transplan |          71           0         295
  KRT uncle |          12           0          41
------------+------------------------------------
      Total |   224.78482   127.60072       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         530           0        530        530

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,292
  CKD stage |         122           0         420
  CKD stage |           9           0          19
   Dialysis |          22           0          80
  Transplan |          85           0         295
  KRT uncle |          14           0          41
------------+------------------------------------
      Total |   255.15417   134.63381       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         615           0        615        615

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,292
  CKD stage |         121           0         420
  CKD stage |           3           0          19
   Dialysis |          31           0          80
  Transplan |          89           0         295
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |     236.381   118.53316       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         581           0        581        581

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,292
  CKD stage |         105           0         420
  CKD stage |           6           0          19
   Dialysis |           8           0          80
  Transplan |          81           0         295
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   211.40568   108.69135       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,147         501           0        501        501

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,292
  CKD stage |         101           0         420
  CKD stage |          12           0          19
   Dialysis |          14           0          80
  Transplan |          75           0         295
  KRT uncle |          18           0          41
------------+------------------------------------
      Total |   215.77783   113.77765       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,147         527           0        527        527

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,292
  CKD stage |         125           0         420
  CKD stage |           0           0          19
   Dialysis |           4           0          80
  Transplan |          84           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   224.06754   111.38421       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,147         534           0        534        534

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,292
  CKD stage |          88           0         420
  CKD stage |           0           0          19
   Dialysis |          20           0          80
  Transplan |          63           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |     228.381   132.13846       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,147         515           0        515        515

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,292
  CKD stage |          97           0         420
  CKD stage |          12           0          19
   Dialysis |          17           0          80
  Transplan |          84           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |     265.517   152.95666       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,147         608           0        608        608

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,292
  CKD stage |         142           0         420
  CKD stage |           5           0          19
   Dialysis |          15           0          80
  Transplan |          81           0         295
  KRT uncle |          22           0          41
------------+------------------------------------
      Total |   246.33815   122.41724       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,147         608           0        608        608

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,292
  CKD stage |         112           0         420
  CKD stage |           4           0          19
   Dialysis |          16           0          80
  Transplan |          73           0         295
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   249.36143   137.89164       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,147         573           0        573        573

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,292
  CKD stage |         122           0         420
  CKD stage |           2           0          19
   Dialysis |          28           0          80
  Transplan |          55           0         295
  KRT uncle |           1           0          41
------------+------------------------------------
      Total |   233.49418    126.3942       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,147         542           0        542        542

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,292
  CKD stage |         105           0         420
  CKD stage |           4           0          19
   Dialysis |           7           0          80
  Transplan |          53           0         295
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |   234.03866   134.77807       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,147         517           0        517        517

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,292
  CKD stage |         115           0         420
  CKD stage |           1           0          19
   Dialysis |           4           0          80
  Transplan |          59           0         295
  KRT uncle |          10           0          41
------------+------------------------------------
      Total |   248.19096   141.07331       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         550           0        550        550

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,292
  CKD stage |          77           0         420
  CKD stage |          11           0          19
   Dialysis |          12           0          80
  Transplan |          83           0         295
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   213.11132   119.00341       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         500           0        500        500

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,292
  CKD stage |         112           0         420
  CKD stage |           5           0          19
   Dialysis |          17           0          80
  Transplan |         101           0         295
  KRT uncle |          15           0          41
------------+------------------------------------
      Total |   247.97252   128.55651       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,147         601           0        601        601

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,292
  CKD stage |         120           0         420
  CKD stage |          11           0          19
   Dialysis |          18           0          80
  Transplan |          96           0         295
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |   226.50349    110.1408       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,147         565           0        565        565

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         417           0       1,292
  CKD stage |          92           0         420
  CKD stage |           3           0          19
   Dialysis |          13           0          80
  Transplan |          66           0         295
  KRT uncle |          15           0          41
------------+------------------------------------
      Total |   278.80112   170.84975       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         606           0        606        606

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,292
  CKD stage |         112           0         420
  CKD stage |           0           0          19
   Dialysis |          24           0          80
  Transplan |          75           0         295
  KRT uncle |          12           0          41
------------+------------------------------------
      Total |   208.45319   103.73876       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         514           0        514        514

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,292
  CKD stage |          75           0         420
  CKD stage |          15           0          19
   Dialysis |          19           0          80
  Transplan |          59           0         295
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |   234.48673   142.61696       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         531           0        531        531

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,292
  CKD stage |         131           0         420
  CKD stage |           8           0          19
   Dialysis |          11           0          80
  Transplan |          81           0         295
  KRT uncle |          18           0          41
------------+------------------------------------
      Total |   230.74849   114.18405       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         570           0        570        570

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,292
  CKD stage |          95           0         420
  CKD stage |          10           0          19
   Dialysis |          19           0          80
  Transplan |          83           0         295
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |   249.47555   140.69611       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         583           0        583        583

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,292
  CKD stage |         131           0         420
  CKD stage |          11           0          19
   Dialysis |          12           0          80
  Transplan |          75           0         295
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |   243.58034   126.58587       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         578           0        578        578

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,292
  CKD stage |         156           0         420
  CKD stage |           6           0          19
   Dialysis |          17           0          80
  Transplan |          74           0         295
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |   218.98882    99.71047       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         553           0        553        553

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,292
  CKD stage |         107           0         420
  CKD stage |           6           0          19
   Dialysis |          11           0          80
  Transplan |          65           0         295
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |   251.27061   144.04871       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         561           0        561        561

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,292
  CKD stage |         104           0         420
  CKD stage |          11           0          19
   Dialysis |          21           0          80
  Transplan |          45           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   219.54401   124.32806       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         509           0        509        509

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,292
  CKD stage |         115           0         420
  CKD stage |           9           0          19
   Dialysis |          14           0          80
  Transplan |         117           0         295
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |    245.6381   122.24028       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         601           0        601        601

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,292
  CKD stage |         162           0         420
  CKD stage |           7           0          19
   Dialysis |          30           0          80
  Transplan |          61           0         295
  KRT uncle |           7           0          41
------------+------------------------------------
      Total |   224.92548   105.23025       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         572           0        572        572

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,292
  CKD stage |         100           0         420
  CKD stage |           1           0          19
   Dialysis |          24           0          80
  Transplan |          75           0         295
  KRT uncle |          11           0          41
------------+------------------------------------
      Total |   201.88309   102.65164       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,147         495           0        495        495

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,292
  CKD stage |          95           0         420
  CKD stage |           4           0          19
   Dialysis |          12           0          80
  Transplan |          44           0         295
  KRT uncle |          14           0          41
------------+------------------------------------
      Total |   216.74243   126.19137       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,147         487           0        487        487

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,292
  CKD stage |         100           0         420
  CKD stage |           5           0          19
   Dialysis |          37           0          80
  Transplan |          73           0         295
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |    237.6707   130.61814       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,147         571           0        571        571

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,292
  CKD stage |          79           0         420
  CKD stage |           3           0          19
   Dialysis |          17           0          80
  Transplan |          77           0         295
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |   203.08896   111.66336       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,147         473           0        473        473

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         250           0       1,292
  CKD stage |          98           0         420
  CKD stage |           3           0          19
   Dialysis |          25           0          80
  Transplan |          57           0         295
  KRT uncle |          17           0          41
------------+------------------------------------
      Total |   178.72799   89.580781       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,147         450           0        450        450

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,292
  CKD stage |          71           0         420
  CKD stage |           2           0          19
   Dialysis |          24           0          80
  Transplan |          55           0         295
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |    217.4462   131.60762       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,147         482           0        482        482

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         269           0       1,292
  CKD stage |         132           0         420
  CKD stage |           9           0          19
   Dialysis |          16           0          80
  Transplan |         102           0         295
  KRT uncle |          15           0          41
------------+------------------------------------
      Total |   202.67536   85.576682       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,147         543           0        543        543

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         269           0       1,292
  CKD stage |         116           0         420
  CKD stage |           8           0          19
   Dialysis |          27           0          80
  Transplan |          56           0         295
  KRT uncle |          13           0          41
------------+------------------------------------
      Total |    193.5878    95.74362       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,147         489           0        489        489

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,292
  CKD stage |         153           0         420
  CKD stage |           4           0          19
   Dialysis |          15           0          80
  Transplan |          73           0         295
  KRT uncle |           9           0          41
------------+------------------------------------
      Total |   250.74429   125.50859       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,147         603           0        603        603

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,292
  CKD stage |          93           0         420
  CKD stage |           0           0          19
   Dialysis |          20           0          80
  Transplan |          68           0         295
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   255.30135   150.67897       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         566           0        566        566

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,292
  CKD stage |         141           0         420
  CKD stage |           2           0          19
   Dialysis |          23           0          80
  Transplan |          96           0         295
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |   255.95435   126.23866       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         622           0        622        622

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,292
  CKD stage |         104           0         420
  CKD stage |           4           0          19
   Dialysis |          19           0          80
  Transplan |          70           0         295
  KRT uncle |           5           0          41
------------+------------------------------------
      Total |    238.4122   132.65241       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,147         547           0        547        547

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,292
  CKD stage |         126           0         420
  CKD stage |           7           0          19
   Dialysis |          23           0          80
  Transplan |          75           0         295
  KRT uncle |           2           0          41
------------+------------------------------------
      Total |   221.85748   110.18758       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,147         542           0        542        542

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,292
  CKD stage |         137           0         420
  CKD stage |           6           0          19
   Dialysis |           7           0          80
  Transplan |         102           0         295
  KRT uncle |          15           0          41
------------+------------------------------------
      Total |   266.47741   135.20007       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         641           0        641        641

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,292
  CKD stage |          99           0         420
  CKD stage |           7           0          19
   Dialysis |          30           0          80
  Transplan |          52           0         295
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   210.68654   116.42004       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         495           0        495        495

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,292
  CKD stage |          95           0         420
  CKD stage |          10           0          19
   Dialysis |          36           0          80
  Transplan |          93           0         295
  KRT uncle |          14           0          41
------------+------------------------------------
      Total |   240.06847   128.81262       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         592           0        592        592

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,292
  CKD stage |         135           0         420
  CKD stage |           2           0          19
   Dialysis |          23           0          80
  Transplan |          79           0         295
  KRT uncle |           8           0          41
------------+------------------------------------
      Total |   251.91942   129.71581       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         602           0        602        602

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,292
  CKD stage |         106           0         420
  CKD stage |           4           0          19
   Dialysis |          10           0          80
  Transplan |          99           0         295
  KRT uncle |           6           0          41
------------+------------------------------------
      Total |   236.45412   123.20461       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         560           0        560        560

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,292
  CKD stage |         100           0         420
  CKD stage |           8           0          19
   Dialysis |          18           0          80
  Transplan |          78           0         295
  KRT uncle |          12           0          41
------------+------------------------------------
      Total |   228.63065   123.62651       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         544           0        544        544

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,292
  CKD stage |          89           0         420
  CKD stage |           8           0          19
   Dialysis |           8           0          80
  Transplan |          51           0         295
  KRT uncle |           4           0          41
------------+------------------------------------
      Total |   241.50023   146.92593       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         520           0        520        520

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,292
  CKD stage |         135           0         420
  CKD stage |           5           0          19
   Dialysis |          25           0          80
  Transplan |          83           0         295
  KRT uncle |           1           0          41
------------+------------------------------------
      Total |   271.09129   143.92971       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         635           0        635        635

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,292
  CKD stage |         114           0         420
  CKD stage |           5           0          19
   Dialysis |          28           0          80
  Transplan |          75           0         295
  KRT uncle |           3           0          41
------------+------------------------------------
      Total |   238.95435   127.38748       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         566           0        566        566

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,292
  CKD stage |         132           0         420
  CKD stage |           3           0          19
   Dialysis |          25           0          80
  Transplan |          67           0         295
  KRT uncle |          20           0          41
------------+------------------------------------
      Total |   252.40335   133.84287       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         606           0        606        606

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,292
  CKD stage |         113           0         420
  CKD stage |           0           0          19
   Dialysis |          22           0          80
  Transplan |          82           0         295
  KRT uncle |          14           0          41
------------+------------------------------------
      Total |   231.23801   119.69072       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         558           0        558        558

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(88 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(81 real changes made)

. replace ethnicity=4 if ethnicity==6
(88 real changes made)

. replace ethnicity=6 if ethnicity==.
(528 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,917 missing values generated)

. replace region = 2 if region_string=="East"
(230 real changes made)

. replace region = 3 if region_string=="London"
(427 real changes made)

. replace region = 4 if region_string=="North East"
(217 real changes made)

. replace region = 5 if region_string=="North West"
(193 real changes made)

. replace region = 6 if region_string=="South East"
(218 real changes made)

. replace region = 7 if region_string=="South West"
(220 real changes made)

. replace region = 8 if region_string=="West Midlands"
(194 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(218 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,147 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(845 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,302 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v3.dta", replace
(note: file ./output/2019_ckd_complete_v3.dta not found)
file ./output/2019_ckd_complete_v3.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2019_ckd_complete_v3.log
  log type:  text
 closed on:  21 Apr 2023, 07:54:39
-------------------------------------------------------------------------------
