-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete_v3.log
  log type:  text
 opened on:  21 Apr 2023, 14:35:45

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,025 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,739
        from master                    47,857  (_merge==1)
        from using                     18,882  (_merge==2)

    matched                             2,143  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,739 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v3

. save ``dataset'_ckd_complete_v3', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v3
> save 2017_ckd_complete_v3, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        186        8.68        8.68
Kidney transplant |        188        8.77       17.45
 Modality unclear |         38        1.77       19.23
          Pre KRT |      1,731       80.77      100.00
------------------+-----------------------------------
            Total |      2,143      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(899 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1244 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,244       58.05       58.05
          . |        899       41.95      100.00
------------+-----------------------------------
      Total |      2,143      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(186 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(24 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(133 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(300 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(10 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(38 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(7 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       109         77 |       186 
Kidney transplant |       188          0 |       188 
 Modality unclear |        38          0 |        38 
          Pre KRT |     1,731          0 |     1,731 
------------------+----------------------+----------
            Total |     2,066         77 |     2,143 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       174         12 |       186 
Kidney transplant |       156         32 |       188 
 Modality unclear |        31          7 |        38 
          Pre KRT |     1,492        239 |     1,731 
------------------+----------------------+----------
            Total |     1,853        290 |     2,143 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       186          0 |       186 
Kidney transplant |       188          0 |       188 
 Modality unclear |         7         31 |        38 
          Pre KRT |     1,731          0 |     1,731 
------------------+----------------------+----------
            Total |     2,112         31 |     2,143 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,776        290 |     2,066 
         1 |        77          0 |        77 
-----------+----------------------+----------
     Total |     1,853        290 |     2,143 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(899 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1244 changes made)

. replace ckd_group = 4 if dialysis==1
(77 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(290 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(31 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(703 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,373       64.07       64.07
         CKD stage 3 |        353       16.47       80.54
       CKD stage 4/5 |         19        0.89       81.43
            Dialysis |         77        3.59       85.02
          Transplant |        290       13.53       98.55
KRT unclear modality |         31        1.45      100.00
---------------------+-----------------------------------
               Total |      2,143      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        65        112          0      1,196 |     1,373 
         CKD stage 3 |        30         42          0        281 |       353 
       CKD stage 4/5 |         2          2          0         15 |        19 
            Dialysis |        77          0          0          0 |        77 
          Transplant |        12         32          7        239 |       290 
KRT unclear modality |         0          0         31          0 |        31 
---------------------+--------------------------------------------+----------
               Total |       186        188         38      1,731 |     2,143 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       124         59         53         22 |     1,373 
         CKD stage 3 |        40         23         14          0 |       353 
       CKD stage 4/5 |         1          1          1          0 |        19 
            Dialysis |         9          1          2          0 |        77 
          Transplant |        32         14         11          2 |       290 
KRT unclear modality |         1          3          3          0 |        31 
---------------------+--------------------------------------------+----------
               Total |       207        101         84         24 |     2,143 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,115 |     1,373 
         CKD stage 3 |       276 |       353 
       CKD stage 4/5 |        16 |        19 
            Dialysis |        65 |        77 
          Transplant |       231 |       290 
KRT unclear modality |        24 |        31 
---------------------+-----------+----------
               Total |     1,727 |     2,143 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,124 missing values generated)

. replace sex = 0 if male == "Female"
(1,124 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(956 real changes made, 956 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(956 missing values generated)

. gen min_creatinine_outcome=.
(2,143 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(618 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(569 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(618 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(569 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(743 real changes made)

. gen max_creatinine_outcome=.
(2,143 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(618 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(569 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,187 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,400 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(956 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,187 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(618 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(956 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1187 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(199 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(3 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(1 real change made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(956 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1187 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,187       55.39       55.39
          . |        956       44.61      100.00
------------+-----------------------------------
      Total |      2,143      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(101 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(84 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(17 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(24 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(101 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(101 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(207 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,567       73.12       73.12
               CKD 3 |        156        7.28       80.40
     CKD 4/5 pre-KRT |          4        0.19       80.59
            Dialysis |        101        4.71       85.30
   Kidney transplant |        101        4.71       90.01
KRT unclear modality |          7        0.33       90.34
            Deceased |        207        9.66      100.00
---------------------+-----------------------------------
               Total |      2,143      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         423           0       1,373
  CKD stage |         109           0         353
  CKD stage |          12           0          19
   Dialysis |          24           0          77
  Transplan |          65           0         290
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   298.81848    167.0628       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,143         639           0        639        639

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,373
  CKD stage |          77           0         353
  CKD stage |           2           0          19
   Dialysis |          14           0          77
  Transplan |          75           0         290
  KRT uncle |          11           0          31
------------+------------------------------------
      Total |     250.958   139.71002       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,143         534           0        534        534

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,373
  CKD stage |          86           0         353
  CKD stage |           0           0          19
   Dialysis |          29           0          77
  Transplan |          76           0         290
  KRT uncle |           1           0          31
------------+------------------------------------
      Total |   247.82688   133.28615       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,143         539           0        539        539

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,373
  CKD stage |          94           0         353
  CKD stage |          11           0          19
   Dialysis |          26           0          77
  Transplan |          62           0         290
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   276.81288   156.01915       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,143         594           0        594        594

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,373
  CKD stage |          96           0         353
  CKD stage |           2           0          19
   Dialysis |          16           0          77
  Transplan |          84           0         290
  KRT uncle |           1           0          31
------------+------------------------------------
      Total |   284.70462   156.39873       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,143         600           0        600        600

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         405           0       1,373
  CKD stage |         136           0         353
  CKD stage |           5           0          19
   Dialysis |           9           0          77
  Transplan |          61           0         290
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |   290.69249   155.41638       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,143         629           0        629        629

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,373
  CKD stage |         110           0         353
  CKD stage |           2           0          19
   Dialysis |          18           0          77
  Transplan |          56           0         290
  KRT uncle |          11           0          31
------------+------------------------------------
      Total |   255.24778   137.63623       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,143         554           0        554        554

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,373
  CKD stage |          96           0         353
  CKD stage |           0           0          19
   Dialysis |          38           0          77
  Transplan |          64           0         290
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   242.42184   128.68081       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,143         538           0        538        538

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,373
  CKD stage |          95           0         353
  CKD stage |           6           0          19
   Dialysis |          14           0          77
  Transplan |         112           0         290
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   255.71862    127.6425       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,143         585           0        585        585

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,373
  CKD stage |          84           0         353
  CKD stage |           3           0          19
   Dialysis |          28           0          77
  Transplan |          69           0         290
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   281.23938   160.54864       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,143         593           0        593        593

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,373
  CKD stage |         103           0         353
  CKD stage |           1           0          19
   Dialysis |           9           0          77
  Transplan |          54           0         290
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   203.44564   103.11362       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,143         452           0        452        452

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,373
  CKD stage |          89           0         353
  CKD stage |           0           0          19
   Dialysis |          31           0          77
  Transplan |          78           0         290
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   256.40971   137.83594       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,143         562           0        562        562

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,373
  CKD stage |          81           0         353
  CKD stage |           8           0          19
   Dialysis |          14           0          77
  Transplan |          41           0         290
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   229.61129   132.40366       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,143         472           0        472        472

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,373
  CKD stage |          96           0         353
  CKD stage |           5           0          19
   Dialysis |          19           0          77
  Transplan |          72           0         290
  KRT uncle |          18           0          31
------------+------------------------------------
      Total |   252.70789   134.98343       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,143         563           0        563        563

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,373
  CKD stage |          82           0         353
  CKD stage |           1           0          19
   Dialysis |          31           0          77
  Transplan |          83           0         290
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   247.59869   132.20656       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,143         547           0        547        547

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,373
  CKD stage |          60           0         353
  CKD stage |           3           0          19
   Dialysis |          15           0          77
  Transplan |          84           0         290
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   248.00887   141.04174       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,143         517           0        517        517

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,373
  CKD stage |         118           0         353
  CKD stage |           0           0          19
   Dialysis |          16           0          77
  Transplan |          96           0         290
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   277.14979   140.53673       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,143         614           0        614        614

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,373
  CKD stage |          85           0         353
  CKD stage |          -1           0          19
   Dialysis |          27           0          77
  Transplan |          71           0         290
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |    253.4853   138.96233       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,143         552           0        552        552

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,373
  CKD stage |          89           0         353
  CKD stage |           6           0          19
   Dialysis |          13           0          77
  Transplan |          64           0         290
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |   209.18899   107.81653       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         474           0        474        474

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,373
  CKD stage |          98           0         353
  CKD stage |           7           0          19
   Dialysis |           8           0          77
  Transplan |          48           0         290
  KRT uncle |          19           0          31
------------+------------------------------------
      Total |   244.30098   135.96174       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         525           0        525        525

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,373
  CKD stage |          73           0         353
  CKD stage |           2           0          19
   Dialysis |           0           0          77
  Transplan |          84           0         290
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   234.32711   127.59803       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         497           0        497        497

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,373
  CKD stage |          53           0         353
  CKD stage |           2           0          19
   Dialysis |           6           0          77
  Transplan |          69           0         290
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   246.50257   146.81399       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         494           0        494        494

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,373
  CKD stage |         106           0         353
  CKD stage |           6           0          19
   Dialysis |          14           0          77
  Transplan |          77           0         290
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   225.82734   111.56632       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,143         515           0        515        515

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,373
  CKD stage |          99           0         353
  CKD stage |           0           0          19
   Dialysis |          32           0          77
  Transplan |          73           0         290
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   228.61409   115.25805       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,143         525           0        525        525

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,373
  CKD stage |          91           0         353
  CKD stage |           3           0          19
   Dialysis |          22           0          77
  Transplan |          78           0         290
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |    240.4251   126.02092       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,143         533           0        533        533

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,373
  CKD stage |          74           0         353
  CKD stage |           3           0          19
   Dialysis |          20           0          77
  Transplan |         114           0         290
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |    260.4797   137.09613       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,143         586           0        586        586

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,373
  CKD stage |          81           0         353
  CKD stage |           6           0          19
   Dialysis |          23           0          77
  Transplan |          91           0         290
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   224.61129   113.80242       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,143         517           0        517        517

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,373
  CKD stage |         104           0         353
  CKD stage |           4           0          19
   Dialysis |          13           0          77
  Transplan |          79           0         290
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   264.76808   140.62942       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,143         571           0        571        571

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,373
  CKD stage |         110           0         353
  CKD stage |           0           0          19
   Dialysis |          51           0          77
  Transplan |          78           0         290
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   238.80401   116.45682       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,143         569           0        569        569

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,373
  CKD stage |         105           0         353
  CKD stage |          14           0          19
   Dialysis |          21           0          77
  Transplan |          77           0         290
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   249.71955   128.61793       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,143         568           0        568        568

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,373
  CKD stage |          72           0         353
  CKD stage |           0           0          19
   Dialysis |          23           0          77
  Transplan |          67           0         290
  KRT uncle |          14           0          31
------------+------------------------------------
      Total |   223.77322   122.42673       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         491           0        491        491

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,373
  CKD stage |          93           0         353
  CKD stage |           1           0          19
   Dialysis |          15           0          77
  Transplan |          45           0         290
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   218.08026   118.93897       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         465           0        465        465

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,373
  CKD stage |          75           0         353
  CKD stage |           6           0          19
   Dialysis |          14           0          77
  Transplan |          65           0         290
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   226.82874    125.1764       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         487           0        487        487

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,373
  CKD stage |          91           0         353
  CKD stage |           5           0          19
   Dialysis |          23           0          77
  Transplan |         113           0         290
  KRT uncle |          11           0          31
------------+------------------------------------
      Total |   220.31498   101.66236       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         538           0        538        538

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,373
  CKD stage |         104           0         353
  CKD stage |           3           0          19
   Dialysis |          10           0          77
  Transplan |         101           0         290
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   264.45404   134.63822       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,143         586           0        586        586

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,373
  CKD stage |          52           0         353
  CKD stage |           1           0          19
   Dialysis |          11           0          77
  Transplan |          77           0         290
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   233.43817   135.05684       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,143         479           0        479        479

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,373
  CKD stage |         110           0         353
  CKD stage |           0           0          19
   Dialysis |          25           0          77
  Transplan |          91           0         290
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   267.20765   136.05338       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,143         601           0        601        601

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,373
  CKD stage |         102           0         353
  CKD stage |           4           0          19
   Dialysis |          24           0          77
  Transplan |          79           0         290
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   254.05786   132.01318       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,143         571           0        571        571

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,373
  CKD stage |          50           0         353
  CKD stage |           0           0          19
   Dialysis |           8           0          77
  Transplan |          64           0         290
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   229.38311   136.22158       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,143         462           0        462        462

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,373
  CKD stage |          96           0         353
  CKD stage |           0           0          19
   Dialysis |          19           0          77
  Transplan |          95           0         290
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   226.18852   109.46504       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,143         527           0        527        527

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,373
  CKD stage |          65           0         353
  CKD stage |           1           0          19
   Dialysis |          23           0          77
  Transplan |          81           0         290
  KRT uncle |          19           0          31
------------+------------------------------------
      Total |   221.39244   119.03958       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,143         499           0        499        499

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,373
  CKD stage |          94           0         353
  CKD stage |           6           0          19
   Dialysis |          29           0          77
  Transplan |          51           0         290
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   211.87261     111.052       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,143         476           0        476        476

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         267           0       1,373
  CKD stage |          59           0         353
  CKD stage |           7           0          19
   Dialysis |          28           0          77
  Transplan |          46           0         290
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   188.22072   105.55638       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,143         417           0        417        417

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,373
  CKD stage |          92           0         353
  CKD stage |           2           0          19
   Dialysis |          23           0          77
  Transplan |          63           0         290
  KRT uncle |          19           0          31
------------+------------------------------------
      Total |   219.56883   113.84735       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,143         503           0        503        503

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,373
  CKD stage |          86           0         353
  CKD stage |           2           0          19
   Dialysis |          21           0          77
  Transplan |          90           0         290
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   269.38544   146.00235       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,143         583           0        583        583

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         391           0       1,373
  CKD stage |         116           0         353
  CKD stage |           5           0          19
   Dialysis |          18           0          77
  Transplan |          47           0         290
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   276.66916   154.73226       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         577           0        577        577

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,373
  CKD stage |          80           0         353
  CKD stage |           4           0          19
   Dialysis |           7           0          77
  Transplan |          69           0         290
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   254.80448   144.02703       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,143         527           0        527        527

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,373
  CKD stage |          93           0         353
  CKD stage |           0           0          19
   Dialysis |          32           0          77
  Transplan |          65           0         290
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   248.25432   134.17031       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,143         540           0        540        540

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,373
  CKD stage |          85           0         353
  CKD stage |           5           0          19
   Dialysis |          14           0          77
  Transplan |         104           0         290
  KRT uncle |          20           0          31
------------+------------------------------------
      Total |   235.21419   117.37512       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,143         550           0        550        550

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,373
  CKD stage |          89           0         353
  CKD stage |           8           0          19
   Dialysis |          27           0          77
  Transplan |          95           0         290
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   252.90014   130.71967       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,143         576           0        576        576

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,373
  CKD stage |          83           0         353
  CKD stage |           3           0          19
   Dialysis |          34           0          77
  Transplan |          75           0         290
  KRT uncle |          16           0          31
------------+------------------------------------
      Total |   250.82408   135.72509       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,143         563           0        563        563

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,373
  CKD stage |          52           0         353
  CKD stage |           3           0          19
   Dialysis |          29           0          77
  Transplan |          85           0         290
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   239.64116   136.14108       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,143         512           0        512        512

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,373
  CKD stage |         106           0         353
  CKD stage |          10           0          19
   Dialysis |           8           0          77
  Transplan |          67           0         290
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   254.52217   135.77063       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,143         558           0        558        558

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,373
  CKD stage |         119           0         353
  CKD stage |           9           0          19
   Dialysis |           7           0          77
  Transplan |          56           0         290
  KRT uncle |          21           0          31
------------+------------------------------------
      Total |   238.60243    123.2511       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,143         541           0        541        541

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,373
  CKD stage |          83           0         353
  CKD stage |           3           0          19
   Dialysis |          12           0          77
  Transplan |          96           0         290
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |    244.4307   127.58579       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         541           0        541        541

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,373
  CKD stage |          50           0         353
  CKD stage |           0           0          19
   Dialysis |          30           0          77
  Transplan |          49           0         290
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   247.27765   152.08283       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         493           0        493        493

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,373
  CKD stage |          66           0         353
  CKD stage |           1           0          19
   Dialysis |          15           0          77
  Transplan |          56           0         290
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   243.26832   143.05501       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         490           0        490        490

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,373
  CKD stage |          60           0         353
  CKD stage |           1           0          19
   Dialysis |          21           0          77
  Transplan |         105           0         290
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   262.58096   146.10736       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         560           0        560        560

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,373
  CKD stage |          87           0         353
  CKD stage |           4           0          19
   Dialysis |          10           0          77
  Transplan |          52           0         290
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   269.24265   156.83983       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,143         551           0        551        551

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,373
  CKD stage |          90           0         353
  CKD stage |           4           0          19
   Dialysis |          23           0          77
  Transplan |          52           0         290
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   261.16192   148.95019       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,143         548           0        548        548

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,373
  CKD stage |         117           0         353
  CKD stage |           1           0          19
   Dialysis |          32           0          77
  Transplan |          70           0         290
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   221.51377   105.68894       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,143         522           0        522        522

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,373
  CKD stage |          89           0         353
  CKD stage |           1           0          19
   Dialysis |           6           0          77
  Transplan |          43           0         290
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   252.69155   147.21504       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,143         505           0        505        505

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,373
  CKD stage |         102           0         353
  CKD stage |           5           0          19
   Dialysis |          12           0          77
  Transplan |          82           0         290
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   274.50023   147.52373       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,143         592           0        592        592

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,373
  CKD stage |          82           0         353
  CKD stage |           8           0          19
   Dialysis |          18           0          77
  Transplan |          90           0         290
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   226.29958   115.66356       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,143         510           0        510        510

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,373
  CKD stage |          60           0         353
  CKD stage |           0           0          19
   Dialysis |           7           0          77
  Transplan |          81           0         290
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   253.11293   146.23827       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,143         516           0        516        516

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,373
  CKD stage |         100           0         353
  CKD stage |           1           0          19
   Dialysis |          26           0          77
  Transplan |          70           0         290
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   233.29165   119.77641       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,143         526           0        526        526

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,373
  CKD stage |         107           0         353
  CKD stage |          12           0          19
   Dialysis |          15           0          77
  Transplan |          80           0         290
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   231.08773   113.75611       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,143         541           0        541        541

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,373
  CKD stage |          67           0         353
  CKD stage |           8           0          19
   Dialysis |          12           0          77
  Transplan |          66           0         290
  KRT uncle |          20           0          31
------------+------------------------------------
      Total |   242.43817   138.83114       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,143         519           0        519        519

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         424           0       1,373
  CKD stage |         114           0         353
  CKD stage |           0           0          19
   Dialysis |          29           0          77
  Transplan |          92           0         290
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |    304.0532   161.43766       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,143         668           0        668        668

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,373
  CKD stage |          99           0         353
  CKD stage |           2           0          19
   Dialysis |          19           0          77
  Transplan |          63           0         290
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   244.18245   130.57437       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         536           0        536        536

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,373
  CKD stage |         128           0         353
  CKD stage |           0           0          19
   Dialysis |          40           0          77
  Transplan |          94           0         290
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   283.30518   140.19948       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,143         657           0        657        657

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,373
  CKD stage |          93           0         353
  CKD stage |           1           0          19
   Dialysis |           2           0          77
  Transplan |          69           0         290
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   269.55343   151.37125       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,143         552           0        552        552

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,373
  CKD stage |         133           0         353
  CKD stage |          12           0          19
   Dialysis |          28           0          77
  Transplan |          58           0         290
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   236.02053   115.35537       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,143         560           0        560        560

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,373
  CKD stage |         118           0         353
  CKD stage |           0           0          19
   Dialysis |          30           0          77
  Transplan |          70           0         290
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   249.14746   125.93583       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,143         563           0        563        563

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,373
  CKD stage |          88           0         353
  CKD stage |           0           0          19
   Dialysis |          20           0          77
  Transplan |          77           0         290
  KRT uncle |          18           0          31
------------+------------------------------------
      Total |    227.0714    117.0962       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,143         517           0        517        517

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,373
  CKD stage |          66           0         353
  CKD stage |           8           0          19
   Dialysis |          13           0          77
  Transplan |          89           0         290
  KRT uncle |          18           0          31
------------+------------------------------------
      Total |   244.75222   134.77311       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,143         539           0        539        539

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,373
  CKD stage |          96           0         353
  CKD stage |           2           0          19
   Dialysis |          21           0          77
  Transplan |          96           0         290
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   260.25432   134.50207       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,143         577           0        577        577

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,373
  CKD stage |          78           0         353
  CKD stage |           4           0          19
   Dialysis |          19           0          77
  Transplan |          72           0         290
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   261.13626   147.38136       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,143         553           0        553        553

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         397           0       1,373
  CKD stage |         154           0         353
  CKD stage |           4           0          19
   Dialysis |           8           0          77
  Transplan |          92           0         290
  KRT uncle |          14           0          31
------------+------------------------------------
      Total |   292.69669   142.73746       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         669           0        669        669

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,373
  CKD stage |          46           0         353
  CKD stage |           3           0          19
   Dialysis |          19           0          77
  Transplan |          79           0         290
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |    233.0546    135.5496       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         487           0        487        487

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,373
  CKD stage |          97           0         353
  CKD stage |           0           0          19
   Dialysis |          24           0          77
  Transplan |          69           0         290
  KRT uncle |          11           0          31
------------+------------------------------------
      Total |   262.11106   142.43857       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         569           0        569        569

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,373
  CKD stage |          85           0         353
  CKD stage |           6           0          19
   Dialysis |          20           0          77
  Transplan |          92           0         290
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   215.67289   105.92399       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,143         503           0        503        503

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,373
  CKD stage |          90           0         353
  CKD stage |          10           0          19
   Dialysis |          22           0          77
  Transplan |          87           0         290
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   242.10873   125.17579       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,143         544           0        544        544

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,373
  CKD stage |          78           0         353
  CKD stage |           8           0          19
   Dialysis |          32           0          77
  Transplan |          74           0         290
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   263.13299   147.27771       2,143

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,143         570           0        570        570

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(96 real changes made)

. replace ethnicity=2 if ethnicity==3
(86 real changes made)

. replace ethnicity=3 if ethnicity==4
(69 real changes made)

. replace ethnicity=4 if ethnicity==6
(96 real changes made)

. replace ethnicity=6 if ethnicity==.
(544 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,905 missing values generated)

. replace region = 2 if region_string=="East"
(219 real changes made)

. replace region = 3 if region_string=="London"
(437 real changes made)

. replace region = 4 if region_string=="North East"
(185 real changes made)

. replace region = 5 if region_string=="North West"
(214 real changes made)

. replace region = 6 if region_string=="South East"
(214 real changes made)

. replace region = 7 if region_string=="South West"
(218 real changes made)

. replace region = 8 if region_string=="West Midlands"
(231 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(187 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,143 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(846 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,297 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v3.dta", replace
(note: file ./output/2020_ckd_complete_v3.dta not found)
file ./output/2020_ckd_complete_v3.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete_v3.log
  log type:  text
 closed on:  21 Apr 2023, 14:35:50
-------------------------------------------------------------------------------
