-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_dialysis_ukrr.log
  log type:  text
 opened on:  29 Mar 2023, 12:15:21

. clear

. 
. import delimited ./output/input_2020.csv, delimiter(comma) varnames(1) case(p
> reserve) 
(19 vars, 50,000 obs)

. 
. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,604 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(2,002 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,684 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,460       10.26       10.26
           East Midlands |      3,392       10.06       20.33
                  London |      6,737       19.99       40.31
              North East |      3,380       10.03       50.34
              North West |      3,315        9.83       60.17
              South East |      3,460       10.26       70.44
              South West |      3,430       10.18       80.61
           West Midlands |      3,288        9.75       90.36
Yorkshire and The Humber |      3,248        9.64      100.00
-------------------------+-----------------------------------
                   Total |     33,710      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,611        4.78        4.78
          1 |      6,460       19.16       23.94
          2 |      6,362       18.87       42.82
          3 |      6,554       19.44       62.26
          4 |      6,357       18.86       81.12
          5 |      6,366       18.88      100.00
------------+-----------------------------------
      Total |     33,710      100.00

. drop if imd==0
(1,611 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * Calculate eGFR
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace latest_creatinine = . if !inrange(latest_creatinine, 20, 3000)
(14,070 real changes made, 14,070 to missing)

. gen mgdl_latest_creatinine = latest_creatinine/88.4
(14,070 missing values generated)

. gen min_latest_creatinine=.
(32,099 missing values generated)

. replace min_latest_creatinine = mgdl_latest_creatinine/0.7 if male==0
(9,294 real changes made)

. replace min_latest_creatinine = mgdl_latest_creatinine/0.9 if male==1
(8,735 real changes made)

. replace min_latest_creatinine = min_latest_creatinine^-0.329  if male==0
(9,294 real changes made)

. replace min_latest_creatinine = min_latest_creatinine^-0.411  if male==1
(8,735 real changes made)

. replace min_latest_creatinine = 1 if min_latest_creatinine<1
(11,459 real changes made)

. gen max_latest_creatinine=.
(32,099 missing values generated)

. replace max_latest_creatinine = mgdl_latest_creatinine/0.7 if male==0
(9,294 real changes made)

. replace max_latest_creatinine = mgdl_latest_creatinine/0.9 if male==1
(8,735 real changes made)

. replace max_latest_creatinine = max_latest_creatinine^-1.209
(18,029 real changes made)

. replace max_latest_creatinine = 1 if max_latest_creatinine>1
(20,640 real changes made)

. gen latest_egfr = min_latest_creatinine*max_latest_creatinine*141
(14,070 missing values generated)

. replace latest_egfr = latest_egfr*(0.993^age)
(18,029 real changes made)

. replace latest_egfr = latest_egfr*1.018 if male==0
(9,294 real changes made)

. drop latest_creatinine

. drop mgdl_latest_creatinine

. drop min_latest_creatinine

. drop max_latest_creatinine

. egen esrd_egfr = cut(latest_egfr), at(0, 15, 5000)
(14070 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 18029 changes made)

. replace esrd_egfr = 0 if latest_egfr==.
(14,070 real changes made)

. 
. * Correlate dialysis codes
. tab dialysis_primary_care dialysis_icd_10

dialysis_p |
rimary_car |    dialysis_icd_10
         e |         0          1 |     Total
-----------+----------------------+----------
         0 |    28,978      1,523 |    30,501 
         1 |     1,512         86 |     1,598 
-----------+----------------------+----------
     Total |    30,490      1,609 |    32,099 

. tab dialysis_primary_care dialysis_opcs_4

dialysis_p |
rimary_car |    dialysis_opcs_4
         e |         0          1 |     Total
-----------+----------------------+----------
         0 |    29,041      1,460 |    30,501 
         1 |     1,515         83 |     1,598 
-----------+----------------------+----------
     Total |    30,556      1,543 |    32,099 

. tab esrd_egfr dialysis_primary_care

           | dialysis_primary_care
 esrd_egfr |         0          1 |     Total
-----------+----------------------+----------
         0 |    30,501      1,598 |    32,099 
-----------+----------------------+----------
     Total |    30,501      1,598 |    32,099 

. tab esrd_egfr dialysis_icd_10

           |    dialysis_icd_10
 esrd_egfr |         0          1 |     Total
-----------+----------------------+----------
         0 |    30,490      1,609 |    32,099 
-----------+----------------------+----------
     Total |    30,490      1,609 |    32,099 

. tab esrd_egfr dialysis_opcs_4

           |    dialysis_opcs_4
 esrd_egfr |         0          1 |     Total
-----------+----------------------+----------
         0 |    30,556      1,543 |    32,099 
-----------+----------------------+----------
     Total |    30,556      1,543 |    32,099 

. 
. gen dialysis_sus = dialysis_icd_10

. replace dialysis_sus = 1 if dialysis_opcs_4==1
(1,461 real changes made)

. tab esrd_egfr dialysis_sus

           |     dialysis_sus
 esrd_egfr |         0          1 |     Total
-----------+----------------------+----------
         0 |    29,029      3,070 |    32,099 
-----------+----------------------+----------
     Total |    29,029      3,070 |    32,099 

. tab dialysis_primary_care dialysis_sus

dialysis_p |
rimary_car |     dialysis_sus
         e |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,597      2,904 |    30,501 
         1 |     1,432        166 |     1,598 
-----------+----------------------+----------
     Total |    29,029      3,070 |    32,099 

. 
. gen dialysis_sus_egfr = dialysis_sus

. replace dialysis_sus_egfr = 0 if esrd_egfr==0
(3,070 real changes made)

. tab dialysis_primary_care dialysis_sus_egfr

dialysis_p | dialysis_s
rimary_car |  us_egfr
         e |         0 |     Total
-----------+-----------+----------
         0 |    30,501 |    30,501 
         1 |     1,598 |     1,598 
-----------+-----------+----------
     Total |    32,099 |    32,099 

. 
. tab ukrr

       ukrr |      Freq.     Percent        Cum.
------------+-----------------------------------
       ICHD |        810       49.45       49.45
         Tx |        828       50.55      100.00
------------+-----------------------------------
      Total |      1,638      100.00

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_dialysis_ukrr.log
  log type:  text
 closed on:  29 Mar 2023, 12:15:22
-------------------------------------------------------------------------------
