-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 opened on:  12 Jan 2023, 18:22:31

. clear

. 
. * Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 20,926 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00011.000001 not found)
file /tmp/St00011.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,744
        from master                    47,909  (_merge==1)
        from using                     18,835  (_merge==2)

    matched                             2,091  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,744 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00011.000002 not found)
file /tmp/St00011.000002 saved

. 
. /* Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save 2017_ckd_complete, replace
> */
. 
. * CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        175        8.37        8.37
Kidney transplant |        223       10.66       19.03
 Modality unclear |         51        2.44       21.47
          Pre KRT |      1,642       78.53      100.00
------------------+-----------------------------------
            Total |      2,091      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(837 missing values generated)

. drop baseline_egfr

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1254 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(175 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(223 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(51 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0        594 |       594 
  CKD stage 3 |         0          0          0        369 |       369 
CKD stage 4/5 |         0          0          0         16 |        16 
     Dialysis |       175          0          0          0 |       175 
   Transplant |         0        223          0          0 |       223 
  KRT unclear |         0          0         51          0 |        51 
--------------+--------------------------------------------+----------
        Total |       175        223         51        979 |     1,428 

. 
. * Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |        67         27         22          7 |       594 
  CKD stage 3 |        46         20         18          5 |       369 
CKD stage 4/5 |         0          1          0          0 |        16 
     Dialysis |        17          8          8          1 |       175 
   Transplant |        21         15         13          0 |       223 
  KRT unclear |         5          1          5          0 |        51 
            . |        47         30         23          5 |       663 
--------------+--------------------------------------------+----------
        Total |       203        102         89         18 |     2,091 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |       471 |       594 
  CKD stage 3 |       280 |       369 
CKD stage 4/5 |        15 |        16 
     Dialysis |       141 |       175 
   Transplant |       174 |       223 
  KRT unclear |        40 |        51 
            . |       558 |       663 
--------------+-----------+----------
        Total |     1,679 |     2,091 

. 
. * eGFR outcome classification based on updated mean eGFR over previous 18 mon
> ths by the end of year
. gen sex = 1 if male == "Male"
(1,111 missing values generated)

. replace sex = 0 if male == "Female"
(1,111 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(914 real changes made, 914 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(914 missing values generated)

. gen min_creatinine_outcome=.
(2,091 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(615 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(562 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(615 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(562 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(759 real changes made)

. gen max_creatinine_outcome=.
(2,091 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(615 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(562 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,177 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,332 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(914 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,177 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(615 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(914 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1177 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(74 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(3 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(102 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(89 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(18 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(203 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,618       77.38       77.38
               CKD 3 |         56        2.68       80.06
     CKD 4/5 pre-KRT |          5        0.24       80.30
            Dialysis |        102        4.88       85.17
   Kidney transplant |         89        4.26       89.43
KRT unclear modality |         18        0.86       90.29
            Deceased |        203        9.71      100.00
---------------------+-----------------------------------
               Total |      2,091      100.00

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(74 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(80 real changes made)

. replace ethnicity=4 if ethnicity==6
(74 real changes made)

. replace ethnicity=6 if ethnicity==.
(514 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,886 missing values generated)

. replace region = 2 if region_string=="East"
(200 real changes made)

. replace region = 3 if region_string=="London"
(401 real changes made)

. replace region = 4 if region_string=="North East"
(203 real changes made)

. replace region = 5 if region_string=="North West"
(217 real changes made)

. replace region = 6 if region_string=="South East"
(206 real changes made)

. replace region = 7 if region_string=="South West"
(219 real changes made)

. replace region = 8 if region_string=="West Midlands"
(220 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(220 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,091 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(858 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,233 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2020_ckd_complete.dta not found)
file ./output/2020_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 closed on:  12 Jan 2023, 18:22:35
-------------------------------------------------------------------------------
