-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 opened on:  21 Nov 2023, 18:35:18

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,025 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(236 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,841
        from master                    47,908  (_merge==1)
        from using                     18,933  (_merge==2)

    matched                             2,092  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,841 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        177        8.46        8.46
Kidney transplant |        179        8.56       17.02
 Modality unclear |         44        2.10       19.12
          Pre KRT |      1,692       80.88      100.00
------------------+-----------------------------------
            Total |      2,092      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(855 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1237 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,237       59.13       59.13
          . |        855       40.87      100.00
------------+-----------------------------------
      Total |      2,092      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(177 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(26 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(133 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(307 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(11 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(44 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(4 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       107         70 |       177 
Kidney transplant |       179          0 |       179 
 Modality unclear |        44          0 |        44 
          Pre KRT |     1,692          0 |     1,692 
------------------+----------------------+----------
            Total |     2,022         70 |     2,092 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       163         14 |       177 
Kidney transplant |       152         27 |       179 
 Modality unclear |        40          4 |        44 
          Pre KRT |     1,441        251 |     1,692 
------------------+----------------------+----------
            Total |     1,796        296 |     2,092 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       177          0 |       177 
Kidney transplant |       179          0 |       179 
 Modality unclear |         4         40 |        44 
          Pre KRT |     1,692          0 |     1,692 
------------------+----------------------+----------
            Total |     2,052         40 |     2,092 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,726        296 |     2,022 
         1 |        70          0 |        70 
-----------+----------------------+----------
     Total |     1,796        296 |     2,092 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(855 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1237 changes made)

. replace ckd_group = 4 if dialysis==1
(70 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(296 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(40 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(657 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,272       60.80       60.80
         CKD stage 3 |        397       18.98       79.78
       CKD stage 4/5 |         17        0.81       80.59
            Dialysis |         70        3.35       83.94
          Transplant |        296       14.15       98.09
KRT unclear modality |         40        1.91      100.00
---------------------+-----------------------------------
               Total |      2,092      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        55        117          0      1,100 |     1,272 
         CKD stage 3 |        37         34          0        326 |       397 
       CKD stage 4/5 |         1          1          0         15 |        17 
            Dialysis |        70          0          0          0 |        70 
          Transplant |        14         27          4        251 |       296 
KRT unclear modality |         0          0         40          0 |        40 
---------------------+--------------------------------------------+----------
               Total |       177        179         44      1,692 |     2,092 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       127         66         45          9 |     1,272 
         CKD stage 3 |        45         19         16          3 |       397 
       CKD stage 4/5 |         2          2          0          0 |        17 
            Dialysis |        14          3          0          1 |        70 
          Transplant |        32         18         10          4 |       296 
KRT unclear modality |         2          5          1          0 |        40 
---------------------+--------------------------------------------+----------
               Total |       222        113         72         17 |     2,092 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,025 |     1,272 
         CKD stage 3 |       314 |       397 
       CKD stage 4/5 |        13 |        17 
            Dialysis |        52 |        70 
          Transplant |       232 |       296 
KRT unclear modality |        32 |        40 
---------------------+-----------+----------
               Total |     1,668 |     2,092 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,061 missing values generated)

. replace sex = 0 if male == "Female"
(1,061 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(912 real changes made, 912 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(912 missing values generated)

. gen min_creatinine_outcome=.
(2,092 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(584 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(596 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(584 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(596 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(740 real changes made)

. gen max_creatinine_outcome=.
(2,092 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(584 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(596 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,180 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,352 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(912 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,180 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(584 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(912 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1180 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(193 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(4 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(6 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(912 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1180 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,180       56.41       56.41
          . |        912       43.59      100.00
------------+-----------------------------------
      Total |      2,092      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(113 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(72 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(10 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(17 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(113 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(82 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(222 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,514       72.37       72.37
               CKD 3 |        146        6.98       79.35
     CKD 4/5 pre-KRT |          8        0.38       79.73
            Dialysis |        113        5.40       85.13
   Kidney transplant |         82        3.92       89.05
KRT unclear modality |          7        0.33       89.39
            Deceased |        222       10.61      100.00
---------------------+-----------------------------------
               Total |      2,092      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(855 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1237 changes made)

. replace access_egfr=0 if ckd_group==4
(70 real changes made)

. replace access_egfr=3 if access_egfr==.
(785 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes (including by month)
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,272
  CKD stage |          85           0         397
  CKD stage |           5           0          17
   Dialysis |          21           0          70
  Transplan |          87           0         296
  KRT uncle |           4           0          40
------------+------------------------------------
      Total |   235.99044   130.62278       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,092         542           0        542        542

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,272
  CKD stage |          96           0         397
  CKD stage |           3           0          17
   Dialysis |          13           0          70
  Transplan |          58           0         296
  KRT uncle |          16           0          40
------------+------------------------------------
      Total |   255.20124   150.40933       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,092         561           0        561        561

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,272
  CKD stage |          83           0         397
  CKD stage |           0           0          17
   Dialysis |           8           0          70
  Transplan |          79           0         296
  KRT uncle |           9           0          40
------------+------------------------------------
      Total |   217.07409   119.44813       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,092         491           0        491        491

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         383           0       1,272
  CKD stage |          94           0         397
  CKD stage |           2           0          17
   Dialysis |          31           0          70
  Transplan |          87           0         296
  KRT uncle |          10           0          40
------------+------------------------------------
      Total |   264.26864   148.81509       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,092         607           0        607        607

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,272
  CKD stage |         107           0         397
  CKD stage |          10           0          17
   Dialysis |          20           0          70
  Transplan |          72           0         296
  KRT uncle |          14           0          40
------------+------------------------------------
      Total |   249.79398   137.47623       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,092         582           0        582        582

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,272
  CKD stage |         116           0         397
  CKD stage |          11           0          17
   Dialysis |          12           0          70
  Transplan |         107           0         296
  KRT uncle |          12           0          40
------------+------------------------------------
      Total |    251.9001   126.78127       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,092         610           0        610        610

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,272
  CKD stage |         114           0         397
  CKD stage |           3           0          17
   Dialysis |          10           0          70
  Transplan |          59           0         296
  KRT uncle |          24           0          40
------------+------------------------------------
      Total |   212.60086    110.1746       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,092         509           0        509        509

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,272
  CKD stage |         103           0         397
  CKD stage |           7           0          17
   Dialysis |          19           0          70
  Transplan |          85           0         296
  KRT uncle |          15           0          40
------------+------------------------------------
      Total |   211.31358   104.68942       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,092         523           0        523        523

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         265           0       1,272
  CKD stage |          87           0         397
  CKD stage |           9           0          17
   Dialysis |          22           0          70
  Transplan |          82           0         296
  KRT uncle |           9           0          40
------------+------------------------------------
      Total |    190.2218   94.472461       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,092         474           0        474        474

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,272
  CKD stage |         101           0         397
  CKD stage |          15           0          17
   Dialysis |          21           0          70
  Transplan |          76           0         296
  KRT uncle |           6           0          40
------------+------------------------------------
      Total |   205.36424   103.36287       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,092         506           0        506        506

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,272
  CKD stage |         101           0         397
  CKD stage |           4           0          17
   Dialysis |          14           0          70
  Transplan |          85           0         296
  KRT uncle |          13           0          40
------------+------------------------------------
      Total |   252.65822   138.78277       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,092         580           0        580        580

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,272
  CKD stage |          90           0         397
  CKD stage |           6           0          17
   Dialysis |          12           0          70
  Transplan |          84           0         296
  KRT uncle |           8           0          40
------------+------------------------------------
      Total |   211.97706   111.06853       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,092         500           0        500        500

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,272
  CKD stage |         122           0         397
  CKD stage |           6           0          17
   Dialysis |          16           0          70
  Transplan |         100           0         296
  KRT uncle |          12           0          40
------------+------------------------------------
      Total |   209.57935   93.191969       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,092         538           0        538        538

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,272
  CKD stage |         115           0         397
  CKD stage |           8           0          17
   Dialysis |          22           0          70
  Transplan |          44           0         296
  KRT uncle |          10           0          40
------------+------------------------------------
      Total |   224.82744    123.7144       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,092         521           0        521        521

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,272
  CKD stage |          64           0         397
  CKD stage |          13           0          17
   Dialysis |          38           0          70
  Transplan |          66           0         296
  KRT uncle |          21           0          40
------------+------------------------------------
      Total |   233.64101   140.22848       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,092         548           0        548        548

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,272
  CKD stage |         116           0         397
  CKD stage |           0           0          17
   Dialysis |          11           0          70
  Transplan |          82           0         296
  KRT uncle |          10           0          40
------------+------------------------------------
      Total |   233.00096   119.34977       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,092         546           0        546        546

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         273           0       1,272
  CKD stage |         138           0         397
  CKD stage |           0           0          17
   Dialysis |          21           0          70
  Transplan |          78           0         296
  KRT uncle |          11           0          40
------------+------------------------------------
      Total |   204.13002   90.236542       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,092         521           0        521        521

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,272
  CKD stage |         107           0         397
  CKD stage |          -2           0          17
   Dialysis |          17           0          70
  Transplan |          77           0         296
  KRT uncle |          22           0          40
------------+------------------------------------
      Total |   230.39149   120.73247       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,092         547           0        547        547

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,272
  CKD stage |         110           0         397
  CKD stage |           5           0          17
   Dialysis |          15           0          70
  Transplan |          67           0         296
  KRT uncle |           5           0          40
------------+------------------------------------
      Total |   204.28155   102.96111       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,092         487           0        487        487

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,272
  CKD stage |          86           0         397
  CKD stage |           5           0          17
   Dialysis |          14           0          70
  Transplan |          78           0         296
  KRT uncle |          16           0          40
------------+------------------------------------
      Total |   249.49474   143.52657       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,092         563           0        563        563

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,272
  CKD stage |         123           0         397
  CKD stage |           6           0          17
   Dialysis |          26           0          70
  Transplan |          86           0         296
  KRT uncle |          11           0          40
------------+------------------------------------
      Total |   254.92208   131.64095       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,092         611           0        611        611

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,272
  CKD stage |         108           0         397
  CKD stage |           7           0          17
   Dialysis |          17           0          70
  Transplan |          84           0         296
  KRT uncle |           7           0          40
------------+------------------------------------
      Total |   227.10182   116.30944       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,092         542           0        542        542

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,272
  CKD stage |          94           0         397
  CKD stage |           1           0          17
   Dialysis |          32           0          70
  Transplan |          85           0         296
  KRT uncle |           6           0          40
------------+------------------------------------
      Total |   228.66874   121.14001       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,092         543           0        543        543

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,272
  CKD stage |          99           0         397
  CKD stage |           0           0          17
   Dialysis |          25           0          70
  Transplan |          89           0         296
  KRT uncle |          16           0          40
------------+------------------------------------
      Total |   242.90105   129.63258       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,092         575           0        575        575

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,272
  CKD stage |         136           0         397
  CKD stage |           3           0          17
   Dialysis |          14           0          70
  Transplan |          94           0         296
  KRT uncle |           0           0          40
------------+------------------------------------
      Total |   247.54828    120.8775       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,092         589           0        589        589

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,272
  CKD stage |         105           0         397
  CKD stage |          -1           0          17
   Dialysis |          31           0          70
  Transplan |          74           0         296
  KRT uncle |           9           0          40
------------+------------------------------------
      Total |   244.40822   132.88171       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         568           0        568        568

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,272
  CKD stage |         132           0         397
  CKD stage |           0           0          17
   Dialysis |          28           0          70
  Transplan |          48           0         296
  KRT uncle |           6           0          40
------------+------------------------------------
      Total |   222.59847   115.34249       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         526           0        526        526

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,272
  CKD stage |          74           0         397
  CKD stage |           0           0          17
   Dialysis |           8           0          70
  Transplan |          62           0         296
  KRT uncle |           0           0          40
------------+------------------------------------
      Total |   217.65296   128.38464       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         464           0        464        464

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,272
  CKD stage |         119           0         397
  CKD stage |           0           0          17
   Dialysis |          43           0          70
  Transplan |          71           0         296
  KRT uncle |          17           0          40
------------+------------------------------------
      Total |   253.28346   134.62879       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         610           0        610        610

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,272
  CKD stage |         101           0         397
  CKD stage |           0           0          17
   Dialysis |          25           0          70
  Transplan |          67           0         296
  KRT uncle |           2           0          40
------------+------------------------------------
      Total |   252.66874    143.7199       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,092         562           0        562        562

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,272
  CKD stage |          76           0         397
  CKD stage |           2           0          17
   Dialysis |           7           0          70
  Transplan |          47           0         296
  KRT uncle |          17           0          40
------------+------------------------------------
      Total |   245.40344   153.44774       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,092         517           0        517        517

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,272
  CKD stage |          90           0         397
  CKD stage |           8           0          17
   Dialysis |          16           0          70
  Transplan |          70           0         296
  KRT uncle |          11           0          40
------------+------------------------------------
      Total |   199.25908   104.38343       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,092         477           0        477        477

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,272
  CKD stage |         112           0         397
  CKD stage |           1           0          17
   Dialysis |          30           0          70
  Transplan |          96           0         296
  KRT uncle |           6           0          40
------------+------------------------------------
      Total |   244.51864   124.36839       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,092         588           0        588        588

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,272
  CKD stage |         100           0         397
  CKD stage |           8           0          17
   Dialysis |           3           0          70
  Transplan |          67           0         296
  KRT uncle |          18           0          40
------------+------------------------------------
      Total |     236.913   132.43179       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,092         538           0        538        538

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,272
  CKD stage |          89           0         397
  CKD stage |           6           0          17
   Dialysis |          15           0          70
  Transplan |          72           0         296
  KRT uncle |          13           0          40
------------+------------------------------------
      Total |   215.14962   116.81222       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,092         503           0        503        503

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,272
  CKD stage |          73           0         397
  CKD stage |           2           0          17
   Dialysis |          18           0          70
  Transplan |         103           0         296
  KRT uncle |          25           0          40
------------+------------------------------------
      Total |    197.9479   100.05093       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,092         498           0        498        498

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,272
  CKD stage |         117           0         397
  CKD stage |           0           0          17
   Dialysis |          19           0          70
  Transplan |          84           0         296
  KRT uncle |           9           0          40
------------+------------------------------------
      Total |   241.01864    124.1073       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,092         568           0        568        568

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,272
  CKD stage |          86           0         397
  CKD stage |           3           0          17
   Dialysis |          24           0          70
  Transplan |         106           0         296
  KRT uncle |          17           0          40
------------+------------------------------------
      Total |   205.75956   100.36591       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         521           0        521        521

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,272
  CKD stage |          93           0         397
  CKD stage |           0           0          17
   Dialysis |          19           0          70
  Transplan |          68           0         296
  KRT uncle |           4           0          40
------------+------------------------------------
      Total |   262.68212   154.63384       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         570           0        570        570

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,272
  CKD stage |          72           0         397
  CKD stage |           7           0          17
   Dialysis |          19           0          70
  Transplan |          78           0         296
  KRT uncle |          11           0          40
------------+------------------------------------
      Total |   201.93164   110.56321       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         477           0        477        477

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,272
  CKD stage |          85           0         397
  CKD stage |           2           0          17
   Dialysis |          18           0          70
  Transplan |          60           0         296
  KRT uncle |          27           0          40
------------+------------------------------------
      Total |    206.9479   114.36627       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         490           0        490        490

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,272
  CKD stage |          90           0         397
  CKD stage |           2           0          17
   Dialysis |          20           0          70
  Transplan |          64           0         296
  KRT uncle |           4           0          40
------------+------------------------------------
      Total |   239.70746   138.43286       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,092         530           0        530        530

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,272
  CKD stage |         119           0         397
  CKD stage |           2           0          17
   Dialysis |          20           0          70
  Transplan |          73           0         296
  KRT uncle |           9           0          40
------------+------------------------------------
      Total |   242.32361   127.58351       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,092         566           0        566        566

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,272
  CKD stage |         123           0         397
  CKD stage |          11           0          17
   Dialysis |          23           0          70
  Transplan |          42           0         296
  KRT uncle |           9           0          40
------------+------------------------------------
      Total |   266.83939   154.78001       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,092         597           0        597        597

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,272
  CKD stage |         132           0         397
  CKD stage |           3           0          17
   Dialysis |          27           0          70
  Transplan |          65           0         296
  KRT uncle |          13           0          40
------------+------------------------------------
      Total |   253.70602   133.93088       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,092         599           0        599        599

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,272
  CKD stage |         125           0         397
  CKD stage |           4           0          17
   Dialysis |          13           0          70
  Transplan |          49           0         296
  KRT uncle |           3           0          40
------------+------------------------------------
      Total |   206.29207   105.79351       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,092         482           0        482        482

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,272
  CKD stage |          92           0         397
  CKD stage |           6           0          17
   Dialysis |          15           0          70
  Transplan |          81           0         296
  KRT uncle |          11           0          40
------------+------------------------------------
      Total |   257.08413   146.66833       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,092         579           0        579        579

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,272
  CKD stage |          76           0         397
  CKD stage |           4           0          17
   Dialysis |          15           0          70
  Transplan |          85           0         296
  KRT uncle |           7           0          40
------------+------------------------------------
      Total |   206.48662   111.40044       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,092         482           0        482        482

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,272
  CKD stage |         103           0         397
  CKD stage |           4           0          17
   Dialysis |          41           0          70
  Transplan |          69           0         296
  KRT uncle |           4           0          40
------------+------------------------------------
      Total |    204.6869   102.89025       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,092         507           0        507        507

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,272
  CKD stage |         103           0         397
  CKD stage |           1           0          17
   Dialysis |          30           0          70
  Transplan |          72           0         296
  KRT uncle |          17           0          40
------------+------------------------------------
      Total |   235.97706   127.11568       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,092         560           0        560        560

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,272
  CKD stage |         101           0         397
  CKD stage |           6           0          17
   Dialysis |          16           0          70
  Transplan |          62           0         296
  KRT uncle |          23           0          40
------------+------------------------------------
      Total |   233.26147   129.38325       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,092         544           0        544        544

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,272
  CKD stage |          90           0         397
  CKD stage |           9           0          17
   Dialysis |          35           0          70
  Transplan |          56           0         296
  KRT uncle |          12           0          40
------------+------------------------------------
      Total |   227.12667   129.07839       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,092         532           0        532        532

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         276           0       1,272
  CKD stage |         112           0         397
  CKD stage |           6           0          17
   Dialysis |          16           0          70
  Transplan |          84           0         296
  KRT uncle |           9           0          40
------------+------------------------------------
      Total |   201.71224    94.98988       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         503           0        503        503

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,272
  CKD stage |         100           0         397
  CKD stage |          11           0          17
   Dialysis |          34           0          70
  Transplan |          86           0         296
  KRT uncle |           2           0          40
------------+------------------------------------
      Total |   262.24618   145.25422       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,092         611           0        611        611

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,272
  CKD stage |          90           0         397
  CKD stage |           3           0          17
   Dialysis |          16           0          70
  Transplan |          87           0         296
  KRT uncle |           8           0          40
------------+------------------------------------
      Total |   250.20889   140.36254       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,092         566           0        566        566

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,272
  CKD stage |         117           0         397
  CKD stage |           0           0          17
   Dialysis |          11           0          70
  Transplan |          79           0         296
  KRT uncle |           8           0          40
------------+------------------------------------
      Total |   219.35134   109.26496       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,092         520           0        520        520

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,272
  CKD stage |         120           0         397
  CKD stage |          10           0          17
   Dialysis |          24           0          70
  Transplan |          78           0         296
  KRT uncle |          13           0          40
------------+------------------------------------
      Total |    238.0239   121.64705       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,092         579           0        579        579

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,272
  CKD stage |          64           0         397
  CKD stage |           6           0          17
   Dialysis |          26           0          70
  Transplan |         103           0         296
  KRT uncle |           9           0          40
------------+------------------------------------
      Total |   229.06788   128.27726       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,092         539           0        539        539

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,272
  CKD stage |          99           0         397
  CKD stage |           5           0          17
   Dialysis |          24           0          70
  Transplan |          74           0         296
  KRT uncle |           5           0          40
------------+------------------------------------
      Total |   201.05354   101.23132       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,092         488           0        488        488

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,272
  CKD stage |          81           0         397
  CKD stage |           4           0          17
   Dialysis |          25           0          70
  Transplan |          48           0         296
  KRT uncle |          12           0          40
------------+------------------------------------
      Total |   228.16778   136.36956       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,092         507           0        507        507

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,272
  CKD stage |         105           0         397
  CKD stage |           2           0          17
   Dialysis |          13           0          70
  Transplan |          61           0         296
  KRT uncle |          11           0          40
------------+------------------------------------
      Total |   220.74809   119.31317       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,092         507           0        507        507

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,272
  CKD stage |         105           0         397
  CKD stage |           4           0          17
   Dialysis |          19           0          70
  Transplan |          63           0         296
  KRT uncle |           6           0          40
------------+------------------------------------
      Total |   244.25765   137.03999       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         550           0        550        550

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,272
  CKD stage |          85           0         397
  CKD stage |           0           0          17
   Dialysis |          14           0          70
  Transplan |          69           0         296
  KRT uncle |           5           0          40
------------+------------------------------------
      Total |   238.66013   138.42327       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         522           0        522        522

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,272
  CKD stage |         115           0         397
  CKD stage |           0           0          17
   Dialysis |          11           0          70
  Transplan |          42           0         296
  KRT uncle |           2           0          40
------------+------------------------------------
      Total |   224.56644   125.60298       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         493           0        493        493

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,272
  CKD stage |          92           0         397
  CKD stage |           7           0          17
   Dialysis |           6           0          70
  Transplan |          59           0         296
  KRT uncle |          14           0          40
------------+------------------------------------
      Total |   233.67065   134.95643       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         519           0        519        519

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,272
  CKD stage |          97           0         397
  CKD stage |           3           0          17
   Dialysis |          13           0          70
  Transplan |          85           0         296
  KRT uncle |           5           0          40
------------+------------------------------------
      Total |    255.9608   143.34333       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,092         573           0        573        573

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,272
  CKD stage |         116           0         397
  CKD stage |           6           0          17
   Dialysis |          16           0          70
  Transplan |          82           0         296
  KRT uncle |           4           0          40
------------+------------------------------------
      Total |   208.78107   100.06112       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,092         511           0        511        511

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,272
  CKD stage |         102           0         397
  CKD stage |           8           0          17
   Dialysis |          12           0          70
  Transplan |          65           0         296
  KRT uncle |           7           0          40
------------+------------------------------------
      Total |   248.65296   141.41735       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,092         555           0        555        555

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,272
  CKD stage |         121           0         397
  CKD stage |           0           0          17
   Dialysis |          27           0          70
  Transplan |          71           0         296
  KRT uncle |           2           0          40
------------+------------------------------------
      Total |   214.53489   105.49895       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,092         518           0        518        518

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,272
  CKD stage |         105           0         397
  CKD stage |          -1           0          17
   Dialysis |          15           0          70
  Transplan |          59           0         296
  KRT uncle |          10           0          40
------------+------------------------------------
      Total |   222.92065   121.57899       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,092         507           0        507        507

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,272
  CKD stage |         111           0         397
  CKD stage |           2           0          17
   Dialysis |          17           0          70
  Transplan |          83           0         296
  KRT uncle |           7           0          40
------------+------------------------------------
      Total |   236.60946   123.19177       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,092         554           0        554        554

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,272
  CKD stage |          96           0         397
  CKD stage |           3           0          17
   Dialysis |          24           0          70
  Transplan |          88           0         296
  KRT uncle |          11           0          40
------------+------------------------------------
      Total |   228.70889   119.97516       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,092         546           0        546        546

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,272
  CKD stage |         102           0         397
  CKD stage |          10           0          17
   Dialysis |           8           0          70
  Transplan |          59           0         296
  KRT uncle |           4           0          40
------------+------------------------------------
      Total |   228.17208   127.39412       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,092         512           0        512        512

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,272
  CKD stage |         147           0         397
  CKD stage |           3           0          17
   Dialysis |          17           0          70
  Transplan |         107           0         296
  KRT uncle |          14           0          40
------------+------------------------------------
      Total |   276.16444   134.91605       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,092         670           0        670        670

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,272
  CKD stage |          84           0         397
  CKD stage |           1           0          17
   Dialysis |          37           0          70
  Transplan |          97           0         296
  KRT uncle |           6           0          40
------------+------------------------------------
      Total |   248.09321   136.63232       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,092         582           0        582        582

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,272
  CKD stage |         104           0         397
  CKD stage |           6           0          17
   Dialysis |          23           0          70
  Transplan |          63           0         296
  KRT uncle |           0           0          40
------------+------------------------------------
      Total |   214.30975   113.58426       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,092         500           0        500        500

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,272
  CKD stage |         131           0         397
  CKD stage |           2           0          17
   Dialysis |          23           0          70
  Transplan |          90           0         296
  KRT uncle |           9           0          40
------------+------------------------------------
      Total |    245.2825   120.63914       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         595           0        595        595

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,272
  CKD stage |         155           0         397
  CKD stage |           2           0          17
   Dialysis |          34           0          70
  Transplan |          87           0         296
  KRT uncle |          20           0          40
------------+------------------------------------
      Total |   222.62954   95.030595       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,092         593           0        593        593

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,272
  CKD stage |         130           0         397
  CKD stage |          12           0          17
   Dialysis |          28           0          70
  Transplan |          83           0         296
  KRT uncle |           4           0          40
------------+------------------------------------
      Total |   245.47132   122.79371       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,092         599           0        599        599

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,272
  CKD stage |         122           0         397
  CKD stage |          10           0          17
   Dialysis |          21           0          70
  Transplan |          58           0         296
  KRT uncle |          14           0          40
------------+------------------------------------
      Total |   223.93977    116.2287       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,092         540           0        540        540

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,272
  CKD stage |          83           0         397
  CKD stage |           4           0          17
   Dialysis |          31           0          70
  Transplan |          65           0         296
  KRT uncle |          14           0          40
------------+------------------------------------
      Total |   240.92017   140.26448       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,092         550           0        550        550

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,272
  CKD stage |          88           0         397
  CKD stage |           2           0          17
   Dialysis |          15           0          70
  Transplan |          75           0         296
  KRT uncle |           6           0          40
------------+------------------------------------
      Total |   224.33843   124.05067       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,092         509           0        509        509

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,272
  CKD stage |          96           0         397
  CKD stage |           9           0          17
   Dialysis |          28           0          70
  Transplan |          91           0         296
  KRT uncle |          19           0          40
------------+------------------------------------
      Total |   226.42878   116.46761       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,092         562           0        562        562

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,272
  CKD stage |         115           0         397
  CKD stage |          14           0          17
   Dialysis |          10           0          70
  Transplan |          62           0         296
  KRT uncle |          10           0          40
------------+------------------------------------
      Total |    214.8609   111.15747       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,092         513           0        513        513

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,272
  CKD stage |         102           0         397
  CKD stage |           5           0          17
   Dialysis |          28           0          70
  Transplan |          84           0         296
  KRT uncle |          15           0          40
------------+------------------------------------
      Total |   217.95554   109.84839       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,092         539           0        539        539

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,272
  CKD stage |          97           0         397
  CKD stage |           8           0          17
   Dialysis |          24           0          70
  Transplan |          95           0         296
  KRT uncle |           8           0          40
------------+------------------------------------
      Total |   233.52055   121.54535       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         562           0        562        562

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,272
  CKD stage |          87           0         397
  CKD stage |           0           0          17
   Dialysis |           6           0          70
  Transplan |          81           0         296
  KRT uncle |           5           0          40
------------+------------------------------------
      Total |    236.8217    133.5087       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         522           0        522        522

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,272
  CKD stage |         101           0         397
  CKD stage |           3           0          17
   Dialysis |          14           0          70
  Transplan |          48           0         296
  KRT uncle |          18           0          40
------------+------------------------------------
      Total |   232.30975   133.33866       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         522           0        522        522

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,272
  CKD stage |          76           0         397
  CKD stage |           4           0          17
   Dialysis |           5           0          70
  Transplan |         101           0         296
  KRT uncle |           7           0          40
------------+------------------------------------
      Total |   229.08891   126.02013       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,092         522           0        522        522

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,272
  CKD stage |         132           0         397
  CKD stage |           1           0          17
   Dialysis |          23           0          70
  Transplan |          80           0         296
  KRT uncle |          14           0          40
------------+------------------------------------
      Total |   217.39149   101.25518       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,092         546           0        546        546

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,272
  CKD stage |         107           0         397
  CKD stage |           3           0          17
   Dialysis |          10           0          70
  Transplan |          59           0         296
  KRT uncle |           0           0          40
------------+------------------------------------
      Total |   210.20554   111.73083       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,092         477           0        477        477

. 
. 
. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(87 real changes made)

. replace ethnicity=2 if ethnicity==3
(95 real changes made)

. replace ethnicity=3 if ethnicity==4
(74 real changes made)

. replace ethnicity=4 if ethnicity==6
(87 real changes made)

. replace ethnicity=6 if ethnicity==.
(498 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,880 missing values generated)

. replace region = 2 if region_string=="East"
(184 real changes made)

. replace region = 3 if region_string=="London"
(399 real changes made)

. replace region = 4 if region_string=="North East"
(233 real changes made)

. replace region = 5 if region_string=="North West"
(212 real changes made)

. replace region = 6 if region_string=="South East"
(202 real changes made)

. replace region = 7 if region_string=="South West"
(189 real changes made)

. replace region = 8 if region_string=="West Midlands"
(238 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(223 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,092 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(857 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,235 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. *Age bands for standardisation
. egen agecat = cut(age), at(0,18,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,
> 200)

. drop if agecat==0
(0 observations deleted)

. 
. *Age-standardisation weights (European Standard Population 2013)
. gen weight = .
(2,092 missing values generated)

. replace weight = 0.027261 if agecat==18
(55 real changes made)

. replace weight = 0.074349 if agecat==20
(149 real changes made)

. replace weight = 0.074349 if agecat==25
(181 real changes made)

. replace weight = 0.080545 if agecat==30
(172 real changes made)

. replace weight = 0.086741 if agecat==35
(168 real changes made)

. replace weight = 0.086741 if agecat==40
(160 real changes made)

. replace weight = 0.086741 if agecat==45
(174 real changes made)

. replace weight = 0.086741 if agecat==50
(211 real changes made)

. replace weight = 0.080545 if agecat==55
(155 real changes made)

. replace weight = 0.074349 if agecat==60
(154 real changes made)

. replace weight = 0.068154 if agecat==65
(136 real changes made)

. replace weight = 0.061958 if agecat==70
(159 real changes made)

. replace weight = 0.049566 if agecat==75
(78 real changes made)

. replace weight = 0.030979 if agecat==80
(77 real changes made)

. replace weight = 0.018587 if agecat==85
(41 real changes made)

. replace weight = 0.012392 if agecat==90
(22 real changes made)

. 
. 
. *Age standardised counts for each non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. replace `aggregate' = `aggregate' * weight
  3. }
variable hospital_days was byte now float
(183 real changes made)
variable critical_care_days was byte now float
(192 real changes made)
variable emergency_days was byte now float
(166 real changes made)
variable op_appts was byte now float
(204 real changes made)
variable neph_appts was byte now float
(198 real changes made)
variable tx_appts was byte now float
(201 real changes made)
variable gp_interactions was byte now float
(179 real changes made)

. 
. * Create variable for age-standardised total # of each aggregated outcome
. * `var'_`aggregate' = age-standardised total # of each aggregated outcome ove
> rall stratified by ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = age-standardised total # of each aggregated outcome
>  in each CKD group stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. egen overall_std_`aggregate' = total(`aggregate')
  3. bysort ckd_group: egen std_`aggregate' = total(`aggregate')
  4. foreach var of varlist ethnicity imd region urban {
  5. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  6. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  7. }
  8. }

. 
. foreach binary of varlist fistula_formation pd_insertion blood_pressure album
> inuria creatinine {
  2. gen esp_`binary' = `binary' * weight
  3. egen overall_std_`binary' = total(esp_`binary')
  4. bysort ckd_group: egen std_`binary' = total(esp_`binary')
  5. foreach var of varlist ethnicity imd region urban {
  6. bysort `var': egen `var'_`binary' = total(esp_`binary')
  7. bysort `var' ckd_group: egen `var'_`binary'_ckd = total(esp_`binary')
  8. }
  9. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2020_ckd_complete.dta not found)
file ./output/2020_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,592
        from master                       500  (_merge==1)
        from using                      2,092  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(500 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,272
  CKD stage |           0           0         397
  CKD stage |           0           0          17
   Dialysis |           0           0          70
  Transplan |           0           0         296
  KRT uncle |           0           0          40
------------+------------------------------------
      Total |           0           0       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,092           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,272
  CKD stage |           0           0         397
  CKD stage |           0           0          17
   Dialysis |           0           0          70
  Transplan |           0           0         296
  KRT uncle |           0           0          40
------------+------------------------------------
      Total |           0           0       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,092           0           0          0          0

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,272
  CKD stage |           0           0         397
  CKD stage |           0           0          17
   Dialysis |           0           0          70
  Transplan |           0           0         296
  KRT uncle |           0           0          40
------------+------------------------------------
      Total |           0           0       2,092

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,092           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2020_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 closed on:  21 Nov 2023, 18:35:25
-------------------------------------------------------------------------------
