-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 opened on:  18 Aug 2023, 17:34:58

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,025 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(235 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,765
        from master                    47,870  (_merge==1)
        from using                     18,895  (_merge==2)

    matched                             2,130  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,765 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        178        8.36        8.36
Kidney transplant |        221       10.38       18.73
 Modality unclear |         54        2.54       21.27
          Pre KRT |      1,677       78.73      100.00
------------------+-----------------------------------
            Total |      2,130      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(848 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1282 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,282       60.19       60.19
          . |        848       39.81      100.00
------------+-----------------------------------
      Total |      2,130      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(178 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(35 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(132 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(318 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(14 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(54 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(8 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |        97         81 |       178 
Kidney transplant |       221          0 |       221 
 Modality unclear |        54          0 |        54 
          Pre KRT |     1,677          0 |     1,677 
------------------+----------------------+----------
            Total |     2,049         81 |     2,130 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       163         15 |       178 
Kidney transplant |       187         34 |       221 
 Modality unclear |        46          8 |        54 
          Pre KRT |     1,430        247 |     1,677 
------------------+----------------------+----------
            Total |     1,826        304 |     2,130 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       178          0 |       178 
Kidney transplant |       221          0 |       221 
 Modality unclear |         8         46 |        54 
          Pre KRT |     1,677          0 |     1,677 
------------------+----------------------+----------
            Total |     2,084         46 |     2,130 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,745        304 |     2,049 
         1 |        81          0 |        81 
-----------+----------------------+----------
     Total |     1,826        304 |     2,130 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(848 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1282 changes made)

. replace ckd_group = 4 if dialysis==1
(81 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(304 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(46 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(636 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,294       60.75       60.75
         CKD stage 3 |        393       18.45       79.20
       CKD stage 4/5 |         12        0.56       79.77
            Dialysis |         81        3.80       83.57
          Transplant |        304       14.27       97.84
KRT unclear modality |         46        2.16      100.00
---------------------+-----------------------------------
               Total |      2,130      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        53        146          0      1,095 |     1,294 
         CKD stage 3 |        28         39          0        326 |       393 
       CKD stage 4/5 |         1          2          0          9 |        12 
            Dialysis |        81          0          0          0 |        81 
          Transplant |        15         34          8        247 |       304 
KRT unclear modality |         0          0         46          0 |        46 
---------------------+--------------------------------------------+----------
               Total |       178        221         54      1,677 |     2,130 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       103         60         48         10 |     1,294 
         CKD stage 3 |        39         17         18          8 |       393 
       CKD stage 4/5 |         0          2          2          0 |        12 
            Dialysis |         9          4          4          1 |        81 
          Transplant |        34         13         16          4 |       304 
KRT unclear modality |         8          4          2          0 |        46 
---------------------+--------------------------------------------+----------
               Total |       193        100         90         23 |     2,130 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,073 |     1,294 
         CKD stage 3 |       311 |       393 
       CKD stage 4/5 |         8 |        12 
            Dialysis |        63 |        81 
          Transplant |       237 |       304 
KRT unclear modality |        32 |        46 
---------------------+-----------+----------
               Total |     1,724 |     2,130 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,123 missing values generated)

. replace sex = 0 if male == "Female"
(1,123 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(932 real changes made, 932 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(932 missing values generated)

. gen min_creatinine_outcome=.
(2,130 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(626 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(572 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(626 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(572 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(777 real changes made)

. gen max_creatinine_outcome=.
(2,130 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(626 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(572 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,198 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,353 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(932 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,198 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(626 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(932 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1198 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(179 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(10 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(3 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(932 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1198 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,198       56.24       56.24
          . |        932       43.76      100.00
------------+-----------------------------------
      Total |      2,130      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(100 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(90 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(11 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(23 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(100 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(101 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(193 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,571       73.76       73.76
               CKD 3 |        141        6.62       80.38
     CKD 4/5 pre-KRT |         12        0.56       80.94
            Dialysis |        100        4.69       85.63
   Kidney transplant |        101        4.74       90.38
KRT unclear modality |         12        0.56       90.94
            Deceased |        193        9.06      100.00
---------------------+-----------------------------------
               Total |      2,130      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(848 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1282 changes made)

. replace access_egfr=0 if ckd_group==4
(81 real changes made)

. replace access_egfr=3 if access_egfr==.
(767 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,294
  CKD stage |          93           0         393
  CKD stage |           3           0          12
   Dialysis |          10           0          81
  Transplan |         114           0         304
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |   240.44554   126.00171       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,130         563           0        563        563

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,294
  CKD stage |          99           0         393
  CKD stage |           0           0          12
   Dialysis |          29           0          81
  Transplan |          49           0         304
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   229.50892   131.49517       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,130         522           0        522        522

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,294
  CKD stage |         104           0         393
  CKD stage |           3           0          12
   Dialysis |          23           0          81
  Transplan |          81           0         304
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   240.90563   129.68705       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,130         568           0        568        568

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         244           0       1,294
  CKD stage |          90           0         393
  CKD stage |           2           0          12
   Dialysis |          32           0          81
  Transplan |          88           0         304
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   178.97183   82.373139       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,130         472           0        472        472

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,294
  CKD stage |         103           0         393
  CKD stage |           0           0          12
   Dialysis |          27           0          81
  Transplan |         110           0         304
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   232.17277   114.87976       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,130         573           0        573        573

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         260           0       1,294
  CKD stage |          75           0         393
  CKD stage |           3           0          12
   Dialysis |          35           0          81
  Transplan |          71           0         304
  KRT uncle |          20           0          46
------------+------------------------------------
      Total |   183.70423   95.589923       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,130         464           0        464        464

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,294
  CKD stage |          93           0         393
  CKD stage |           0           0          12
   Dialysis |          28           0          81
  Transplan |         111           0         304
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   211.08967   101.37749       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,130         534           0        534        534

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,294
  CKD stage |         103           0         393
  CKD stage |           5           0          12
   Dialysis |          24           0          81
  Transplan |          62           0         304
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   201.04366   103.80019       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,130         492           0        492        492

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,294
  CKD stage |         107           0         393
  CKD stage |           2           0          12
   Dialysis |          11           0          81
  Transplan |          60           0         304
  KRT uncle |          25           0          46
------------+------------------------------------
      Total |   206.06103   107.85805       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,130         496           0        496        496

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,294
  CKD stage |         106           0         393
  CKD stage |           3           0          12
   Dialysis |           7           0          81
  Transplan |         117           0         304
  KRT uncle |          23           0          46
------------+------------------------------------
      Total |   221.71972   105.02164       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,130         560           0        560        560

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,294
  CKD stage |         102           0         393
  CKD stage |           1           0          12
   Dialysis |          20           0          81
  Transplan |          87           0         304
  KRT uncle |          25           0          46
------------+------------------------------------
      Total |   229.98404   119.62895       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,130         560           0        560        560

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,294
  CKD stage |         107           0         393
  CKD stage |           0           0          12
   Dialysis |          29           0          81
  Transplan |          82           0         304
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |    233.8507   122.42022       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,130         559           0        559        559

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,294
  CKD stage |         119           0         393
  CKD stage |           7           0          12
   Dialysis |           7           0          81
  Transplan |          75           0         304
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   255.48826   139.76374       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,130         582           0        582        582

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,294
  CKD stage |          71           0         393
  CKD stage |           5           0          12
   Dialysis |          27           0          81
  Transplan |          68           0         304
  KRT uncle |          21           0          46
------------+------------------------------------
      Total |   201.09953   112.41464       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,130         483           0        483        483

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,294
  CKD stage |         100           0         393
  CKD stage |           2           0          12
   Dialysis |          11           0          81
  Transplan |          98           0         304
  KRT uncle |          26           0          46
------------+------------------------------------
      Total |   236.33756   123.11888       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,130         571           0        571        571

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,294
  CKD stage |         131           0         393
  CKD stage |           0           0          12
   Dialysis |           9           0          81
  Transplan |          81           0         304
  KRT uncle |          20           0          46
------------+------------------------------------
      Total |   224.22629   108.85041       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,130         550           0        550        550

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,294
  CKD stage |         120           0         393
  CKD stage |           6           0          12
   Dialysis |          21           0          81
  Transplan |          55           0         304
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   240.65211   132.33326       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,130         558           0        558        558

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,294
  CKD stage |         122           0         393
  CKD stage |           3           0          12
   Dialysis |          11           0          81
  Transplan |          85           0         304
  KRT uncle |          20           0          46
------------+------------------------------------
      Total |   225.65962   111.31728       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,130         554           0        554        554

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,294
  CKD stage |          75           0         393
  CKD stage |           5           0          12
   Dialysis |           3           0          81
  Transplan |         100           0         304
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   241.57559   137.70295       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,130         538           0        538        538

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         264           0       1,294
  CKD stage |          71           0         393
  CKD stage |           4           0          12
   Dialysis |          24           0          81
  Transplan |          66           0         304
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |   183.90282   100.49688       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,130         432           0        432        432

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,294
  CKD stage |         109           0         393
  CKD stage |           3           0          12
   Dialysis |          18           0          81
  Transplan |          57           0         304
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   221.65869   120.79532       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,130         510           0        510        510

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,294
  CKD stage |          82           0         393
  CKD stage |           4           0          12
   Dialysis |          20           0          81
  Transplan |          56           0         304
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   246.51362   149.42549       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,130         540           0        540        540

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,294
  CKD stage |         101           0         393
  CKD stage |           5           0          12
   Dialysis |          30           0          81
  Transplan |         110           0         304
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   220.40329   105.91078       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,130         560           0        560        560

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,294
  CKD stage |          92           0         393
  CKD stage |           7           0          12
   Dialysis |          23           0          81
  Transplan |         123           0         304
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |    241.6277   123.21919       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,130         595           0        595        595

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         403           0       1,294
  CKD stage |          75           0         393
  CKD stage |           8           0          12
   Dialysis |           7           0          81
  Transplan |         104           0         304
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   274.01408   161.80069       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,130         606           0        606        606

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         275           0       1,294
  CKD stage |         112           0         393
  CKD stage |           2           0          12
   Dialysis |          14           0          81
  Transplan |          67           0         304
  KRT uncle |           5           0          46
------------+------------------------------------
      Total |    197.9446   98.634342       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         475           0        475        475

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,294
  CKD stage |          75           0         393
  CKD stage |           2           0          12
   Dialysis |          25           0          81
  Transplan |          62           0         304
  KRT uncle |           5           0          46
------------+------------------------------------
      Total |   210.87042   121.58293       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         477           0        477        477

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,294
  CKD stage |         124           0         393
  CKD stage |           7           0          12
   Dialysis |          28           0          81
  Transplan |         112           0         304
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   242.46385   115.07826       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         613           0        613        613

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,294
  CKD stage |         102           0         393
  CKD stage |           0           0          12
   Dialysis |          32           0          81
  Transplan |          81           0         304
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   213.45915   107.93485       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         524           0        524        524

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,294
  CKD stage |          81           0         393
  CKD stage |           5           0          12
   Dialysis |          27           0          81
  Transplan |         109           0         304
  KRT uncle |          18           0          46
------------+------------------------------------
      Total |   245.78967   133.45425       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,130         592           0        592        592

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         263           0       1,294
  CKD stage |         100           0         393
  CKD stage |           4           0          12
   Dialysis |          19           0          81
  Transplan |         103           0         304
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   193.75822   88.632973       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,130         493           0        493        493

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,294
  CKD stage |         101           0         393
  CKD stage |           0           0          12
   Dialysis |          12           0          81
  Transplan |          89           0         304
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   240.92911   129.88762       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,130         553           0        553        553

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,294
  CKD stage |         120           0         393
  CKD stage |           2           0          12
   Dialysis |          33           0          81
  Transplan |          67           0         304
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   226.30939   116.46684       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,130         547           0        547        547

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,294
  CKD stage |          85           0         393
  CKD stage |           0           0          12
   Dialysis |          19           0          81
  Transplan |          47           0         304
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   225.63099   134.64682       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,130         494           0        494        494

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         252           0       1,294
  CKD stage |         102           0         393
  CKD stage |           8           0          12
   Dialysis |          28           0          81
  Transplan |          92           0         304
  KRT uncle |          25           0          46
------------+------------------------------------
      Total |   186.69296   83.064404       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,130         507           0        507        507

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,294
  CKD stage |          58           0         393
  CKD stage |           6           0          12
   Dialysis |          20           0          81
  Transplan |          74           0         304
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   203.98404    118.8722       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,130         470           0        470        470

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,294
  CKD stage |         116           0         393
  CKD stage |           1           0          12
   Dialysis |          31           0          81
  Transplan |          94           0         304
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |    218.3216   103.91043       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,130         545           0        545        545

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         400           0       1,294
  CKD stage |          93           0         393
  CKD stage |           5           0          12
   Dialysis |          34           0          81
  Transplan |          96           0         304
  KRT uncle |          21           0          46
------------+------------------------------------
      Total |   275.63991   155.56556       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         649           0        649        649

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,294
  CKD stage |          84           0         393
  CKD stage |           2           0          12
   Dialysis |          27           0          81
  Transplan |         110           0         304
  KRT uncle |           2           0          46
------------+------------------------------------
      Total |   221.21549   113.51458       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         536           0        536        536

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         260           0       1,294
  CKD stage |          72           0         393
  CKD stage |           8           0          12
   Dialysis |          30           0          81
  Transplan |          92           0         304
  KRT uncle |          21           0          46
------------+------------------------------------
      Total |   186.00751   93.175516       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         483           0        483        483

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         402           0       1,294
  CKD stage |         128           0         393
  CKD stage |           0           0          12
   Dialysis |          18           0          81
  Transplan |          74           0         304
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   279.21221   155.06699       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         628           0        628        628

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,294
  CKD stage |          66           0         393
  CKD stage |           3           0          12
   Dialysis |          28           0          81
  Transplan |          82           0         304
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   197.62535   108.36616       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,130         469           0        469        469

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,294
  CKD stage |         115           0         393
  CKD stage |          -1           0          12
   Dialysis |          21           0          81
  Transplan |          61           0         304
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |    234.9277   128.02584       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,130         536           0        536        536

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,294
  CKD stage |          98           0         393
  CKD stage |           5           0          12
   Dialysis |          24           0          81
  Transplan |          48           0         304
  KRT uncle |          19           0          46
------------+------------------------------------
      Total |   210.35962   116.88014       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,130         497           0        497        497

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,294
  CKD stage |          98           0         393
  CKD stage |           2           0          12
   Dialysis |          23           0          81
  Transplan |         108           0         304
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   221.12535   108.74734       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,130         549           0        549        549

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,294
  CKD stage |          85           0         393
  CKD stage |           3           0          12
   Dialysis |          14           0          81
  Transplan |         113           0         304
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   237.22113   126.06297       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,130         558           0        558        558

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,294
  CKD stage |          77           0         393
  CKD stage |          10           0          12
   Dialysis |          35           0          81
  Transplan |          75           0         304
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   262.16432   157.11038       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,130         592           0        592        592

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         272           0       1,294
  CKD stage |         112           0         393
  CKD stage |           0           0          12
   Dialysis |          31           0          81
  Transplan |          77           0         304
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   198.33568   93.880562       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,130         504           0        504        504

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,294
  CKD stage |          76           0         393
  CKD stage |           4           0          12
   Dialysis |          22           0          81
  Transplan |          45           0         304
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   201.86479   119.24465       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,130         450           0        450        450

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,294
  CKD stage |          81           0         393
  CKD stage |           5           0          12
   Dialysis |           9           0          81
  Transplan |          41           0         304
  KRT uncle |           0           0          46
------------+------------------------------------
      Total |   199.16808   118.09568       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,130         429           0        429        429

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         264           0       1,294
  CKD stage |         141           0         393
  CKD stage |           5           0          12
   Dialysis |          15           0          81
  Transplan |          41           0         304
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |    193.0216   94.901058       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,130         474           0        474        474

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,294
  CKD stage |          72           0         393
  CKD stage |           4           0          12
   Dialysis |          29           0          81
  Transplan |          74           0         304
  KRT uncle |          25           0          46
------------+------------------------------------
      Total |   196.22207   106.09206       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,130         485           0        485        485

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,294
  CKD stage |          82           0         393
  CKD stage |           1           0          12
   Dialysis |          26           0          81
  Transplan |          73           0         304
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   220.59812   123.26647       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         513           0        513        513

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,294
  CKD stage |         108           0         393
  CKD stage |           1           0          12
   Dialysis |          10           0          81
  Transplan |          47           0         304
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   252.53709   149.41879       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,130         543           0        543        543

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,294
  CKD stage |         100           0         393
  CKD stage |           0           0          12
   Dialysis |          40           0          81
  Transplan |          68           0         304
  KRT uncle |           1           0          46
------------+------------------------------------
      Total |   247.79531    139.5322       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,130         568           0        568        568

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         260           0       1,294
  CKD stage |         134           0         393
  CKD stage |           0           0          12
   Dialysis |          28           0          81
  Transplan |         107           0         304
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |    199.2939   79.581515       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,130         542           0        542        542

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,294
  CKD stage |          84           0         393
  CKD stage |           0           0          12
   Dialysis |          17           0          81
  Transplan |          80           0         304
  KRT uncle |          22           0          46
------------+------------------------------------
      Total |   219.40423   119.94017       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,130         518           0        518        518

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,294
  CKD stage |         121           0         393
  CKD stage |          13           0          12
   Dialysis |          18           0          81
  Transplan |          76           0         304
  KRT uncle |          24           0          46
------------+------------------------------------
      Total |   234.31972   120.04233       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,130         581           0        581        581

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,294
  CKD stage |          93           0         393
  CKD stage |          10           0          12
   Dialysis |          22           0          81
  Transplan |         102           0         304
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   220.54695   111.68056       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,130         546           0        546        546

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,294
  CKD stage |          87           0         393
  CKD stage |           5           0          12
   Dialysis |          13           0          81
  Transplan |          88           0         304
  KRT uncle |          20           0          46
------------+------------------------------------
      Total |   212.42723   111.52878       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,130         514           0        514        514

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,294
  CKD stage |          80           0         393
  CKD stage |           1           0          12
   Dialysis |          17           0          81
  Transplan |          75           0         304
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   253.02113   150.04089       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,130         560           0        560        560

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,294
  CKD stage |          77           0         393
  CKD stage |           1           0          12
   Dialysis |           5           0          81
  Transplan |          65           0         304
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   226.26197   133.72299       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         494           0        494        494

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,294
  CKD stage |          82           0         393
  CKD stage |           2           0          12
   Dialysis |          25           0          81
  Transplan |          80           0         304
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |     225.623   125.87157       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         518           0        518        518

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,294
  CKD stage |          81           0         393
  CKD stage |           3           0          12
   Dialysis |          31           0          81
  Transplan |          76           0         304
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   237.53239   135.62048       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         553           0        553        553

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,294
  CKD stage |          75           0         393
  CKD stage |           9           0          12
   Dialysis |          19           0          81
  Transplan |          94           0         304
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   217.89484   118.25407       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         524           0        524        524

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,294
  CKD stage |          89           0         393
  CKD stage |           0           0          12
   Dialysis |          32           0          81
  Transplan |          50           0         304
  KRT uncle |          22           0          46
------------+------------------------------------
      Total |   254.28122   153.50844       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,130         570           0        570        570

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,294
  CKD stage |         130           0         393
  CKD stage |           0           0          12
   Dialysis |          21           0          81
  Transplan |          69           0         304
  KRT uncle |          28           0          46
------------+------------------------------------
      Total |   229.64085   115.37725       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,130         568           0        568        568

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,294
  CKD stage |          79           0         393
  CKD stage |          -1           0          12
   Dialysis |           8           0          81
  Transplan |          59           0         304
  KRT uncle |          18           0          46
------------+------------------------------------
      Total |   218.69531   128.20476       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,130         484           0        484        484

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         383           0       1,294
  CKD stage |          86           0         393
  CKD stage |           6           0          12
   Dialysis |           4           0          81
  Transplan |          62           0         304
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   257.75211   156.86339       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,130         549           0        549        549

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,294
  CKD stage |         127           0         393
  CKD stage |           1           0          12
   Dialysis |          17           0          81
  Transplan |          47           0         304
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |    233.7662   128.19922       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,130         529           0        529        529

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,294
  CKD stage |          78           0         393
  CKD stage |           0           0          12
   Dialysis |          37           0          81
  Transplan |          93           0         304
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   232.32629   127.35081       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,130         558           0        558        558

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,294
  CKD stage |         120           0         393
  CKD stage |           5           0          12
   Dialysis |          29           0          81
  Transplan |         101           0         304
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   226.27465   106.46612       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,130         577           0        577        577

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,294
  CKD stage |          90           0         393
  CKD stage |           6           0          12
   Dialysis |           9           0          81
  Transplan |          63           0         304
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |     212.023   118.33471       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,130         481           0        481        481

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,294
  CKD stage |         122           0         393
  CKD stage |           3           0          12
   Dialysis |          25           0          81
  Transplan |          74           0         304
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   223.66901    112.5507       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,130         540           0        540        540

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,294
  CKD stage |          78           0         393
  CKD stage |          10           0          12
   Dialysis |          13           0          81
  Transplan |          80           0         304
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   246.01737   143.89301       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,130         558           0        558        558

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,294
  CKD stage |          89           0         393
  CKD stage |           5           0          12
   Dialysis |          28           0          81
  Transplan |         106           0         304
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   224.24648   114.44519       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,130         554           0        554        554

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,294
  CKD stage |         145           0         393
  CKD stage |           3           0          12
   Dialysis |          10           0          81
  Transplan |          93           0         304
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   259.82207    129.5754       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         616           0        616        616

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,294
  CKD stage |         122           0         393
  CKD stage |           2           0          12
   Dialysis |          22           0          81
  Transplan |          96           0         304
  KRT uncle |          22           0          46
------------+------------------------------------
      Total |    241.0507   119.03627       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,130         599           0        599        599

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,294
  CKD stage |          98           0         393
  CKD stage |           0           0          12
   Dialysis |          23           0          81
  Transplan |         106           0         304
  KRT uncle |          30           0          46
------------+------------------------------------
      Total |   260.11972   139.21404       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,130         628           0        628        628

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,294
  CKD stage |          88           0         393
  CKD stage |           6           0          12
   Dialysis |          12           0          81
  Transplan |          79           0         304
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   229.86854    128.2855       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,130         525           0        525        525

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,294
  CKD stage |          88           0         393
  CKD stage |           3           0          12
   Dialysis |          18           0          81
  Transplan |          91           0         304
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   225.26103   120.37786       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,130         536           0        536        536

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,294
  CKD stage |          80           0         393
  CKD stage |           0           0          12
   Dialysis |          21           0          81
  Transplan |          40           0         304
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   221.98451   135.34435       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,130         482           0        482        482

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,294
  CKD stage |         149           0         393
  CKD stage |           4           0          12
   Dialysis |          19           0          81
  Transplan |         111           0         304
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   242.40845   108.07286       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,130         622           0        622        622

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,294
  CKD stage |         104           0         393
  CKD stage |           0           0          12
   Dialysis |          33           0          81
  Transplan |          75           0         304
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   227.04742   119.53632       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,130         547           0        547        547

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,294
  CKD stage |          84           0         393
  CKD stage |           2           0          12
   Dialysis |          14           0          81
  Transplan |          72           0         304
  KRT uncle |           1           0          46
------------+------------------------------------
      Total |   206.77089   113.53021       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,130         470           0        470        470

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,294
  CKD stage |          78           0         393
  CKD stage |           6           0          12
   Dialysis |          20           0          81
  Transplan |         118           0         304
  KRT uncle |          17           0          46
------------+------------------------------------
      Total |   207.35775   102.60913       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         527           0        527        527

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,294
  CKD stage |          99           0         393
  CKD stage |          12           0          12
   Dialysis |          16           0          81
  Transplan |          83           0         304
  KRT uncle |          23           0          46
------------+------------------------------------
      Total |    244.5216   133.70557       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         584           0        584        584

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,294
  CKD stage |          87           0         393
  CKD stage |           6           0          12
   Dialysis |          12           0          81
  Transplan |          66           0         304
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   247.91972   146.65516       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         546           0        546        546

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,294
  CKD stage |          90           0         393
  CKD stage |           0           0          12
   Dialysis |          19           0          81
  Transplan |          79           0         304
  KRT uncle |          22           0          46
------------+------------------------------------
      Total |   230.16479   126.49386       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,130         541           0        541        541

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,294
  CKD stage |          79           0         393
  CKD stage |           6           0          12
   Dialysis |          27           0          81
  Transplan |          74           0         304
  KRT uncle |          19           0          46
------------+------------------------------------
      Total |   241.66761   140.37714       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,130         559           0        559        559

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,294
  CKD stage |         103           0         393
  CKD stage |           3           0          12
   Dialysis |           7           0          81
  Transplan |          88           0         304
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   233.21408   123.47546       2,130

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,130         545           0        545        545

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(66 real changes made)

. replace ethnicity=2 if ethnicity==3
(77 real changes made)

. replace ethnicity=3 if ethnicity==4
(83 real changes made)

. replace ethnicity=4 if ethnicity==6
(66 real changes made)

. replace ethnicity=6 if ethnicity==.
(543 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,930 missing values generated)

. replace region = 2 if region_string=="East"
(207 real changes made)

. replace region = 3 if region_string=="London"
(445 real changes made)

. replace region = 4 if region_string=="North East"
(210 real changes made)

. replace region = 5 if region_string=="North West"
(197 real changes made)

. replace region = 6 if region_string=="South East"
(200 real changes made)

. replace region = 7 if region_string=="South West"
(212 real changes made)

. replace region = 8 if region_string=="West Midlands"
(222 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(237 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,130 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(823 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,307 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. }
  5. }

. 
. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2020_ckd_complete.dta not found)
file ./output/2020_ckd_complete.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 closed on:  18 Aug 2023, 17:35:01
-------------------------------------------------------------------------------
