-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete_v3.log
  log type:  text
 opened on:  21 Apr 2023, 07:55:23

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 20,860 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,666
        from master                    47,903  (_merge==1)
        from using                     18,763  (_merge==2)

    matched                             2,097  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,666 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v3

. save ``dataset'_ckd_complete_v3', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v3
> save 2017_ckd_complete_v3, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        192        9.16        9.16
Kidney transplant |        187        8.92       18.07
 Modality unclear |         46        2.19       20.27
          Pre KRT |      1,672       79.73      100.00
------------------+-----------------------------------
            Total |      2,097      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(837 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1260 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,260       60.09       60.09
          . |        837       39.91      100.00
------------+-----------------------------------
      Total |      2,097      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(192 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(23 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(136 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(289 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(9 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       113         79 |       192 
Kidney transplant |       187          0 |       187 
 Modality unclear |        46          0 |        46 
          Pre KRT |     1,672          0 |     1,672 
------------------+----------------------+----------
            Total |     2,018         79 |     2,097 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       178         14 |       192 
Kidney transplant |       165         22 |       187 
 Modality unclear |        40          6 |        46 
          Pre KRT |     1,434        238 |     1,672 
------------------+----------------------+----------
            Total |     1,817        280 |     2,097 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(837 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1260 changes made)

. replace ckd_group = 4 if dialysis==1
(79 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(280 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(46 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(630 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,259       60.04       60.04
         CKD stage 3 |        424       20.22       80.26
       CKD stage 4/5 |         15        0.72       80.97
            Dialysis |         79        3.77       84.74
          Transplant |        274       13.07       97.81
KRT unclear modality |         46        2.19      100.00
---------------------+-----------------------------------
               Total |      2,097      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        59        127          0      1,073 |     1,259 
         CKD stage 3 |        38         38          0        348 |       424 
       CKD stage 4/5 |         2          0          0         13 |        15 
            Dialysis |        79          0          0          0 |        79 
          Transplant |        14         22          0        238 |       274 
KRT unclear modality |         0          0         46          0 |        46 
---------------------+--------------------------------------------+----------
               Total |       192        187         46      1,672 |     2,097 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       125         51         51         26 |     1,259 
         CKD stage 3 |        42         30         14          5 |       424 
       CKD stage 4/5 |         0          1          1          0 |        15 
            Dialysis |        10          7          2          1 |        79 
          Transplant |        17         10         11          4 |       274 
KRT unclear modality |         8          0          3          0 |        46 
---------------------+--------------------------------------------+----------
               Total |       202         99         82         36 |     2,097 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,006 |     1,259 
         CKD stage 3 |       333 |       424 
       CKD stage 4/5 |        13 |        15 
            Dialysis |        59 |        79 
          Transplant |       232 |       274 
KRT unclear modality |        35 |        46 
---------------------+-----------+----------
               Total |     1,678 |     2,097 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,081 missing values generated)

. replace sex = 0 if male == "Female"
(1,081 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(954 real changes made, 954 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(954 missing values generated)

. gen min_creatinine_outcome=.
(2,097 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(584 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(559 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(584 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(559 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(718 real changes made)

. gen max_creatinine_outcome=.
(2,097 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(584 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(559 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,143 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,379 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(954 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,143 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(584 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(954 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1143 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(176 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(10 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(8 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(954 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1143 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,143       54.51       54.51
          . |        954       45.49      100.00
------------+-----------------------------------
      Total |      2,097      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(99 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(82 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(21 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(36 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(99 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(103 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(202 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,524       72.68       72.68
               CKD 3 |        142        6.77       79.45
     CKD 4/5 pre-KRT |         12        0.57       80.02
            Dialysis |         99        4.72       84.74
   Kidney transplant |        103        4.91       89.65
KRT unclear modality |         15        0.72       90.37
            Deceased |        202        9.63      100.00
---------------------+-----------------------------------
               Total |      2,097      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,259
  CKD stage |         130           0         424
  CKD stage |           1           0          15
   Dialysis |          23           0          79
  Transplan |          75           0         274
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   201.77015   92.430563       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,097         517           0        517        517

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,259
  CKD stage |          85           0         424
  CKD stage |           6           0          15
   Dialysis |          26           0          79
  Transplan |          89           0         274
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   205.43443    107.3237       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,097         511           0        511        511

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         391           0       1,259
  CKD stage |         126           0         424
  CKD stage |           9           0          15
   Dialysis |          15           0          79
  Transplan |          67           0         274
  KRT uncle |          22           0          46
------------+------------------------------------
      Total |   270.09204   150.54656       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,097         630           0        630        630

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         262           0       1,259
  CKD stage |          66           0         424
  CKD stage |           1           0          15
   Dialysis |          26           0          79
  Transplan |         108           0         274
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   186.02814   95.102163       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,097         476           0        476        476

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,259
  CKD stage |          91           0         424
  CKD stage |           5           0          15
   Dialysis |          32           0          79
  Transplan |          54           0         274
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   250.17024   150.34542       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,097         560           0        560        560

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,259
  CKD stage |          84           0         424
  CKD stage |           1           0          15
   Dialysis |          12           0          79
  Transplan |          71           0         274
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   237.11731   139.37474       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,097         530           0        530        530

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,259
  CKD stage |         126           0         424
  CKD stage |           4           0          15
   Dialysis |          26           0          79
  Transplan |          78           0         274
  KRT uncle |           5           0          46
------------+------------------------------------
      Total |   252.32284   133.23109       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,097         598           0        598        598

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,259
  CKD stage |         105           0         424
  CKD stage |           1           0          15
   Dialysis |          14           0          79
  Transplan |          77           0         274
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   244.71197    135.5696       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,097         567           0        567        567

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,259
  CKD stage |          89           0         424
  CKD stage |           0           0          15
   Dialysis |          17           0          79
  Transplan |          95           0         274
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   246.76109   138.88496       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,097         568           0        568        568

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,259
  CKD stage |          90           0         424
  CKD stage |           4           0          15
   Dialysis |          31           0          79
  Transplan |          81           0         274
  KRT uncle |           3           0          46
------------+------------------------------------
      Total |   235.37387   131.76497       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,097         551           0        551        551

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         278           0       1,259
  CKD stage |          91           0         424
  CKD stage |           7           0          15
   Dialysis |          33           0          79
  Transplan |          34           0         274
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   191.21698   108.21149       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,097         451           0        451        451

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,259
  CKD stage |         126           0         424
  CKD stage |           0           0          15
   Dialysis |          18           0          79
  Transplan |          60           0         274
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   216.23891   109.83836       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,097         522           0        522        522

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,259
  CKD stage |         120           0         424
  CKD stage |           6           0          15
   Dialysis |          17           0          79
  Transplan |          71           0         274
  KRT uncle |           0           0          46
------------+------------------------------------
      Total |   222.74344   114.75302       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,097         528           0        528        528

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,259
  CKD stage |         131           0         424
  CKD stage |           2           0          15
   Dialysis |          17           0          79
  Transplan |          68           0         274
  KRT uncle |          17           0          46
------------+------------------------------------
      Total |   217.11493   106.55033       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,097         536           0        536        536

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,259
  CKD stage |         112           0         424
  CKD stage |           0           0          15
   Dialysis |          22           0          79
  Transplan |          70           0         274
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   221.44778   115.59223       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,097         532           0        532        532

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,259
  CKD stage |         134           0         424
  CKD stage |           3           0          15
   Dialysis |          33           0          79
  Transplan |          60           0         274
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   217.71102   107.27739       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,097         541           0        541        541

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,259
  CKD stage |         104           0         424
  CKD stage |           8           0          15
   Dialysis |          17           0          79
  Transplan |          70           0         274
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   218.47639   116.44868       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,097         524           0        524        524

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,259
  CKD stage |         106           0         424
  CKD stage |           4           0          15
   Dialysis |          29           0          79
  Transplan |          46           0         274
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |    234.8021   134.51882       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,097         542           0        542        542

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,259
  CKD stage |          95           0         424
  CKD stage |           0           0          15
   Dialysis |          12           0          79
  Transplan |          51           0         274
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   219.13448   126.57827       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         483           0        483        483

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         280           0       1,259
  CKD stage |         136           0         424
  CKD stage |           0           0          15
   Dialysis |          29           0          79
  Transplan |          66           0         274
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   205.67239   95.495369       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         527           0        527        527

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,259
  CKD stage |         111           0         424
  CKD stage |           7           0          15
   Dialysis |          13           0          79
  Transplan |          71           0         274
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   205.49928   103.60868       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         505           0        505        505

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,259
  CKD stage |         106           0         424
  CKD stage |           5           0          15
   Dialysis |          28           0          79
  Transplan |          70           0         274
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   219.18598   115.54651       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         530           0        530        530

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,259
  CKD stage |         107           0         424
  CKD stage |           8           0          15
   Dialysis |          33           0          79
  Transplan |          68           0         274
  KRT uncle |          18           0          46
------------+------------------------------------
      Total |   214.73104   111.12612       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,097         538           0        538        538

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,259
  CKD stage |         125           0         424
  CKD stage |           0           0          15
   Dialysis |           8           0          79
  Transplan |          83           0         274
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   219.71245   107.91529       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,097         529           0        529        529

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,259
  CKD stage |         134           0         424
  CKD stage |           0           0          15
   Dialysis |          22           0          79
  Transplan |          61           0         274
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |     204.732   98.142416       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,097         504           0        504        504

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,259
  CKD stage |          99           0         424
  CKD stage |           0           0          15
   Dialysis |          55           0          79
  Transplan |          71           0         274
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   240.04959   132.04465       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,097         588           0        588        588

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,259
  CKD stage |         128           0         424
  CKD stage |           5           0          15
   Dialysis |           6           0          79
  Transplan |          86           0         274
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   227.18789    112.3583       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,097         545           0        545        545

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,259
  CKD stage |         136           0         424
  CKD stage |           0           0          15
   Dialysis |           9           0          79
  Transplan |          55           0         274
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |   235.17024   124.17039       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,097         543           0        543        543

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,259
  CKD stage |          93           0         424
  CKD stage |           4           0          15
   Dialysis |          20           0          79
  Transplan |          75           0         274
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   249.92322   144.61622       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,097         568           0        568        568

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,259
  CKD stage |         123           0         424
  CKD stage |           0           0          15
   Dialysis |          28           0          79
  Transplan |          71           0         274
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   209.66333   101.44501       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,097         528           0        528        528

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,259
  CKD stage |         123           0         424
  CKD stage |           4           0          15
   Dialysis |          31           0          79
  Transplan |          53           0         274
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   202.45255   101.12364       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         500           0        500        500

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,259
  CKD stage |          98           0         424
  CKD stage |           0           0          15
   Dialysis |          45           0          79
  Transplan |          83           0         274
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   252.42394   140.14083       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         607           0        607        607

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,259
  CKD stage |         109           0         424
  CKD stage |           0           0          15
   Dialysis |          26           0          79
  Transplan |          62           0         274
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   225.95041   122.12072       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         535           0        535        535

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,259
  CKD stage |          79           0         424
  CKD stage |           1           0          15
   Dialysis |          18           0          79
  Transplan |          35           0         274
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   254.93371   165.24948       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         529           0        529        529

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,259
  CKD stage |          98           0         424
  CKD stage |           0           0          15
   Dialysis |          14           0          79
  Transplan |          82           0         274
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   208.85742   108.69875       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,097         494           0        494        494

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,259
  CKD stage |         122           0         424
  CKD stage |          12           0          15
   Dialysis |          11           0          79
  Transplan |          68           0         274
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   257.65808   142.57483       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,097         597           0        597        597

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,259
  CKD stage |          81           0         424
  CKD stage |           0           0          15
   Dialysis |          20           0          79
  Transplan |          88           0         274
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   206.67144   110.69886       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,097         500           0        500        500

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,259
  CKD stage |          89           0         424
  CKD stage |           0           0          15
   Dialysis |          39           0          79
  Transplan |          46           0         274
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   218.37291   126.97098       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,097         503           0        503        503

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,259
  CKD stage |         109           0         424
  CKD stage |           9           0          15
   Dialysis |          22           0          79
  Transplan |          43           0         274
  KRT uncle |          18           0          46
------------+------------------------------------
      Total |   219.86695   122.67215       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,097         519           0        519        519

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,259
  CKD stage |          87           0         424
  CKD stage |           0           0          15
   Dialysis |          30           0          79
  Transplan |          55           0         274
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   232.07964   136.91049       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,097         526           0        526        526

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,259
  CKD stage |          86           0         424
  CKD stage |           0           0          15
   Dialysis |           9           0          79
  Transplan |          67           0         274
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   227.93896   132.36297       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,097         512           0        512        512

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,259
  CKD stage |         115           0         424
  CKD stage |           5           0          15
   Dialysis |          44           0          79
  Transplan |          65           0         274
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   213.15021   107.46232       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,097         537           0        537        537

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,259
  CKD stage |          88           0         424
  CKD stage |           5           0          15
   Dialysis |          12           0          79
  Transplan |          85           0         274
  KRT uncle |           8           0          46
------------+------------------------------------
      Total |   229.48975   128.19841       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,097         531           0        531        531

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,259
  CKD stage |         110           0         424
  CKD stage |           3           0          15
   Dialysis |          30           0          79
  Transplan |          54           0         274
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   240.84549   135.69689       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,097         559           0        559        559

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,259
  CKD stage |          73           0         424
  CKD stage |           9           0          15
   Dialysis |          29           0          79
  Transplan |          93           0         274
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |      245.67   143.44151       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,097         578           0        578        578

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,259
  CKD stage |          96           0         424
  CKD stage |           5           0          15
   Dialysis |          15           0          79
  Transplan |          37           0         274
  KRT uncle |           1           0          46
------------+------------------------------------
      Total |   230.19838   138.89528       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         496           0        496        496

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,259
  CKD stage |         113           0         424
  CKD stage |           0           0          15
   Dialysis |          34           0          79
  Transplan |          64           0         274
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   207.28994   105.06168       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,097         506           0        506        506

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,259
  CKD stage |          89           0         424
  CKD stage |           4           0          15
   Dialysis |          21           0          79
  Transplan |          62           0         274
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   203.11302   111.43363       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,097         482           0        482        482

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,259
  CKD stage |         102           0         424
  CKD stage |           4           0          15
   Dialysis |          26           0          79
  Transplan |          47           0         274
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   224.38293   127.59233       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,097         519           0        519        519

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,259
  CKD stage |         106           0         424
  CKD stage |           1           0          15
   Dialysis |           9           0          79
  Transplan |          44           0         274
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   218.75632   124.08934       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,097         492           0        492        492

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,259
  CKD stage |          89           0         424
  CKD stage |           0           0          15
   Dialysis |          24           0          79
  Transplan |         113           0         274
  KRT uncle |          26           0          46
------------+------------------------------------
      Total |   204.14258   98.594789       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,097         535           0        535        535

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         402           0       1,259
  CKD stage |          82           0         424
  CKD stage |           2           0          15
   Dialysis |           4           0          79
  Transplan |          77           0         274
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   268.31283   164.86721       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,097         574           0        574        574

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,259
  CKD stage |         125           0         424
  CKD stage |           0           0          15
   Dialysis |          21           0          79
  Transplan |          72           0         274
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   245.33524   129.62978       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,097         582           0        582        582

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,259
  CKD stage |         119           0         424
  CKD stage |           0           0          15
   Dialysis |          18           0          79
  Transplan |          72           0         274
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   239.76252    127.6764       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,097         564           0        564        564

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,259
  CKD stage |         109           0         424
  CKD stage |           0           0          15
   Dialysis |           8           0          79
  Transplan |          49           0         274
  KRT uncle |           7           0          46
------------+------------------------------------
      Total |   209.61135   114.82161       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         474           0        474        474

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         264           0       1,259
  CKD stage |         127           0         424
  CKD stage |          16           0          15
   Dialysis |          18           0          79
  Transplan |          58           0         274
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   192.68193   91.855566       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         489           0        489        489

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,259
  CKD stage |          95           0         424
  CKD stage |           2           0          15
   Dialysis |           9           0          79
  Transplan |          47           0         274
  KRT uncle |          17           0          46
------------+------------------------------------
      Total |    247.6166    150.2271       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         539           0        539        539

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,259
  CKD stage |          98           0         424
  CKD stage |           0           0          15
   Dialysis |          13           0          79
  Transplan |          94           0         274
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   206.38245   103.25846       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         507           0        507        507

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,259
  CKD stage |         114           0         424
  CKD stage |           0           0          15
   Dialysis |          25           0          79
  Transplan |          72           0         274
  KRT uncle |          22           0          46
------------+------------------------------------
      Total |    219.4001   111.95458       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,097         542           0        542        542

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,259
  CKD stage |         115           0         424
  CKD stage |           3           0          15
   Dialysis |          21           0          79
  Transplan |          65           0         274
  KRT uncle |          19           0          46
------------+------------------------------------
      Total |   234.70291   126.30709       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,097         559           0        559        559

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,259
  CKD stage |         107           0         424
  CKD stage |           3           0          15
   Dialysis |           4           0          79
  Transplan |          77           0         274
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   239.24082   131.62612       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,097         547           0        547        547

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,259
  CKD stage |         108           0         424
  CKD stage |           7           0          15
   Dialysis |          15           0          79
  Transplan |          46           0         274
  KRT uncle |           5           0          46
------------+------------------------------------
      Total |    250.7134   148.28941       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,097         551           0        551        551

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,259
  CKD stage |         131           0         424
  CKD stage |           4           0          15
   Dialysis |          18           0          79
  Transplan |          77           0         274
  KRT uncle |          19           0          46
------------+------------------------------------
      Total |   209.38102   97.661279       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,097         535           0        535        535

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,259
  CKD stage |         112           0         424
  CKD stage |          19           0          15
   Dialysis |          13           0          79
  Transplan |          48           0         274
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |   211.09967    114.2336       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,097         505           0        505        505

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,259
  CKD stage |         122           0         424
  CKD stage |           0           0          15
   Dialysis |           8           0          79
  Transplan |          77           0         274
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   250.65474   135.44603       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,097         570           0        570        570

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,259
  CKD stage |          66           0         424
  CKD stage |           4           0          15
   Dialysis |          24           0          79
  Transplan |          38           0         274
  KRT uncle |           6           0          46
------------+------------------------------------
      Total |   200.08918    124.3338       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,097         439           0        439        439

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         270           0       1,259
  CKD stage |          75           0         424
  CKD stage |           6           0          15
   Dialysis |          11           0          79
  Transplan |          62           0         274
  KRT uncle |          29           0          46
------------+------------------------------------
      Total |   186.46209   103.28436       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,097         453           0        453        453

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,259
  CKD stage |         109           0         424
  CKD stage |           5           0          15
   Dialysis |          23           0          79
  Transplan |          63           0         274
  KRT uncle |           4           0          46
------------+------------------------------------
      Total |   216.17835   114.75676       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,097         512           0        512        512

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,259
  CKD stage |         140           0         424
  CKD stage |           0           0          15
   Dialysis |          19           0          79
  Transplan |          55           0         274
  KRT uncle |          14           0          46
------------+------------------------------------
      Total |   250.25227   133.59796       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,097         584           0        584        584

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,259
  CKD stage |          80           0         424
  CKD stage |           0           0          15
   Dialysis |          19           0          79
  Transplan |          52           0         274
  KRT uncle |          19           0          46
------------+------------------------------------
      Total |   209.62041   122.72066       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         479           0        479        479

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,259
  CKD stage |         125           0         424
  CKD stage |           0           0          15
   Dialysis |           8           0          79
  Transplan |          47           0         274
  KRT uncle |          21           0          46
------------+------------------------------------
      Total |    200.8846   102.55297       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,097         482           0        482        482

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,259
  CKD stage |         123           0         424
  CKD stage |          13           0          15
   Dialysis |          21           0          79
  Transplan |          91           0         274
  KRT uncle |           5           0          46
------------+------------------------------------
      Total |   228.67525   112.18729       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,097         571           0        571        571

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,259
  CKD stage |          79           0         424
  CKD stage |           0           0          15
   Dialysis |           1           0          79
  Transplan |          42           0         274
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   224.69099   140.03168       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,097         472           0        472        472

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,259
  CKD stage |          76           0         424
  CKD stage |           0           0          15
   Dialysis |          34           0          79
  Transplan |          71           0         274
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   237.45637   141.01594       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,097         542           0        542        542

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,259
  CKD stage |         101           0         424
  CKD stage |           0           0          15
   Dialysis |          37           0          79
  Transplan |          63           0         274
  KRT uncle |          13           0          46
------------+------------------------------------
      Total |   216.45064   116.14074       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,097         524           0        524        524

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,259
  CKD stage |          59           0         424
  CKD stage |           1           0          15
   Dialysis |          17           0          79
  Transplan |          74           0         274
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   205.11302   121.88702       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,097         471           0        471        471

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,259
  CKD stage |         114           0         424
  CKD stage |          13           0          15
   Dialysis |          22           0          79
  Transplan |          78           0         274
  KRT uncle |           2           0          46
------------+------------------------------------
      Total |   219.72532   111.77637       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,097         538           0        538        538

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,259
  CKD stage |         111           0         424
  CKD stage |           1           0          15
   Dialysis |          27           0          79
  Transplan |          77           0         274
  KRT uncle |          15           0          46
------------+------------------------------------
      Total |   243.99142   131.61123       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,097         581           0        581        581

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,259
  CKD stage |         110           0         424
  CKD stage |          12           0          15
   Dialysis |          30           0          79
  Transplan |          39           0         274
  KRT uncle |          16           0          46
------------+------------------------------------
      Total |   213.22127   117.53496       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         514           0        514        514

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,259
  CKD stage |         114           0         424
  CKD stage |           0           0          15
   Dialysis |          28           0          79
  Transplan |          45           0         274
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   242.11683   138.29356       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         549           0        549        549

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,259
  CKD stage |          87           0         424
  CKD stage |           4           0          15
   Dialysis |           8           0          79
  Transplan |          71           0         274
  KRT uncle |          10           0          46
------------+------------------------------------
      Total |    204.5298   112.31905       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         475           0        475        475

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,259
  CKD stage |         109           0         424
  CKD stage |           5           0          15
   Dialysis |          27           0          79
  Transplan |          72           0         274
  KRT uncle |          11           0          46
------------+------------------------------------
      Total |    226.0639   119.42271       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,097         546           0        546        546

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,259
  CKD stage |          86           0         424
  CKD stage |           3           0          15
   Dialysis |          32           0          79
  Transplan |          56           0         274
  KRT uncle |          12           0          46
------------+------------------------------------
      Total |   247.13639    148.9538       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,097         557           0        557        557

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,259
  CKD stage |         107           0         424
  CKD stage |          10           0          15
   Dialysis |          19           0          79
  Transplan |          43           0         274
  KRT uncle |           9           0          46
------------+------------------------------------
      Total |   215.55699   120.65764       2,097

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,097         500           0        500        500

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(88 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(76 real changes made)

. replace ethnicity=4 if ethnicity==6
(88 real changes made)

. replace ethnicity=6 if ethnicity==.
(502 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,899 missing values generated)

. replace region = 2 if region_string=="East"
(233 real changes made)

. replace region = 3 if region_string=="London"
(407 real changes made)

. replace region = 4 if region_string=="North East"
(212 real changes made)

. replace region = 5 if region_string=="North West"
(195 real changes made)

. replace region = 6 if region_string=="South East"
(209 real changes made)

. replace region = 7 if region_string=="South West"
(205 real changes made)

. replace region = 8 if region_string=="West Midlands"
(230 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(208 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,097 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(819 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,278 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v3.dta", replace
(note: file ./output/2020_ckd_complete_v3.dta not found)
file ./output/2020_ckd_complete_v3.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete_v3.log
  log type:  text
 closed on:  21 Apr 2023, 07:55:27
-------------------------------------------------------------------------------
