-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 opened on:  12 Sep 2023, 14:36:44

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,025 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(235 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,731
        from master                    47,853  (_merge==1)
        from using                     18,878  (_merge==2)

    matched                             2,147  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,731 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        193        8.99        8.99
Kidney transplant |        182        8.48       17.47
 Modality unclear |         53        2.47       19.93
          Pre KRT |      1,719       80.07      100.00
------------------+-----------------------------------
            Total |      2,147      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(860 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1287 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,287       59.94       59.94
          . |        860       40.06      100.00
------------+-----------------------------------
      Total |      2,147      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(193 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(33 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(153 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(289 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(6 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(53 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(9 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       120         73 |       193 
Kidney transplant |       182          0 |       182 
 Modality unclear |        53          0 |        53 
          Pre KRT |     1,719          0 |     1,719 
------------------+----------------------+----------
            Total |     2,074         73 |     2,147 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       173         20 |       193 
Kidney transplant |       151         31 |       182 
 Modality unclear |        44          9 |        53 
          Pre KRT |     1,496        223 |     1,719 
------------------+----------------------+----------
            Total |     1,864        283 |     2,147 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       193          0 |       193 
Kidney transplant |       182          0 |       182 
 Modality unclear |         9         44 |        53 
          Pre KRT |     1,719          0 |     1,719 
------------------+----------------------+----------
            Total |     2,103         44 |     2,147 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,791        283 |     2,074 
         1 |        73          0 |        73 
-----------+----------------------+----------
     Total |     1,864        283 |     2,147 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(860 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1287 changes made)

. replace ckd_group = 4 if dialysis==1
(73 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(283 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(44 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(652 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,300       60.55       60.55
         CKD stage 3 |        435       20.26       80.81
       CKD stage 4/5 |         12        0.56       81.37
            Dialysis |         73        3.40       84.77
          Transplant |        283       13.18       97.95
KRT unclear modality |         44        2.05      100.00
---------------------+-----------------------------------
               Total |      2,147      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        55        122          0      1,123 |     1,300 
         CKD stage 3 |        45         26          0        364 |       435 
       CKD stage 4/5 |         0          3          0          9 |        12 
            Dialysis |        73          0          0          0 |        73 
          Transplant |        20         31          9        223 |       283 
KRT unclear modality |         0          0         44          0 |        44 
---------------------+--------------------------------------------+----------
               Total |       193        182         53      1,719 |     2,147 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       116         70         47         16 |     1,300 
         CKD stage 3 |        56         19         22          3 |       435 
       CKD stage 4/5 |         0          1          0          0 |        12 
            Dialysis |         6          1          4          0 |        73 
          Transplant |        29         16         19          3 |       283 
KRT unclear modality |         8          2          2          0 |        44 
---------------------+--------------------------------------------+----------
               Total |       215        109         94         22 |     2,147 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,051 |     1,300 
         CKD stage 3 |       335 |       435 
       CKD stage 4/5 |        11 |        12 
            Dialysis |        62 |        73 
          Transplant |       216 |       283 
KRT unclear modality |        32 |        44 
---------------------+-----------+----------
               Total |     1,707 |     2,147 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,095 missing values generated)

. replace sex = 0 if male == "Female"
(1,095 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(965 real changes made, 965 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(965 missing values generated)

. gen min_creatinine_outcome=.
(2,147 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(586 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(596 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(586 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(596 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(747 real changes made)

. gen max_creatinine_outcome=.
(2,147 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(586 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(596 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,182 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,400 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(965 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,182 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(586 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(965 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1182 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(181 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(6 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(6 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(965 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1182 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,182       55.05       55.05
          . |        965       44.95      100.00
------------+-----------------------------------
      Total |      2,147      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(109 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(94 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(13 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(22 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(109 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(107 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(215 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,551       72.24       72.24
               CKD 3 |        145        6.75       78.99
     CKD 4/5 pre-KRT |         11        0.51       79.51
            Dialysis |        109        5.08       84.58
   Kidney transplant |        107        4.98       89.57
KRT unclear modality |          9        0.42       89.99
            Deceased |        215       10.01      100.00
---------------------+-----------------------------------
               Total |      2,147      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(860 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1287 changes made)

. replace access_egfr=0 if ckd_group==4
(73 real changes made)

. replace access_egfr=3 if access_egfr==.
(787 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         278           0       1,300
  CKD stage |          96           0         435
  CKD stage |           0           0          12
   Dialysis |           8           0          73
  Transplan |         101           0         283
  KRT uncle |          14           0          44
------------+------------------------------------
      Total |   201.65021   96.719954       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,147         497           0        497        497

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,300
  CKD stage |          88           0         435
  CKD stage |           0           0          12
   Dialysis |          15           0          73
  Transplan |          34           0         283
  KRT uncle |           3           0          44
------------+------------------------------------
      Total |   235.41174    144.6305       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,147         491           0        491        491

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,300
  CKD stage |         112           0         435
  CKD stage |           0           0          12
   Dialysis |          16           0          73
  Transplan |          76           0         283
  KRT uncle |          15           0          44
------------+------------------------------------
      Total |   253.96181   138.03716       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,147         583           0        583        583

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,300
  CKD stage |          88           0         435
  CKD stage |           5           0          12
   Dialysis |          23           0          73
  Transplan |          71           0         283
  KRT uncle |          18           0          44
------------+------------------------------------
      Total |    246.3456   141.61109       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,147         565           0        565        565

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,300
  CKD stage |         129           0         435
  CKD stage |           0           0          12
   Dialysis |          23           0          73
  Transplan |          36           0         283
  KRT uncle |          13           0          44
------------+------------------------------------
      Total |   229.92734   124.29635       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,147         528           0        528        528

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,300
  CKD stage |          74           0         435
  CKD stage |          10           0          12
   Dialysis |          19           0          73
  Transplan |          43           0         283
  KRT uncle |          16           0          44
------------+------------------------------------
      Total |   264.49464   169.68101       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,147         563           0        563        563

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,300
  CKD stage |          97           0         435
  CKD stage |           2           0          12
   Dialysis |          24           0          73
  Transplan |          79           0         283
  KRT uncle |          18           0          44
------------+------------------------------------
      Total |   217.75501   113.06509       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,147         528           0        528        528

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,300
  CKD stage |         102           0         435
  CKD stage |          13           0          12
   Dialysis |          16           0          73
  Transplan |          88           0         283
  KRT uncle |          25           0          44
------------+------------------------------------
      Total |   222.91476   113.07497       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,147         557           0        557        557

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,300
  CKD stage |          95           0         435
  CKD stage |           8           0          12
   Dialysis |          15           0          73
  Transplan |          56           0         283
  KRT uncle |          16           0          44
------------+------------------------------------
      Total |   209.16069   114.05115       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,147         490           0        490        490

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,300
  CKD stage |         117           0         435
  CKD stage |           9           0          12
   Dialysis |          23           0          73
  Transplan |          76           0         283
  KRT uncle |          12           0          44
------------+------------------------------------
      Total |   244.30275    127.9359       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,147         583           0        583        583

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,300
  CKD stage |         130           0         435
  CKD stage |           2           0          12
   Dialysis |          29           0          73
  Transplan |          79           0         283
  KRT uncle |           9           0          44
------------+------------------------------------
      Total |   225.63763    107.5091       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,147         559           0        559        559

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,300
  CKD stage |         147           0         435
  CKD stage |           2           0          12
   Dialysis |          13           0          73
  Transplan |          78           0         283
  KRT uncle |          16           0          44
------------+------------------------------------
      Total |   242.47601   116.38584       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,147         589           0        589        589

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,300
  CKD stage |         108           0         435
  CKD stage |           0           0          12
   Dialysis |          14           0          73
  Transplan |          57           0         283
  KRT uncle |          11           0          44
------------+------------------------------------
      Total |   202.66279   104.47449       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,147         475           0        475        475

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,300
  CKD stage |         134           0         435
  CKD stage |           0           0          12
   Dialysis |          17           0          73
  Transplan |          74           0         283
  KRT uncle |           3           0          44
------------+------------------------------------
      Total |   225.24686   108.75375       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,147         538           0        538        538

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         275           0       1,300
  CKD stage |         131           0         435
  CKD stage |           4           0          12
   Dialysis |          15           0          73
  Transplan |          93           0         283
  KRT uncle |          14           0          44
------------+------------------------------------
      Total |   206.13088   89.068238       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,147         532           0        532        532

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,300
  CKD stage |         156           0         435
  CKD stage |           6           0          12
   Dialysis |           4           0          73
  Transplan |          66           0         283
  KRT uncle |          17           0          44
------------+------------------------------------
      Total |   212.78528   95.263083       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,147         533           0        533        533

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,300
  CKD stage |         123           0         435
  CKD stage |           1           0          12
   Dialysis |           9           0          73
  Transplan |          69           0         283
  KRT uncle |          10           0          44
------------+------------------------------------
      Total |   269.46483   149.16598       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,147         600           0        600        600

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,300
  CKD stage |          99           0         435
  CKD stage |           4           0          12
   Dialysis |           4           0          73
  Transplan |          59           0         283
  KRT uncle |          10           0          44
------------+------------------------------------
      Total |   251.02096   146.43922       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,147         544           0        544        544

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,300
  CKD stage |          74           0         435
  CKD stage |           3           0          12
   Dialysis |          10           0          73
  Transplan |          57           0         283
  KRT uncle |          25           0          44
------------+------------------------------------
      Total |   214.71216   126.18446       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,147         485           0        485        485

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,300
  CKD stage |         129           0         435
  CKD stage |           7           0          12
   Dialysis |          33           0          73
  Transplan |          67           0         283
  KRT uncle |           9           0          44
------------+------------------------------------
      Total |   227.65021   112.45423       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,147         561           0        561        561

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,300
  CKD stage |         110           0         435
  CKD stage |           0           0          12
   Dialysis |          22           0          73
  Transplan |          82           0         283
  KRT uncle |          12           0          44
------------+------------------------------------
      Total |   231.48114   118.86981       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         552           0        552        552

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,300
  CKD stage |         127           0         435
  CKD stage |           5           0          12
   Dialysis |          16           0          73
  Transplan |          68           0         283
  KRT uncle |          12           0          44
------------+------------------------------------
      Total |   212.92268   102.66076       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         521           0        521        521

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,300
  CKD stage |          92           0         435
  CKD stage |           0           0          12
   Dialysis |          12           0          73
  Transplan |          55           0         283
  KRT uncle |           7           0          44
------------+------------------------------------
      Total |   223.22729   127.48401       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         491           0        491        491

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,300
  CKD stage |         115           0         435
  CKD stage |           6           0          12
   Dialysis |          19           0          73
  Transplan |          62           0         283
  KRT uncle |          10           0          44
------------+------------------------------------
      Total |    212.1891   107.66656       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         509           0        509        509

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,300
  CKD stage |         119           0         435
  CKD stage |           5           0          12
   Dialysis |          23           0          73
  Transplan |          72           0         283
  KRT uncle |          15           0          44
------------+------------------------------------
      Total |   252.69679   134.90843       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         594           0        594        594

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,300
  CKD stage |          95           0         435
  CKD stage |           1           0          12
   Dialysis |          32           0          73
  Transplan |          80           0         283
  KRT uncle |           5           0          44
------------+------------------------------------
      Total |   210.82115   108.06273       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         510           0        510        510

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,300
  CKD stage |          59           0         435
  CKD stage |           2           0          12
   Dialysis |          24           0          73
  Transplan |          69           0         283
  KRT uncle |          13           0          44
------------+------------------------------------
      Total |   243.14858   151.36894       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         532           0        532        532

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,300
  CKD stage |         116           0         435
  CKD stage |           3           0          12
   Dialysis |          30           0          73
  Transplan |          83           0         283
  KRT uncle |           8           0          44
------------+------------------------------------
      Total |   253.01677   133.01881       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         599           0        599        599

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,300
  CKD stage |         101           0         435
  CKD stage |           6           0          12
   Dialysis |          17           0          73
  Transplan |          70           0         283
  KRT uncle |           6           0          44
------------+------------------------------------
      Total |   227.81649    123.2066       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         526           0        526        526

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,300
  CKD stage |         145           0         435
  CKD stage |          10           0          12
   Dialysis |           4           0          73
  Transplan |          79           0         283
  KRT uncle |          11           0          44
------------+------------------------------------
      Total |   258.79273   130.49583       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         610           0        610        610

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,300
  CKD stage |         109           0         435
  CKD stage |           8           0          12
   Dialysis |          28           0          73
  Transplan |          74           0         283
  KRT uncle |          11           0          44
------------+------------------------------------
      Total |   203.20494   98.393702       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         511           0        511        511

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,300
  CKD stage |         148           0         435
  CKD stage |           0           0          12
   Dialysis |          24           0          73
  Transplan |          59           0         283
  KRT uncle |          11           0          44
------------+------------------------------------
      Total |   257.38845   132.61622       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,147         603           0        603        603

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,300
  CKD stage |          99           0         435
  CKD stage |           8           0          12
   Dialysis |          10           0          73
  Transplan |          72           0         283
  KRT uncle |           7           0          44
------------+------------------------------------
      Total |   234.12902   128.96033       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         533           0        533        533

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,300
  CKD stage |         116           0         435
  CKD stage |           3           0          12
   Dialysis |          24           0          73
  Transplan |          63           0         283
  KRT uncle |           4           0          44
------------+------------------------------------
      Total |   225.87471   117.78107       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         529           0        529        529

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,300
  CKD stage |          99           0         435
  CKD stage |           2           0          12
   Dialysis |          14           0          73
  Transplan |          67           0         283
  KRT uncle |           4           0          44
------------+------------------------------------
      Total |   234.11644   130.21582       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         524           0        524        524

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         394           0       1,300
  CKD stage |         113           0         435
  CKD stage |           0           0          12
   Dialysis |          27           0          73
  Transplan |         101           0         283
  KRT uncle |          12           0          44
------------+------------------------------------
      Total |   275.93712   147.72646       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         647           0        647        647

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,300
  CKD stage |         109           0         435
  CKD stage |           3           0          12
   Dialysis |          26           0          73
  Transplan |          29           0         283
  KRT uncle |          16           0          44
------------+------------------------------------
      Total |   227.55473   130.81243       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         514           0        514        514

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,300
  CKD stage |         127           0         435
  CKD stage |           0           0          12
   Dialysis |          31           0          73
  Transplan |          78           0         283
  KRT uncle |          11           0          44
------------+------------------------------------
      Total |    226.8123   109.48321       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         560           0        560        560

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,300
  CKD stage |         118           0         435
  CKD stage |           0           0          12
   Dialysis |          16           0          73
  Transplan |          85           0         283
  KRT uncle |          22           0          44
------------+------------------------------------
      Total |    244.3973   125.38478       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         585           0        585        585

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         259           0       1,300
  CKD stage |         114           0         435
  CKD stage |           6           0          12
   Dialysis |          24           0          73
  Transplan |          74           0         283
  KRT uncle |           3           0          44
------------+------------------------------------
      Total |   190.58593    87.59409       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         480           0        480        480

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         278           0       1,300
  CKD stage |         116           0         435
  CKD stage |           5           0          12
   Dialysis |          24           0          73
  Transplan |          62           0         283
  KRT uncle |           7           0          44
------------+------------------------------------
      Total |   200.99022   98.266453       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         492           0        492        492

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,300
  CKD stage |          82           0         435
  CKD stage |           1           0          12
   Dialysis |           6           0          73
  Transplan |         113           0         283
  KRT uncle |          16           0          44
------------+------------------------------------
      Total |   222.77736   116.22737       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         533           0        533        533

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,300
  CKD stage |         106           0         435
  CKD stage |           2           0          12
   Dialysis |          13           0          73
  Transplan |          74           0         283
  KRT uncle |           8           0          44
------------+------------------------------------
      Total |   232.26688   124.11047       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         534           0        534        534

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,300
  CKD stage |          83           0         435
  CKD stage |          14           0          12
   Dialysis |           5           0          73
  Transplan |          59           0         283
  KRT uncle |          13           0          44
------------+------------------------------------
      Total |   237.63717   141.40588       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,147         525           0        525        525

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,300
  CKD stage |         134           0         435
  CKD stage |           3           0          12
   Dialysis |          40           0          73
  Transplan |          87           0         283
  KRT uncle |          20           0          44
------------+------------------------------------
      Total |   220.23614   98.025938       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,147         581           0        581        581

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,300
  CKD stage |         124           0         435
  CKD stage |           6           0          12
   Dialysis |          13           0          73
  Transplan |          74           0         283
  KRT uncle |           4           0          44
------------+------------------------------------
      Total |   249.17513   131.19989       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,147         574           0        574        574

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,300
  CKD stage |          86           0         435
  CKD stage |           0           0          12
   Dialysis |          16           0          73
  Transplan |          45           0         283
  KRT uncle |          14           0          44
------------+------------------------------------
      Total |   210.07406   121.33126       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,147         468           0        468        468

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,300
  CKD stage |          92           0         435
  CKD stage |          -1           0          12
   Dialysis |          16           0          73
  Transplan |         101           0         283
  KRT uncle |           4           0          44
------------+------------------------------------
      Total |    209.3782   104.21789       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,147         504           0        504        504

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,300
  CKD stage |         115           0         435
  CKD stage |           1           0          12
   Dialysis |          14           0          73
  Transplan |          42           0         283
  KRT uncle |           2           0          44
------------+------------------------------------
      Total |   257.63065   150.38049       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,147         551           0        551        551

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,300
  CKD stage |          80           0         435
  CKD stage |           0           0          12
   Dialysis |          22           0          73
  Transplan |          78           0         283
  KRT uncle |          18           0          44
------------+------------------------------------
      Total |   246.79646   143.42051       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,147         560           0        560        560

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,300
  CKD stage |         112           0         435
  CKD stage |           4           0          12
   Dialysis |          22           0          73
  Transplan |          74           0         283
  KRT uncle |           5           0          44
------------+------------------------------------
      Total |   227.07778    117.1548       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,147         537           0        537        537

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,300
  CKD stage |          91           0         435
  CKD stage |           9           0          12
   Dialysis |          21           0          73
  Transplan |          83           0         283
  KRT uncle |           2           0          44
------------+------------------------------------
      Total |   248.76712   140.12243       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,147         567           0        567        567

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,300
  CKD stage |          99           0         435
  CKD stage |           8           0          12
   Dialysis |          23           0          73
  Transplan |          57           0         283
  KRT uncle |           7           0          44
------------+------------------------------------
      Total |   211.40149    113.8968       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         496           0        496        496

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,300
  CKD stage |         142           0         435
  CKD stage |           2           0          12
   Dialysis |          18           0          73
  Transplan |          72           0         283
  KRT uncle |           6           0          44
------------+------------------------------------
      Total |   229.13274   109.47026       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         554           0        554        554

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         398           0       1,300
  CKD stage |          80           0         435
  CKD stage |           7           0          12
   Dialysis |          26           0          73
  Transplan |          79           0         283
  KRT uncle |          25           0          44
------------+------------------------------------
      Total |   269.04471   160.29754       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,147         615           0        615        615

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,300
  CKD stage |          98           0         435
  CKD stage |           0           0          12
   Dialysis |          16           0          73
  Transplan |          77           0         283
  KRT uncle |          20           0          44
------------+------------------------------------
      Total |   240.46064   131.97962       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,147         557           0        557        557

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,300
  CKD stage |         113           0         435
  CKD stage |           0           0          12
   Dialysis |          32           0          73
  Transplan |          97           0         283
  KRT uncle |          10           0          44
------------+------------------------------------
      Total |   236.18165   116.74015       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         581           0        581        581

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,300
  CKD stage |         121           0         435
  CKD stage |           5           0          12
   Dialysis |          18           0          73
  Transplan |          99           0         283
  KRT uncle |          14           0          44
------------+------------------------------------
      Total |   218.32417    100.1143       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         554           0        554        554

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,300
  CKD stage |         113           0         435
  CKD stage |           3           0          12
   Dialysis |          16           0          73
  Transplan |          59           0         283
  KRT uncle |          10           0          44
------------+------------------------------------
      Total |   212.48067   109.75551       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         500           0        500        500

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,300
  CKD stage |         107           0         435
  CKD stage |           0           0          12
   Dialysis |          16           0          73
  Transplan |          72           0         283
  KRT uncle |          12           0          44
------------+------------------------------------
      Total |   220.87424   114.78999       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         519           0        519        519

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,300
  CKD stage |         108           0         435
  CKD stage |           5           0          12
   Dialysis |          13           0          73
  Transplan |          55           0         283
  KRT uncle |           3           0          44
------------+------------------------------------
      Total |   217.97205   117.58754       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         495           0        495        495

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,300
  CKD stage |         147           0         435
  CKD stage |           0           0          12
   Dialysis |          29           0          73
  Transplan |          77           0         283
  KRT uncle |          12           0          44
------------+------------------------------------
      Total |    222.2082   99.756325       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         564           0        564        564

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,300
  CKD stage |         112           0         435
  CKD stage |           4           0          12
   Dialysis |          35           0          73
  Transplan |          64           0         283
  KRT uncle |          16           0          44
------------+------------------------------------
      Total |    227.6381   118.72708       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         553           0        553        553

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,300
  CKD stage |          92           0         435
  CKD stage |           3           0          12
   Dialysis |          28           0          73
  Transplan |          74           0         283
  KRT uncle |          31           0          44
------------+------------------------------------
      Total |    264.9306    153.1652       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         616           0        616        616

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,300
  CKD stage |          79           0         435
  CKD stage |           4           0          12
   Dialysis |          17           0          73
  Transplan |          66           0         283
  KRT uncle |          17           0          44
------------+------------------------------------
      Total |   206.09222   114.70433       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         481           0        481        481

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,300
  CKD stage |         114           0         435
  CKD stage |           0           0          12
   Dialysis |           8           0          73
  Transplan |          58           0         283
  KRT uncle |           6           0          44
------------+------------------------------------
      Total |    200.0708   100.93694       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         465           0        465        465

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,300
  CKD stage |         142           0         435
  CKD stage |           4           0          12
   Dialysis |          30           0          73
  Transplan |          82           0         283
  KRT uncle |          25           0          44
------------+------------------------------------
      Total |   242.76386   115.02138       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         616           0        616        616

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         265           0       1,300
  CKD stage |         110           0         435
  CKD stage |          -1           0          12
   Dialysis |           1           0          73
  Transplan |          93           0         283
  KRT uncle |          19           0          44
------------+------------------------------------
      Total |   195.41966   89.077788       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,147         487           0        487        487

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,300
  CKD stage |          98           0         435
  CKD stage |           2           0          12
   Dialysis |          14           0          73
  Transplan |          91           0         283
  KRT uncle |          16           0          44
------------+------------------------------------
      Total |   220.97485   113.09099       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,147         532           0        532        532

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,300
  CKD stage |         116           0         435
  CKD stage |           0           0          12
   Dialysis |          16           0          73
  Transplan |          84           0         283
  KRT uncle |          15           0          44
------------+------------------------------------
      Total |   237.05636   120.92817       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,147         564           0        564        564

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,300
  CKD stage |         132           0         435
  CKD stage |           2           0          12
   Dialysis |          14           0          73
  Transplan |          81           0         283
  KRT uncle |           6           0          44
------------+------------------------------------
      Total |    268.7252   141.74987       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,147         616           0        616        616

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,300
  CKD stage |          98           0         435
  CKD stage |           3           0          12
   Dialysis |          33           0          73
  Transplan |          79           0         283
  KRT uncle |          12           0          44
------------+------------------------------------
      Total |   213.90778   109.16078       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,147         526           0        526        526

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,300
  CKD stage |         125           0         435
  CKD stage |          10           0          12
   Dialysis |          10           0          73
  Transplan |          46           0         283
  KRT uncle |          23           0          44
------------+------------------------------------
      Total |   249.62972   138.52923       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,147         573           0        573        573

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,300
  CKD stage |         106           0         435
  CKD stage |           0           0          12
   Dialysis |           5           0          73
  Transplan |          84           0         283
  KRT uncle |          20           0          44
------------+------------------------------------
      Total |   226.28179   116.76645       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,147         534           0        534        534

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,300
  CKD stage |          93           0         435
  CKD stage |          10           0          12
   Dialysis |          16           0          73
  Transplan |          83           0         283
  KRT uncle |           4           0          44
------------+------------------------------------
      Total |   248.44341   139.38153       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,147         566           0        566        566

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,300
  CKD stage |         110           0         435
  CKD stage |           3           0          12
   Dialysis |          21           0          73
  Transplan |          79           0         283
  KRT uncle |          17           0          44
------------+------------------------------------
      Total |   210.58407   102.86621       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,147         522           0        522        522

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,300
  CKD stage |         156           0         435
  CKD stage |           0           0          12
   Dialysis |          13           0          73
  Transplan |         113           0         283
  KRT uncle |          11           0          44
------------+------------------------------------
      Total |   248.79925   108.94639       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         626           0        626        626

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,300
  CKD stage |         109           0         435
  CKD stage |           4           0          12
   Dialysis |          17           0          73
  Transplan |          97           0         283
  KRT uncle |           8           0          44
------------+------------------------------------
      Total |   223.94364   109.89853       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         546           0        546        546

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,300
  CKD stage |          86           0         435
  CKD stage |           0           0          12
   Dialysis |          16           0          73
  Transplan |          79           0         283
  KRT uncle |           7           0          44
------------+------------------------------------
      Total |   197.45831   102.36381       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,147         467           0        467        467

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,300
  CKD stage |         128           0         435
  CKD stage |           0           0          12
   Dialysis |          28           0          73
  Transplan |          73           0         283
  KRT uncle |          21           0          44
------------+------------------------------------
      Total |    254.3116   132.01636       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,147         609           0        609        609

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,300
  CKD stage |         132           0         435
  CKD stage |           3           0          12
   Dialysis |          11           0          73
  Transplan |          83           0         283
  KRT uncle |           8           0          44
------------+------------------------------------
      Total |   232.60363   112.85466       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,147         558           0        558        558

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,300
  CKD stage |         119           0         435
  CKD stage |           0           0          12
   Dialysis |          17           0          73
  Transplan |          84           0         283
  KRT uncle |           8           0          44
------------+------------------------------------
      Total |    226.0503   111.43101       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,147         542           0        542        542

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,300
  CKD stage |         130           0         435
  CKD stage |          -1           0          12
   Dialysis |           8           0          73
  Transplan |          62           0         283
  KRT uncle |          21           0          44
------------+------------------------------------
      Total |   220.48999   109.67215       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,147         526           0        526        526

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,300
  CKD stage |          78           0         435
  CKD stage |           0           0          12
   Dialysis |          33           0          73
  Transplan |          62           0         283
  KRT uncle |          10           0          44
------------+------------------------------------
      Total |   214.21751   121.80971       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,147         495           0        495        495

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,300
  CKD stage |         103           0         435
  CKD stage |           3           0          12
   Dialysis |          13           0          73
  Transplan |          98           0         283
  KRT uncle |           6           0          44
------------+------------------------------------
      Total |   223.88822    112.3464       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,147         536           0        536        536

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,300
  CKD stage |         104           0         435
  CKD stage |           5           0          12
   Dialysis |          15           0          73
  Transplan |          71           0         283
  KRT uncle |           7           0          44
------------+------------------------------------
      Total |   214.57662     111.433       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         505           0        505        505

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,300
  CKD stage |         104           0         435
  CKD stage |           0           0          12
   Dialysis |          23           0          73
  Transplan |          72           0         283
  KRT uncle |          13           0          44
------------+------------------------------------
      Total |   212.65347   108.68362       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         511           0        511        511

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,300
  CKD stage |         124           0         435
  CKD stage |           5           0          12
   Dialysis |          25           0          73
  Transplan |          81           0         283
  KRT uncle |          15           0          44
------------+------------------------------------
      Total |   208.94644   95.857597       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         534           0        534        534

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,300
  CKD stage |         108           0         435
  CKD stage |           0           0          12
   Dialysis |          19           0          73
  Transplan |          56           0         283
  KRT uncle |          19           0          44
------------+------------------------------------
      Total |   245.85515   138.19749       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,147         558           0        558        558

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,300
  CKD stage |         104           0         435
  CKD stage |           0           0          12
   Dialysis |          24           0          73
  Transplan |          64           0         283
  KRT uncle |           9           0          44
------------+------------------------------------
      Total |   232.13787    126.5499       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,147         534           0        534        534

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,300
  CKD stage |          61           0         435
  CKD stage |           8           0          12
   Dialysis |          39           0          73
  Transplan |          45           0         283
  KRT uncle |           1           0          44
------------+------------------------------------
      Total |         231   146.53308       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,147         503           0        503        503

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(75 real changes made)

. replace ethnicity=2 if ethnicity==3
(79 real changes made)

. replace ethnicity=3 if ethnicity==4
(69 real changes made)

. replace ethnicity=4 if ethnicity==6
(75 real changes made)

. replace ethnicity=6 if ethnicity==.
(546 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,930 missing values generated)

. replace region = 2 if region_string=="East"
(235 real changes made)

. replace region = 3 if region_string=="London"
(460 real changes made)

. replace region = 4 if region_string=="North East"
(226 real changes made)

. replace region = 5 if region_string=="North West"
(191 real changes made)

. replace region = 6 if region_string=="South East"
(210 real changes made)

. replace region = 7 if region_string=="South West"
(194 real changes made)

. replace region = 8 if region_string=="West Midlands"
(222 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(192 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,147 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(869 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,278 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2020_ckd_complete.dta not found)
file ./output/2020_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,643
        from master                       498  (_merge==1)
        from using                      2,145  (_merge==2)

    matched                                 2  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(498 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
      Percentiles      Smallest
 1%      .393766        .393766
 5%      .393766              .
10%      .393766              .       Obs                   1
25%      .393766              .       Sum of Wgt.           1

50%      .393766                      Mean            .393766
                        Largest       Std. Dev.             .
75%      .393766              .
90%      .393766              .       Variance              .
95%      .393766              .       Skewness              .
99%      .393766        .393766       Kurtosis              .

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,300
  CKD stage |           0           0         435
  CKD stage |           0           0          12
   Dialysis |           0           0          73
  Transplan |   .39376605           0         283
  KRT uncle |           0           0          44
------------+------------------------------------
      Total |   .05190302    .1332366       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,147     .393766           0    .393766    .393766

                           ec_cost
-------------------------------------------------------------
      Percentiles      Smallest
 1%     41.01869       41.01869
 5%     41.01869       99.25186
10%     41.01869              .       Obs                   2
25%     41.01869              .       Sum of Wgt.           2

50%     70.13528                      Mean           70.13528
                        Largest       Std. Dev.      41.17707
75%     99.25186              .
90%     99.25186              .       Variance       1695.551
95%     99.25186       41.01869       Skewness              0
99%     99.25186       99.25186       Kurtosis              1

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |   41.018692           0       1,300
  CKD stage |           0           0         435
  CKD stage |           0           0          12
   Dialysis |           0           0          73
  Transplan |   99.251862           0         283
  KRT uncle |           0           0          44
------------+------------------------------------
      Total |   37.919225   29.661063       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,147    140.2706           0   140.2706   140.2706

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,300
  CKD stage |           0           0         435
  CKD stage |           0           0          12
   Dialysis |           0           0          73
  Transplan |           0           0         283
  KRT uncle |           0           0          44
------------+------------------------------------
      Total |           0           0       2,147

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,147           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2020_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 closed on:  12 Sep 2023, 14:36:47
-------------------------------------------------------------------------------
