-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_01_ukrr_v3.log
  log type:  text
 opened on:  25 Apr 2023, 09:42:21

. clear

. 
. use ./output/`dataset'_ckd_complete_v3.dta, clear

. 
. tab ukrr

       ukrr |      Freq.     Percent        Cum.
------------+-----------------------------------
       ICHD |         44       47.83       47.83
         Tx |         48       52.17      100.00
------------+-----------------------------------
      Total |         92      100.00

. rename ukrr ukrr_string

. gen ukrr = 0

. replace ukrr = 1 if ukrr_string=="HD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="HHD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="ICHD"
(44 real changes made)

. replace ukrr = 1 if ukrr_string=="PD"
(0 real changes made)

. replace ukrr = 2 if ukrr_string=="Tx"
(48 real changes made)

. drop ukrr_string

. 
. tab ckd_group ukrr, m

                     |               ukrr
           CKD group |         0          1          2 |     Total
---------------------+---------------------------------+----------
         Albuminuria |     1,289         27         27 |     1,343 
         CKD stage 3 |       362          5         13 |       380 
       CKD stage 4/5 |        23          0          1 |        24 
            Dialysis |        75          3          1 |        79 
          Transplant |       309          8          5 |       322 
KRT unclear modality |        44          1          1 |        46 
---------------------+---------------------------------+----------
               Total |     2,102         44         48 |     2,194 

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_01_ukrr_v3.log
  log type:  text
 closed on:  25 Apr 2023, 09:42:21
-------------------------------------------------------------------------------
