-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 opened on:  16 Dec 2022, 19:43:19

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,578 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,987 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,742 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,373       10.01       10.01
           East Midlands |      3,311        9.83       19.84
                  London |      6,686       19.84       39.68
              North East |      3,340        9.91       49.59
              North West |      3,337        9.90       59.50
              South East |      3,339        9.91       69.41
              South West |      3,471       10.30       79.71
           West Midlands |      3,384       10.04       89.75
Yorkshire and The Humber |      3,452       10.25      100.00
-------------------------+-----------------------------------
                   Total |     33,693      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,791        5.32        5.32
          1 |      6,277       18.63       23.95
          2 |      6,394       18.98       42.92
          3 |      6,358       18.87       61.79
          4 |      6,515       19.34       81.13
          5 |      6,358       18.87      100.00
------------+-----------------------------------
      Total |     33,693      100.00

. drop if imd==0
(1,791 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,923 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(819 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(771 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,988 real changes made, 13,988 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,988 missing values generated)

. gen min_baseline_creatinine=.
(31,902 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,151 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,763 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,151 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,763 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,376 real changes made)

. gen max_baseline_creatinine=.
(31,902 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,151 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,763 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,914 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,526 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,988 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,914 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,151 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,666 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,902
25%            0              0       Sum of Wgt.      31,902

50%            0                      Mean           12.47505
                        Largest       Std. Dev.      12.97856
75%     24.95412       42.78904
90%      29.2177       43.04095       Variance        168.443
95%     31.37629       43.16259       Skewness       .2139788
99%     35.10802        43.8392       Kurtosis       1.297995

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,567        5.47        5.47
         <= |      1,611        5.63       11.10
          = |     20,712       72.35       83.45
          > |      1,600        5.59       89.04
         >= |      1,530        5.34       94.39
          ~ |      1,607        5.61      100.00
------------+-----------------------------------
      Total |     28,627      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,569       55.07       55.07
          1 |     14,333       44.93      100.00
------------+-----------------------------------
      Total |     31,902      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,903       46.71       46.71
          1 |     16,999       53.29      100.00
------------+-----------------------------------
      Total |     31,902      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,271       94.89       94.89
          1 |      1,631        5.11      100.00
------------+-----------------------------------
      Total |     31,902      100.00
(759 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,336       95.09       95.09
          1 |      1,566        4.91      100.00
------------+-----------------------------------
      Total |     31,902      100.00
(701 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,310       95.01       95.01
          1 |      1,592        4.99      100.00
------------+-----------------------------------
      Total |     31,902      100.00
(647 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,320       95.04       95.04
          1 |      1,582        4.96      100.00
------------+-----------------------------------
      Total |     31,902      100.00
(626 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,284       94.93       94.93
          1 |      1,618        5.07      100.00
------------+-----------------------------------
      Total |     31,902      100.00
(591 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,318       95.03       95.03
          1 |      1,584        4.97      100.00
------------+-----------------------------------
      Total |     31,902      100.00
(554 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,025       34.56       34.56
          1 |     20,877       65.44      100.00
------------+-----------------------------------
      Total |     31,902      100.00

. drop if ckd==0
(11,025 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2020_ckd.csv not found)
file ./output/2020_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 closed on:  16 Dec 2022, 19:43:21
-------------------------------------------------------------------------------
