-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 opened on:   4 Jan 2023, 23:04:35

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,562 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,972 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,718 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,298        9.77        9.77
           East Midlands |      3,283        9.73       19.50
                  London |      6,702       19.86       39.36
              North East |      3,340        9.90       49.26
              North West |      3,466       10.27       59.53
              South East |      3,435       10.18       69.70
              South West |      3,440       10.19       79.90
           West Midlands |      3,403       10.08       89.98
Yorkshire and The Humber |      3,381       10.02      100.00
-------------------------+-----------------------------------
                   Total |     33,748      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,716        5.08        5.08
          1 |      6,360       18.85       23.93
          2 |      6,436       19.07       43.00
          3 |      6,372       18.88       61.88
          4 |      6,351       18.82       80.70
          5 |      6,513       19.30      100.00
------------+-----------------------------------
      Total |     33,748      100.00

. drop if imd==0
(1,716 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,008 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(768 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(748 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,991 real changes made, 13,991 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,991 missing values generated)

. gen min_baseline_creatinine=.
(32,032 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,071 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,970 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,071 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,970 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,515 real changes made)

. gen max_baseline_creatinine=.
(32,032 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,071 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,970 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,041 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,517 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,991 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,041 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,071 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,738 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,032
25%            0              0       Sum of Wgt.      32,032

50%            0                      Mean           12.49083
                        Largest       Std. Dev.      12.97929
75%     25.00219       42.56133
90%     29.10738       43.09135       Variance       168.4621
95%     31.28245       44.53504       Skewness       .2115899
99%     35.32006        45.0503       Kurtosis       1.297692

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,581        5.47        5.47
         <= |      1,597        5.52       10.99
          = |     20,988       72.58       83.57
          > |      1,601        5.54       89.10
         >= |      1,641        5.67       94.78
          ~ |      1,510        5.22      100.00
------------+-----------------------------------
      Total |     28,918      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,540       54.76       54.76
          1 |     14,492       45.24      100.00
------------+-----------------------------------
      Total |     32,032      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,802       46.21       46.21
          1 |     17,230       53.79      100.00
------------+-----------------------------------
      Total |     32,032      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,415       94.95       94.95
          1 |      1,617        5.05      100.00
------------+-----------------------------------
      Total |     32,032      100.00
(735 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,412       94.94       94.94
          1 |      1,620        5.06      100.00
------------+-----------------------------------
      Total |     32,032      100.00
(702 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,465       95.11       95.11
          1 |      1,567        4.89      100.00
------------+-----------------------------------
      Total |     32,032      100.00
(644 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,421       94.97       94.97
          1 |      1,611        5.03      100.00
------------+-----------------------------------
      Total |     32,032      100.00
(665 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,418       94.96       94.96
          1 |      1,614        5.04      100.00
------------+-----------------------------------
      Total |     32,032      100.00
(585 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,475       95.14       95.14
          1 |      1,557        4.86      100.00
------------+-----------------------------------
      Total |     32,032      100.00
(555 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,916       34.08       34.08
          1 |     21,116       65.92      100.00
------------+-----------------------------------
      Total |     32,032      100.00

. drop if ckd==0
(10,916 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2020_ckd.csv not found)
file ./output/2020_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 closed on:   4 Jan 2023, 23:04:37
-------------------------------------------------------------------------------
