-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 opened on:  21 Apr 2023, 14:33:31

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(19 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,632 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,989 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,763 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,228        9.60        9.60
           East Midlands |      3,427       10.19       19.80
                  London |      6,810       20.26       40.06
              North East |      3,351        9.97       50.02
              North West |      3,377       10.05       60.07
              South East |      3,309        9.84       69.91
              South West |      3,388       10.08       79.99
           West Midlands |      3,445       10.25       90.24
Yorkshire and The Humber |      3,281        9.76      100.00
-------------------------+-----------------------------------
                   Total |     33,616      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,661        4.94        4.94
          1 |      6,330       18.83       23.77
          2 |      6,456       19.21       42.98
          3 |      6,352       18.90       61.87
          4 |      6,390       19.01       80.88
          5 |      6,427       19.12      100.00
------------+-----------------------------------
      Total |     33,616      100.00

. drop if imd==0
(1,661 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,933 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(773 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(748 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,091 real changes made, 14,091 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,091 missing values generated)

. gen min_baseline_creatinine=.
(31,955 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,143 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,721 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,143 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,721 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,270 real changes made)

. gen max_baseline_creatinine=.
(31,955 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,143 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,721 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,864 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,685 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,091 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,864 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,143 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,583 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,955
25%            0              0       Sum of Wgt.      31,955

50%            0                      Mean            12.4674
                        Largest       Std. Dev.      12.99883
75%     24.94492        41.7676
90%     29.20821       41.89009       Variance       168.9696
95%     31.51686       41.97201       Skewness       .2212531
99%     35.32409       44.47299       Kurtosis       1.305517

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,596        5.54        5.54
         <= |      1,557        5.40       10.94
          = |     20,935       72.61       83.55
          > |      1,598        5.54       89.09
         >= |      1,620        5.62       94.71
          ~ |      1,526        5.29      100.00
------------+-----------------------------------
      Total |     28,832      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,543       54.90       54.90
   Albuminuria |     14,412       45.10      100.00
---------------+-----------------------------------
         Total |     31,955      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,960       46.82       46.82
          1 |     16,995       53.18      100.00
------------+-----------------------------------
      Total |     31,955      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14091 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17864 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,091 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,359       95.01       95.01
          1 |      1,596        4.99      100.00
------------+-----------------------------------
      Total |     31,955      100.00
(1,596 real changes made)
(741 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,359       95.01       95.01
          1 |      1,596        4.99      100.00
------------+-----------------------------------
      Total |     31,955      100.00
(1,526 real changes made)
(725 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,357       95.00       95.00
          1 |      1,598        5.00      100.00
------------+-----------------------------------
      Total |     31,955      100.00
(1,428 real changes made)
(681 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,351       94.98       94.98
          1 |      1,604        5.02      100.00
------------+-----------------------------------
      Total |     31,955      100.00
(1,380 real changes made)
(678 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,376       95.06       95.06
          1 |      1,579        4.94      100.00
------------+-----------------------------------
      Total |     31,955      100.00
(1,273 real changes made)
(625 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,373       95.05       95.05
          1 |      1,582        4.95      100.00
------------+-----------------------------------
      Total |     31,955      100.00
(1,248 real changes made)
(580 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,649      4,681 |    10,330 
 eGFR >=60 |     5,281      4,338 |     9,619 
  eGFR <60 |     1,890      1,665 |     3,555 
       KRT |     4,723      3,728 |     8,451 
-----------+----------------------+----------
     Total |    17,543     14,412 |    31,955 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,930       34.20       34.20
          1 |     21,025       65.80      100.00
------------+-----------------------------------
      Total |     31,955      100.00

. drop if ckd==0
(10,930 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,681 |     4,681 
 eGFR >=60 |         0      4,338 |     4,338 
  eGFR <60 |     1,890      1,665 |     3,555 
       KRT |     4,723      3,728 |     8,451 
-----------+----------------------+----------
     Total |     6,613     14,412 |    21,025 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2020_ckd.csv not found)
file ./output/2020_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 closed on:  21 Apr 2023, 14:33:36
-------------------------------------------------------------------------------
