-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 opened on:  20 Sep 2023, 14:24:13

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,025 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(236 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,775
        from master                    47,875  (_merge==1)
        from using                     18,900  (_merge==2)

    matched                             2,125  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,775 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        169        7.95        7.95
Kidney transplant |        169        7.95       15.91
 Modality unclear |         46        2.16       18.07
          Pre KRT |      1,741       81.93      100.00
------------------+-----------------------------------
            Total |      2,125      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(873 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1252 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,252       58.92       58.92
          . |        873       41.08      100.00
------------+-----------------------------------
      Total |      2,125      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(169 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(24 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(115 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(307 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(19 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(46 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(8 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |        91         78 |       169 
Kidney transplant |       169          0 |       169 
 Modality unclear |        46          0 |        46 
          Pre KRT |     1,741          0 |     1,741 
------------------+----------------------+----------
            Total |     2,047         78 |     2,125 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       157         12 |       169 
Kidney transplant |       140         29 |       169 
 Modality unclear |        38          8 |        46 
          Pre KRT |     1,502        239 |     1,741 
------------------+----------------------+----------
            Total |     1,837        288 |     2,125 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       169          0 |       169 
Kidney transplant |       169          0 |       169 
 Modality unclear |         8         38 |        46 
          Pre KRT |     1,741          0 |     1,741 
------------------+----------------------+----------
            Total |     2,087         38 |     2,125 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,759        288 |     2,047 
         1 |        78          0 |        78 
-----------+----------------------+----------
     Total |     1,837        288 |     2,125 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(873 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1252 changes made)

. replace ckd_group = 4 if dialysis==1
(78 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(288 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(38 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(671 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,337       62.92       62.92
         CKD stage 3 |        366       17.22       80.14
       CKD stage 4/5 |         18        0.85       80.99
            Dialysis |         78        3.67       84.66
          Transplant |        288       13.55       98.21
KRT unclear modality |         38        1.79      100.00
---------------------+-----------------------------------
               Total |      2,125      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        48        116          0      1,173 |     1,337 
         CKD stage 3 |        30         23          0        313 |       366 
       CKD stage 4/5 |         1          1          0         16 |        18 
            Dialysis |        78          0          0          0 |        78 
          Transplant |        12         29          8        239 |       288 
KRT unclear modality |         0          0         38          0 |        38 
---------------------+--------------------------------------------+----------
               Total |       169        169         46      1,741 |     2,125 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       134         75         49         12 |     1,337 
         CKD stage 3 |        38         18         14          4 |       366 
       CKD stage 4/5 |         2          0          2          0 |        18 
            Dialysis |         6          7          3          1 |        78 
          Transplant |        32         11         11          7 |       288 
KRT unclear modality |         3          3          2          0 |        38 
---------------------+--------------------------------------------+----------
               Total |       215        114         81         24 |     2,125 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,067 |     1,337 
         CKD stage 3 |       292 |       366 
       CKD stage 4/5 |        14 |        18 
            Dialysis |        61 |        78 
          Transplant |       227 |       288 
KRT unclear modality |        30 |        38 
---------------------+-----------+----------
               Total |     1,691 |     2,125 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,140 missing values generated)

. replace sex = 0 if male == "Female"
(1,140 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(945 real changes made, 945 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(945 missing values generated)

. gen min_creatinine_outcome=.
(2,125 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(636 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(544 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(636 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(544 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(761 real changes made)

. gen max_creatinine_outcome=.
(2,125 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(636 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(544 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,180 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,364 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(945 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,180 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(636 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(945 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1180 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(189 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(7 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(8 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(945 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1180 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,180       55.53       55.53
          . |        945       44.47      100.00
------------+-----------------------------------
      Total |      2,125      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(114 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(81 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(13 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(24 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(114 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(94 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(215 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,525       71.76       71.76
               CKD 3 |        153        7.20       78.96
     CKD 4/5 pre-KRT |         13        0.61       79.58
            Dialysis |        114        5.36       84.94
   Kidney transplant |         94        4.42       89.36
KRT unclear modality |         11        0.52       89.88
            Deceased |        215       10.12      100.00
---------------------+-----------------------------------
               Total |      2,125      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(873 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1252 changes made)

. replace access_egfr=0 if ckd_group==4
(78 real changes made)

. replace access_egfr=3 if access_egfr==.
(795 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         455           0       1,337
  CKD stage |         116           0         366
  CKD stage |           2           0          18
   Dialysis |          15           0          78
  Transplan |          70           0         288
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   316.39859   182.08027       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,125         663           0        663        663

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,337
  CKD stage |         110           0         366
  CKD stage |          11           0          18
   Dialysis |          32           0          78
  Transplan |          64           0         288
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   231.48235   119.73298       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,125         539           0        539        539

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         412           0       1,337
  CKD stage |          50           0         366
  CKD stage |          13           0          18
   Dialysis |          20           0          78
  Transplan |          76           0         288
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   279.10212   173.62466       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,125         578           0        578        578

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,337
  CKD stage |          80           0         366
  CKD stage |           0           0          18
   Dialysis |           8           0          78
  Transplan |          60           0         288
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |     255.736   151.00832       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,125         525           0        525        525

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         275           0       1,337
  CKD stage |          83           0         366
  CKD stage |           7           0          18
   Dialysis |          19           0          78
  Transplan |          74           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   198.31953   100.99784       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,125         470           0        470        470

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,337
  CKD stage |          84           0         366
  CKD stage |           4           0          18
   Dialysis |          24           0          78
  Transplan |          76           0         288
  KRT uncle |          22           0          38
------------+------------------------------------
      Total |   231.18776   124.31368       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,125         536           0        536        536

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,337
  CKD stage |          74           0         366
  CKD stage |           0           0          18
   Dialysis |          25           0          78
  Transplan |          44           0         288
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   227.54071   134.10471       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,125         489           0        489        489

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,337
  CKD stage |          71           0         366
  CKD stage |           4           0          18
   Dialysis |          28           0          78
  Transplan |          58           0         288
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   231.38541    134.2058       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,125         500           0        500        500

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,337
  CKD stage |          78           0         366
  CKD stage |          10           0          18
   Dialysis |          25           0          78
  Transplan |          73           0         288
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   232.67718   128.82817       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,125         522           0        522        522

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,337
  CKD stage |          76           0         366
  CKD stage |           2           0          18
   Dialysis |          22           0          78
  Transplan |          90           0         288
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   208.23012   106.34841       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,125         495           0        495        495

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,337
  CKD stage |          82           0         366
  CKD stage |           7           0          18
   Dialysis |          12           0          78
  Transplan |          30           0         288
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   213.35482   125.90024       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,125         454           0        454        454

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         444           0       1,337
  CKD stage |          96           0         366
  CKD stage |           0           0          18
   Dialysis |          16           0          78
  Transplan |          76           0         288
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   307.00894   179.37821       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,125         645           0        645        645

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,337
  CKD stage |          83           0         366
  CKD stage |           0           0          18
   Dialysis |          15           0          78
  Transplan |          82           0         288
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   240.75906     131.583       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,125         535           0        535        535

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,337
  CKD stage |          83           0         366
  CKD stage |           3           0          18
   Dialysis |           8           0          78
  Transplan |         105           0         288
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   254.91624   137.11595       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,125         569           0        569        569

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,337
  CKD stage |         117           0         366
  CKD stage |           9           0          18
   Dialysis |          15           0          78
  Transplan |          89           0         288
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   259.57647   132.71337       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,125         603           0        603        603

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,337
  CKD stage |          79           0         366
  CKD stage |           2           0          18
   Dialysis |          16           0          78
  Transplan |          86           0         288
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   245.64565   135.61004       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,125         543           0        543        543

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,337
  CKD stage |         141           0         366
  CKD stage |           8           0          18
   Dialysis |          19           0          78
  Transplan |          86           0         288
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   247.65882   117.14547       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,125         599           0        599        599

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,337
  CKD stage |          86           0         366
  CKD stage |           1           0          18
   Dialysis |          17           0          78
  Transplan |          93           0         288
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   256.67247   139.62111       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,125         573           0        573        573

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,337
  CKD stage |          86           0         366
  CKD stage |           0           0          18
   Dialysis |          20           0          78
  Transplan |          64           0         288
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   258.41694   148.80816       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,125         550           0        550        550

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,337
  CKD stage |          96           0         366
  CKD stage |           5           0          18
   Dialysis |          14           0          78
  Transplan |          77           0         288
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   262.29882   145.41217       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,125         570           0        570        570

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,337
  CKD stage |          91           0         366
  CKD stage |           8           0          18
   Dialysis |          11           0          78
  Transplan |          63           0         288
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   219.90682   118.66947       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,125         493           0        493        493

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,337
  CKD stage |         101           0         366
  CKD stage |           6           0          18
   Dialysis |          13           0          78
  Transplan |          75           0         288
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   259.87576   142.15847       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,125         577           0        577        577

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,337
  CKD stage |         123           0         366
  CKD stage |          10           0          18
   Dialysis |          33           0          78
  Transplan |          74           0         288
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   210.08094   96.409921       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,125         530           0        530        530

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,337
  CKD stage |         108           0         366
  CKD stage |           4           0          18
   Dialysis |          31           0          78
  Transplan |          69           0         288
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   262.69224   142.45554       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,125         591           0        591        591

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         272           0       1,337
  CKD stage |          97           0         366
  CKD stage |           0           0          18
   Dialysis |           6           0          78
  Transplan |          36           0         288
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   193.01365   105.34592       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,125         415           0        415        415

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,337
  CKD stage |         123           0         366
  CKD stage |          10           0          18
   Dialysis |          24           0          78
  Transplan |          60           0         288
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   256.31765   136.07337       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         585           0        585        585

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,337
  CKD stage |         104           0         366
  CKD stage |          10           0          18
   Dialysis |          17           0          78
  Transplan |          64           0         288
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   231.83106   123.07678       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         523           0        523        523

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         399           0       1,337
  CKD stage |          85           0         366
  CKD stage |           4           0          18
   Dialysis |           7           0          78
  Transplan |          87           0         288
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   278.04941   158.56423       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         598           0        598        598

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,337
  CKD stage |          84           0         366
  CKD stage |           6           0          18
   Dialysis |          19           0          78
  Transplan |          61           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   246.42635   140.94328       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         536           0        536        536

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         396           0       1,337
  CKD stage |          78           0         366
  CKD stage |           2           0          18
   Dialysis |          34           0          78
  Transplan |          74           0         288
  KRT uncle |          20           0          38
------------+------------------------------------
      Total |      274.24    159.0878       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,125         604           0        604        604

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,337
  CKD stage |          83           0         366
  CKD stage |           0           0          18
   Dialysis |          27           0          78
  Transplan |          94           0         288
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   234.48565   122.98046       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,125         537           0        537        537

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,337
  CKD stage |          80           0         366
  CKD stage |           9           0          18
   Dialysis |          23           0          78
  Transplan |          96           0         288
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   239.86776   127.66516       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,125         552           0        552        552

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,337
  CKD stage |         117           0         366
  CKD stage |          11           0          18
   Dialysis |          21           0          78
  Transplan |          61           0         288
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   243.22071   128.31017       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,125         551           0        551        551

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,337
  CKD stage |         103           0         366
  CKD stage |           1           0          18
   Dialysis |          39           0          78
  Transplan |          71           0         288
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   241.75059   126.54916       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,125         568           0        568        568

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,337
  CKD stage |          97           0         366
  CKD stage |           1           0          18
   Dialysis |          14           0          78
  Transplan |          58           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   239.85365    133.1394       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,125         523           0        523        523

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,337
  CKD stage |         102           0         366
  CKD stage |           5           0          18
   Dialysis |          42           0          78
  Transplan |          96           0         288
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   231.71906   112.44609       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,125         568           0        568        568

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,337
  CKD stage |         126           0         366
  CKD stage |           3           0          18
   Dialysis |          29           0          78
  Transplan |          77           0         288
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   253.61788   127.79072       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,125         595           0        595        595

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,337
  CKD stage |          75           0         366
  CKD stage |          13           0          18
   Dialysis |          23           0          78
  Transplan |          43           0         288
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   259.48753   158.90419       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         539           0        539        539

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,337
  CKD stage |          83           0         366
  CKD stage |           8           0          18
   Dialysis |          24           0          78
  Transplan |          34           0         288
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   252.95153   153.39788       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         536           0        536        536

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,337
  CKD stage |          99           0         366
  CKD stage |           9           0          18
   Dialysis |          11           0          78
  Transplan |          50           0         288
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   223.12753   122.80178       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         485           0        485        485

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,337
  CKD stage |          93           0         366
  CKD stage |          10           0          18
   Dialysis |          34           0          78
  Transplan |          85           0         288
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   251.63482   134.33726       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         578           0        578        578

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,337
  CKD stage |          93           0         366
  CKD stage |           7           0          18
   Dialysis |          34           0          78
  Transplan |          95           0         288
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   238.61882   121.48381       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,125         569           0        569        569

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,337
  CKD stage |          65           0         366
  CKD stage |           0           0          18
   Dialysis |          27           0          78
  Transplan |          61           0         288
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   232.55765   136.52728       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,125         494           0        494        494

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,337
  CKD stage |         124           0         366
  CKD stage |           0           0          18
   Dialysis |          13           0          78
  Transplan |          55           0         288
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   214.37365   107.22855       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,125         492           0        492        492

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,337
  CKD stage |         124           0         366
  CKD stage |           6           0          18
   Dialysis |          17           0          78
  Transplan |          78           0         288
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   239.62024   119.06001       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,125         555           0        555        555

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         397           0       1,337
  CKD stage |         116           0         366
  CKD stage |           5           0          18
   Dialysis |          30           0          78
  Transplan |          73           0         288
  KRT uncle |          -1           0          38
------------+------------------------------------
      Total |   280.78165   153.00215       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,125         620           0        620        620

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,337
  CKD stage |          93           0         366
  CKD stage |           3           0          18
   Dialysis |          23           0          78
  Transplan |          85           0         288
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   232.56471   120.25979       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,125         545           0        545        545

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,337
  CKD stage |         100           0         366
  CKD stage |           2           0          18
   Dialysis |          20           0          78
  Transplan |          50           0         288
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   212.38871   113.34685       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,125         478           0        478        478

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,337
  CKD stage |         105           0         366
  CKD stage |          14           0          18
   Dialysis |          17           0          78
  Transplan |          54           0         288
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   268.57553   153.12227       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,125         586           0        586        586

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,337
  CKD stage |         102           0         366
  CKD stage |           2           0          18
   Dialysis |          23           0          78
  Transplan |          65           0         288
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   234.36282   124.77564       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,125         528           0        528        528

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,337
  CKD stage |          99           0         366
  CKD stage |           3           0          18
   Dialysis |          20           0          78
  Transplan |          80           0         288
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   249.69082   133.23065       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,125         564           0        564        564

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,337
  CKD stage |          79           0         366
  CKD stage |           4           0          18
   Dialysis |          33           0          78
  Transplan |          73           0         288
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   250.04424   141.28862       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,125         550           0        550        550

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         430           0       1,337
  CKD stage |         103           0         366
  CKD stage |           4           0          18
   Dialysis |           7           0          78
  Transplan |          70           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   298.27859   172.84247       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         626           0        626        626

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,337
  CKD stage |          76           0         366
  CKD stage |           0           0          18
   Dialysis |          14           0          78
  Transplan |          79           0         288
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   243.28188   137.35528       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,125         518           0        518        518

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,337
  CKD stage |          72           0         366
  CKD stage |           1           0          18
   Dialysis |          15           0          78
  Transplan |          92           0         288
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   238.98776   131.34243       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,125         534           0        534        534

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,337
  CKD stage |          76           0         366
  CKD stage |           4           0          18
   Dialysis |           9           0          78
  Transplan |          64           0         288
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   266.35576   159.18224       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,125         547           0        547        547

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         444           0       1,337
  CKD stage |          80           0         366
  CKD stage |           7           0          18
   Dialysis |          29           0          78
  Transplan |          65           0         288
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   303.35247   183.67708       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,125         641           0        641        641

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,337
  CKD stage |          98           0         366
  CKD stage |           0           0          18
   Dialysis |           9           0          78
  Transplan |          84           0         288
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   229.49788   118.23074       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,125         521           0        521        521

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,337
  CKD stage |          88           0         366
  CKD stage |           2           0          18
   Dialysis |          11           0          78
  Transplan |          70           0         288
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   237.20424    131.1495       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,125         514           0        514        514

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,337
  CKD stage |          89           0         366
  CKD stage |          10           0          18
   Dialysis |          17           0          78
  Transplan |          67           0         288
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   232.26024   127.08556       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,125         520           0        520        520

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,337
  CKD stage |          91           0         366
  CKD stage |           3           0          18
   Dialysis |          16           0          78
  Transplan |          75           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   244.36047   133.48977       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,125         543           0        543        543

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,337
  CKD stage |         117           0         366
  CKD stage |           0           0          18
   Dialysis |          28           0          78
  Transplan |          67           0         288
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   245.54541   127.67796       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         560           0        560        560

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,337
  CKD stage |         109           0         366
  CKD stage |           0           0          18
   Dialysis |          12           0          78
  Transplan |          63           0         288
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   214.16753   108.88109       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         490           0        490        490

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,337
  CKD stage |         111           0         366
  CKD stage |          10           0          18
   Dialysis |          27           0          78
  Transplan |          66           0         288
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   253.91576   135.88568       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         580           0        580        580

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,337
  CKD stage |         119           0         366
  CKD stage |          12           0          18
   Dialysis |          39           0          78
  Transplan |         104           0         288
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   246.98776   116.51252       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         614           0        614        614

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,337
  CKD stage |         111           0         366
  CKD stage |          13           0          18
   Dialysis |          13           0          78
  Transplan |          79           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   263.42212   140.46527       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,125         598           0        598        598

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,337
  CKD stage |          82           0         366
  CKD stage |           2           0          18
   Dialysis |          26           0          78
  Transplan |          63           0         288
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   255.90635   148.03062       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,125         548           0        548        548

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,337
  CKD stage |          92           0         366
  CKD stage |           1           0          18
   Dialysis |          17           0          78
  Transplan |          51           0         288
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   215.59294   117.81958       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,125         483           0        483        483

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,337
  CKD stage |         111           0         366
  CKD stage |          10           0          18
   Dialysis |          21           0          78
  Transplan |          98           0         288
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   238.49224   115.91282       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,125         573           0        573        573

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,337
  CKD stage |         120           0         366
  CKD stage |           4           0          18
   Dialysis |          31           0          78
  Transplan |          80           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   231.08753   111.44503       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,125         562           0        562        562

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,337
  CKD stage |          84           0         366
  CKD stage |          19           0          18
   Dialysis |          13           0          78
  Transplan |          69           0         288
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   239.20329   133.50436       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,125         537           0        537        537

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,337
  CKD stage |          97           0         366
  CKD stage |          14           0          18
   Dialysis |          23           0          78
  Transplan |          71           0         288
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   216.90682   110.85619       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,125         519           0        519        519

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,337
  CKD stage |          77           0         366
  CKD stage |           6           0          18
   Dialysis |          25           0          78
  Transplan |          79           0         288
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   258.52282    147.2017       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,125         567           0        567        567

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,337
  CKD stage |          88           0         366
  CKD stage |           4           0          18
   Dialysis |          22           0          78
  Transplan |          58           0         288
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |     223.576   122.71026       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,125         504           0        504        504

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,337
  CKD stage |          71           0         366
  CKD stage |           2           0          18
   Dialysis |           7           0          78
  Transplan |          79           0         288
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   217.71435   119.99163       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,125         473           0        473        473

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,337
  CKD stage |          60           0         366
  CKD stage |           3           0          18
   Dialysis |          14           0          78
  Transplan |          60           0         288
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   244.39341   148.44653       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,125         503           0        503        503

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,337
  CKD stage |         102           0         366
  CKD stage |           3           0          18
   Dialysis |          26           0          78
  Transplan |          90           0         288
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   251.08235   130.21228       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         578           0        578        578

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,337
  CKD stage |          59           0         366
  CKD stage |           0           0          18
   Dialysis |          14           0          78
  Transplan |          72           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   233.31012   136.99183       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,125         495           0        495        495

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,337
  CKD stage |          78           0         366
  CKD stage |           6           0          18
   Dialysis |          12           0          78
  Transplan |          80           0         288
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |     197.216   101.32992       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,125         453           0        453        453

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,337
  CKD stage |          70           0         366
  CKD stage |           4           0          18
   Dialysis |           9           0          78
  Transplan |          62           0         288
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   241.33929   142.16954       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,125         512           0        512        512

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         254           0       1,337
  CKD stage |          89           0         366
  CKD stage |           7           0          18
   Dialysis |          25           0          78
  Transplan |          72           0         288
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   185.96424   90.020717       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,125         452           0        452        452

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,337
  CKD stage |         109           0         366
  CKD stage |           5           0          18
   Dialysis |          11           0          78
  Transplan |          55           0         288
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   221.14306   116.78049       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,125         492           0        492        492

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,337
  CKD stage |          90           0         366
  CKD stage |           6           0          18
   Dialysis |          21           0          78
  Transplan |          72           0         288
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   255.80188   143.21855       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,125         558           0        558        558

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,337
  CKD stage |          63           0         366
  CKD stage |           3           0          18
   Dialysis |          30           0          78
  Transplan |          83           0         288
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   237.21788    134.6093       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,125         523           0        523        523

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,337
  CKD stage |         109           0         366
  CKD stage |           6           0          18
   Dialysis |          18           0          78
  Transplan |          81           0         288
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   223.72753   110.45073       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,125         527           0        527        527

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,337
  CKD stage |         104           0         366
  CKD stage |           3           0          18
   Dialysis |          11           0          78
  Transplan |          46           0         288
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   242.37835   136.89003       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         516           0        516        516

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         392           0       1,337
  CKD stage |         109           0         366
  CKD stage |           3           0          18
   Dialysis |          26           0          78
  Transplan |          71           0         288
  KRT uncle |          20           0          38
------------+------------------------------------
      Total |   276.37082   151.89922       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         621           0        621        621

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,337
  CKD stage |          82           0         366
  CKD stage |           0           0          18
   Dialysis |           9           0          78
  Transplan |          77           0         288
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   234.69129    129.0961       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         517           0        517        517

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,337
  CKD stage |          87           0         366
  CKD stage |           5           0          18
   Dialysis |           8           0          78
  Transplan |          58           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   227.24894   127.19539       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,125         494           0        494        494

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,337
  CKD stage |         100           0         366
  CKD stage |           8           0          18
   Dialysis |          14           0          78
  Transplan |          82           0         288
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   212.87059   104.79406       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,125         509           0        509        509

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,337
  CKD stage |         108           0         366
  CKD stage |          20           0          18
   Dialysis |          14           0          78
  Transplan |          87           0         288
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   262.19812   138.02969       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,125         608           0        608        608

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(81 real changes made)

. replace ethnicity=2 if ethnicity==3
(92 real changes made)

. replace ethnicity=3 if ethnicity==4
(83 real changes made)

. replace ethnicity=4 if ethnicity==6
(81 real changes made)

. replace ethnicity=6 if ethnicity==.
(540 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,913 missing values generated)

. replace region = 2 if region_string=="East"
(189 real changes made)

. replace region = 3 if region_string=="London"
(465 real changes made)

. replace region = 4 if region_string=="North East"
(201 real changes made)

. replace region = 5 if region_string=="North West"
(224 real changes made)

. replace region = 6 if region_string=="South East"
(239 real changes made)

. replace region = 7 if region_string=="South West"
(186 real changes made)

. replace region = 8 if region_string=="West Midlands"
(226 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(183 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,125 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(857 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,268 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2020_ckd_complete.dta not found)
file ./output/2020_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,615
        from master                       495  (_merge==1)
        from using                      2,120  (_merge==2)

    matched                                 5  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(495 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
      Percentiles      Smallest
 1%     43.90339       43.90339
 5%     43.90339       71.30206
10%     43.90339              .       Obs                   2
25%     43.90339              .       Sum of Wgt.           2

50%     57.60272                      Mean           57.60272
                        Largest       Std. Dev.      19.37378
75%     71.30206              .
90%     71.30206              .       Variance       375.3434
95%     71.30206       43.90339       Skewness              0
99%     71.30206       71.30206       Kurtosis              1

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |   115.20544           0       1,337
  CKD stage |           0           0         366
  CKD stage |           0           0          18
   Dialysis |           0           0          78
  Transplan |           0           0         288
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   72.484555   55.660242       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,125    115.2054           0   115.2054   115.2054

                           ec_cost
-------------------------------------------------------------
      Percentiles      Smallest
 1%     41.01869       41.01869
 5%     41.01869              .
10%     41.01869              .       Obs                   1
25%     41.01869              .       Sum of Wgt.           1

50%     41.01869                      Mean           41.01869
                        Largest       Std. Dev.             .
75%     41.01869              .
90%     41.01869              .       Variance              .
95%     41.01869              .       Skewness              .
99%     41.01869       41.01869       Kurtosis              .

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |   41.018692           0       1,337
  CKD stage |           0           0         366
  CKD stage |           0           0          18
   Dialysis |           0           0          78
  Transplan |           0           0         288
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   25.807996    19.81773       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,125    41.01869           0   41.01869   41.01869

                          opa_cost
-------------------------------------------------------------
      Percentiles      Smallest
 1%     58.38884       58.38884
 5%     58.38884       68.58647
10%     58.38884              .       Obs                   2
25%     58.38884              .       Sum of Wgt.           2

50%     63.48766                      Mean           63.48766
                        Largest       Std. Dev.      7.210812
75%     68.58647              .
90%     68.58647              .       Variance       51.99581
95%     68.58647       58.38884       Skewness              0
99%     68.58647       68.58647       Kurtosis              1

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |   126.97531           0       1,337
  CKD stage |           0           0         366
  CKD stage |           0           0          18
   Dialysis |           0           0          78
  Transplan |           0           0         288
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   79.889878   61.346724       2,125

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,125    126.9753           0   126.9753   126.9753

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2020_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete.log
  log type:  text
 closed on:  20 Sep 2023, 14:24:15
-------------------------------------------------------------------------------
