-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 opened on:  12 Jan 2023, 18:20:13

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,667 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(2,007 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,774 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,210        9.57        9.57
           East Midlands |      3,389       10.10       19.67
                  London |      6,766       20.17       39.83
              North East |      3,420       10.19       50.03
              North West |      3,296        9.82       59.85
              South East |      3,323        9.90       69.75
              South West |      3,332        9.93       79.69
           West Midlands |      3,445       10.27       89.95
Yorkshire and The Humber |      3,371       10.05      100.00
-------------------------+-----------------------------------
                   Total |     33,552      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,681        5.01        5.01
          1 |      6,294       18.76       23.77
          2 |      6,433       19.17       42.94
          3 |      6,498       19.37       62.31
          4 |      6,306       18.79       81.10
          5 |      6,340       18.90      100.00
------------+-----------------------------------
      Total |     33,552      100.00

. drop if imd==0
(1,681 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,818 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(805 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(791 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,929 real changes made, 13,929 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,929 missing values generated)

. gen min_baseline_creatinine=.
(31,871 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,107 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,835 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,107 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,835 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,498 real changes made)

. gen max_baseline_creatinine=.
(31,871 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,107 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,835 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,942 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,373 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,929 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,942 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,107 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,737 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,871
25%            0              0       Sum of Wgt.      31,871

50%            0                      Mean           12.42126
                        Largest       Std. Dev.      12.99686
75%     24.99222       43.14183
90%     29.22561       43.82671       Variance       168.9182
95%     31.34178       43.90664       Skewness       .2253955
99%     35.28065       44.46036       Kurtosis       1.303064

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,635        5.70        5.70
         <= |      1,575        5.49       11.18
          = |     20,650       71.93       83.11
          > |      1,612        5.61       88.72
         >= |      1,622        5.65       94.37
          ~ |      1,615        5.63      100.00
------------+-----------------------------------
      Total |     28,709      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,649       55.38       55.38
          1 |     14,222       44.62      100.00
------------+-----------------------------------
      Total |     31,871      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,912       46.79       46.79
          1 |     16,959       53.21      100.00
------------+-----------------------------------
      Total |     31,871      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,279       95.00       95.00
          1 |      1,592        5.00      100.00
------------+-----------------------------------
      Total |     31,871      100.00
(754 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,282       95.01       95.01
          1 |      1,589        4.99      100.00
------------+-----------------------------------
      Total |     31,871      100.00
(705 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,255       94.93       94.93
          1 |      1,616        5.07      100.00
------------+-----------------------------------
      Total |     31,871      100.00
(667 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,295       95.06       95.06
          1 |      1,576        4.94      100.00
------------+-----------------------------------
      Total |     31,871      100.00
(629 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,265       94.96       94.96
          1 |      1,606        5.04      100.00
------------+-----------------------------------
      Total |     31,871      100.00
(624 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,277       95.00       95.00
          1 |      1,594        5.00      100.00
------------+-----------------------------------
      Total |     31,871      100.00
(588 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,945       34.34       34.34
          1 |     20,926       65.66      100.00
------------+-----------------------------------
      Total |     31,871      100.00

. drop if ckd==0
(10,945 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2020_ckd.csv not found)
file ./output/2020_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 closed on:  12 Jan 2023, 18:20:14
-------------------------------------------------------------------------------
