-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete_v2.log
  log type:  text
 opened on:  24 Mar 2023, 18:44:21

. clear

. 
. *Merge `dataset'_ckd_v2 with `dataset'_ckd_complete_v2
. capture noisily import delimited ./output/`dataset'_ckd_v2.csv, clear
(7 vars, 21,209 obs)

. tempfile `dataset'_ckd_v2

. save ``dataset'_ckd'_v2, replace
(note: file _v2.dta not found)
file _v2.dta saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete_v2.csv
> , clear
(210 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'_v2

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,991
        from master                    47,891  (_merge==1)
        from using                     19,100  (_merge==2)

    matched                             2,109  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,991 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v2

. save ``dataset'_ckd_complete'_v2, replace
file _v2.dta saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd_v2.csv, clear
> tempfile 2017_ckd_v2
> save 2017_ckd_v2, replace
> capture noisily import delimited ./output/input_2017_ckd_complete_v2.csv, cle
> ar
> merge 1:1 patient_id using 2017_ckd_v2
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v2
> save 2017_ckd_complete_v2, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        175        8.30        8.30
Kidney transplant |        190        9.01       17.31
 Modality unclear |         43        2.04       19.35
          Pre KRT |      1,701       80.65      100.00
------------------+-----------------------------------
            Total |      2,109      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(841 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1268 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(175 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(190 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(43 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(680 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,316       62.40       62.40
  CKD stage 3 |        371       17.59       79.99
CKD stage 4/5 |         14        0.66       80.65
     Dialysis |        175        8.30       88.95
   Transplant |        190        9.01       97.96
  KRT unclear |         43        2.04      100.00
--------------+-----------------------------------
        Total |      2,109      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,316 |     1,316 
  CKD stage 3 |         0          0          0        371 |       371 
CKD stage 4/5 |         0          0          0         14 |        14 
     Dialysis |       175          0          0          0 |       175 
   Transplant |         0        190          0          0 |       190 
  KRT unclear |         0          0         43          0 |        43 
--------------+--------------------------------------------+----------
        Total |       175        190         43      1,701 |     2,109 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       120         63         46         10 |     1,316 
  CKD stage 3 |        31         17         17          5 |       371 
CKD stage 4/5 |         3          0          1          0 |        14 
     Dialysis |        13          8          9          1 |       175 
   Transplant |        23          9          8          3 |       190 
  KRT unclear |         6          2          0          1 |        43 
--------------+--------------------------------------------+----------
        Total |       196         99         81         20 |     2,109 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |     1,077 |     1,316 
  CKD stage 3 |       301 |       371 
CKD stage 4/5 |        10 |        14 
     Dialysis |       144 |       175 
   Transplant |       147 |       190 
  KRT unclear |        34 |        43 
--------------+-----------+----------
        Total |     1,713 |     2,109 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,100 missing values generated)

. replace sex = 0 if male == "Female"
(1,100 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(927 real changes made, 927 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(927 missing values generated)

. gen min_creatinine_outcome=.
(2,109 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(604 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(578 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(604 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(578 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(747 real changes made)

. gen max_creatinine_outcome=.
(2,109 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(604 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(578 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,182 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,362 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(927 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,182 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(604 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(927 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1182 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(197 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(6 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(99 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(81 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(20 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(196 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,544       73.21       73.21
               CKD 3 |        163        7.73       80.94
     CKD 4/5 pre-KRT |          6        0.28       81.22
            Dialysis |         99        4.69       85.92
   Kidney transplant |         81        3.84       89.76
KRT unclear modality |         20        0.95       90.71
            Deceased |        196        9.29      100.00
---------------------+-----------------------------------
               Total |      2,109      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,316
  CKD stage |          93           0         371
  CKD stage |           3           0          14
   Dialysis |          40           0         175
  Transplan |          45           0         190
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   257.22807   151.53682       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,109         560           0        560        560

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         272           0       1,316
  CKD stage |          83           0         371
  CKD stage |           0           0          14
   Dialysis |          56           0         175
  Transplan |          45           0         190
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   193.29256   102.30525       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,109         469           0        469        469

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,316
  CKD stage |         110           0         371
  CKD stage |          11           0          14
   Dialysis |          40           0         175
  Transplan |          51           0         190
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |    232.8753   125.76777       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,109         553           0        553        553

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,316
  CKD stage |         112           0         371
  CKD stage |           6           0          14
   Dialysis |          53           0         175
  Transplan |          57           0         190
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   252.30536   136.43373       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,109         598           0        598        598

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,316
  CKD stage |          69           0         371
  CKD stage |           0           0          14
   Dialysis |          38           0         175
  Transplan |          61           0         190
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |    231.3779   136.51538       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,109         520           0        520        520

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,316
  CKD stage |          95           0         371
  CKD stage |           0           0          14
   Dialysis |          44           0         175
  Transplan |          40           0         190
  KRT uncle |          22           0          43
------------+------------------------------------
      Total |   220.34851   121.97957       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,109         515           0        515        515

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,316
  CKD stage |          72           0         371
  CKD stage |           0           0          14
   Dialysis |          33           0         175
  Transplan |          58           0         190
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   251.14746   152.34235       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,109         545           0        545        545

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,316
  CKD stage |         117           0         371
  CKD stage |           0           0          14
   Dialysis |          49           0         175
  Transplan |          58           0         190
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   215.60645   107.14274       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,109         541           0        541        541

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,316
  CKD stage |          95           0         371
  CKD stage |           8           0          14
   Dialysis |          50           0         175
  Transplan |          37           0         190
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   221.51019   123.16231       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,109         510           0        510        510

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,316
  CKD stage |          81           0         371
  CKD stage |           0           0          14
   Dialysis |          51           0         175
  Transplan |          20           0         190
  KRT uncle |          27           0          43
------------+------------------------------------
      Total |   254.20626   155.21937       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,109         553           0        553        553

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,316
  CKD stage |          74           0         371
  CKD stage |           4           0          14
   Dialysis |          40           0         175
  Transplan |          39           0         190
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   223.50213   132.68684       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,109         493           0        493        493

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,316
  CKD stage |          76           0         371
  CKD stage |           2           0          14
   Dialysis |          43           0         175
  Transplan |          65           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   211.39497   117.39019       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,109         495           0        495        495

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         376           0       1,316
  CKD stage |         102           0         371
  CKD stage |          10           0          14
   Dialysis |          19           0         175
  Transplan |          61           0         190
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   260.11048   150.91416       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,109         588           0        588        588

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,316
  CKD stage |          84           0         371
  CKD stage |           0           0          14
   Dialysis |          36           0         175
  Transplan |          69           0         190
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   243.93125    140.0153       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,109         556           0        556        556

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,316
  CKD stage |         121           0         371
  CKD stage |          11           0          14
   Dialysis |          56           0         175
  Transplan |          42           0         190
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   228.00237   117.17268       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,109         567           0        567        567

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,316
  CKD stage |          81           0         371
  CKD stage |           0           0          14
   Dialysis |          55           0         175
  Transplan |          45           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   245.15078   143.46344       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,109         544           0        544        544

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,316
  CKD stage |          86           0         371
  CKD stage |           0           0          14
   Dialysis |          21           0         175
  Transplan |          45           0         190
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   243.18872   146.53513       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,109         514           0        514        514

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,316
  CKD stage |          97           0         371
  CKD stage |           2           0          14
   Dialysis |          43           0         175
  Transplan |          46           0         190
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   220.48601   120.54596       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,109         520           0        520        520

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,316
  CKD stage |          91           0         371
  CKD stage |           3           0          14
   Dialysis |          53           0         175
  Transplan |          72           0         190
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   232.38928   125.31075       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         557           0        557        557

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,316
  CKD stage |          88           0         371
  CKD stage |           0           0          14
   Dialysis |          21           0         175
  Transplan |          73           0         190
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   263.57563   156.30468       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         574           0        574        574

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,316
  CKD stage |         127           0         371
  CKD stage |           0           0          14
   Dialysis |          75           0         175
  Transplan |          38           0         190
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |    234.3651   118.40629       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         574           0        574        574

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,316
  CKD stage |         102           0         371
  CKD stage |           0           0          14
   Dialysis |          35           0         175
  Transplan |          29           0         190
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   251.48222   148.01867       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         544           0        544        544

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,316
  CKD stage |         104           0         371
  CKD stage |           0           0          14
   Dialysis |          35           0         175
  Transplan |          38           0         190
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   237.02466   134.53164       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,109         529           0        529        529

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,316
  CKD stage |          75           0         371
  CKD stage |           7           0          14
   Dialysis |          28           0         175
  Transplan |          65           0         190
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |   246.05642   147.55167       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,109         535           0        535        535

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,316
  CKD stage |         115           0         371
  CKD stage |           9           0          14
   Dialysis |          57           0         175
  Transplan |          41           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   242.88525   131.05724       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,109         572           0        572        572

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,316
  CKD stage |          96           0         371
  CKD stage |           4           0          14
   Dialysis |          24           0         175
  Transplan |          58           0         190
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |   238.78426   137.12745       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,109         526           0        526        526

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,316
  CKD stage |          98           0         371
  CKD stage |           8           0          14
   Dialysis |          48           0         175
  Transplan |          57           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |    276.7743   161.00203       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,109         619           0        619        619

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,316
  CKD stage |          91           0         371
  CKD stage |           4           0          14
   Dialysis |          42           0         175
  Transplan |          36           0         190
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   238.28497     138.647       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,109         530           0        530        530

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,316
  CKD stage |          73           0         371
  CKD stage |          13           0          14
   Dialysis |          24           0         175
  Transplan |          22           0         190
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   225.51873   140.68683       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,109         476           0        476        476

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,316
  CKD stage |          78           0         371
  CKD stage |           7           0          14
   Dialysis |          55           0         175
  Transplan |          38           0         190
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   252.99905   151.27847       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,109         566           0        566        566

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,316
  CKD stage |          78           0         371
  CKD stage |           7           0          14
   Dialysis |          53           0         175
  Transplan |          34           0         190
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   223.68753   129.95356       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         510           0        510        510

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,316
  CKD stage |          75           0         371
  CKD stage |          10           0          14
   Dialysis |          48           0         175
  Transplan |          57           0         190
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   262.98198   157.55693       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         593           0        593        593

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,316
  CKD stage |         116           0         371
  CKD stage |           0           0          14
   Dialysis |          46           0         175
  Transplan |          99           0         190
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   255.56852   131.16717       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         631           0        631        631

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,316
  CKD stage |         112           0         371
  CKD stage |           0           0          14
   Dialysis |          55           0         175
  Transplan |          59           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |    246.8734   131.91669       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         581           0        581        581

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         408           0       1,316
  CKD stage |          93           0         371
  CKD stage |           2           0          14
   Dialysis |          31           0         175
  Transplan |          76           0         190
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   280.76861     164.873       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,109         629           0        629        629

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,316
  CKD stage |         107           0         371
  CKD stage |           2           0          14
   Dialysis |          83           0         175
  Transplan |          59           0         190
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   237.26174   120.70803       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,109         596           0        596        596

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,316
  CKD stage |          77           0         371
  CKD stage |           0           0          14
   Dialysis |          37           0         175
  Transplan |          30           0         190
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |    223.6899   133.92947       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,109         487           0        487        487

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,316
  CKD stage |         115           0         371
  CKD stage |           3           0          14
   Dialysis |          36           0         175
  Transplan |          55           0         190
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   228.77904   121.13824       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,109         544           0        544        544

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,316
  CKD stage |         101           0         371
  CKD stage |           2           0          14
   Dialysis |          52           0         175
  Transplan |          34           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   239.95448   135.62951       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,109         540           0        540        540

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,316
  CKD stage |          88           0         371
  CKD stage |           7           0          14
   Dialysis |          53           0         175
  Transplan |          81           0         190
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |   243.12328   133.37218       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,109         575           0        575        575

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,316
  CKD stage |         120           0         371
  CKD stage |          10           0          14
   Dialysis |          76           0         175
  Transplan |          59           0         190
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   240.04457   120.38036       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,109         601           0        601        601

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,316
  CKD stage |         111           0         371
  CKD stage |           6           0          14
   Dialysis |          54           0         175
  Transplan |          72           0         190
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   232.16453   118.67514       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,109         570           0        570        570

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,316
  CKD stage |          76           0         371
  CKD stage |           6           0          14
   Dialysis |          41           0         175
  Transplan |          24           0         190
  KRT uncle |          22           0          43
------------+------------------------------------
      Total |   199.13182   115.44186       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,109         457           0        457        457

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,316
  CKD stage |          99           0         371
  CKD stage |           7           0          14
   Dialysis |          60           0         175
  Transplan |          40           0         190
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |     216.688   115.20428       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,109         527           0        527        527

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,316
  CKD stage |          83           0         371
  CKD stage |           4           0          14
   Dialysis |          59           0         175
  Transplan |          41           0         190
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   210.63869   115.98172       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,109         498           0        498        498

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         394           0       1,316
  CKD stage |         115           0         371
  CKD stage |           8           0          14
   Dialysis |          60           0         175
  Transplan |          53           0         190
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   276.09341   153.39611       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         640           0        640        640

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,316
  CKD stage |          94           0         371
  CKD stage |           0           0          14
   Dialysis |          41           0         175
  Transplan |          49           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |    231.6605   130.50511       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,109         523           0        523        523

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,316
  CKD stage |         108           0         371
  CKD stage |           4           0          14
   Dialysis |          47           0         175
  Transplan |          64           0         190
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   239.36368   127.24197       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,109         579           0        579        579

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,316
  CKD stage |         117           0         371
  CKD stage |           0           0          14
   Dialysis |          62           0         175
  Transplan |          56           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   210.62399   102.02673       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,109         530           0        530        530

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,316
  CKD stage |         104           0         371
  CKD stage |           6           0          14
   Dialysis |          51           0         175
  Transplan |          49           0         190
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   220.08013   116.14469       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,109         533           0        533        533

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,316
  CKD stage |         103           0         371
  CKD stage |           0           0          14
   Dialysis |          65           0         175
  Transplan |          42           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |    222.7487   117.89096       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,109         530           0        530        530

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,316
  CKD stage |         102           0         371
  CKD stage |           6           0          14
   Dialysis |          48           0         175
  Transplan |          39           0         190
  KRT uncle |          22           0          43
------------+------------------------------------
      Total |   220.61356   119.36013       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,109         529           0        529        529

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,316
  CKD stage |         106           0         371
  CKD stage |           4           0          14
   Dialysis |          29           0         175
  Transplan |          52           0         190
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   218.67994   118.55685       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,109         505           0        505        505

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,316
  CKD stage |          73           0         371
  CKD stage |           6           0          14
   Dialysis |          47           0         175
  Transplan |          30           0         190
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   248.23234   152.27571       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,109         540           0        540        540

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,316
  CKD stage |          86           0         371
  CKD stage |           1           0          14
   Dialysis |          49           0         175
  Transplan |          32           0         190
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |    211.3779   119.20254       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         482           0        482        482

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,316
  CKD stage |         106           0         371
  CKD stage |           0           0          14
   Dialysis |          25           0         175
  Transplan |          66           0         190
  KRT uncle |          23           0          43
------------+------------------------------------
      Total |   236.79753   129.66411       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         556           0        556        556

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         271           0       1,316
  CKD stage |          78           0         371
  CKD stage |           3           0          14
   Dialysis |          77           0         175
  Transplan |          58           0         190
  KRT uncle |          22           0          43
------------+------------------------------------
      Total |   194.90612   98.580219       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         509           0        509        509

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,316
  CKD stage |         107           0         371
  CKD stage |          11           0          14
   Dialysis |          33           0         175
  Transplan |          53           0         190
  KRT uncle |          23           0          43
------------+------------------------------------
      Total |   268.36273   154.32594       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         614           0        614        614

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,316
  CKD stage |          86           0         371
  CKD stage |           8           0          14
   Dialysis |          26           0         175
  Transplan |          64           0         190
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   243.59839   141.96301       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,109         548           0        548        548

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,316
  CKD stage |          87           0         371
  CKD stage |          10           0          14
   Dialysis |          48           0         175
  Transplan |          56           0         190
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   259.90896   151.50884       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,109         591           0        591        591

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,316
  CKD stage |          74           0         371
  CKD stage |           0           0          14
   Dialysis |          69           0         175
  Transplan |          57           0         190
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   244.89379   141.01236       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,109         560           0        560        560

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,316
  CKD stage |          86           0         371
  CKD stage |           2           0          14
   Dialysis |          30           0         175
  Transplan |          48           0         190
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   250.64248   149.54728       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,109         547           0        547        547

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,316
  CKD stage |         116           0         371
  CKD stage |           6           0          14
   Dialysis |          40           0         175
  Transplan |          46           0         190
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |    238.1944     129.724       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,109         545           0        545        545

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,316
  CKD stage |         103           0         371
  CKD stage |           0           0          14
   Dialysis |          48           0         175
  Transplan |          36           0         190
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   266.97297   156.09901       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,109         581           0        581        581

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,316
  CKD stage |         100           0         371
  CKD stage |           0           0          14
   Dialysis |          30           0         175
  Transplan |          45           0         190
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |    207.8331   112.98691       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,109         481           0        481        481

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,316
  CKD stage |          72           0         371
  CKD stage |           2           0          14
   Dialysis |          45           0         175
  Transplan |          40           0         190
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   242.44334    146.7715       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,109         529           0        529        529

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,316
  CKD stage |          79           0         371
  CKD stage |          10           0          14
   Dialysis |          41           0         175
  Transplan |          61           0         190
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   225.13656   128.05971       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,109         520           0        520        520

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,316
  CKD stage |         114           0         371
  CKD stage |           5           0          14
   Dialysis |          36           0         175
  Transplan |          59           0         190
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   240.93457   129.64127       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,109         573           0        573        573

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,316
  CKD stage |          95           0         371
  CKD stage |           2           0          14
   Dialysis |          37           0         175
  Transplan |          30           0         190
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   228.78236   131.94159       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,109         512           0        512        512

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,316
  CKD stage |         111           0         371
  CKD stage |           7           0          14
   Dialysis |          27           0         175
  Transplan |          74           0         190
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   234.01802    124.5351       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         560           0        560        560

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,316
  CKD stage |          97           0         371
  CKD stage |          12           0          14
   Dialysis |          45           0         175
  Transplan |          67           0         190
  KRT uncle |          23           0          43
------------+------------------------------------
      Total |   251.39545   139.53378       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,109         603           0        603        603

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,316
  CKD stage |          82           0         371
  CKD stage |           0           0          14
   Dialysis |          19           0         175
  Transplan |          22           0         190
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   230.22238   142.82007       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,109         467           0        467        467

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         451           0       1,316
  CKD stage |          99           0         371
  CKD stage |           6           0          14
   Dialysis |          37           0         175
  Transplan |          58           0         190
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   307.43623   185.91531       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,109         664           0        664        664

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,316
  CKD stage |          86           0         371
  CKD stage |           0           0          14
   Dialysis |          85           0         175
  Transplan |          39           0         190
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   240.69512    134.0098       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,109         571           0        571        571

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,316
  CKD stage |         100           0         371
  CKD stage |          10           0          14
   Dialysis |          40           0         175
  Transplan |          54           0         190
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   224.61783   121.71941       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,109         539           0        539        539

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,316
  CKD stage |         110           0         371
  CKD stage |           6           0          14
   Dialysis |          41           0         175
  Transplan |          32           0         190
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   227.97108   126.10397       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,109         519           0        519        519

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,316
  CKD stage |         116           0         371
  CKD stage |           0           0          14
   Dialysis |          60           0         175
  Transplan |          42           0         190
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   203.52726   99.908686       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,109         510           0        510        510

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,316
  CKD stage |          78           0         371
  CKD stage |           4           0          14
   Dialysis |          38           0         175
  Transplan |          62           0         190
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   258.76339   154.12963       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,109         580           0        580        580

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,316
  CKD stage |         104           0         371
  CKD stage |           2           0          14
   Dialysis |          30           0         175
  Transplan |          27           0         190
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   245.55477   144.35978       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         528           0        528        528

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,316
  CKD stage |         109           0         371
  CKD stage |           4           0          14
   Dialysis |          62           0         175
  Transplan |          45           0         190
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   257.18872   141.60042       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         606           0        606        606

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,316
  CKD stage |         119           0         371
  CKD stage |          10           0          14
   Dialysis |          20           0         175
  Transplan |          70           0         190
  KRT uncle |          13           0          43
------------+------------------------------------
      Total |   214.55666   109.46556       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         529           0        529        529

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,316
  CKD stage |          44           0         371
  CKD stage |           9           0          14
   Dialysis |          51           0         175
  Transplan |          62           0         190
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   231.99336   143.21319       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,109         526           0        526        526

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,316
  CKD stage |         121           0         371
  CKD stage |           4           0          14
   Dialysis |          34           0         175
  Transplan |          47           0         190
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   237.50688   128.44042       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,109         546           0        546        546

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         395           0       1,316
  CKD stage |          90           0         371
  CKD stage |           9           0          14
   Dialysis |          55           0         175
  Transplan |          61           0         190
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |   272.42817   158.63451       2,109

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,109         610           0        610        610

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(65 real changes made)

. replace ethnicity=2 if ethnicity==3
(61 real changes made)

. replace ethnicity=3 if ethnicity==4
(80 real changes made)

. replace ethnicity=4 if ethnicity==6
(65 real changes made)

. replace ethnicity=6 if ethnicity==.
(562 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,918 missing values generated)

. replace region = 2 if region_string=="East"
(217 real changes made)

. replace region = 3 if region_string=="London"
(422 real changes made)

. replace region = 4 if region_string=="North East"
(209 real changes made)

. replace region = 5 if region_string=="North West"
(191 real changes made)

. replace region = 6 if region_string=="South East"
(208 real changes made)

. replace region = 7 if region_string=="South West"
(213 real changes made)

. replace region = 8 if region_string=="West Midlands"
(233 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(225 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,109 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(860 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,249 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v2.dta", replace
(note: file ./output/2020_ckd_complete_v2.dta not found)
file ./output/2020_ckd_complete_v2.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_complete_v2.log
  log type:  text
 closed on:  24 Mar 2023, 18:44:32
-------------------------------------------------------------------------------
