-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_v2.log
  log type:  text
 opened on:  24 Mar 2023, 17:54:53

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,550 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,969 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,767 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,434       10.19       10.19
           East Midlands |      3,395       10.07       20.26
                  London |      6,676       19.80       40.06
              North East |      3,374       10.01       50.07
              North West |      3,404       10.10       60.16
              South East |      3,394       10.07       70.23
              South West |      3,355        9.95       80.18
           West Midlands |      3,367        9.99       90.17
Yorkshire and The Humber |      3,315        9.83      100.00
-------------------------+-----------------------------------
                   Total |     33,714      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,660        4.92        4.92
          1 |      6,365       18.88       23.80
          2 |      6,370       18.89       42.70
          3 |      6,397       18.97       61.67
          4 |      6,528       19.36       81.03
          5 |      6,394       18.97      100.00
------------+-----------------------------------
      Total |     33,714      100.00

. drop if imd==0
(1,660 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,006 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(787 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(763 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,041 real changes made, 14,041 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,041 missing values generated)

. gen min_baseline_creatinine=.
(32,054 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,080 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,933 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,080 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,933 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,472 real changes made)

. gen max_baseline_creatinine=.
(32,054 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,080 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,933 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,013 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,582 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,041 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,013 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,080 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,723 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,054
25%            0              0       Sum of Wgt.      32,054

50%            0                      Mean           12.50176
                        Largest       Std. Dev.      12.99936
75%     25.07803        43.1879
90%     29.17696       43.74541       Variance       168.9835
95%     31.37678       44.17943       Skewness       .2116747
99%     35.15798       44.44014       Kurtosis       1.294386

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,582        5.48        5.48
         <= |      1,512        5.24       10.72
          = |     20,948       72.61       83.34
          > |      1,608        5.57       88.91
         >= |      1,601        5.55       94.46
          ~ |      1,598        5.54      100.00
------------+-----------------------------------
      Total |     28,849      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,598       54.90       54.90
   Albuminuria |     14,456       45.10      100.00
---------------+-----------------------------------
         Total |     32,054      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,875       46.41       46.41
          1 |     17,179       53.59      100.00
------------+-----------------------------------
      Total |     32,054      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14041 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 18013 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,041 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,425       94.92       94.92
          1 |      1,629        5.08      100.00
------------+-----------------------------------
      Total |     32,054      100.00
(1,629 real changes made)
(758 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,410       94.87       94.87
          1 |      1,644        5.13      100.00
------------+-----------------------------------
      Total |     32,054      100.00
(1,556 real changes made)
(743 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,463       95.04       95.04
          1 |      1,591        4.96      100.00
------------+-----------------------------------
      Total |     32,054      100.00
(1,438 real changes made)
(683 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,466       95.05       95.05
          1 |      1,588        4.95      100.00
------------+-----------------------------------
      Total |     32,054      100.00
(1,350 real changes made)
(636 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,454       95.01       95.01
          1 |      1,600        4.99      100.00
------------+-----------------------------------
      Total |     32,054      100.00
(1,285 real changes made)
(624 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,435       94.95       94.95
          1 |      1,619        5.05      100.00
------------+-----------------------------------
      Total |     32,054      100.00
(1,230 real changes made)
(586 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,650      4,661 |    10,311 
 eGFR >=60 |     5,195      4,431 |     9,626 
  eGFR <60 |     2,044      1,585 |     3,629 
       KRT |     4,709      3,779 |     8,488 
-----------+----------------------+----------
     Total |    17,598     14,456 |    32,054 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,845       33.83       33.83
          1 |     21,209       66.17      100.00
------------+-----------------------------------
      Total |     32,054      100.00

. drop if ckd==0
(10,845 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,661 |     4,661 
 eGFR >=60 |         0      4,431 |     4,431 
  eGFR <60 |     2,044      1,585 |     3,629 
       KRT |     4,709      3,779 |     8,488 
-----------+----------------------+----------
     Total |     6,753     14,456 |    21,209 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd_v2.csv", replace
(note: file ./output/2020_ckd_v2.csv not found)
file ./output/2020_ckd_v2.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd_v2.log
  log type:  text
 closed on:  24 Mar 2023, 17:54:54
-------------------------------------------------------------------------------
