-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_01_ckd.log
  log type:  text
 opened on:  25 Apr 2023, 09:28:04

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(19 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,464 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,980 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,743 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,384       10.01       10.01
           East Midlands |      3,394       10.04       20.05
                  London |      6,809       20.14       40.18
              North East |      3,419       10.11       50.29
              North West |      3,377        9.99       60.28
              South East |      3,374        9.98       70.26
              South West |      3,325        9.83       80.09
           West Midlands |      3,341        9.88       89.97
Yorkshire and The Humber |      3,390       10.03      100.00
-------------------------+-----------------------------------
                   Total |     33,813      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,697        5.02        5.02
          1 |      6,491       19.20       24.22
          2 |      6,417       18.98       43.19
          3 |      6,442       19.05       62.25
          4 |      6,353       18.79       81.03
          5 |      6,413       18.97      100.00
------------+-----------------------------------
      Total |     33,813      100.00

. drop if imd==0
(1,697 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,040 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(824 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(814 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,203 real changes made, 14,203 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,203 missing values generated)

. gen min_baseline_creatinine=.
(32,116 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,233 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,680 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,233 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,680 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,509 real changes made)

. gen max_baseline_creatinine=.
(32,116 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,233 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,680 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,913 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,607 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,203 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,913 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,233 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,735 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,116
25%            0              0       Sum of Wgt.      32,116

50%            0                      Mean           12.50108
                        Largest       Std. Dev.      13.00934
75%     25.04795       43.62404
90%     29.17868       44.53298       Variance        169.243
95%     31.44355       44.71191       Skewness       .2177001
99%     35.47276        45.9381       Kurtosis       1.307059

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,636        5.66        5.66
         <= |      1,542        5.33       10.99
          = |     21,016       72.66       83.65
          > |      1,541        5.33       88.97
         >= |      1,578        5.46       94.43
          ~ |      1,611        5.57      100.00
------------+-----------------------------------
      Total |     28,924      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,714       55.16       55.16
   Albuminuria |     14,402       44.84      100.00
---------------+-----------------------------------
         Total |     32,116      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,979       46.64       46.64
          1 |     17,137       53.36      100.00
------------+-----------------------------------
      Total |     32,116      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14203 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17913 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,203 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,555       95.14       95.14
          1 |      1,561        4.86      100.00
------------+-----------------------------------
      Total |     32,116      100.00
(1,561 real changes made)
(721 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,527       95.05       95.05
          1 |      1,589        4.95      100.00
------------+-----------------------------------
      Total |     32,116      100.00
(1,518 real changes made)
(697 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,469       94.87       94.87
          1 |      1,647        5.13      100.00
------------+-----------------------------------
      Total |     32,116      100.00
(1,486 real changes made)
(726 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,496       94.96       94.96
          1 |      1,620        5.04      100.00
------------+-----------------------------------
      Total |     32,116      100.00
(1,396 real changes made)
(638 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,528       95.06       95.06
          1 |      1,588        4.94      100.00
------------+-----------------------------------
      Total |     32,116      100.00
(1,261 real changes made)
(588 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,544       95.11       95.11
          1 |      1,572        4.89      100.00
------------+-----------------------------------
      Total |     32,116      100.00
(1,179 real changes made)
(545 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,761      4,697 |    10,458 
 eGFR >=60 |     5,303      4,270 |     9,573 
  eGFR <60 |     2,051      1,633 |     3,684 
       KRT |     4,599      3,802 |     8,401 
-----------+----------------------+----------
     Total |    17,714     14,402 |    32,116 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,064       34.45       34.45
          1 |     21,052       65.55      100.00
------------+-----------------------------------
      Total |     32,116      100.00

. drop if ckd==0
(11,064 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,697 |     4,697 
 eGFR >=60 |         0      4,270 |     4,270 
  eGFR <60 |     2,051      1,633 |     3,684 
       KRT |     4,599      3,802 |     8,401 
-----------+----------------------+----------
     Total |     6,650     14,402 |    21,052 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2020_01_ckd.csv not found)
file ./output/2020_01_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_01_ckd.log
  log type:  text
 closed on:  25 Apr 2023, 09:28:07
-------------------------------------------------------------------------------
