-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 opened on:   7 Jun 2024, 10:21:22

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve)
(19 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,708 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,950 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,713 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,250        9.66        9.66
           East Midlands |      3,459       10.29       19.95
                  London |      6,653       19.78       39.73
              North East |      3,306        9.83       49.56
              North West |      3,296        9.80       59.37
              South East |      3,415       10.15       69.52
              South West |      3,433       10.21       79.73
           West Midlands |      3,444       10.24       89.97
Yorkshire and The Humber |      3,373       10.03      100.00
-------------------------+-----------------------------------
                   Total |     33,629      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,651        4.91        4.91
          1 |      6,357       18.90       23.81
          2 |      6,424       19.10       42.92
          3 |      6,546       19.47       62.38
          4 |      6,331       18.83       81.21
          5 |      6,320       18.79      100.00
------------+-----------------------------------
      Total |     33,629      100.00

. drop if imd==0
(1,651 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * Code sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. save ./output/input_`dataset', replace
(note: file ./output/input_2020.dta not found)
file ./output/input_2020.dta saved

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,035 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(767 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(824 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,062 real changes made, 14,062 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,062 missing values generated)

. gen min_baseline_creatinine=.
(31,978 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,200 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,716 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,200 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,716 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,320 real changes made)

. gen max_baseline_creatinine=.
(31,978 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,200 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,716 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,916 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,658 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,062 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,916 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,200 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,688 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,978
25%            0              0       Sum of Wgt.      31,978

50%     11.49343                      Mean           12.54882
                        Largest       Std. Dev.      13.00494
75%     25.05276       42.45138
90%     29.28749       42.79807       Variance       169.1286
95%     31.44967       42.86999       Skewness       .2080226
99%     35.18529       43.05146       Kurtosis       1.297594

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,556        5.40        5.40
         <= |      1,611        5.59       10.99
          = |     20,807       72.23       83.22
          > |      1,623        5.63       88.85
         >= |      1,594        5.53       94.39
          ~ |      1,617        5.61      100.00
------------+-----------------------------------
      Total |     28,808      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,534       54.83       54.83
   Albuminuria |     14,444       45.17      100.00
---------------+-----------------------------------
         Total |     31,978      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,846       46.43       46.43
          1 |     17,132       53.57      100.00
------------+-----------------------------------
      Total |     31,978      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14062 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17916 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,062 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,389       95.03       95.03
          1 |      1,589        4.97      100.00
------------+-----------------------------------
      Total |     31,978      100.00
(1,589 real changes made)
(733 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,387       95.02       95.02
          1 |      1,591        4.98      100.00
------------+-----------------------------------
      Total |     31,978      100.00
(1,506 real changes made)
(719 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,342       94.88       94.88
          1 |      1,636        5.12      100.00
------------+-----------------------------------
      Total |     31,978      100.00
(1,474 real changes made)
(663 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,357       94.93       94.93
          1 |      1,621        5.07      100.00
------------+-----------------------------------
      Total |     31,978      100.00
(1,385 real changes made)
(631 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,356       94.93       94.93
          1 |      1,622        5.07      100.00
------------+-----------------------------------
      Total |     31,978      100.00
(1,320 real changes made)
(613 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,376       94.99       94.99
          1 |      1,602        5.01      100.00
------------+-----------------------------------
      Total |     31,978      100.00
(1,263 real changes made)
(598 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,636      4,655 |    10,291 
 eGFR >=60 |     5,253      4,262 |     9,515 
  eGFR <60 |     1,970      1,665 |     3,635 
       KRT |     4,675      3,862 |     8,537 
-----------+----------------------+----------
     Total |    17,534     14,444 |    31,978 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,889       34.05       34.05
          1 |     21,089       65.95      100.00
------------+-----------------------------------
      Total |     31,978      100.00

. drop if ckd==0
(10,889 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,655 |     4,655 
 eGFR >=60 |         0      4,262 |     4,262 
  eGFR <60 |     1,970      1,665 |     3,635 
       KRT |     4,675      3,862 |     8,537 
-----------+----------------------+----------
     Total |     6,645     14,444 |    21,089 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2020_ckd.csv not found)
file ./output/2020_ckd.csv saved

. 
. *Create dataset of non-CKD
. merge 1:1 patient_id using ./output/input_`dataset'
(label sexLab already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,889
        from master                         0  (_merge==1)
        from using                     10,889  (_merge==2)

    matched                            21,089  (_merge==3)
    -----------------------------------------

. keep if _merge==2
(21,089 observations deleted)

. drop _merge

. 
. export delimited using "./output/`dataset'_nockd.csv", replace
(note: file ./output/2020_nockd.csv not found)
file ./output/2020_nockd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 closed on:   7 Jun 2024, 10:21:26
-------------------------------------------------------------------------------
