-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 opened on:  31 Jan 2023, 11:39:12

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,603 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,980 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,752 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,379       10.04       10.04
           East Midlands |      3,383       10.05       20.09
                  London |      6,712       19.94       40.02
              North East |      3,371       10.01       50.04
              North West |      3,374       10.02       60.06
              South East |      3,338        9.92       69.97
              South West |      3,417       10.15       80.12
           West Midlands |      3,371       10.01       90.14
Yorkshire and The Humber |      3,320        9.86      100.00
-------------------------+-----------------------------------
                   Total |     33,665      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,696        5.04        5.04
          1 |      6,293       18.69       23.73
          2 |      6,435       19.11       42.85
          3 |      6,426       19.09       61.93
          4 |      6,358       18.89       80.82
          5 |      6,457       19.18      100.00
------------+-----------------------------------
      Total |     33,665      100.00

. drop if imd==0
(1,696 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,900 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(759 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(824 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,004 real changes made, 14,004 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,004 missing values generated)

. gen min_baseline_creatinine=.
(31,969 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,134 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,831 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,134 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,831 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,268 real changes made)

. gen max_baseline_creatinine=.
(31,969 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,134 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,831 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,965 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,701 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,004 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,965 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,134 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,565 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,969
25%            0              0       Sum of Wgt.      31,969

50%            0                      Mean           12.44433
                        Largest       Std. Dev.      12.99686
75%     24.96777       44.06268
90%     29.20499       44.35276       Variance       168.9184
95%     31.40299       44.85858       Skewness       .2233986
99%     35.30961       47.39735       Kurtosis       1.306975

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,516        5.27        5.27
         <= |      1,614        5.61       10.88
          = |     20,806       72.33       83.21
          > |      1,604        5.58       88.79
         >= |      1,575        5.48       94.26
          ~ |      1,650        5.74      100.00
------------+-----------------------------------
      Total |     28,765      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,652       55.22       55.22
          1 |     14,317       44.78      100.00
------------+-----------------------------------
      Total |     31,969      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,087       47.19       47.19
          1 |     16,882       52.81      100.00
------------+-----------------------------------
      Total |     31,969      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,339       94.90       94.90
          1 |      1,630        5.10      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(779 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,366       94.99       94.99
          1 |      1,603        5.01      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(725 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,383       95.04       95.04
          1 |      1,586        4.96      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(652 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,365       94.98       94.98
          1 |      1,604        5.02      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(632 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,366       94.99       94.99
          1 |      1,603        5.01      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(610 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,372       95.00       95.00
          1 |      1,597        5.00      100.00
------------+-----------------------------------
      Total |     31,969      100.00
(580 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,109       34.75       34.75
          1 |     20,860       65.25      100.00
------------+-----------------------------------
      Total |     31,969      100.00

. drop if ckd==0
(11,109 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2020_ckd.csv not found)
file ./output/2020_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2020_ckd.log
  log type:  text
 closed on:  31 Jan 2023, 11:39:15
-------------------------------------------------------------------------------
