-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 opened on:  12 Jan 2023, 18:25:08

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,597 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,935 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,717 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,337        9.89        9.89
           East Midlands |      3,351        9.93       19.82
                  London |      6,882       20.39       40.21
              North East |      3,322        9.84       50.05
              North West |      3,399       10.07       60.12
              South East |      3,387       10.04       70.15
              South West |      3,426       10.15       80.31
           West Midlands |      3,242        9.61       89.91
Yorkshire and The Humber |      3,405       10.09      100.00
-------------------------+-----------------------------------
                   Total |     33,751      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,741        5.16        5.16
          1 |      6,422       19.03       24.19
          2 |      6,434       19.06       43.25
          3 |      6,456       19.13       62.38
          4 |      6,332       18.76       81.14
          5 |      6,366       18.86      100.00
------------+-----------------------------------
      Total |     33,751      100.00

. drop if imd==0
(1,741 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,042 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(779 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(757 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,121 real changes made, 14,121 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,121 missing values generated)

. gen min_baseline_creatinine=.
(32,010 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,116 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,773 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,116 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,773 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,240 real changes made)

. gen max_baseline_creatinine=.
(32,010 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,116 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,773 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,889 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,770 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,121 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,889 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,116 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,615 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,010
25%            0              0       Sum of Wgt.      32,010

50%     10.52709                      Mean           12.50058
                        Largest       Std. Dev.      12.96764
75%     24.93708       42.66397
90%      29.1854       43.15476       Variance       168.1596
95%     31.36723       43.20007       Skewness       .2121327
99%     35.31246       45.59766       Kurtosis       1.304772

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,532        5.34        5.34
         <= |      1,551        5.40       10.74
          = |     20,825       72.52       83.26
          > |      1,636        5.70       88.96
         >= |      1,600        5.57       94.53
          ~ |      1,571        5.47      100.00
------------+-----------------------------------
      Total |     28,715      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,504       54.68       54.68
          1 |     14,506       45.32      100.00
------------+-----------------------------------
      Total |     32,010      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,889       46.51       46.51
          1 |     17,121       53.49      100.00
------------+-----------------------------------
      Total |     32,010      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,428       95.06       95.06
          1 |      1,582        4.94      100.00
------------+-----------------------------------
      Total |     32,010      100.00
(682 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,402       94.98       94.98
          1 |      1,608        5.02      100.00
------------+-----------------------------------
      Total |     32,010      100.00
(715 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,411       95.00       95.00
          1 |      1,599        5.00      100.00
------------+-----------------------------------
      Total |     32,010      100.00
(681 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,387       94.93       94.93
          1 |      1,623        5.07      100.00
------------+-----------------------------------
      Total |     32,010      100.00
(655 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,403       94.98       94.98
          1 |      1,607        5.02      100.00
------------+-----------------------------------
      Total |     32,010      100.00
(596 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,405       94.99       94.99
          1 |      1,605        5.01      100.00
------------+-----------------------------------
      Total |     32,010      100.00
(576 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,984       34.31       34.31
          1 |     21,026       65.69      100.00
------------+-----------------------------------
      Total |     32,010      100.00

. drop if ckd==0
(10,984 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2021_ckd.csv not found)
file ./output/2021_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 closed on:  12 Jan 2023, 18:25:10
-------------------------------------------------------------------------------
