-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 opened on:   4 Jan 2023, 23:10:27

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,693 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,939 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,799 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,331        9.92        9.92
           East Midlands |      3,332        9.93       19.85
                  London |      6,776       20.19       40.03
              North East |      3,299        9.83       49.86
              North West |      3,352        9.99       59.85
              South East |      3,280        9.77       69.62
              South West |      3,422       10.19       79.81
           West Midlands |      3,378       10.06       89.87
Yorkshire and The Humber |      3,399       10.13      100.00
-------------------------+-----------------------------------
                   Total |     33,569      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,635        4.87        4.87
          1 |      6,389       19.03       23.90
          2 |      6,400       19.07       42.97
          3 |      6,429       19.15       62.12
          4 |      6,456       19.23       81.35
          5 |      6,260       18.65      100.00
------------+-----------------------------------
      Total |     33,569      100.00

. drop if imd==0
(1,635 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,970 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(786 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(766 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,961 real changes made, 13,961 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,961 missing values generated)

. gen min_baseline_creatinine=.
(31,934 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,179 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,794 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,179 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,794 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,349 real changes made)

. gen max_baseline_creatinine=.
(31,934 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,179 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,794 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,973 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,585 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,961 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,973 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,179 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,752 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,934
25%            0              0       Sum of Wgt.      31,934

50%     6.304658                      Mean           12.52972
                        Largest       Std. Dev.      13.00983
75%     25.08419       41.96025
90%     29.26371       42.39957       Variance       169.2556
95%     31.43826       42.54762       Skewness       .2093199
99%     35.20976       42.64041       Kurtosis       1.294602

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,594        5.54        5.54
         <= |      1,587        5.52       11.06
          = |     20,765       72.19       83.25
          > |      1,592        5.53       88.78
         >= |      1,726        6.00       94.79
          ~ |      1,500        5.21      100.00
------------+-----------------------------------
      Total |     28,764      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,516       54.85       54.85
          1 |     14,418       45.15      100.00
------------+-----------------------------------
      Total |     31,934      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,764       46.23       46.23
          1 |     17,170       53.77      100.00
------------+-----------------------------------
      Total |     31,934      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,293       94.86       94.86
          1 |      1,641        5.14      100.00
------------+-----------------------------------
      Total |     31,934      100.00
(754 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,361       95.07       95.07
          1 |      1,573        4.93      100.00
------------+-----------------------------------
      Total |     31,934      100.00
(690 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,360       95.07       95.07
          1 |      1,574        4.93      100.00
------------+-----------------------------------
      Total |     31,934      100.00
(659 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,371       95.11       95.11
          1 |      1,563        4.89      100.00
------------+-----------------------------------
      Total |     31,934      100.00
(613 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,390       95.17       95.17
          1 |      1,544        4.83      100.00
------------+-----------------------------------
      Total |     31,934      100.00
(530 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,339       95.01       95.01
          1 |      1,595        4.99      100.00
------------+-----------------------------------
      Total |     31,934      100.00
(571 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,947       34.28       34.28
          1 |     20,987       65.72      100.00
------------+-----------------------------------
      Total |     31,934      100.00

. drop if ckd==0
(10,947 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2021_ckd.csv not found)
file ./output/2021_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 closed on:   4 Jan 2023, 23:10:28
-------------------------------------------------------------------------------
