-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete.log
  log type:  text
 opened on:  20 Sep 2023, 14:25:21

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,102 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(236 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,824
        from master                    47,861  (_merge==1)
        from using                     18,963  (_merge==2)

    matched                             2,139  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,824 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        176        8.23        8.23
Kidney transplant |        186        8.70       16.92
 Modality unclear |         45        2.10       19.03
          Pre KRT |      1,732       80.97      100.00
------------------+-----------------------------------
            Total |      2,139      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(840 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1299 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,299       60.73       60.73
          . |        840       39.27      100.00
------------+-----------------------------------
      Total |      2,139      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(176 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(27 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(142 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(311 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(8 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(45 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(12 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       115         61 |       176 
Kidney transplant |       186          0 |       186 
 Modality unclear |        45          0 |        45 
          Pre KRT |     1,732          0 |     1,732 
------------------+----------------------+----------
            Total |     2,078         61 |     2,139 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       161         15 |       176 
Kidney transplant |       161         25 |       186 
 Modality unclear |        33         12 |        45 
          Pre KRT |     1,481        251 |     1,732 
------------------+----------------------+----------
            Total |     1,836        303 |     2,139 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       176          0 |       176 
Kidney transplant |       186          0 |       186 
 Modality unclear |        12         33 |        45 
          Pre KRT |     1,732          0 |     1,732 
------------------+----------------------+----------
            Total |     2,106         33 |     2,139 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,775        303 |     2,078 
         1 |        61          0 |        61 
-----------+----------------------+----------
     Total |     1,836        303 |     2,139 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(840 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1299 changes made)

. replace ckd_group = 4 if dialysis==1
(61 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(303 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(33 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(647 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,297       60.64       60.64
         CKD stage 3 |        427       19.96       80.60
       CKD stage 4/5 |         18        0.84       81.44
            Dialysis |         61        2.85       84.29
          Transplant |        303       14.17       98.46
KRT unclear modality |         33        1.54      100.00
---------------------+-----------------------------------
               Total |      2,139      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        58        123          0      1,116 |     1,297 
         CKD stage 3 |        41         37          0        349 |       427 
       CKD stage 4/5 |         1          1          0         16 |        18 
            Dialysis |        61          0          0          0 |        61 
          Transplant |        15         25         12        251 |       303 
KRT unclear modality |         0          0         33          0 |        33 
---------------------+--------------------------------------------+----------
               Total |       176        186         45      1,732 |     2,139 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       145         65         58         17 |     1,297 
         CKD stage 3 |        42         18         17          1 |       427 
       CKD stage 4/5 |         2          0          0          0 |        18 
            Dialysis |         6          7          0          1 |        61 
          Transplant |        26         19         12          2 |       303 
KRT unclear modality |         5          1          1          1 |        33 
---------------------+--------------------------------------------+----------
               Total |       226        110         88         22 |     2,139 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,012 |     1,297 
         CKD stage 3 |       349 |       427 
       CKD stage 4/5 |        16 |        18 
            Dialysis |        47 |        61 
          Transplant |       244 |       303 
KRT unclear modality |        25 |        33 
---------------------+-----------+----------
               Total |     1,693 |     2,139 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,172 missing values generated)

. replace sex = 0 if male == "Female"
(1,172 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(965 real changes made, 965 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(965 missing values generated)

. gen min_creatinine_outcome=.
(2,139 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(634 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(540 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(634 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(540 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(768 real changes made)

. gen max_creatinine_outcome=.
(2,139 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(634 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(540 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,174 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,371 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(965 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,174 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(634 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(965 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1174 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(178 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(10 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(965 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1174 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,174       54.89       54.89
          . |        965       45.11      100.00
------------+-----------------------------------
      Total |      2,139      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(110 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(88 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(16 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(22 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(110 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(104 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(226 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,549       72.42       72.42
               CKD 3 |        134        6.26       78.68
     CKD 4/5 pre-KRT |         10        0.47       79.15
            Dialysis |        110        5.14       84.29
   Kidney transplant |        104        4.86       89.15
KRT unclear modality |          6        0.28       89.43
            Deceased |        226       10.57      100.00
---------------------+-----------------------------------
               Total |      2,139      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(840 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1299 changes made)

. replace access_egfr=0 if ckd_group==4
(61 real changes made)

. replace access_egfr=3 if access_egfr==.
(779 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,297
  CKD stage |          90           0         427
  CKD stage |           0           0          18
   Dialysis |           2           0          61
  Transplan |          65           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   219.53904   122.30313       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,139         480           0        480        480

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,297
  CKD stage |         129           0         427
  CKD stage |           3           0          18
   Dialysis |          14           0          61
  Transplan |          86           0         303
  KRT uncle |          13           0          33
------------+------------------------------------
      Total |   216.22207   98.416018       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,139         538           0        538        538

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,297
  CKD stage |         131           0         427
  CKD stage |           8           0          18
   Dialysis |          13           0          61
  Transplan |          64           0         303
  KRT uncle |          21           0          33
------------+------------------------------------
      Total |   244.56615   126.36066       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,139         581           0        581        581

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,297
  CKD stage |          68           0         427
  CKD stage |           3           0          18
   Dialysis |          15           0          61
  Transplan |         100           0         303
  KRT uncle |          19           0          33
------------+------------------------------------
      Total |   220.70173   120.75415       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,139         522           0        522        522

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,297
  CKD stage |         116           0         427
  CKD stage |           6           0          18
   Dialysis |          15           0          61
  Transplan |         103           0         303
  KRT uncle |          20           0          33
------------+------------------------------------
      Total |   218.62225   99.483946       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,139         557           0        557        557

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,297
  CKD stage |         124           0         427
  CKD stage |           5           0          18
   Dialysis |          21           0          61
  Transplan |          73           0         303
  KRT uncle |           0           0          33
------------+------------------------------------
      Total |    249.7798   130.43311       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,139         576           0        576        576

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         394           0       1,297
  CKD stage |         139           0         427
  CKD stage |           2           0          18
   Dialysis |           8           0          61
  Transplan |          58           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   275.20664   150.78614       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,139         607           0        607        607

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,297
  CKD stage |         106           0         427
  CKD stage |           4           0          18
   Dialysis |          12           0          61
  Transplan |          71           0         303
  KRT uncle |           9           0          33
------------+------------------------------------
      Total |   256.69144   143.32276       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,139         573           0        573        573

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,297
  CKD stage |         105           0         427
  CKD stage |          16           0          18
   Dialysis |          21           0          61
  Transplan |          86           0         303
  KRT uncle |           5           0          33
------------+------------------------------------
      Total |   242.54091   127.27587       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,139         577           0        577        577

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,297
  CKD stage |         128           0         427
  CKD stage |           0           0          18
   Dialysis |          19           0          61
  Transplan |          65           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   248.83216   130.76987       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,139         570           0        570        570

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,297
  CKD stage |         105           0         427
  CKD stage |           3           0          18
   Dialysis |           0           0          61
  Transplan |          55           0         303
  KRT uncle |           4           0          33
------------+------------------------------------
      Total |   229.54324   127.98618       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,139         498           0        498        498

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,297
  CKD stage |          97           0         427
  CKD stage |          11           0          18
   Dialysis |           5           0          61
  Transplan |         107           0         303
  KRT uncle |           0           0          33
------------+------------------------------------
      Total |   218.48247   106.96594       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,139         523           0        523        523

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,297
  CKD stage |          68           0         427
  CKD stage |           5           0          18
   Dialysis |          29           0          61
  Transplan |          79           0         303
  KRT uncle |          13           0          33
------------+------------------------------------
      Total |   227.75222   131.18444       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,139         527           0        527        527

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,297
  CKD stage |          90           0         427
  CKD stage |           5           0          18
   Dialysis |          12           0          61
  Transplan |          73           0         303
  KRT uncle |           2           0          33
------------+------------------------------------
      Total |   233.67134   130.59358       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,139         520           0        520        520

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,297
  CKD stage |          85           0         427
  CKD stage |           2           0          18
   Dialysis |          20           0          61
  Transplan |          75           0         303
  KRT uncle |           9           0          33
------------+------------------------------------
      Total |   229.02291   127.44057       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,139         522           0        522        522

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,297
  CKD stage |         119           0         427
  CKD stage |           7           0          18
   Dialysis |           5           0          61
  Transplan |          58           0         303
  KRT uncle |          11           0          33
------------+------------------------------------
      Total |    239.1108   129.02775       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,139         541           0        541        541

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,297
  CKD stage |          72           0         427
  CKD stage |           6           0          18
   Dialysis |          13           0          61
  Transplan |          76           0         303
  KRT uncle |           5           0          33
------------+------------------------------------
      Total |   226.34175     130.649       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,139         503           0        503        503

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,297
  CKD stage |         111           0         427
  CKD stage |          10           0          18
   Dialysis |          28           0          61
  Transplan |          75           0         303
  KRT uncle |           3           0          33
------------+------------------------------------
      Total |   258.06405   140.36496       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,139         597           0        597        597

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,297
  CKD stage |          71           0         427
  CKD stage |           6           0          18
   Dialysis |          17           0          61
  Transplan |          68           0         303
  KRT uncle |          23           0          33
------------+------------------------------------
      Total |   212.06078   120.87502       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,139         494           0        494        494

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,297
  CKD stage |          98           0         427
  CKD stage |           6           0          18
   Dialysis |          18           0          61
  Transplan |          64           0         303
  KRT uncle |          20           0          33
------------+------------------------------------
      Total |   239.30154   133.59275       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,139         552           0        552        552

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,297
  CKD stage |         160           0         427
  CKD stage |           2           0          18
   Dialysis |          10           0          61
  Transplan |          70           0         303
  KRT uncle |          11           0          33
------------+------------------------------------
      Total |   226.66059   102.35406       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,139         557           0        557        557

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,297
  CKD stage |         111           0         427
  CKD stage |          12           0          18
   Dialysis |          10           0          61
  Transplan |          57           0         303
  KRT uncle |          -2           0          33
------------+------------------------------------
      Total |   220.37821   117.33768       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,139         501           0        501        501

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,297
  CKD stage |         106           0         427
  CKD stage |           0           0          18
   Dialysis |          16           0          61
  Transplan |          70           0         303
  KRT uncle |          11           0          33
------------+------------------------------------
      Total |   213.00327   108.58367       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,139         502           0        502        502

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,297
  CKD stage |         106           0         427
  CKD stage |           7           0          18
   Dialysis |          25           0          61
  Transplan |          84           0         303
  KRT uncle |          13           0          33
------------+------------------------------------
      Total |   253.53343   135.83953       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,139         597           0        597        597

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,297
  CKD stage |         114           0         427
  CKD stage |           3           0          18
   Dialysis |          16           0          61
  Transplan |          75           0         303
  KRT uncle |          13           0          33
------------+------------------------------------
      Total |   225.06639   113.65816       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,139         536           0        536        536

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         383           0       1,297
  CKD stage |          90           0         427
  CKD stage |           3           0          18
   Dialysis |           1           0          61
  Transplan |          86           0         303
  KRT uncle |          11           0          33
------------+------------------------------------
      Total |   262.60729   150.53468       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         574           0        574        574

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,297
  CKD stage |         140           0         427
  CKD stage |          12           0          18
   Dialysis |          20           0          61
  Transplan |          56           0         303
  KRT uncle |          -1           0          33
------------+------------------------------------
      Total |   215.41187   103.63684       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         522           0        522        522

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,297
  CKD stage |          99           0         427
  CKD stage |           4           0          18
   Dialysis |          20           0          61
  Transplan |          83           0         303
  KRT uncle |           9           0          33
------------+------------------------------------
      Total |   222.65965   114.71051       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         529           0        529        529

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         427           0       1,297
  CKD stage |          98           0         427
  CKD stage |           6           0          18
   Dialysis |          13           0          61
  Transplan |          73           0         303
  KRT uncle |          18           0          33
------------+------------------------------------
      Total |     289.518   171.55747       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         635           0        635        635

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         398           0       1,297
  CKD stage |         114           0         427
  CKD stage |           6           0          18
   Dialysis |          28           0          61
  Transplan |          62           0         303
  KRT uncle |           5           0          33
------------+------------------------------------
      Total |   273.79663   155.75045       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,139         613           0        613        613

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,297
  CKD stage |         107           0         427
  CKD stage |           6           0          18
   Dialysis |          28           0          61
  Transplan |          75           0         303
  KRT uncle |          12           0          33
------------+------------------------------------
      Total |   239.17999   126.50147       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,139         568           0        568        568

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,297
  CKD stage |          99           0         427
  CKD stage |           7           0          18
   Dialysis |          13           0          61
  Transplan |          53           0         303
  KRT uncle |          10           0          33
------------+------------------------------------
      Total |    210.3684   114.23269       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,139         483           0        483        483

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,297
  CKD stage |          94           0         427
  CKD stage |          16           0          18
   Dialysis |          17           0          61
  Transplan |          67           0         303
  KRT uncle |           8           0          33
------------+------------------------------------
      Total |   218.18233   117.64112       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,139         514           0        514        514

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,297
  CKD stage |         123           0         427
  CKD stage |           3           0          18
   Dialysis |          16           0          61
  Transplan |          66           0         303
  KRT uncle |          11           0          33
------------+------------------------------------
      Total |   220.10005   109.47582       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,139         525           0        525        525

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,297
  CKD stage |         117           0         427
  CKD stage |           2           0          18
   Dialysis |          31           0          61
  Transplan |          91           0         303
  KRT uncle |           3           0          33
------------+------------------------------------
      Total |   223.34596   105.84787       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,139         551           0        551        551

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,297
  CKD stage |         162           0         427
  CKD stage |           2           0          18
   Dialysis |          22           0          61
  Transplan |          59           0         303
  KRT uncle |          14           0          33
------------+------------------------------------
      Total |   276.21786     142.393       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,139         646           0        646        646

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,297
  CKD stage |         122           0         427
  CKD stage |           8           0          18
   Dialysis |          19           0          61
  Transplan |         106           0         303
  KRT uncle |           9           0          33
------------+------------------------------------
      Total |   230.51426    105.9616       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,139         578           0        578        578

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,297
  CKD stage |         107           0         427
  CKD stage |           0           0          18
   Dialysis |          10           0          61
  Transplan |          74           0         303
  KRT uncle |          16           0          33
------------+------------------------------------
      Total |   229.44086   120.32563       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         532           0        532        532

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,297
  CKD stage |         119           0         427
  CKD stage |           2           0          18
   Dialysis |           8           0          61
  Transplan |          85           0         303
  KRT uncle |           4           0          33
------------+------------------------------------
      Total |   234.98831   117.78742       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         546           0        546        546

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,297
  CKD stage |         118           0         427
  CKD stage |           0           0          18
   Dialysis |          11           0          61
  Transplan |          90           0         303
  KRT uncle |           4           0          33
------------+------------------------------------
      Total |   242.23562   122.24101       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         562           0        562        562

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,297
  CKD stage |         119           0         427
  CKD stage |           4           0          18
   Dialysis |           5           0          61
  Transplan |          90           0         303
  KRT uncle |          10           0          33
------------+------------------------------------
      Total |   241.17765   121.16265       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         565           0        565        565

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,297
  CKD stage |          99           0         427
  CKD stage |           0           0          18
   Dialysis |          12           0          61
  Transplan |          88           0         303
  KRT uncle |          14           0          33
------------+------------------------------------
      Total |   218.93876   110.81899       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,139         520           0        520        520

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,297
  CKD stage |          95           0         427
  CKD stage |           9           0          18
   Dialysis |          19           0          61
  Transplan |          72           0         303
  KRT uncle |          23           0          33
------------+------------------------------------
      Total |   232.65965   126.78718       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,139         552           0        552        552

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,297
  CKD stage |         116           0         427
  CKD stage |          14           0          18
   Dialysis |           2           0          61
  Transplan |         101           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |    220.2604   102.76504       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,139         541           0        541        541

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,297
  CKD stage |         117           0         427
  CKD stage |           8           0          18
   Dialysis |           6           0          61
  Transplan |          63           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   216.94437   110.79306       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,139         504           0        504        504

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,297
  CKD stage |          62           0         427
  CKD stage |           3           0          18
   Dialysis |          10           0          61
  Transplan |          72           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |   234.00701   142.08425       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,139         502           0        502        502

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,297
  CKD stage |          95           0         427
  CKD stage |           0           0          18
   Dialysis |           9           0          61
  Transplan |          89           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |   241.12997   130.24125       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,139         545           0        545        545

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,297
  CKD stage |         109           0         427
  CKD stage |           0           0          18
   Dialysis |          15           0          61
  Transplan |         102           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |   241.69285   121.31336       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,139         571           0        571        571

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,297
  CKD stage |          84           0         427
  CKD stage |           8           0          18
   Dialysis |          15           0          61
  Transplan |          85           0         303
  KRT uncle |          14           0          33
------------+------------------------------------
      Total |   236.28845   130.86519       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,139         547           0        547        547

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,297
  CKD stage |          95           0         427
  CKD stage |           4           0          18
   Dialysis |          29           0          61
  Transplan |          90           0         303
  KRT uncle |           8           0          33
------------+------------------------------------
      Total |   243.10379   129.97521       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,139         573           0        573        573

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,297
  CKD stage |         145           0         427
  CKD stage |           3           0          18
   Dialysis |          29           0          61
  Transplan |          68           0         303
  KRT uncle |          12           0          33
------------+------------------------------------
      Total |    255.4792   128.31177       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,139         613           0        613        613

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,297
  CKD stage |         115           0         427
  CKD stage |           0           0          18
   Dialysis |          14           0          61
  Transplan |          78           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |   234.00514   119.95565       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,139         543           0        543        543

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,297
  CKD stage |          79           0         427
  CKD stage |           0           0          18
   Dialysis |          18           0          61
  Transplan |          77           0         303
  KRT uncle |           4           0          33
------------+------------------------------------
      Total |    246.1482   143.30766       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         539           0        539        539

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,297
  CKD stage |          81           0         427
  CKD stage |           5           0          18
   Dialysis |          10           0          61
  Transplan |          57           0         303
  KRT uncle |           4           0          33
------------+------------------------------------
      Total |   212.60402   121.86378       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,139         467           0        467        467

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,297
  CKD stage |         122           0         427
  CKD stage |           5           0          18
   Dialysis |          32           0          61
  Transplan |          46           0         303
  KRT uncle |           9           0          33
------------+------------------------------------
      Total |   225.39224   119.20666       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,139         533           0        533        533

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,297
  CKD stage |         101           0         427
  CKD stage |           9           0          18
   Dialysis |          17           0          61
  Transplan |          91           0         303
  KRT uncle |          17           0          33
------------+------------------------------------
      Total |   241.25012   126.29616       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,139         577           0        577        577

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,297
  CKD stage |         128           0         427
  CKD stage |           0           0          18
   Dialysis |          16           0          61
  Transplan |          90           0         303
  KRT uncle |           3           0          33
------------+------------------------------------
      Total |   260.73072   132.96083       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,139         603           0        603        603

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,297
  CKD stage |          89           0         427
  CKD stage |           4           0          18
   Dialysis |          15           0          61
  Transplan |          62           0         303
  KRT uncle |           5           0          33
------------+------------------------------------
      Total |   243.55774   141.77961       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,139         532           0        532        532

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,297
  CKD stage |          88           0         427
  CKD stage |           0           0          18
   Dialysis |           8           0          61
  Transplan |          82           0         303
  KRT uncle |           5           0          33
------------+------------------------------------
      Total |    202.9065    104.5578       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,139         469           0        469        469

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,297
  CKD stage |         126           0         427
  CKD stage |           3           0          18
   Dialysis |           5           0          61
  Transplan |          65           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   243.20804   127.98671       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,139         549           0        549        549

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,297
  CKD stage |          69           0         427
  CKD stage |           8           0          18
   Dialysis |          11           0          61
  Transplan |          78           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |   228.44226   132.99599       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,139         508           0        508        508

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,297
  CKD stage |         103           0         427
  CKD stage |           0           0          18
   Dialysis |           9           0          61
  Transplan |          80           0         303
  KRT uncle |          18           0          33
------------+------------------------------------
      Total |   221.61197   113.80355       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         522           0        522        522

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,297
  CKD stage |         116           0         427
  CKD stage |           0           0          18
   Dialysis |          10           0          61
  Transplan |          82           0         303
  KRT uncle |          10           0          33
------------+------------------------------------
      Total |   239.55446   122.99295       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         555           0        555        555

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,297
  CKD stage |         106           0         427
  CKD stage |           0           0          18
   Dialysis |           7           0          61
  Transplan |          93           0         303
  KRT uncle |          10           0          33
------------+------------------------------------
      Total |   269.95512   147.94984       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         604           0        604        604

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,297
  CKD stage |          89           0         427
  CKD stage |           0           0          18
   Dialysis |           7           0          61
  Transplan |          45           0         303
  KRT uncle |           8           0          33
------------+------------------------------------
      Total |   217.89247   126.90343       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         468           0        468        468

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,297
  CKD stage |         113           0         427
  CKD stage |           0           0          18
   Dialysis |          12           0          61
  Transplan |          76           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |   223.56381   113.14411       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,139         521           0        521        521

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,297
  CKD stage |          95           0         427
  CKD stage |           5           0          18
   Dialysis |          18           0          61
  Transplan |          61           0         303
  KRT uncle |           5           0          33
------------+------------------------------------
      Total |   208.32632    111.4933       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,139         481           0        481        481

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,297
  CKD stage |          64           0         427
  CKD stage |           2           0          18
   Dialysis |          13           0          61
  Transplan |          70           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |   214.79663   126.23683       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,139         472           0        472        472

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,297
  CKD stage |         104           0         427
  CKD stage |           0           0          18
   Dialysis |          14           0          61
  Transplan |         100           0         303
  KRT uncle |           3           0          33
------------+------------------------------------
      Total |   213.03506   101.27945       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,139         514           0        514        514

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         399           0       1,297
  CKD stage |          96           0         427
  CKD stage |           0           0          18
   Dialysis |          10           0          61
  Transplan |          92           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   274.51099   155.65986       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,139         603           0        603        603

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,297
  CKD stage |         114           0         427
  CKD stage |           6           0          18
   Dialysis |          14           0          61
  Transplan |          60           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |   255.56054   142.72913       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,139         570           0        570        570

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,297
  CKD stage |         138           0         427
  CKD stage |           0           0          18
   Dialysis |          23           0          61
  Transplan |          58           0         303
  KRT uncle |           9           0          33
------------+------------------------------------
      Total |   234.23188   117.80394       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,139         554           0        554        554

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         395           0       1,297
  CKD stage |         124           0         427
  CKD stage |          11           0          18
   Dialysis |          24           0          61
  Transplan |         105           0         303
  KRT uncle |           0           0          33
------------+------------------------------------
      Total |   279.91585   144.61175       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,139         659           0        659        659

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,297
  CKD stage |          87           0         427
  CKD stage |           8           0          18
   Dialysis |           5           0          61
  Transplan |          94           0         303
  KRT uncle |          11           0          33
------------+------------------------------------
      Total |   251.17064   139.95506       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,139         568           0        568        568

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,297
  CKD stage |         114           0         427
  CKD stage |          13           0          18
   Dialysis |          11           0          61
  Transplan |          99           0         303
  KRT uncle |           8           0          33
------------+------------------------------------
      Total |   208.92707   94.365343       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,139         528           0        528        528

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         269           0       1,297
  CKD stage |          90           0         427
  CKD stage |           2           0          18
   Dialysis |           7           0          61
  Transplan |          87           0         303
  KRT uncle |          11           0          33
------------+------------------------------------
      Total |   193.78682   94.973791       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,139         466           0        466        466

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,297
  CKD stage |         112           0         427
  CKD stage |           6           0          18
   Dialysis |          33           0          61
  Transplan |          79           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   255.95372   136.74278       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         601           0        601        601

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,297
  CKD stage |         110           0         427
  CKD stage |           3           0          18
   Dialysis |          18           0          61
  Transplan |          36           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   261.13745   155.90047       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,139         558           0        558        558

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,297
  CKD stage |         102           0         427
  CKD stage |           0           0          18
   Dialysis |          23           0          61
  Transplan |          62           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   245.75643   138.19255       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,139         549           0        549        549

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,297
  CKD stage |          96           0         427
  CKD stage |           5           0          18
   Dialysis |          25           0          61
  Transplan |          48           0         303
  KRT uncle |           3           0          33
------------+------------------------------------
      Total |   219.58672   123.65467       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,139         495           0        495        495

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,297
  CKD stage |         122           0         427
  CKD stage |           8           0          18
   Dialysis |          26           0          61
  Transplan |          92           0         303
  KRT uncle |          18           0          33
------------+------------------------------------
      Total |   219.77419   100.53888       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,139         565           0        565        565

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,297
  CKD stage |         102           0         427
  CKD stage |           6           0          18
   Dialysis |          25           0          61
  Transplan |          85           0         303
  KRT uncle |           5           0          33
------------+------------------------------------
      Total |   218.78869   109.69486       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,139         529           0        529        529

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,297
  CKD stage |          94           0         427
  CKD stage |           4           0          18
   Dialysis |          14           0          61
  Transplan |         131           0         303
  KRT uncle |           2           0          33
------------+------------------------------------
      Total |    216.0547   99.683523       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,139         539           0        539        539

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,297
  CKD stage |          69           0         427
  CKD stage |           3           0          18
   Dialysis |          13           0          61
  Transplan |          97           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |    226.2978   126.18604       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,139         516           0        516        516

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,297
  CKD stage |          84           0         427
  CKD stage |          14           0          18
   Dialysis |          14           0          61
  Transplan |          70           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   206.77606   111.74361       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,139         484           0        484        484

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,297
  CKD stage |         114           0         427
  CKD stage |           4           0          18
   Dialysis |          10           0          61
  Transplan |          58           0         303
  KRT uncle |          10           0          33
------------+------------------------------------
      Total |   264.28799    150.4958       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         580           0        580        580

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,297
  CKD stage |         112           0         427
  CKD stage |           0           0          18
   Dialysis |          10           0          61
  Transplan |          91           0         303
  KRT uncle |           8           0          33
------------+------------------------------------
      Total |   253.33988   132.87661       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         580           0        580        580

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         270           0       1,297
  CKD stage |         115           0         427
  CKD stage |          12           0          18
   Dialysis |          16           0          61
  Transplan |          70           0         303
  KRT uncle |           6           0          33
------------+------------------------------------
      Total |   197.23936   92.991468       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         489           0        489        489

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,297
  CKD stage |         142           0         427
  CKD stage |           0           0          18
   Dialysis |          12           0          61
  Transplan |         101           0         303
  KRT uncle |           5           0          33
------------+------------------------------------
      Total |   224.37447   96.665706       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,139         559           0        559        559

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,297
  CKD stage |         135           0         427
  CKD stage |           5           0          18
   Dialysis |          15           0          61
  Transplan |          87           0         303
  KRT uncle |          16           0          33
------------+------------------------------------
      Total |   237.66293    112.6256       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,139         584           0        584        584

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         276           0       1,297
  CKD stage |         126           0         427
  CKD stage |           4           0          18
   Dialysis |          27           0          61
  Transplan |          89           0         303
  KRT uncle |           7           0          33
------------+------------------------------------
      Total |   206.02665   89.775918       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,139         529           0        529        529

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(92 real changes made)

. replace ethnicity=2 if ethnicity==3
(83 real changes made)

. replace ethnicity=3 if ethnicity==4
(74 real changes made)

. replace ethnicity=4 if ethnicity==6
(92 real changes made)

. replace ethnicity=6 if ethnicity==.
(551 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,927 missing values generated)

. replace region = 2 if region_string=="East"
(201 real changes made)

. replace region = 3 if region_string=="London"
(437 real changes made)

. replace region = 4 if region_string=="North East"
(235 real changes made)

. replace region = 5 if region_string=="North West"
(222 real changes made)

. replace region = 6 if region_string=="South East"
(198 real changes made)

. replace region = 7 if region_string=="South West"
(192 real changes made)

. replace region = 8 if region_string=="West Midlands"
(219 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(223 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,139 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(869 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,270 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2021_ckd_complete.dta not found)
file ./output/2021_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,639
        from master                       500  (_merge==1)
        from using                      2,139  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(500 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,297
  CKD stage |           0           0         427
  CKD stage |           0           0          18
   Dialysis |           0           0          61
  Transplan |           0           0         303
  KRT uncle |           0           0          33
------------+------------------------------------
      Total |           0           0       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,139           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,297
  CKD stage |           0           0         427
  CKD stage |           0           0          18
   Dialysis |           0           0          61
  Transplan |           0           0         303
  KRT uncle |           0           0          33
------------+------------------------------------
      Total |           0           0       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,139           0           0          0          0

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,297
  CKD stage |           0           0         427
  CKD stage |           0           0          18
   Dialysis |           0           0          61
  Transplan |           0           0         303
  KRT uncle |           0           0          33
------------+------------------------------------
      Total |           0           0       2,139

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,139           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2021_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete.log
  log type:  text
 closed on:  20 Sep 2023, 14:25:23
-------------------------------------------------------------------------------
