-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 opened on:   7 Jun 2024, 10:21:34

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve)
(19 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,632 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,973 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,726 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,372       10.02       10.02
           East Midlands |      3,369       10.01       20.02
                  London |      6,632       19.70       39.72
              North East |      3,419       10.15       49.87
              North West |      3,424       10.17       60.04
              South East |      3,287        9.76       69.81
              South West |      3,444       10.23       80.04
           West Midlands |      3,367       10.00       90.04
Yorkshire and The Humber |      3,355        9.96      100.00
-------------------------+-----------------------------------
                   Total |     33,669      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,681        4.99        4.99
          1 |      6,452       19.16       24.16
          2 |      6,400       19.01       43.16
          3 |      6,390       18.98       62.14
          4 |      6,371       18.92       81.07
          5 |      6,375       18.93      100.00
------------+-----------------------------------
      Total |     33,669      100.00

. drop if imd==0
(1,681 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * Code sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. save ./output/input_`dataset', replace
(note: file ./output/input_2021.dta not found)
file ./output/input_2021.dta saved

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,038 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(795 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(764 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,251 real changes made, 14,251 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,251 missing values generated)

. gen min_baseline_creatinine=.
(31,988 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(8,975 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,762 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(8,975 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,762 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,183 real changes made)

. gen max_baseline_creatinine=.
(31,988 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(8,975 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,762 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,737 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,805 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,251 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,737 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(8,975 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,667 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,988
25%            0              0       Sum of Wgt.      31,988

50%      10.8602                      Mean           12.52196
                        Largest       Std. Dev.      12.98277
75%     24.97887       42.23284
90%     29.20246       42.51671       Variance       168.5522
95%     31.42224       44.49918       Skewness       .2109373
99%      35.4276       45.32337       Kurtosis        1.30493

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,567        5.45        5.45
         <= |      1,596        5.55       10.99
          = |     20,779       72.21       83.20
          > |      1,679        5.83       89.04
         >= |      1,557        5.41       94.45
          ~ |      1,598        5.55      100.00
------------+-----------------------------------
      Total |     28,776      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,509       54.74       54.74
   Albuminuria |     14,479       45.26      100.00
---------------+-----------------------------------
         Total |     31,988      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,842       46.40       46.40
          1 |     17,146       53.60      100.00
------------+-----------------------------------
      Total |     31,988      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14251 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17737 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,251 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,401       95.04       95.04
          1 |      1,587        4.96      100.00
------------+-----------------------------------
      Total |     31,988      100.00
(1,587 real changes made)
(750 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,366       94.93       94.93
          1 |      1,622        5.07      100.00
------------+-----------------------------------
      Total |     31,988      100.00
(1,539 real changes made)
(739 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,413       95.08       95.08
          1 |      1,575        4.92      100.00
------------+-----------------------------------
      Total |     31,988      100.00
(1,412 real changes made)
(670 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,372       94.95       94.95
          1 |      1,616        5.05      100.00
------------+-----------------------------------
      Total |     31,988      100.00
(1,406 real changes made)
(686 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,365       94.93       94.93
          1 |      1,623        5.07      100.00
------------+-----------------------------------
      Total |     31,988      100.00
(1,328 real changes made)
(599 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,399       95.03       95.03
          1 |      1,589        4.97      100.00
------------+-----------------------------------
      Total |     31,988      100.00
(1,252 real changes made)
(615 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,651      4,800 |    10,451 
 eGFR >=60 |     5,132      4,282 |     9,414 
  eGFR <60 |     2,005      1,594 |     3,599 
       KRT |     4,721      3,803 |     8,524 
-----------+----------------------+----------
     Total |    17,509     14,479 |    31,988 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,783       33.71       33.71
          1 |     21,205       66.29      100.00
------------+-----------------------------------
      Total |     31,988      100.00

. drop if ckd==0
(10,783 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,800 |     4,800 
 eGFR >=60 |         0      4,282 |     4,282 
  eGFR <60 |     2,005      1,594 |     3,599 
       KRT |     4,721      3,803 |     8,524 
-----------+----------------------+----------
     Total |     6,726     14,479 |    21,205 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2021_ckd.csv not found)
file ./output/2021_ckd.csv saved

. 
. *Create dataset of non-CKD
. merge 1:1 patient_id using ./output/input_`dataset'
(label sexLab already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,783
        from master                         0  (_merge==1)
        from using                     10,783  (_merge==2)

    matched                            21,205  (_merge==3)
    -----------------------------------------

. keep if _merge==2
(21,205 observations deleted)

. drop _merge

. 
. export delimited using "./output/`dataset'_nockd.csv", replace
(note: file ./output/2021_nockd.csv not found)
file ./output/2021_nockd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 closed on:   7 Jun 2024, 10:21:37
-------------------------------------------------------------------------------
