-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_v2.log
  log type:  text
 opened on:  24 Mar 2023, 17:55:37

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,560 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,960 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,732 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,363        9.97        9.97
           East Midlands |      3,330        9.87       19.83
                  London |      6,796       20.14       39.97
              North East |      3,364        9.97       49.94
              North West |      3,382       10.02       59.96
              South East |      3,318        9.83       69.79
              South West |      3,411       10.11       79.90
           West Midlands |      3,419       10.13       90.03
Yorkshire and The Humber |      3,365        9.97      100.00
-------------------------+-----------------------------------
                   Total |     33,748      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,700        5.04        5.04
          1 |      6,320       18.73       23.76
          2 |      6,501       19.26       43.03
          3 |      6,335       18.77       61.80
          4 |      6,490       19.23       81.03
          5 |      6,402       18.97      100.00
------------+-----------------------------------
      Total |     33,748      100.00

. drop if imd==0
(1,700 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,120 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(779 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(854 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,045 real changes made, 14,045 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,045 missing values generated)

. gen min_baseline_creatinine=.
(32,048 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,343 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,660 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,343 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,660 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,447 real changes made)

. gen max_baseline_creatinine=.
(32,048 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,343 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,660 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,003 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,601 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,045 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,003 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,343 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,691 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,048
25%            0              0       Sum of Wgt.      32,048

50%     12.23419                      Mean           12.55796
                        Largest       Std. Dev.      12.97412
75%     24.96603       42.09335
90%     29.19627       42.51878       Variance       168.3279
95%     31.39823       42.60461       Skewness       .2020413
99%     35.16975       42.72704       Kurtosis        1.29621

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,590        5.50        5.50
         <= |      1,656        5.72       11.22
          = |     20,864       72.13       83.35
          > |      1,611        5.57       88.92
         >= |      1,605        5.55       94.47
          ~ |      1,601        5.53      100.00
------------+-----------------------------------
      Total |     28,927      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,561       54.80       54.80
   Albuminuria |     14,487       45.20      100.00
---------------+-----------------------------------
         Total |     32,048      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,870       46.40       46.40
          1 |     17,178       53.60      100.00
------------+-----------------------------------
      Total |     32,048      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14045 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 18003 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,045 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,408       94.88       94.88
          1 |      1,640        5.12      100.00
------------+-----------------------------------
      Total |     32,048      100.00
(1,640 real changes made)
(767 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,459       95.04       95.04
          1 |      1,589        4.96      100.00
------------+-----------------------------------
      Total |     32,048      100.00
(1,513 real changes made)
(673 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,418       94.91       94.91
          1 |      1,630        5.09      100.00
------------+-----------------------------------
      Total |     32,048      100.00
(1,471 real changes made)
(693 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,445       95.00       95.00
          1 |      1,603        5.00      100.00
------------+-----------------------------------
      Total |     32,048      100.00
(1,370 real changes made)
(629 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,426       94.94       94.94
          1 |      1,622        5.06      100.00
------------+-----------------------------------
      Total |     32,048      100.00
(1,299 real changes made)
(609 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,435       94.97       94.97
          1 |      1,613        5.03      100.00
------------+-----------------------------------
      Total |     32,048      100.00
(1,219 real changes made)
(578 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,655      4,645 |    10,300 
 eGFR >=60 |     5,266      4,360 |     9,626 
  eGFR <60 |     1,965      1,645 |     3,610 
       KRT |     4,675      3,837 |     8,512 
-----------+----------------------+----------
     Total |    17,561     14,487 |    32,048 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,921       34.08       34.08
          1 |     21,127       65.92      100.00
------------+-----------------------------------
      Total |     32,048      100.00

. drop if ckd==0
(10,921 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,645 |     4,645 
 eGFR >=60 |         0      4,360 |     4,360 
  eGFR <60 |     1,965      1,645 |     3,610 
       KRT |     4,675      3,837 |     8,512 
-----------+----------------------+----------
     Total |     6,640     14,487 |    21,127 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd_v2.csv", replace
(note: file ./output/2021_ckd_v2.csv not found)
file ./output/2021_ckd_v2.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_v2.log
  log type:  text
 closed on:  24 Mar 2023, 17:55:39
-------------------------------------------------------------------------------
