-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete.log
  log type:  text
 opened on:   9 Feb 2023, 22:13:41

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 21,127 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,819
        from master                    47,846  (_merge==1)
        from using                     18,973  (_merge==2)

    matched                             2,154  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,819 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save 2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        185        8.59        8.59
Kidney transplant |        174        8.08       16.67
 Modality unclear |         38        1.76       18.43
          Pre KRT |      1,757       81.57      100.00
------------------+-----------------------------------
            Total |      2,154      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(848 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1306 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(185 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(174 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(38 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(695 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,323       61.42       61.42
  CKD stage 3 |        421       19.55       80.97
CKD stage 4/5 |         13        0.60       81.57
     Dialysis |        185        8.59       90.16
   Transplant |        174        8.08       98.24
  KRT unclear |         38        1.76      100.00
--------------+-----------------------------------
        Total |      2,154      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,323 |     1,323 
  CKD stage 3 |         0          0          0        421 |       421 
CKD stage 4/5 |         0          0          0         13 |        13 
     Dialysis |       185          0          0          0 |       185 
   Transplant |         0        174          0          0 |       174 
  KRT unclear |         0          0         38          0 |        38 
--------------+--------------------------------------------+----------
        Total |       185        174         38      1,757 |     2,154 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       114         57         53         18 |     1,323 
  CKD stage 3 |        43         25         14          6 |       421 
CKD stage 4/5 |         1          2          0          0 |        13 
     Dialysis |        16          8          7          3 |       185 
   Transplant |        21          7          8          2 |       174 
  KRT unclear |         2          2          2          0 |        38 
--------------+--------------------------------------------+----------
        Total |       197        101         84         29 |     2,154 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |     1,081 |     1,323 
  CKD stage 3 |       333 |       421 
CKD stage 4/5 |        10 |        13 
     Dialysis |       151 |       185 
   Transplant |       136 |       174 
  KRT unclear |        32 |        38 
--------------+-----------+----------
        Total |     1,743 |     2,154 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,118 missing values generated)

. replace sex = 0 if male == "Female"
(1,118 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(963 real changes made, 963 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(963 missing values generated)

. gen min_creatinine_outcome=.
(2,154 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(617 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(574 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(617 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(574 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(765 real changes made)

. gen max_creatinine_outcome=.
(2,154 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(617 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(574 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,191 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,389 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(963 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,191 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(617 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(963 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1191 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(174 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(6 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(5 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(101 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(84 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(29 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(197 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,594       74.00       74.00
               CKD 3 |        141        6.55       80.55
     CKD 4/5 pre-KRT |          8        0.37       80.92
            Dialysis |        101        4.69       85.61
   Kidney transplant |         84        3.90       89.51
KRT unclear modality |         29        1.35       90.85
            Deceased |        197        9.15      100.00
---------------------+-----------------------------------
               Total |      2,154      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,323
  CKD stage |         101           0         421
  CKD stage |           0           0          13
   Dialysis |          36           0         185
  Transplan |          47           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   205.53946   109.79991       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,154         485           0        485        485

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,323
  CKD stage |          66           0         421
  CKD stage |           0           0          13
   Dialysis |          52           0         185
  Transplan |          50           0         174
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   227.19916   136.39684       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,154         505           0        505        505

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,323
  CKD stage |         106           0         421
  CKD stage |           0           0          13
   Dialysis |          64           0         185
  Transplan |          29           0         174
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   252.35747   142.56151       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,154         576           0        576        576

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,323
  CKD stage |         105           0         421
  CKD stage |           4           0          13
   Dialysis |          26           0         185
  Transplan |          25           0         174
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   236.13881   138.54137       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,154         507           0        507        507

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,323
  CKD stage |         125           0         421
  CKD stage |           3           0          13
   Dialysis |          52           0         185
  Transplan |          35           0         174
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |    256.7363   140.56861       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,154         592           0        592        592

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,323
  CKD stage |          79           0         421
  CKD stage |           5           0          13
   Dialysis |          47           0         185
  Transplan |          55           0         174
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   247.78598   147.13947       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,154         565           0        565        565

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         391           0       1,323
  CKD stage |          70           0         421
  CKD stage |           6           0          13
   Dialysis |          43           0         185
  Transplan |          45           0         174
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   261.27112   164.10649       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,154         559           0        559        559

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,323
  CKD stage |          85           0         421
  CKD stage |           4           0          13
   Dialysis |          49           0         185
  Transplan |          42           0         174
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   209.81708   117.31416       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,154         487           0        487        487

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,323
  CKD stage |         126           0         421
  CKD stage |           2           0          13
   Dialysis |          71           0         185
  Transplan |          43           0         174
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   270.83844   146.23238       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,154         636           0        636        636

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,323
  CKD stage |         134           0         421
  CKD stage |           3           0          13
   Dialysis |          53           0         185
  Transplan |          41           0         174
  KRT uncle |          21           0          38
------------+------------------------------------
      Total |   219.93315   107.45797       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,154         554           0        554        554

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,323
  CKD stage |          97           0         421
  CKD stage |          13           0          13
   Dialysis |          28           0         185
  Transplan |          39           0         174
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   250.74373   149.49008       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,154         552           0        552        552

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,323
  CKD stage |          87           0         421
  CKD stage |           1           0          13
   Dialysis |          58           0         185
  Transplan |          27           0         174
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   209.27809   116.99098       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,154         487           0        487        487

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,323
  CKD stage |         113           0         421
  CKD stage |           3           0          13
   Dialysis |          40           0         185
  Transplan |          45           0         174
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   248.65785   138.77129       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,154         570           0        570        570

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,323
  CKD stage |         131           0         421
  CKD stage |           6           0          13
   Dialysis |          54           0         185
  Transplan |          57           0         174
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |     220.987   106.89687       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,154         551           0        551        551

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,323
  CKD stage |         120           0         421
  CKD stage |           0           0          13
   Dialysis |          73           0         185
  Transplan |          49           0         174
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   224.82358   111.05722       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,154         560           0        560        560

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         383           0       1,323
  CKD stage |          94           0         421
  CKD stage |          11           0          13
   Dialysis |          32           0         185
  Transplan |          55           0         174
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   261.08264   154.94148       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,154         587           0        587        587

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,323
  CKD stage |         100           0         421
  CKD stage |           1           0          13
   Dialysis |          34           0         185
  Transplan |          40           0         174
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   218.68663   122.16899       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,154         496           0        496        496

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,323
  CKD stage |          96           0         421
  CKD stage |           5           0          13
   Dialysis |          42           0         185
  Transplan |          39           0         174
  KRT uncle |          25           0          38
------------+------------------------------------
      Total |   230.52275   130.62429       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,154         540           0        540        540

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,323
  CKD stage |         113           0         421
  CKD stage |           1           0          13
   Dialysis |          48           0         185
  Transplan |          55           0         174
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   222.44847   115.11514       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         538           0        538        538

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,323
  CKD stage |          93           0         421
  CKD stage |           1           0          13
   Dialysis |          42           0         185
  Transplan |          45           0         174
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   234.99304    134.9579       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         529           0        529        529

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,323
  CKD stage |         114           0         421
  CKD stage |           7           0          13
   Dialysis |          60           0         185
  Transplan |          31           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   210.11978   107.29846       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         515           0        515        515

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,323
  CKD stage |         101           0         421
  CKD stage |           0           0          13
   Dialysis |          44           0         185
  Transplan |          42           0         174
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |    262.8909   154.17916       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         578           0        578        578

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,323
  CKD stage |          94           0         421
  CKD stage |           3           0          13
   Dialysis |          32           0         185
  Transplan |          37           0         174
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   231.87047   135.42777       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         512           0        512        512

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,323
  CKD stage |          89           0         421
  CKD stage |          -2           0          13
   Dialysis |          37           0         185
  Transplan |          37           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   209.21634    118.4534       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,154         473           0        473        473

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,323
  CKD stage |         138           0         421
  CKD stage |           4           0          13
   Dialysis |          53           0         185
  Transplan |          67           0         174
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   271.20241   141.23172       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,154         656           0        656        656

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,323
  CKD stage |         112           0         421
  CKD stage |           0           0          13
   Dialysis |          36           0         185
  Transplan |          25           0         174
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |    242.1857   138.60491       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,154         535           0        535        535

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,323
  CKD stage |         107           0         421
  CKD stage |           0           0          13
   Dialysis |          57           0         185
  Transplan |          56           0         174
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   247.27066   134.80436       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,154         580           0        580        580

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,323
  CKD stage |          86           0         421
  CKD stage |           9           0          13
   Dialysis |          60           0         185
  Transplan |          33           0         174
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   211.68292   117.50295       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,154         508           0        508        508

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,323
  CKD stage |          98           0         421
  CKD stage |           2           0          13
   Dialysis |          26           0         185
  Transplan |          70           0         174
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   263.78784   154.28127       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,154         596           0        596        596

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,323
  CKD stage |         106           0         421
  CKD stage |           4           0          13
   Dialysis |          43           0         185
  Transplan |          37           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   235.81616   132.10359       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,154         539           0        539        539

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,323
  CKD stage |         109           0         421
  CKD stage |           8           0          13
   Dialysis |          24           0         185
  Transplan |          40           0         174
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   226.92897   127.62282       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         510           0        510        510

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,323
  CKD stage |         123           0         421
  CKD stage |           1           0          13
   Dialysis |          43           0         185
  Transplan |          35           0         174
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   223.00743   116.89337       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         526           0        526        526

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,323
  CKD stage |          87           0         421
  CKD stage |           5           0          13
   Dialysis |          49           0         185
  Transplan |          37           0         174
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   261.50929    157.9151       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         575           0        575        575

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,323
  CKD stage |         124           0         421
  CKD stage |           3           0          13
   Dialysis |          40           0         185
  Transplan |          30           0         174
  KRT uncle |          27           0          38
------------+------------------------------------
      Total |    237.5766   128.63941       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         561           0        561        561

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,323
  CKD stage |          93           0         421
  CKD stage |           4           0          13
   Dialysis |          66           0         185
  Transplan |          54           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   218.81198   115.99466       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         537           0        537        537

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         411           0       1,323
  CKD stage |         126           0         421
  CKD stage |           1           0          13
   Dialysis |          48           0         185
  Transplan |          38           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   284.44011   162.10368       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,154         634           0        634        634

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,323
  CKD stage |         127           0         421
  CKD stage |           3           0          13
   Dialysis |          49           0         185
  Transplan |          42           0         174
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   216.23027   107.99462       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,154         528           0        528        528

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,323
  CKD stage |          62           0         421
  CKD stage |           0           0          13
   Dialysis |          39           0         185
  Transplan |          47           0         174
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   237.44847   148.64497       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,154         511           0        511        511

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,323
  CKD stage |         126           0         421
  CKD stage |           4           0          13
   Dialysis |          35           0         185
  Transplan |          46           0         174
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   253.33055   138.77579       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,154         585           0        585        585

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,323
  CKD stage |          79           0         421
  CKD stage |           4           0          13
   Dialysis |          36           0         185
  Transplan |          28           0         174
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   214.50511   127.81561       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,154         474           0        474        474

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,323
  CKD stage |         121           0         421
  CKD stage |           2           0          13
   Dialysis |          30           0         185
  Transplan |          43           0         174
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |    248.6337    138.2911       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,154         567           0        567        567

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,323
  CKD stage |          82           0         421
  CKD stage |           0           0          13
   Dialysis |          38           0         185
  Transplan |          46           0         174
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   238.19034   141.86844       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,154         528           0        528        528

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,323
  CKD stage |         105           0         421
  CKD stage |           6           0          13
   Dialysis |          46           0         185
  Transplan |          37           0         174
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   237.82126   133.19399       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,154         551           0        551        551

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,323
  CKD stage |         126           0         421
  CKD stage |           2           0          13
   Dialysis |          27           0         185
  Transplan |          51           0         174
  KRT uncle |          18           0          38
------------+------------------------------------
      Total |   248.20984   135.34186       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,154         577           0        577        577

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,323
  CKD stage |         100           0         421
  CKD stage |           2           0          13
   Dialysis |          37           0         185
  Transplan |          45           0         174
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   224.26787    125.0243       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,154         513           0        513        513

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,323
  CKD stage |         107           0         421
  CKD stage |          10           0          13
   Dialysis |          53           0         185
  Transplan |          26           0         174
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   239.52693   135.18653       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         541           0        541        541

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,323
  CKD stage |         120           0         421
  CKD stage |           2           0          13
   Dialysis |          57           0         185
  Transplan |          40           0         174
  KRT uncle |          22           0          38
------------+------------------------------------
      Total |   262.30826   144.25018       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         616           0        616        616

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,323
  CKD stage |         104           0         421
  CKD stage |           5           0          13
   Dialysis |          36           0         185
  Transplan |          32           0         174
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   239.91876   138.34737       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,154         533           0        533        533

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,323
  CKD stage |         114           0         421
  CKD stage |           4           0          13
   Dialysis |          62           0         185
  Transplan |          34           0         174
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   214.63881   110.35436       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,154         514           0        514        514

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,323
  CKD stage |         102           0         421
  CKD stage |           0           0          13
   Dialysis |          55           0         185
  Transplan |          52           0         174
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   200.45311   100.73909       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,154         501           0        501        501

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,323
  CKD stage |         126           0         421
  CKD stage |           0           0          13
   Dialysis |          33           0         185
  Transplan |          42           0         174
  KRT uncle |          25           0          38
------------+------------------------------------
      Total |   232.75441   123.53641       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,154         554           0        554        554

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,323
  CKD stage |         101           0         421
  CKD stage |           4           0          13
   Dialysis |          47           0         185
  Transplan |          63           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   200.43036    100.7412       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,154         504           0        504        504

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,323
  CKD stage |         122           0         421
  CKD stage |           2           0          13
   Dialysis |          33           0         185
  Transplan |          47           0         174
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   217.40065    112.6434       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,154         519           0        519        519

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         266           0       1,323
  CKD stage |         142           0         421
  CKD stage |           3           0          13
   Dialysis |          63           0         185
  Transplan |          46           0         174
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   200.36583   88.143519       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,154         525           0        525        525

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,323
  CKD stage |          87           0         421
  CKD stage |           0           0          13
   Dialysis |          56           0         185
  Transplan |          51           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   231.25487   130.41486       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         538           0        538        538

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,323
  CKD stage |         117           0         421
  CKD stage |           7           0          13
   Dialysis |          44           0         185
  Transplan |          67           0         174
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   223.87465   113.49557       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         555           0        555        555

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,323
  CKD stage |         128           0         421
  CKD stage |           5           0          13
   Dialysis |          35           0         185
  Transplan |          57           0         174
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   240.98004   126.85419       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         570           0        570        570

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,323
  CKD stage |         113           0         421
  CKD stage |           3           0          13
   Dialysis |          42           0         185
  Transplan |          35           0         174
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   218.38115   117.07873       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         505           0        505        505

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,323
  CKD stage |         124           0         421
  CKD stage |           4           0          13
   Dialysis |          78           0         185
  Transplan |          56           0         174
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   237.04828   116.94037       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         596           0        596        596

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,323
  CKD stage |          84           0         421
  CKD stage |           5           0          13
   Dialysis |          64           0         185
  Transplan |          47           0         174
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   242.85608   139.57135       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,154         570           0        570        570

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,323
  CKD stage |         105           0         421
  CKD stage |           0           0          13
   Dialysis |          63           0         185
  Transplan |          63           0         174
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |    230.6922   120.33226       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,154         559           0        559        559

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,323
  CKD stage |          98           0         421
  CKD stage |          11           0          13
   Dialysis |          47           0         185
  Transplan |          49           0         174
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   244.06546   138.70175       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,154         560           0        560        560

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,323
  CKD stage |         102           0         421
  CKD stage |           0           0          13
   Dialysis |          52           0         185
  Transplan |          70           0         174
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   242.20474    130.8269       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,154         583           0        583        583

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,323
  CKD stage |          77           0         421
  CKD stage |           6           0          13
   Dialysis |          44           0         185
  Transplan |          41           0         174
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   219.40761   128.91012       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,154         493           0        493        493

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,323
  CKD stage |         123           0         421
  CKD stage |          12           0          13
   Dialysis |          32           0         185
  Transplan |          35           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   219.04039   115.93145       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,154         520           0        520        520

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,323
  CKD stage |         142           0         421
  CKD stage |           0           0          13
   Dialysis |          49           0         185
  Transplan |          36           0         174
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   224.76602   111.28164       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,154         542           0        542        542

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,323
  CKD stage |         117           0         421
  CKD stage |           4           0          13
   Dialysis |          76           0         185
  Transplan |          55           0         174
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |    243.9559   125.49488       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,154         596           0        596        596

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,323
  CKD stage |          91           0         421
  CKD stage |           6           0          13
   Dialysis |          36           0         185
  Transplan |          55           0         174
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   217.85051   121.23946       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,154         515           0        515        515

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,323
  CKD stage |          96           0         421
  CKD stage |           5           0          13
   Dialysis |          62           0         185
  Transplan |          61           0         174
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   233.66481   126.29116       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,154         562           0        562        562

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,323
  CKD stage |         127           0         421
  CKD stage |           3           0          13
   Dialysis |          53           0         185
  Transplan |          55           0         174
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   248.49304   129.27907       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         604           0        604        604

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         396           0       1,323
  CKD stage |         127           0         421
  CKD stage |           2           0          13
   Dialysis |          55           0         185
  Transplan |          26           0         174
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |    274.9545    155.5498       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         610           0        610        610

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,323
  CKD stage |         129           0         421
  CKD stage |           0           0          13
   Dialysis |          43           0         185
  Transplan |          38           0         174
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   224.24002   115.86097       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,154         524           0        524        524

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,323
  CKD stage |         108           0         421
  CKD stage |          12           0          13
   Dialysis |          25           0         185
  Transplan |          50           0         174
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   205.08449   108.55276       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,154         496           0        496        496

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,323
  CKD stage |          88           0         421
  CKD stage |           4           0          13
   Dialysis |          57           0         185
  Transplan |          27           0         174
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   262.70056   159.11398       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,154         569           0        569        569

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,323
  CKD stage |          98           0         421
  CKD stage |          10           0          13
   Dialysis |          44           0         185
  Transplan |          63           0         174
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   269.57149   156.75259       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,154         614           0        614        614

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,323
  CKD stage |          98           0         421
  CKD stage |           0           0          13
   Dialysis |          54           0         185
  Transplan |          22           0         174
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   239.41876   138.70001       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,154         528           0        528        528

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,323
  CKD stage |          78           0         421
  CKD stage |           3           0          13
   Dialysis |          50           0         185
  Transplan |          60           0         174
  KRT uncle |          25           0          38
------------+------------------------------------
      Total |   202.96518   110.32337       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,154         506           0        506        506

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,323
  CKD stage |          89           0         421
  CKD stage |           4           0          13
   Dialysis |          37           0         185
  Transplan |          53           0         174
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   247.85283   146.30449       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,154         547           0        547        547

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,323
  CKD stage |         102           0         421
  CKD stage |           3           0          13
   Dialysis |          34           0         185
  Transplan |          35           0         174
  KRT uncle |          27           0          38
------------+------------------------------------
      Total |   239.30734   137.62761       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         548           0        548        548

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,323
  CKD stage |         109           0         421
  CKD stage |           0           0          13
   Dialysis |          42           0         185
  Transplan |          78           0         174
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   254.83612   139.32944       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         596           0        596        596

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,323
  CKD stage |         113           0         421
  CKD stage |           2           0          13
   Dialysis |          57           0         185
  Transplan |          33           0         174
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   221.41504   116.76729       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         524           0        524        524

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,323
  CKD stage |          99           0         421
  CKD stage |           0           0          13
   Dialysis |          65           0         185
  Transplan |          51           0         174
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   257.18709   144.55796       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         601           0        601        601

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         280           0       1,323
  CKD stage |         107           0         421
  CKD stage |           2           0          13
   Dialysis |          58           0         185
  Transplan |          45           0         174
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   201.69591   100.84265       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         502           0        502        502

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,323
  CKD stage |          88           0         421
  CKD stage |           3           0          13
   Dialysis |          20           0         185
  Transplan |          45           0         174
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   213.25673   123.57158       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,154         482           0        482        482

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(65 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(70 real changes made)

. replace ethnicity=4 if ethnicity==6
(65 real changes made)

. replace ethnicity=6 if ethnicity==.
(533 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,937 missing values generated)

. replace region = 2 if region_string=="East"
(227 real changes made)

. replace region = 3 if region_string=="London"
(420 real changes made)

. replace region = 4 if region_string=="North East"
(209 real changes made)

. replace region = 5 if region_string=="North West"
(211 real changes made)

. replace region = 6 if region_string=="South East"
(240 real changes made)

. replace region = 7 if region_string=="South West"
(221 real changes made)

. replace region = 8 if region_string=="West Midlands"
(221 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(188 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,154 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(864 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,290 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2021_ckd_complete.dta not found)
file ./output/2021_ckd_complete.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete.log
  log type:  text
 closed on:   9 Feb 2023, 22:13:49
-------------------------------------------------------------------------------
