-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete_v3.log
  log type:  text
 opened on:  21 Apr 2023, 07:56:02

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 21,127 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,819
        from master                    47,846  (_merge==1)
        from using                     18,973  (_merge==2)

    matched                             2,154  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,819 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v3

. save ``dataset'_ckd_complete_v3', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v3
> save 2017_ckd_complete_v3, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        185        8.59        8.59
Kidney transplant |        174        8.08       16.67
 Modality unclear |         38        1.76       18.43
          Pre KRT |      1,757       81.57      100.00
------------------+-----------------------------------
            Total |      2,154      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(848 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1306 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,306       60.63       60.63
          . |        848       39.37      100.00
------------+-----------------------------------
      Total |      2,154      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(185 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(21 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(137 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(291 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(16 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       116         69 |       185 
Kidney transplant |       174          0 |       174 
 Modality unclear |        38          0 |        38 
          Pre KRT |     1,757          0 |     1,757 
------------------+----------------------+----------
            Total |     2,085         69 |     2,154 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       163         22 |       185 
Kidney transplant |       145         29 |       174 
 Modality unclear |        36          2 |        38 
          Pre KRT |     1,535        222 |     1,757 
------------------+----------------------+----------
            Total |     1,879        275 |     2,154 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(848 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1306 changes made)

. replace ckd_group = 4 if dialysis==1
(69 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(275 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(38 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(664 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,328       61.65       61.65
         CKD stage 3 |        430       19.96       81.62
       CKD stage 4/5 |         16        0.74       82.36
            Dialysis |         69        3.20       85.56
          Transplant |        273       12.67       98.24
KRT unclear modality |         38        1.76      100.00
---------------------+-----------------------------------
               Total |      2,154      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        56        111          0      1,161 |     1,328 
         CKD stage 3 |        36         29          0        365 |       430 
       CKD stage 4/5 |         2          5          0          9 |        16 
            Dialysis |        69          0          0          0 |        69 
          Transplant |        22         29          0        222 |       273 
KRT unclear modality |         0          0         38          0 |        38 
---------------------+--------------------------------------------+----------
               Total |       185        174         38      1,757 |     2,154 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       117         54         56         17 |     1,328 
         CKD stage 3 |        46         26         16          8 |       430 
       CKD stage 4/5 |         1          1          0          0 |        16 
            Dialysis |         5          3          2          0 |        69 
          Transplant |        26         15          8          4 |       273 
KRT unclear modality |         2          2          2          0 |        38 
---------------------+--------------------------------------------+----------
               Total |       197        101         84         29 |     2,154 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,084 |     1,328 
         CKD stage 3 |       334 |       430 
       CKD stage 4/5 |        14 |        16 
            Dialysis |        59 |        69 
          Transplant |       220 |       273 
KRT unclear modality |        32 |        38 
---------------------+-----------+----------
               Total |     1,743 |     2,154 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,118 missing values generated)

. replace sex = 0 if male == "Female"
(1,118 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(963 real changes made, 963 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(963 missing values generated)

. gen min_creatinine_outcome=.
(2,154 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(617 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(574 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(617 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(574 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(765 real changes made)

. gen max_creatinine_outcome=.
(2,154 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(617 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(574 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,191 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,389 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(963 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,191 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(617 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(963 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1191 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(173 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(7 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(6 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(963 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1191 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,191       55.29       55.29
          . |        963       44.71      100.00
------------+-----------------------------------
      Total |      2,154      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(101 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(84 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(13 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(29 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(101 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(97 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(197 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,593       73.96       73.96
               CKD 3 |        139        6.45       80.41
     CKD 4/5 pre-KRT |         11        0.51       80.92
            Dialysis |        101        4.69       85.61
   Kidney transplant |         97        4.50       90.11
KRT unclear modality |         16        0.74       90.85
            Deceased |        197        9.15      100.00
---------------------+-----------------------------------
               Total |      2,154      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,328
  CKD stage |         107           0         430
  CKD stage |           0           0          16
   Dialysis |          11           0          69
  Transplan |          58           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   213.58171   110.56328       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,154         485           0        485        485

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,328
  CKD stage |          86           0         430
  CKD stage |           0           0          16
   Dialysis |          27           0          69
  Transplan |          49           0         273
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   234.51439   136.03747       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,154         505           0        505        505

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,328
  CKD stage |         106           0         430
  CKD stage |           0           0          16
   Dialysis |          29           0          69
  Transplan |          62           0         273
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   255.82591   141.10292       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,154         576           0        576        576

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,328
  CKD stage |          93           0         430
  CKD stage |           8           0          16
   Dialysis |           8           0          69
  Transplan |          74           0         273
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |    226.2182   121.58575       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,154         507           0        507        507

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,328
  CKD stage |         103           0         430
  CKD stage |           8           0          16
   Dialysis |          30           0          69
  Transplan |          71           0         273
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   258.27344    141.5603       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,154         592           0        592        592

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,328
  CKD stage |          65           0         430
  CKD stage |           5           0          16
   Dialysis |          18           0          69
  Transplan |          94           0         273
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   252.64995   147.13431       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,154         565           0        565        565

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,328
  CKD stage |          78           0         430
  CKD stage |           0           0          16
   Dialysis |          24           0          69
  Transplan |          79           0         273
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   257.00418   149.06649       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,154         559           0        559        559

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,328
  CKD stage |          95           0         430
  CKD stage |           8           0          16
   Dialysis |           8           0          69
  Transplan |          52           0         273
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   222.63138    123.8069       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,154         487           0        487        487

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,328
  CKD stage |         123           0         430
  CKD stage |           2           0          16
   Dialysis |          32           0          69
  Transplan |          91           0         273
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   270.95032   138.77124       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,154         636           0        636        636

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,328
  CKD stage |         145           0         430
  CKD stage |           7           0          16
   Dialysis |          27           0          69
  Transplan |          67           0         273
  KRT uncle |          21           0          38
------------+------------------------------------
      Total |   215.66852   95.245324       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,154         554           0        554        554

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,328
  CKD stage |          96           0         430
  CKD stage |          13           0          16
   Dialysis |          11           0          69
  Transplan |          68           0         273
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   248.45543   138.87575       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,154         552           0        552        552

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,328
  CKD stage |          92           0         430
  CKD stage |           0           0          16
   Dialysis |          12           0          69
  Transplan |          62           0         273
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   216.72795   117.07287       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,154         487           0        487        487

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,328
  CKD stage |         107           0         430
  CKD stage |           7           0          16
   Dialysis |          23           0          69
  Transplan |          73           0         273
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   246.16435   130.59773       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,154         570           0        570        570

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,328
  CKD stage |         149           0         430
  CKD stage |           6           0          16
   Dialysis |          30           0          69
  Transplan |          63           0         273
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   225.54271   103.45194       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,154         551           0        551        551

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,328
  CKD stage |         119           0         430
  CKD stage |           3           0          16
   Dialysis |          24           0          69
  Transplan |          58           0         273
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   247.18942   131.42201       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,154         560           0        560        560

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         415           0       1,328
  CKD stage |          96           0         430
  CKD stage |          10           0          16
   Dialysis |           0           0          69
  Transplan |          54           0         273
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |    282.1532   169.69681       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,154         587           0        587        587

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,328
  CKD stage |         109           0         430
  CKD stage |           2           0          16
   Dialysis |           5           0          69
  Transplan |          70           0         273
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |    217.7377   110.42297       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,154         496           0        496        496

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,328
  CKD stage |         106           0         430
  CKD stage |           0           0          16
   Dialysis |          19           0          69
  Transplan |          82           0         273
  KRT uncle |          25           0          38
------------+------------------------------------
      Total |    222.4935   110.02882       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,154         540           0        540        540

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,328
  CKD stage |         131           0         430
  CKD stage |           5           0          16
   Dialysis |          26           0          69
  Transplan |          51           0         273
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   228.46657   114.68146       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         538           0        538        538

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,328
  CKD stage |         111           0         430
  CKD stage |           0           0          16
   Dialysis |           5           0          69
  Transplan |          49           0         273
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   248.75302   139.54343       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         529           0        529        529

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,328
  CKD stage |         115           0         430
  CKD stage |           7           0          16
   Dialysis |          25           0          69
  Transplan |          56           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |    217.2753   109.93869       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         515           0        515        515

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,328
  CKD stage |         118           0         430
  CKD stage |           0           0          16
   Dialysis |           8           0          69
  Transplan |          52           0         273
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   272.82173   154.68259       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         578           0        578        578

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,328
  CKD stage |          89           0         430
  CKD stage |           0           0          16
   Dialysis |          18           0          69
  Transplan |          50           0         273
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   238.75673   138.38056       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         512           0        512        512

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         264           0       1,328
  CKD stage |          95           0         430
  CKD stage |           8           0          16
   Dialysis |          12           0          69
  Transplan |          84           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   192.99443   91.811445       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,154         473           0        473        473

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,328
  CKD stage |         144           0         430
  CKD stage |           4           0          16
   Dialysis |          24           0          69
  Transplan |          93           0         273
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   274.60864   133.96851       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,154         656           0        656        656

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,328
  CKD stage |         109           0         430
  CKD stage |           0           0          16
   Dialysis |          17           0          69
  Transplan |          51           0         273
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   242.29805   133.49667       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,154         535           0        535        535

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,328
  CKD stage |         104           0         430
  CKD stage |           5           0          16
   Dialysis |          16           0          69
  Transplan |         110           0         273
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |    243.7623   121.33973       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,154         580           0        580        580

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,328
  CKD stage |          79           0         430
  CKD stage |          13           0          16
   Dialysis |          16           0          69
  Transplan |          61           0         273
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   223.53157   126.86313       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,154         508           0        508        508

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         402           0       1,328
  CKD stage |         102           0         430
  CKD stage |           9           0          16
   Dialysis |           9           0          69
  Transplan |          59           0         273
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   276.30362   160.70743       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,154         596           0        596        596

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,328
  CKD stage |         111           0         430
  CKD stage |           8           0          16
   Dialysis |          13           0          69
  Transplan |          64           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   236.22609   124.72758       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,154         539           0        539        539

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,328
  CKD stage |         117           0         430
  CKD stage |           8           0          16
   Dialysis |          11           0          69
  Transplan |          53           0         273
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   226.59424   118.74575       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         510           0        510        510

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,328
  CKD stage |         129           0         430
  CKD stage |           1           0          16
   Dialysis |          10           0          69
  Transplan |          77           0         273
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   219.75812   102.66533       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         526           0        526        526

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         412           0       1,328
  CKD stage |         108           0         430
  CKD stage |           5           0          16
   Dialysis |          10           0          69
  Transplan |          29           0         273
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   279.79619   169.76418       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         575           0        575        575

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,328
  CKD stage |         108           0         430
  CKD stage |           3           0          16
   Dialysis |          17           0          69
  Transplan |          75           0         273
  KRT uncle |          27           0          38
------------+------------------------------------
      Total |    236.1792   121.80805       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         561           0        561        561

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,328
  CKD stage |         111           0         430
  CKD stage |           3           0          16
   Dialysis |          10           0          69
  Transplan |          68           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   237.83287   125.23299       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         537           0        537        537

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,328
  CKD stage |         129           0         430
  CKD stage |           0           0          16
   Dialysis |          23           0          69
  Transplan |         110           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   263.78969   126.84233       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,154         634           0        634        634

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,328
  CKD stage |         125           0         430
  CKD stage |           0           0          16
   Dialysis |          19           0          69
  Transplan |          79           0         273
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   218.82451   102.11179       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,154         528           0        528        528

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,328
  CKD stage |          70           0         430
  CKD stage |           2           0          16
   Dialysis |          22           0          69
  Transplan |          44           0         273
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   245.44383    152.1353       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,154         511           0        511        511

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,328
  CKD stage |         133           0         430
  CKD stage |           6           0          16
   Dialysis |           9           0          69
  Transplan |          46           0         273
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   265.99025   145.45159       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,154         585           0        585        585

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,328
  CKD stage |          80           0         430
  CKD stage |           9           0          16
   Dialysis |          19           0          69
  Transplan |          48           0         273
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   211.59842   120.60829       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,154         474           0        474        474

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,328
  CKD stage |         119           0         430
  CKD stage |           9           0          16
   Dialysis |           9           0          69
  Transplan |          48           0         273
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |    256.7247   142.36367       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,154         567           0        567        567

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,328
  CKD stage |          73           0         430
  CKD stage |          11           0          16
   Dialysis |           7           0          69
  Transplan |          78           0         273
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   238.91133   137.86069       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,154         528           0        528        528

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,328
  CKD stage |          80           0         430
  CKD stage |           4           0          16
   Dialysis |          28           0          69
  Transplan |          85           0         273
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   236.93733   130.16544       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,154         551           0        551        551

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,328
  CKD stage |         114           0         430
  CKD stage |           1           0          16
   Dialysis |           6           0          69
  Transplan |          83           0         273
  KRT uncle |          18           0          38
------------+------------------------------------
      Total |   252.66156   131.69062       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,154         577           0        577        577

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,328
  CKD stage |          94           0         430
  CKD stage |           7           0          16
   Dialysis |           9           0          69
  Transplan |          59           0         273
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   234.47632   131.36282       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,154         513           0        513        513

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,328
  CKD stage |         102           0         430
  CKD stage |          15           0          16
   Dialysis |           8           0          69
  Transplan |          94           0         273
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   231.16527    117.0194       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         541           0        541        541

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,328
  CKD stage |         128           0         430
  CKD stage |           2           0          16
   Dialysis |          21           0          69
  Transplan |          64           0         273
  KRT uncle |          22           0          38
------------+------------------------------------
      Total |   268.40344   142.61904       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         616           0        616        616

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,328
  CKD stage |          93           0         430
  CKD stage |           2           0          16
   Dialysis |           8           0          69
  Transplan |          79           0         273
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   240.45915   131.30888       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,154         533           0        533        533

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,328
  CKD stage |         112           0         430
  CKD stage |           4           0          16
   Dialysis |          17           0          69
  Transplan |          61           0         273
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   227.95265    119.0029       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,154         514           0        514        514

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,328
  CKD stage |          91           0         430
  CKD stage |           0           0          16
   Dialysis |          21           0          69
  Transplan |          81           0         273
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   211.20984   107.47484       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,154         501           0        501        501

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,328
  CKD stage |         120           0         430
  CKD stage |           3           0          16
   Dialysis |           9           0          69
  Transplan |          64           0         273
  KRT uncle |          25           0          38
------------+------------------------------------
      Total |    238.1221   122.79431       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,154         554           0        554        554

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,328
  CKD stage |         102           0         430
  CKD stage |          11           0          16
   Dialysis |          21           0          69
  Transplan |          59           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |    214.3454    111.6008       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,154         504           0        504        504

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,328
  CKD stage |         125           0         430
  CKD stage |           2           0          16
   Dialysis |          24           0          69
  Transplan |          48           0         273
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   222.52182   113.08604       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,154         519           0        519        519

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,328
  CKD stage |         154           0         430
  CKD stage |           3           0          16
   Dialysis |          24           0          69
  Transplan |          65           0         273
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   208.78877   89.365547       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,154         525           0        525        525

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,328
  CKD stage |         100           0         430
  CKD stage |           2           0          16
   Dialysis |          31           0          69
  Transplan |          71           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   229.90065   120.58518       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         538           0        538        538

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,328
  CKD stage |         135           0         430
  CKD stage |           7           0          16
   Dialysis |          25           0          69
  Transplan |          62           0         273
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   231.85747   112.87462       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         555           0        555        555

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,328
  CKD stage |         140           0         430
  CKD stage |          10           0          16
   Dialysis |           9           0          69
  Transplan |          56           0         273
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   250.68199   128.74021       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         570           0        570        570

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,328
  CKD stage |         114           0         430
  CKD stage |           3           0          16
   Dialysis |          23           0          69
  Transplan |          62           0         273
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   216.38579   108.48435       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         505           0        505        505

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,328
  CKD stage |         140           0         430
  CKD stage |           3           0          16
   Dialysis |          23           0          69
  Transplan |          65           0         273
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |    258.3844    131.0343       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         596           0        596        596

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,328
  CKD stage |          98           0         430
  CKD stage |           5           0          16
   Dialysis |          33           0          69
  Transplan |          43           0         273
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   256.98886   149.65378       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,154         570           0        570        570

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,328
  CKD stage |         113           0         430
  CKD stage |           2           0          16
   Dialysis |          24           0          69
  Transplan |          89           0         273
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   236.89554   117.41805       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,154         559           0        559        559

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,328
  CKD stage |         108           0         430
  CKD stage |           7           0          16
   Dialysis |          12           0          69
  Transplan |          86           0         273
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   245.63324   127.76914       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,154         560           0        560        560

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,328
  CKD stage |         108           0         430
  CKD stage |           4           0          16
   Dialysis |          19           0          69
  Transplan |          78           0         273
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   254.28087   135.52275       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,154         583           0        583        583

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,328
  CKD stage |          80           0         430
  CKD stage |           3           0          16
   Dialysis |          11           0          69
  Transplan |          52           0         273
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   234.47493   138.52365       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,154         493           0        493        493

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,328
  CKD stage |         114           0         430
  CKD stage |           9           0          16
   Dialysis |          13           0          69
  Transplan |          53           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   228.03993   120.37561       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,154         520           0        520        520

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,328
  CKD stage |         140           0         430
  CKD stage |          -1           0          16
   Dialysis |           3           0          69
  Transplan |          98           0         273
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   223.05525   96.949761       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,154         542           0        542        542

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,328
  CKD stage |         135           0         430
  CKD stage |          11           0          16
   Dialysis |           4           0          69
  Transplan |          55           0         273
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   273.99489   149.17699       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,154         596           0        596        596

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,328
  CKD stage |          78           0         430
  CKD stage |          11           0          16
   Dialysis |          21           0          69
  Transplan |          70           0         273
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   223.34958   124.51432       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,154         515           0        515        515

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,328
  CKD stage |         124           0         430
  CKD stage |           5           0          16
   Dialysis |          16           0          69
  Transplan |          39           0         273
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   260.29944   145.95211       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,154         562           0        562        562

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,328
  CKD stage |         128           0         430
  CKD stage |           3           0          16
   Dialysis |          36           0          69
  Transplan |          82           0         273
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   245.80687   119.12064       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         604           0        604        604

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         402           0       1,328
  CKD stage |         122           0         430
  CKD stage |           6           0          16
   Dialysis |          22           0          69
  Transplan |          54           0         273
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   279.86258    157.0942       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         610           0        610        610

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,328
  CKD stage |         134           0         430
  CKD stage |           5           0          16
   Dialysis |          20           0          69
  Transplan |          68           0         273
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   218.55617   102.17293       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,154         524           0        524        524

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,328
  CKD stage |         111           0         430
  CKD stage |           7           0          16
   Dialysis |           5           0          69
  Transplan |          54           0         273
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   218.70056   114.52577       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,154         496           0        496        496

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,328
  CKD stage |          85           0         430
  CKD stage |           4           0          16
   Dialysis |          25           0          69
  Transplan |          65           0         273
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   263.48839   154.81649       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,154         569           0        569        569

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         395           0       1,328
  CKD stage |          98           0         430
  CKD stage |          10           0          16
   Dialysis |          16           0          69
  Transplan |          89           0         273
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   275.06453   153.21493       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,154         614           0        614        614

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,328
  CKD stage |          96           0         430
  CKD stage |           0           0          16
   Dialysis |          15           0          69
  Transplan |          62           0         273
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   242.77669   136.00194       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,154         528           0        528        528

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,328
  CKD stage |          76           0         430
  CKD stage |           6           0          16
   Dialysis |          27           0          69
  Transplan |          74           0         273
  KRT uncle |          25           0          38
------------+------------------------------------
      Total |   209.62628   112.67009       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,154         506           0        506        506

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,328
  CKD stage |         100           0         430
  CKD stage |           0           0          16
   Dialysis |          19           0          69
  Transplan |          85           0         273
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   242.21448   127.96416       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,154         547           0        547        547

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,328
  CKD stage |          87           0         430
  CKD stage |           0           0          16
   Dialysis |          25           0          69
  Transplan |          90           0         273
  KRT uncle |          27           0          38
------------+------------------------------------
      Total |   226.72377    117.9479       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         548           0        548        548

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         407           0       1,328
  CKD stage |         116           0         430
  CKD stage |           6           0          16
   Dialysis |          12           0          69
  Transplan |          52           0         273
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   281.15599   161.63085       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         596           0        596        596

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,328
  CKD stage |         114           0         430
  CKD stage |           2           0          16
   Dialysis |          10           0          69
  Transplan |          58           0         273
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   235.87094   125.55139       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         524           0        524        524

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         402           0       1,328
  CKD stage |         113           0         430
  CKD stage |           0           0          16
   Dialysis |          13           0          69
  Transplan |          58           0         273
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   278.43408   158.44308       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,154         601           0        601        601

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,328
  CKD stage |         108           0         430
  CKD stage |           2           0          16
   Dialysis |          13           0          69
  Transplan |          77           0         273
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   211.95265   103.61358       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,154         502           0        502        502

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,328
  CKD stage |          90           0         430
  CKD stage |           3           0          16
   Dialysis |           7           0          69
  Transplan |          63           0         273
  KRT uncle |          16           0          38
------------+------------------------------------
      Total |   213.28784   115.07993       2,154

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,154         482           0        482        482

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(65 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(70 real changes made)

. replace ethnicity=4 if ethnicity==6
(65 real changes made)

. replace ethnicity=6 if ethnicity==.
(533 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,937 missing values generated)

. replace region = 2 if region_string=="East"
(227 real changes made)

. replace region = 3 if region_string=="London"
(420 real changes made)

. replace region = 4 if region_string=="North East"
(209 real changes made)

. replace region = 5 if region_string=="North West"
(211 real changes made)

. replace region = 6 if region_string=="South East"
(240 real changes made)

. replace region = 7 if region_string=="South West"
(221 real changes made)

. replace region = 8 if region_string=="West Midlands"
(221 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(188 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,154 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(864 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,290 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v3.dta", replace
(note: file ./output/2021_ckd_complete_v3.dta not found)
file ./output/2021_ckd_complete_v3.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete_v3.log
  log type:  text
 closed on:  21 Apr 2023, 07:56:05
-------------------------------------------------------------------------------
