-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete.log
  log type:  text
 opened on:  21 Nov 2023, 18:36:58

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,102 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(236 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,912
        from master                    47,905  (_merge==1)
        from using                     19,007  (_merge==2)

    matched                             2,095  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,912 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        219       10.45       10.45
Kidney transplant |        177        8.45       18.90
 Modality unclear |         44        2.10       21.00
          Pre KRT |      1,655       79.00      100.00
------------------+-----------------------------------
            Total |      2,095      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(853 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1242 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,242       59.28       59.28
          . |        853       40.72      100.00
------------+-----------------------------------
      Total |      2,095      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(219 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(28 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(160 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(289 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(11 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(44 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(8 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       132         87 |       219 
Kidney transplant |       177          0 |       177 
 Modality unclear |        44          0 |        44 
          Pre KRT |     1,655          0 |     1,655 
------------------+----------------------+----------
            Total |     2,008         87 |     2,095 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       199         20 |       219 
Kidney transplant |       153         24 |       177 
 Modality unclear |        36          8 |        44 
          Pre KRT |     1,429        226 |     1,655 
------------------+----------------------+----------
            Total |     1,817        278 |     2,095 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       219          0 |       219 
Kidney transplant |       177          0 |       177 
 Modality unclear |         8         36 |        44 
          Pre KRT |     1,655          0 |     1,655 
------------------+----------------------+----------
            Total |     2,059         36 |     2,095 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,730        278 |     2,008 
         1 |        87          0 |        87 
-----------+----------------------+----------
     Total |     1,817        278 |     2,095 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(853 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1242 changes made)

. replace ckd_group = 4 if dialysis==1
(87 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(278 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(36 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(638 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,307       62.39       62.39
         CKD stage 3 |        371       17.71       80.10
       CKD stage 4/5 |         16        0.76       80.86
            Dialysis |         87        4.15       85.01
          Transplant |        278       13.27       98.28
KRT unclear modality |         36        1.72      100.00
---------------------+-----------------------------------
               Total |      2,095      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        78        120          0      1,109 |     1,307 
         CKD stage 3 |        32         32          0        307 |       371 
       CKD stage 4/5 |         2          1          0         13 |        16 
            Dialysis |        87          0          0          0 |        87 
          Transplant |        20         24          8        226 |       278 
KRT unclear modality |         0          0         36          0 |        36 
---------------------+--------------------------------------------+----------
               Total |       219        177         44      1,655 |     2,095 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       126         65         48         10 |     1,307 
         CKD stage 3 |        36         11         16          2 |       371 
       CKD stage 4/5 |         3          1          2          0 |        16 
            Dialysis |        11          1          3          0 |        87 
          Transplant |        27         16         13          3 |       278 
KRT unclear modality |         5          0          0          1 |        36 
---------------------+--------------------------------------------+----------
               Total |       208         94         82         16 |     2,095 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,058 |     1,307 
         CKD stage 3 |       306 |       371 
       CKD stage 4/5 |        10 |        16 
            Dialysis |        72 |        87 
          Transplant |       219 |       278 
KRT unclear modality |        30 |        36 
---------------------+-----------+----------
               Total |     1,695 |     2,095 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,145 missing values generated)

. replace sex = 0 if male == "Female"
(1,145 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(884 real changes made, 884 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(884 missing values generated)

. gen min_creatinine_outcome=.
(2,095 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(667 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(544 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(667 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(544 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(764 real changes made)

. gen max_creatinine_outcome=.
(2,095 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(667 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(544 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,211 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,331 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(884 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,211 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(667 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(884 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1211 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(183 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(4 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(3 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(884 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1211 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,211       57.80       57.80
          . |        884       42.20      100.00
------------+-----------------------------------
      Total |      2,095      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(94 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(82 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(6 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(16 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(94 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(88 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(208 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,549       73.94       73.94
               CKD 3 |        142        6.78       80.72
     CKD 4/5 pre-KRT |          4        0.19       80.91
            Dialysis |         94        4.49       85.39
   Kidney transplant |         88        4.20       89.59
KRT unclear modality |         10        0.48       90.07
            Deceased |        208        9.93      100.00
---------------------+-----------------------------------
               Total |      2,095      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(853 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1242 changes made)

. replace access_egfr=0 if ckd_group==4
(87 real changes made)

. replace access_egfr=3 if access_egfr==.
(766 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes (including by month)
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,307
  CKD stage |          77           0         371
  CKD stage |           7           0          16
   Dialysis |          21           0          87
  Transplan |          90           0         278
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |    242.4821    134.3211       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,095         548           0        548        548

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,307
  CKD stage |          91           0         371
  CKD stage |           7           0          16
   Dialysis |          26           0          87
  Transplan |          50           0         278
  KRT uncle |           3           0          36
------------+------------------------------------
      Total |   236.04916   135.03799       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,095         517           0        517        517

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,307
  CKD stage |         104           0         371
  CKD stage |           0           0          16
   Dialysis |          30           0          87
  Transplan |          71           0         278
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   242.01193   128.86318       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,095         557           0        557        557

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,307
  CKD stage |          95           0         371
  CKD stage |          13           0          16
   Dialysis |          24           0          87
  Transplan |          76           0         278
  KRT uncle |          17           0          36
------------+------------------------------------
      Total |   202.35513   100.07206       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,095         504           0        504        504

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,307
  CKD stage |          98           0         371
  CKD stage |           4           0          16
   Dialysis |          16           0          87
  Transplan |          63           0         278
  KRT uncle |           6           0          36
------------+------------------------------------
      Total |   224.90215   121.46081       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,095         505           0        505        505

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,307
  CKD stage |          70           0         371
  CKD stage |           5           0          16
   Dialysis |          27           0          87
  Transplan |          66           0         278
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   219.64439   124.65497       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,095         495           0        495        495

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,307
  CKD stage |         140           0         371
  CKD stage |           0           0          16
   Dialysis |          28           0          87
  Transplan |          57           0         278
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   239.61814   120.27728       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,095         568           0        568        568

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,307
  CKD stage |          99           0         371
  CKD stage |           7           0          16
   Dialysis |          17           0          87
  Transplan |          89           0         278
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |   226.08115   114.90816       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,095         531           0        531        531

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,307
  CKD stage |         112           0         371
  CKD stage |          13           0          16
   Dialysis |          17           0          87
  Transplan |          56           0         278
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |   221.60621   116.20076       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,095         516           0        516        516

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,307
  CKD stage |         122           0         371
  CKD stage |           2           0          16
   Dialysis |          13           0          87
  Transplan |          58           0         278
  KRT uncle |          33           0          36
------------+------------------------------------
      Total |   244.40955   129.52672       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,095         571           0        571        571

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,307
  CKD stage |          87           0         371
  CKD stage |           4           0          16
   Dialysis |           9           0          87
  Transplan |          62           0         278
  KRT uncle |          14           0          36
------------+------------------------------------
      Total |   239.51265    136.9513       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,095         521           0        521        521

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,307
  CKD stage |         105           0         371
  CKD stage |          12           0          16
   Dialysis |          15           0          87
  Transplan |          63           0         278
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   200.66874    100.4844       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,095         483           0        483        483

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,307
  CKD stage |         104           0         371
  CKD stage |           1           0          16
   Dialysis |          22           0          87
  Transplan |          65           0         278
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   238.32697   128.67407       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,095         536           0        536        536

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,307
  CKD stage |         119           0         371
  CKD stage |           0           0          16
   Dialysis |          31           0          87
  Transplan |          74           0         278
  KRT uncle |          21           0          36
------------+------------------------------------
      Total |   250.27064   129.00378       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,095         594           0        594        594

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,307
  CKD stage |          93           0         371
  CKD stage |           0           0          16
   Dialysis |          27           0          87
  Transplan |          83           0         278
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   240.90788   128.71827       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,095         554           0        554        554

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,307
  CKD stage |          77           0         371
  CKD stage |           3           0          16
   Dialysis |          10           0          87
  Transplan |          45           0         278
  KRT uncle |           3           0          36
------------+------------------------------------
      Total |   222.22959   132.04684       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,095         462           0        462        462

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,307
  CKD stage |         113           0         371
  CKD stage |           4           0          16
   Dialysis |          25           0          87
  Transplan |          71           0         278
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |   233.34368   120.04234       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,095         543           0        543        543

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,307
  CKD stage |          56           0         371
  CKD stage |          10           0          16
   Dialysis |          22           0          87
  Transplan |          84           0         278
  KRT uncle |           2           0          36
------------+------------------------------------
      Total |   240.44105   141.89408       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,095         524           0        524        524

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,307
  CKD stage |         115           0         371
  CKD stage |           5           0          16
   Dialysis |          29           0          87
  Transplan |          67           0         278
  KRT uncle |          18           0          36
------------+------------------------------------
      Total |   252.90406   134.50967       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,095         590           0        590        590

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,307
  CKD stage |         110           0         371
  CKD stage |           8           0          16
   Dialysis |          17           0          87
  Transplan |          74           0         278
  KRT uncle |          10           0          36
------------+------------------------------------
      Total |   232.99475   120.41543       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,095         544           0        544        544

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,307
  CKD stage |          45           0         371
  CKD stage |           0           0          16
   Dialysis |          28           0          87
  Transplan |          76           0         278
  KRT uncle |           1           0          36
------------+------------------------------------
      Total |   257.55084   160.85592       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,095         532           0        532        532

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,307
  CKD stage |          85           0         371
  CKD stage |           3           0          16
   Dialysis |          21           0          87
  Transplan |          73           0         278
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   217.90549   117.09837       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,095         497           0        497        497

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,307
  CKD stage |         112           0         371
  CKD stage |           0           0          16
   Dialysis |          48           0          87
  Transplan |          49           0         278
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |   225.47112   118.75177       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,095         525           0        525        525

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,307
  CKD stage |          67           0         371
  CKD stage |           0           0          16
   Dialysis |          41           0          87
  Transplan |          47           0         278
  KRT uncle |           2           0          36
------------+------------------------------------
      Total |   227.58616   136.20303       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,095         490           0        490        490

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,307
  CKD stage |          74           0         371
  CKD stage |           7           0          16
   Dialysis |          27           0          87
  Transplan |          94           0         278
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |   200.94893   101.78825       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,095         489           0        489        489

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,307
  CKD stage |          98           0         371
  CKD stage |           1           0          16
   Dialysis |          21           0          87
  Transplan |          81           0         278
  KRT uncle |          -1           0          36
------------+------------------------------------
      Total |   209.26301   104.45028       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         489           0        489        489

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,307
  CKD stage |          75           0         371
  CKD stage |          12           0          16
   Dialysis |          10           0          87
  Transplan |          68           0         278
  KRT uncle |          12           0          36
------------+------------------------------------
      Total |   251.97709   148.87411       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         544           0        544        544

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,307
  CKD stage |          86           0         371
  CKD stage |           0           0          16
   Dialysis |          37           0          87
  Transplan |         100           0         278
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   219.91456   109.52175       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         540           0        540        540

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         415           0       1,307
  CKD stage |         100           0         371
  CKD stage |           0           0          16
   Dialysis |          16           0          87
  Transplan |          87           0         278
  KRT uncle |          10           0          36
------------+------------------------------------
      Total |   288.99427    163.4872       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         628           0        628        628

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,307
  CKD stage |          97           0         371
  CKD stage |           3           0          16
   Dialysis |          15           0          87
  Transplan |          48           0         278
  KRT uncle |           1           0          36
------------+------------------------------------
      Total |   232.58138   132.25608       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,095         498           0        498        498

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,307
  CKD stage |          84           0         371
  CKD stage |           2           0          16
   Dialysis |          21           0          87
  Transplan |          63           0         278
  KRT uncle |          15           0          36
------------+------------------------------------
      Total |    212.1642   115.38649       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,095         486           0        486        486

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         276           0       1,307
  CKD stage |         126           0         371
  CKD stage |          12           0          16
   Dialysis |          32           0          87
  Transplan |          56           0         278
  KRT uncle |          15           0          36
------------+------------------------------------
      Total |   203.60955   96.676462       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,095         517           0        517        517

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,307
  CKD stage |         121           0         371
  CKD stage |           4           0          16
   Dialysis |           8           0          87
  Transplan |          63           0         278
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   217.53365   109.35217       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,095         509           0        509        509

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,307
  CKD stage |          90           0         371
  CKD stage |          12           0          16
   Dialysis |          15           0          87
  Transplan |          66           0         278
  KRT uncle |          16           0          36
------------+------------------------------------
      Total |   250.27733   142.30703       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,095         559           0        559        559

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,307
  CKD stage |          96           0         371
  CKD stage |           4           0          16
   Dialysis |          28           0          87
  Transplan |          66           0         278
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   235.54654   127.93487       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,095         541           0        541        541

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         409           0       1,307
  CKD stage |          93           0         371
  CKD stage |           6           0          16
   Dialysis |          19           0          87
  Transplan |          81           0         278
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   283.43723   162.65726       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,095         621           0        621        621

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,307
  CKD stage |          91           0         371
  CKD stage |           9           0          16
   Dialysis |          23           0          87
  Transplan |          47           0         278
  KRT uncle |          14           0          36
------------+------------------------------------
      Total |   212.02387   117.20535       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,095         486           0        486        486

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,307
  CKD stage |         109           0         371
  CKD stage |           4           0          16
   Dialysis |          12           0          87
  Transplan |          67           0         278
  KRT uncle |          15           0          36
------------+------------------------------------
      Total |   239.22291   127.83469       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         544           0        544        544

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         264           0       1,307
  CKD stage |          86           0         371
  CKD stage |           0           0          16
   Dialysis |          19           0          87
  Transplan |         103           0         278
  KRT uncle |          22           0          36
------------+------------------------------------
      Total |   194.76516   91.062157       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         494           0        494        494

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,307
  CKD stage |         118           0         371
  CKD stage |           2           0          16
   Dialysis |          14           0          87
  Transplan |          50           0         278
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   247.17375   136.31189       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         539           0        539        539

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,307
  CKD stage |          94           0         371
  CKD stage |           7           0          16
   Dialysis |          13           0          87
  Transplan |          70           0         278
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |   225.54177   121.84261       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         503           0        503        503

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,307
  CKD stage |          97           0         371
  CKD stage |           9           0          16
   Dialysis |          15           0          87
  Transplan |          60           0         278
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |   230.59666   126.90903       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,095         517           0        517        517

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,307
  CKD stage |          91           0         371
  CKD stage |           0           0          16
   Dialysis |          18           0          87
  Transplan |          70           0         278
  KRT uncle |          10           0          36
------------+------------------------------------
      Total |   247.17184   138.66345       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,095         543           0        543        543

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,307
  CKD stage |          77           0         371
  CKD stage |          15           0          16
   Dialysis |          19           0          87
  Transplan |          38           0         278
  KRT uncle |          21           0          36
------------+------------------------------------
      Total |   205.23103   119.09442       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,095         467           0        467        467

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,307
  CKD stage |          79           0         371
  CKD stage |           4           0          16
   Dialysis |          27           0          87
  Transplan |          68           0         278
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   219.00048   120.52653       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,095         501           0        501        501

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,307
  CKD stage |          94           0         371
  CKD stage |           4           0          16
   Dialysis |          12           0          87
  Transplan |          34           0         278
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |   249.48401   150.35889       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,095         514           0        514        514

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,307
  CKD stage |          90           0         371
  CKD stage |           8           0          16
   Dialysis |          13           0          87
  Transplan |          74           0         278
  KRT uncle |          16           0          36
------------+------------------------------------
      Total |   208.17852   108.02717       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,095         492           0        492        492

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,307
  CKD stage |          93           0         371
  CKD stage |          15           0          16
   Dialysis |          28           0          87
  Transplan |          84           0         278
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   259.87828   142.77229       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,095         599           0        599        599

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,307
  CKD stage |          79           0         371
  CKD stage |           4           0          16
   Dialysis |          13           0          87
  Transplan |          55           0         278
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |   219.62434   126.40505       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,095         468           0        468        468

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         275           0       1,307
  CKD stage |          83           0         371
  CKD stage |           3           0          16
   Dialysis |          24           0          87
  Transplan |          89           0         278
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   199.24582   98.904487       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,095         483           0        483        483

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         427           0       1,307
  CKD stage |          80           0         371
  CKD stage |           0           0          16
   Dialysis |          22           0          87
  Transplan |          49           0         278
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |   288.11122   179.52551       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,095         586           0        586        586

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,307
  CKD stage |          82           0         371
  CKD stage |           2           0          16
   Dialysis |          63           0          87
  Transplan |          76           0         278
  KRT uncle |          10           0          36
------------+------------------------------------
      Total |   223.92745     117.856       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,095         548           0        548        548

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,307
  CKD stage |          96           0         371
  CKD stage |           5           0          16
   Dialysis |          27           0          87
  Transplan |          66           0         278
  KRT uncle |          15           0          36
------------+------------------------------------
      Total |   226.18902   120.72759       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         528           0        528        528

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,307
  CKD stage |         107           0         371
  CKD stage |           0           0          16
   Dialysis |          17           0          87
  Transplan |          64           0         278
  KRT uncle |          20           0          36
------------+------------------------------------
      Total |   214.40286   109.67619       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,095         506           0        506        506

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,307
  CKD stage |         108           0         371
  CKD stage |           5           0          16
   Dialysis |          15           0          87
  Transplan |          76           0         278
  KRT uncle |          23           0          36
------------+------------------------------------
      Total |   224.28926   113.54338       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,095         538           0        538        538

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,307
  CKD stage |         121           0         371
  CKD stage |           4           0          16
   Dialysis |          31           0          87
  Transplan |          84           0         278
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |   221.76181   104.49566       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,095         546           0        546        546

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,307
  CKD stage |          84           0         371
  CKD stage |          11           0          16
   Dialysis |          11           0          87
  Transplan |          68           0         278
  KRT uncle |          18           0          36
------------+------------------------------------
      Total |    208.7895   112.15864       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,095         487           0        487        487

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,307
  CKD stage |          67           0         371
  CKD stage |           3           0          16
   Dialysis |          20           0          87
  Transplan |          64           0         278
  KRT uncle |           3           0          36
------------+------------------------------------
      Total |   240.86348   143.69929       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,095         509           0        509        509

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         260           0       1,307
  CKD stage |          68           0         371
  CKD stage |           6           0          16
   Dialysis |          27           0          87
  Transplan |          92           0         278
  KRT uncle |          18           0          36
------------+------------------------------------
      Total |   187.93174   94.007247       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,095         471           0        471        471

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,307
  CKD stage |         101           0         371
  CKD stage |           6           0          16
   Dialysis |          25           0          87
  Transplan |          80           0         278
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   271.83484    150.7317       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,095         611           0        611        611

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,307
  CKD stage |          85           0         371
  CKD stage |           6           0          16
   Dialysis |          18           0          87
  Transplan |          80           0         278
  KRT uncle |           1           0          36
------------+------------------------------------
      Total |   237.34558   130.73136       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,095         528           0        528        528

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,307
  CKD stage |          95           0         371
  CKD stage |           3           0          16
   Dialysis |          31           0          87
  Transplan |          64           0         278
  KRT uncle |          18           0          36
------------+------------------------------------
      Total |   215.96706   113.26159       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         514           0        514        514

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,307
  CKD stage |         118           0         371
  CKD stage |          11           0          16
   Dialysis |          31           0          87
  Transplan |          79           0         278
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |    248.1222   126.62777       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         592           0        592        592

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,307
  CKD stage |         108           0         371
  CKD stage |           3           0          16
   Dialysis |          13           0          87
  Transplan |          71           0         278
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   223.87637   115.57597       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         514           0        514        514

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,307
  CKD stage |         108           0         371
  CKD stage |           1           0          16
   Dialysis |          16           0          87
  Transplan |          63           0         278
  KRT uncle |           3           0          36
------------+------------------------------------
      Total |   242.19523   131.71952       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         534           0        534        534

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,307
  CKD stage |         113           0         371
  CKD stage |           3           0          16
   Dialysis |          14           0          87
  Transplan |          63           0         278
  KRT uncle |          10           0          36
------------+------------------------------------
      Total |   214.43532   108.86513       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,095         500           0        500        500

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,307
  CKD stage |          84           0         371
  CKD stage |           2           0          16
   Dialysis |           4           0          87
  Transplan |          60           0         278
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |   253.36277   149.97783       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,095         527           0        527        527

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,307
  CKD stage |         116           0         371
  CKD stage |           7           0          16
   Dialysis |          16           0          87
  Transplan |          85           0         278
  KRT uncle |          11           0          36
------------+------------------------------------
      Total |   252.95322   130.83165       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,095         588           0        588        588

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,307
  CKD stage |          70           0         371
  CKD stage |           0           0          16
   Dialysis |          34           0          87
  Transplan |          62           0         278
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   239.29547   140.45292       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,095         523           0        523        523

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,307
  CKD stage |         111           0         371
  CKD stage |           5           0          16
   Dialysis |          12           0          87
  Transplan |          58           0         278
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   253.95274   141.09862       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,095         561           0        561        561

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,307
  CKD stage |          95           0         371
  CKD stage |           2           0          16
   Dialysis |           6           0          87
  Transplan |          73           0         278
  KRT uncle |          22           0          36
------------+------------------------------------
      Total |   199.96372   101.01102       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,095         475           0        475        475

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,307
  CKD stage |          78           0         371
  CKD stage |          12           0          16
   Dialysis |          13           0          87
  Transplan |          56           0         278
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   204.73699    114.6703       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,095         456           0        456        456

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,307
  CKD stage |          83           0         371
  CKD stage |          13           0          16
   Dialysis |          13           0          87
  Transplan |          62           0         278
  KRT uncle |           5           0          36
------------+------------------------------------
      Total |    220.1685   123.18686       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,095         491           0        491        491

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,307
  CKD stage |          95           0         371
  CKD stage |           6           0          16
   Dialysis |          32           0          87
  Transplan |          61           0         278
  KRT uncle |          13           0          36
------------+------------------------------------
      Total |   235.51122   129.20343       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,095         542           0        542        542

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,307
  CKD stage |         103           0         371
  CKD stage |           9           0          16
   Dialysis |          28           0          87
  Transplan |          70           0         278
  KRT uncle |           1           0          36
------------+------------------------------------
      Total |   247.75465   134.34784       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,095         562           0        562        562

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,307
  CKD stage |          83           0         371
  CKD stage |           4           0          16
   Dialysis |          19           0          87
  Transplan |          72           0         278
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   229.82053   127.40537       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,095         513           0        513        513

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,307
  CKD stage |          97           0         371
  CKD stage |           9           0          16
   Dialysis |          52           0          87
  Transplan |         104           0         278
  KRT uncle |           6           0          36
------------+------------------------------------
      Total |   247.91933   124.83707       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         612           0        612        612

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,307
  CKD stage |          45           0         371
  CKD stage |           0           0          16
   Dialysis |           4           0          87
  Transplan |          64           0         278
  KRT uncle |          12           0          36
------------+------------------------------------
      Total |   249.53604   159.52142       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,095         498           0        498        498

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,307
  CKD stage |         108           0         371
  CKD stage |           2           0          16
   Dialysis |          16           0          87
  Transplan |          52           0         278
  KRT uncle |          17           0          36
------------+------------------------------------
      Total |   255.95656   144.79011       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,095         562           0        562        562

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,307
  CKD stage |         120           0         371
  CKD stage |           2           0          16
   Dialysis |          31           0          87
  Transplan |          46           0         278
  KRT uncle |           9           0          36
------------+------------------------------------
      Total |   232.81623   124.03846       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,095         535           0        535        535

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,307
  CKD stage |         121           0         371
  CKD stage |           3           0          16
   Dialysis |           6           0          87
  Transplan |          68           0         278
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   233.54845   120.69025       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,095         527           0        527        527

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,307
  CKD stage |          83           0         371
  CKD stage |           4           0          16
   Dialysis |           7           0          87
  Transplan |          42           0         278
  KRT uncle |          22           0          36
------------+------------------------------------
      Total |   229.34224   135.90989       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,095         492           0        492        492

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         390           0       1,307
  CKD stage |          68           0         371
  CKD stage |          11           0          16
   Dialysis |          17           0          87
  Transplan |          73           0         278
  KRT uncle |           6           0          36
------------+------------------------------------
      Total |   265.92983   160.38459       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,095         565           0        565        565

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         412           0       1,307
  CKD stage |          97           0         371
  CKD stage |           6           0          16
   Dialysis |          21           0          87
  Transplan |          58           0         278
  KRT uncle |           4           0          36
------------+------------------------------------
      Total |   282.89356   167.37281       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,095         598           0        598        598

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,307
  CKD stage |          98           0         371
  CKD stage |           3           0          16
   Dialysis |           7           0          87
  Transplan |          85           0         278
  KRT uncle |           7           0          36
------------+------------------------------------
      Total |   208.11742   103.64338       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,095         487           0        487        487

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,307
  CKD stage |          96           0         371
  CKD stage |           4           0          16
   Dialysis |          16           0          87
  Transplan |          67           0         278
  KRT uncle |           8           0          36
------------+------------------------------------
      Total |   249.44391    139.7776       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         548           0        548        548

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         422           0       1,307
  CKD stage |          59           0         371
  CKD stage |           0           0          16
   Dialysis |          24           0          87
  Transplan |          82           0         278
  KRT uncle |          15           0          36
------------+------------------------------------
      Total |   285.85537   175.89365       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         602           0        602        602

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,307
  CKD stage |          96           0         371
  CKD stage |           4           0          16
   Dialysis |          18           0          87
  Transplan |          78           0         278
  KRT uncle |          18           0          36
------------+------------------------------------
      Total |    259.8926   144.20079       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         585           0        585        585

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,307
  CKD stage |          83           0         371
  CKD stage |           3           0          16
   Dialysis |          27           0          87
  Transplan |          67           0         278
  KRT uncle |           2           0          36
------------+------------------------------------
      Total |   263.08449   153.88625       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,095         564           0        564        564

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,307
  CKD stage |         119           0         371
  CKD stage |           9           0          16
   Dialysis |          23           0          87
  Transplan |          79           0         278
  KRT uncle |          10           0          36
------------+------------------------------------
      Total |   239.25203   120.32046       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,095         571           0        571        571

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,307
  CKD stage |          99           0         371
  CKD stage |           3           0          16
   Dialysis |          14           0          87
  Transplan |          59           0         278
  KRT uncle |           6           0          36
------------+------------------------------------
      Total |   202.62243   105.45462       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,095         464           0        464        464

. 
. 
. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(82 real changes made)

. replace ethnicity=2 if ethnicity==3
(77 real changes made)

. replace ethnicity=3 if ethnicity==4
(77 real changes made)

. replace ethnicity=4 if ethnicity==6
(82 real changes made)

. replace ethnicity=6 if ethnicity==.
(535 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,847 missing values generated)

. replace region = 2 if region_string=="East"
(208 real changes made)

. replace region = 3 if region_string=="London"
(404 real changes made)

. replace region = 4 if region_string=="North East"
(191 real changes made)

. replace region = 5 if region_string=="North West"
(221 real changes made)

. replace region = 6 if region_string=="South East"
(206 real changes made)

. replace region = 7 if region_string=="South West"
(202 real changes made)

. replace region = 8 if region_string=="West Midlands"
(210 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(205 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,095 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(830 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,265 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. *Age bands for standardisation
. egen agecat = cut(age), at(0,18,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,
> 200)

. drop if agecat==0
(0 observations deleted)

. 
. *Age-standardisation weights (European Standard Population 2013)
. gen weight = .
(2,095 missing values generated)

. replace weight = 0.027261 if agecat==18
(51 real changes made)

. replace weight = 0.074349 if agecat==20
(165 real changes made)

. replace weight = 0.074349 if agecat==25
(181 real changes made)

. replace weight = 0.080545 if agecat==30
(203 real changes made)

. replace weight = 0.086741 if agecat==35
(178 real changes made)

. replace weight = 0.086741 if agecat==40
(170 real changes made)

. replace weight = 0.086741 if agecat==45
(153 real changes made)

. replace weight = 0.086741 if agecat==50
(173 real changes made)

. replace weight = 0.080545 if agecat==55
(166 real changes made)

. replace weight = 0.074349 if agecat==60
(163 real changes made)

. replace weight = 0.068154 if agecat==65
(140 real changes made)

. replace weight = 0.061958 if agecat==70
(115 real changes made)

. replace weight = 0.049566 if agecat==75
(92 real changes made)

. replace weight = 0.030979 if agecat==80
(71 real changes made)

. replace weight = 0.018587 if agecat==85
(45 real changes made)

. replace weight = 0.012392 if agecat==90
(29 real changes made)

. 
. 
. *Age standardised counts for each non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. replace `aggregate' = `aggregate' * weight
  3. }
variable hospital_days was byte now float
(182 real changes made)
variable critical_care_days was byte now float
(169 real changes made)
variable emergency_days was byte now float
(181 real changes made)
variable op_appts was byte now float
(181 real changes made)
variable neph_appts was byte now float
(168 real changes made)
variable tx_appts was byte now float
(184 real changes made)
variable gp_interactions was byte now float
(197 real changes made)

. 
. * Create variable for age-standardised total # of each aggregated outcome
. * `var'_`aggregate' = age-standardised total # of each aggregated outcome ove
> rall stratified by ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = age-standardised total # of each aggregated outcome
>  in each CKD group stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. egen overall_std_`aggregate' = total(`aggregate')
  3. bysort ckd_group: egen std_`aggregate' = total(`aggregate')
  4. foreach var of varlist ethnicity imd region urban {
  5. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  6. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  7. }
  8. }

. 
. foreach binary of varlist fistula_formation pd_insertion blood_pressure album
> inuria creatinine {
  2. gen esp_`binary' = `binary' * weight
  3. egen overall_std_`binary' = total(esp_`binary')
  4. bysort ckd_group: egen std_`binary' = total(esp_`binary')
  5. foreach var of varlist ethnicity imd region urban {
  6. bysort `var': egen `var'_`binary' = total(esp_`binary')
  7. bysort `var' ckd_group: egen `var'_`binary'_ckd = total(esp_`binary')
  8. }
  9. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2021_ckd_complete.dta not found)
file ./output/2021_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,595
        from master                       500  (_merge==1)
        from using                      2,095  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(500 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,307
  CKD stage |           0           0         371
  CKD stage |           0           0          16
   Dialysis |           0           0          87
  Transplan |           0           0         278
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |           0           0       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,095           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,307
  CKD stage |           0           0         371
  CKD stage |           0           0          16
   Dialysis |           0           0          87
  Transplan |           0           0         278
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |           0           0       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,095           0           0          0          0

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,307
  CKD stage |           0           0         371
  CKD stage |           0           0          16
   Dialysis |           0           0          87
  Transplan |           0           0         278
  KRT uncle |           0           0          36
------------+------------------------------------
      Total |           0           0       2,095

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,095           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2021_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete.log
  log type:  text
 closed on:  21 Nov 2023, 18:37:02
-------------------------------------------------------------------------------
