-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 opened on:  16 Dec 2022, 19:44:07

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,499 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,976 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,743 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,296        9.76        9.76
           East Midlands |      3,431       10.16       19.91
                  London |      6,863       20.32       40.23
              North East |      3,423       10.13       50.36
              North West |      3,320        9.83       60.19
              South East |      3,449       10.21       70.40
              South West |      3,442       10.19       80.59
           West Midlands |      3,227        9.55       90.14
Yorkshire and The Humber |      3,331        9.86      100.00
-------------------------+-----------------------------------
                   Total |     33,782      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,710        5.06        5.06
          1 |      6,395       18.93       23.99
          2 |      6,349       18.79       42.79
          3 |      6,476       19.17       61.96
          4 |      6,317       18.70       80.66
          5 |      6,535       19.34      100.00
------------+-----------------------------------
      Total |     33,782      100.00

. drop if imd==0
(1,710 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,161 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(812 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(806 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,121 real changes made, 14,121 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,121 missing values generated)

. gen min_baseline_creatinine=.
(32,072 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,182 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,769 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,182 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,769 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,353 real changes made)

. gen max_baseline_creatinine=.
(32,072 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,182 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,769 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,951 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,719 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,121 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,951 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,182 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,666 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,072
25%            0              0       Sum of Wgt.      32,072

50%     12.92782                      Mean           12.62561
                        Largest       Std. Dev.      13.02743
75%     25.10775       43.00155
90%     29.33196       43.43097       Variance       169.7138
95%     31.48597       43.89282       Skewness       .2011026
99%     35.37497       45.15073       Kurtosis        1.29847

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,597        5.52        5.52
         <= |      1,604        5.54       11.06
          = |     20,897       72.18       83.24
          > |      1,641        5.67       88.91
         >= |      1,630        5.63       94.54
          ~ |      1,582        5.46      100.00
------------+-----------------------------------
      Total |     28,951      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,529       54.66       54.66
          1 |     14,543       45.34      100.00
------------+-----------------------------------
      Total |     32,072      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,863       46.34       46.34
          1 |     17,209       53.66      100.00
------------+-----------------------------------
      Total |     32,072      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,436       94.90       94.90
          1 |      1,636        5.10      100.00
------------+-----------------------------------
      Total |     32,072      100.00
(803 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,496       95.09       95.09
          1 |      1,576        4.91      100.00
------------+-----------------------------------
      Total |     32,072      100.00
(695 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,502       95.10       95.10
          1 |      1,570        4.90      100.00
------------+-----------------------------------
      Total |     32,072      100.00
(667 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,472       95.01       95.01
          1 |      1,600        4.99      100.00
------------+-----------------------------------
      Total |     32,072      100.00
(629 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,428       94.87       94.87
          1 |      1,644        5.13      100.00
------------+-----------------------------------
      Total |     32,072      100.00
(599 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,489       95.06       95.06
          1 |      1,583        4.94      100.00
------------+-----------------------------------
      Total |     32,072      100.00
(591 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,879       33.92       33.92
          1 |     21,193       66.08      100.00
------------+-----------------------------------
      Total |     32,072      100.00

. drop if ckd==0
(10,879 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2021_ckd.csv not found)
file ./output/2021_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 closed on:  16 Dec 2022, 19:44:10
-------------------------------------------------------------------------------
