-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 opened on:  20 Sep 2023, 15:53:01

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve)
(19 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,745 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,941 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,743 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,264        9.72        9.72
           East Midlands |      3,474       10.35       20.07
                  London |      6,748       20.10       40.17
              North East |      3,365       10.02       50.20
              North West |      3,355        9.99       60.19
              South East |      3,280        9.77       69.96
              South West |      3,315        9.87       79.83
           West Midlands |      3,298        9.82       89.66
Yorkshire and The Humber |      3,472       10.34      100.00
-------------------------+-----------------------------------
                   Total |     33,571      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,690        5.03        5.03
          1 |      6,283       18.72       23.75
          2 |      6,479       19.30       43.05
          3 |      6,280       18.71       61.76
          4 |      6,419       19.12       80.88
          5 |      6,420       19.12      100.00
------------+-----------------------------------
      Total |     33,571      100.00

. drop if imd==0
(1,690 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. save ./output/input_`dataset', replace
(note: file ./output/input_2021.dta not found)
file ./output/input_2021.dta saved

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,033 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(823 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(782 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,948 real changes made, 13,948 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,948 missing values generated)

. gen min_baseline_creatinine=.
(31,881 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,243 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,690 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,243 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,690 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,334 real changes made)

. gen max_baseline_creatinine=.
(31,881 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,243 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,690 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,933 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,547 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,948 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,933 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,243 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,759 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,881
25%            0              0       Sum of Wgt.      31,881

50%      12.3205                      Mean           12.59415
                        Largest       Std. Dev.      13.00785
75%     25.07215       41.87356
90%     29.21082        42.0927       Variance       169.2043
95%     31.40328       43.12477       Skewness       .1999477
99%     35.22972       45.36719       Kurtosis       1.293368

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,606        5.59        5.59
         <= |      1,563        5.44       11.03
          = |     20,693       72.03       83.06
          > |      1,658        5.77       88.83
         >= |      1,618        5.63       94.46
          ~ |      1,592        5.54      100.00
------------+-----------------------------------
      Total |     28,730      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,453       54.74       54.74
   Albuminuria |     14,428       45.26      100.00
---------------+-----------------------------------
         Total |     31,881      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,694       46.09       46.09
          1 |     17,187       53.91      100.00
------------+-----------------------------------
      Total |     31,881      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(13948 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17933 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(13,948 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,258       94.91       94.91
          1 |      1,623        5.09      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(1,623 real changes made)
(776 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,316       95.09       95.09
          1 |      1,565        4.91      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(1,492 real changes made)
(714 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,266       94.93       94.93
          1 |      1,615        5.07      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(1,428 real changes made)
(662 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,307       95.06       95.06
          1 |      1,574        4.94      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(1,322 real changes made)
(633 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,277       94.97       94.97
          1 |      1,604        5.03      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(1,302 real changes made)
(590 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,308       95.07       95.07
          1 |      1,573        4.93      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(1,233 real changes made)
(540 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,700      4,607 |    10,307 
 eGFR >=60 |     5,079      4,358 |     9,437 
  eGFR <60 |     2,090      1,647 |     3,737 
       KRT |     4,584      3,816 |     8,400 
-----------+----------------------+----------
     Total |    17,453     14,428 |    31,881 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,779       33.81       33.81
          1 |     21,102       66.19      100.00
------------+-----------------------------------
      Total |     31,881      100.00

. drop if ckd==0
(10,779 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,607 |     4,607 
 eGFR >=60 |         0      4,358 |     4,358 
  eGFR <60 |     2,090      1,647 |     3,737 
       KRT |     4,584      3,816 |     8,400 
-----------+----------------------+----------
     Total |     6,674     14,428 |    21,102 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2021_ckd.csv not found)
file ./output/2021_ckd.csv saved

. 
. *Create dataset of non-CKD
. merge 1:1 patient_id using ./output/input_`dataset'

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,779
        from master                         0  (_merge==1)
        from using                     10,779  (_merge==2)

    matched                            21,102  (_merge==3)
    -----------------------------------------

. keep if _merge==2
(21,102 observations deleted)

. drop _merge

. 
. export delimited using "./output/`dataset'_nockd.csv", replace
(note: file ./output/2021_nockd.csv not found)
file ./output/2021_nockd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 closed on:  20 Sep 2023, 15:53:02
-------------------------------------------------------------------------------
