-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 opened on:  31 Jan 2023, 11:48:41

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,582 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,929 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,758 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,402       10.09       10.09
           East Midlands |      3,457       10.25       20.33
                  London |      6,851       20.31       40.65
              North East |      3,327        9.86       50.51
              North West |      3,375       10.01       60.51
              South East |      3,372       10.00       70.51
              South West |      3,336        9.89       80.40
           West Midlands |      3,304        9.80       90.20
Yorkshire and The Humber |      3,307        9.80      100.00
-------------------------+-----------------------------------
                   Total |     33,731      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,654        4.90        4.90
          1 |      6,420       19.03       23.94
          2 |      6,371       18.89       42.82
          3 |      6,423       19.04       61.87
          4 |      6,361       18.86       80.72
          5 |      6,502       19.28      100.00
------------+-----------------------------------
      Total |     33,731      100.00

. drop if imd==0
(1,654 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,954 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(820 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(762 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,050 real changes made, 14,050 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,050 missing values generated)

. gen min_baseline_creatinine=.
(32,077 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,293 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,734 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,293 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,734 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,463 real changes made)

. gen max_baseline_creatinine=.
(32,077 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,293 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,734 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,027 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,614 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,050 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,027 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,293 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,821 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,077
25%            0              0       Sum of Wgt.      32,077

50%            0                      Mean           12.40426
                        Largest       Std. Dev.      12.95244
75%     24.90762       42.56393
90%     29.11351       43.03014       Variance       167.7657
95%     31.28846       43.77884       Skewness        .222103
99%     35.13115       44.41999       Kurtosis       1.303803

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,657        5.73        5.73
         <= |      1,572        5.44       11.17
          = |     20,839       72.10       83.27
          > |      1,640        5.67       88.95
         >= |      1,641        5.68       94.62
          ~ |      1,554        5.38      100.00
------------+-----------------------------------
      Total |     28,903      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,705       55.20       55.20
          1 |     14,372       44.80      100.00
------------+-----------------------------------
      Total |     32,077      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,884       46.40       46.40
          1 |     17,193       53.60      100.00
------------+-----------------------------------
      Total |     32,077      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,447       94.92       94.92
          1 |      1,630        5.08      100.00
------------+-----------------------------------
      Total |     32,077      100.00
(777 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,474       95.00       95.00
          1 |      1,603        5.00      100.00
------------+-----------------------------------
      Total |     32,077      100.00
(693 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,443       94.91       94.91
          1 |      1,634        5.09      100.00
------------+-----------------------------------
      Total |     32,077      100.00
(676 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,480       95.02       95.02
          1 |      1,597        4.98      100.00
------------+-----------------------------------
      Total |     32,077      100.00
(633 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,492       95.06       95.06
          1 |      1,585        4.94      100.00
------------+-----------------------------------
      Total |     32,077      100.00
(587 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,451       94.93       94.93
          1 |      1,626        5.07      100.00
------------+-----------------------------------
      Total |     32,077      100.00
(568 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,950       34.14       34.14
          1 |     21,127       65.86      100.00
------------+-----------------------------------
      Total |     32,077      100.00

. drop if ckd==0
(10,950 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2021_ckd.csv not found)
file ./output/2021_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd.log
  log type:  text
 closed on:  31 Jan 2023, 11:48:45
-------------------------------------------------------------------------------
