-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete.log
  log type:  text
 opened on:  18 Aug 2023, 17:35:57

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,102 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(235 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,814
        from master                    47,856  (_merge==1)
        from using                     18,958  (_merge==2)

    matched                             2,144  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,814 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        238       11.10       11.10
Kidney transplant |        219       10.21       21.32
 Modality unclear |         41        1.91       23.23
          Pre KRT |      1,646       76.77      100.00
------------------+-----------------------------------
            Total |      2,144      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(855 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1289 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,289       60.12       60.12
          . |        855       39.88      100.00
------------+-----------------------------------
      Total |      2,144      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(238 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(24 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(179 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(294 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(10 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(41 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(7 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       155         83 |       238 
Kidney transplant |       219          0 |       219 
 Modality unclear |        41          0 |        41 
          Pre KRT |     1,646          0 |     1,646 
------------------+----------------------+----------
            Total |     2,061         83 |     2,144 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       222         16 |       238 
Kidney transplant |       195         24 |       219 
 Modality unclear |        34          7 |        41 
          Pre KRT |     1,409        237 |     1,646 
------------------+----------------------+----------
            Total |     1,860        284 |     2,144 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       238          0 |       238 
Kidney transplant |       219          0 |       219 
 Modality unclear |         7         34 |        41 
          Pre KRT |     1,646          0 |     1,646 
------------------+----------------------+----------
            Total |     2,110         34 |     2,144 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,777        284 |     2,061 
         1 |        83          0 |        83 
-----------+----------------------+----------
     Total |     1,860        284 |     2,144 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(855 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1289 changes made)

. replace ckd_group = 4 if dialysis==1
(83 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(284 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(34 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(647 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,338       62.41       62.41
         CKD stage 3 |        392       18.28       80.69
       CKD stage 4/5 |         13        0.61       81.30
            Dialysis |         83        3.87       85.17
          Transplant |        284       13.25       98.41
KRT unclear modality |         34        1.59      100.00
---------------------+-----------------------------------
               Total |      2,144      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        89        152          0      1,097 |     1,338 
         CKD stage 3 |        46         43          0        303 |       392 
       CKD stage 4/5 |         4          0          0          9 |        13 
            Dialysis |        83          0          0          0 |        83 
          Transplant |        16         24          7        237 |       284 
KRT unclear modality |         0          0         34          0 |        34 
---------------------+--------------------------------------------+----------
               Total |       238        219         41      1,646 |     2,144 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       130         70         53         10 |     1,338 
         CKD stage 3 |        45         17         16          0 |       392 
       CKD stage 4/5 |         2          1          1          1 |        13 
            Dialysis |         5          1          5          3 |        83 
          Transplant |        28         14         12          1 |       284 
KRT unclear modality |         2          2          1          0 |        34 
---------------------+--------------------------------------------+----------
               Total |       212        105         88         15 |     2,144 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,075 |     1,338 
         CKD stage 3 |       314 |       392 
       CKD stage 4/5 |         8 |        13 
            Dialysis |        69 |        83 
          Transplant |       229 |       284 
KRT unclear modality |        29 |        34 
---------------------+-----------+----------
               Total |     1,724 |     2,144 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,112 missing values generated)

. replace sex = 0 if male == "Female"
(1,112 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(962 real changes made, 962 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(962 missing values generated)

. gen min_creatinine_outcome=.
(2,144 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(599 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(583 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(599 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(583 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(744 real changes made)

. gen max_creatinine_outcome=.
(2,144 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(599 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(583 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,182 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,400 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(962 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,182 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(599 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(962 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1182 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(184 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(9 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(3 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(962 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1182 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,182       55.13       55.13
          . |        962       44.87      100.00
------------+-----------------------------------
      Total |      2,144      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(105 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(88 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(11 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(15 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(105 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(99 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(212 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,562       72.85       72.85
               CKD 3 |        151        7.04       79.90
     CKD 4/5 pre-KRT |         11        0.51       80.41
            Dialysis |        105        4.90       85.31
   Kidney transplant |         99        4.62       89.93
KRT unclear modality |          4        0.19       90.11
            Deceased |        212        9.89      100.00
---------------------+-----------------------------------
               Total |      2,144      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(855 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1289 changes made)

. replace access_egfr=0 if ckd_group==4
(83 real changes made)

. replace access_egfr=3 if access_egfr==.
(772 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,338
  CKD stage |          93           0         392
  CKD stage |           8           0          13
   Dialysis |           7           0          83
  Transplan |          73           0         284
  KRT uncle |           7           0          34
------------+------------------------------------
      Total |   239.28685   131.08122       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,144         528           0        528        528

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,338
  CKD stage |          93           0         392
  CKD stage |           6           0          13
   Dialysis |          15           0          83
  Transplan |          68           0         284
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   230.88853   125.03489       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,144         521           0        521        521

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,338
  CKD stage |         117           0         392
  CKD stage |           1           0          13
   Dialysis |          24           0          83
  Transplan |          84           0         284
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   255.09282   130.55283       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,144         587           0        587        587

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,338
  CKD stage |         138           0         392
  CKD stage |           0           0          13
   Dialysis |          16           0          83
  Transplan |          59           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   237.25466   118.29766       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,144         548           0        548        548

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,338
  CKD stage |         116           0         392
  CKD stage |           3           0          13
   Dialysis |          29           0          83
  Transplan |          80           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   245.27239   123.82515       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,144         577           0        577        577

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,338
  CKD stage |         108           0         392
  CKD stage |           8           0          13
   Dialysis |          22           0          83
  Transplan |          67           0         284
  KRT uncle |          17           0          34
------------+------------------------------------
      Total |   244.47015    129.7796       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,144         566           0        566        566

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,338
  CKD stage |          97           0         392
  CKD stage |           0           0          13
   Dialysis |          14           0          83
  Transplan |          47           0         284
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   264.33489    155.5107       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,144         554           0        554        554

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,338
  CKD stage |          95           0         392
  CKD stage |           0           0          13
   Dialysis |          13           0          83
  Transplan |          39           0         284
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   244.64599    143.7512       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,144         506           0        506        506

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,338
  CKD stage |         104           0         392
  CKD stage |           0           0          13
   Dialysis |          31           0          83
  Transplan |          86           0         284
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   222.63479   108.94558       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,144         531           0        531        531

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,338
  CKD stage |         104           0         392
  CKD stage |           4           0          13
   Dialysis |          15           0          83
  Transplan |          40           0         284
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |     247.118   142.24018       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,144         521           0        521        521

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,338
  CKD stage |          94           0         392
  CKD stage |           0           0          13
   Dialysis |          25           0          83
  Transplan |          55           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   265.84841     154.531       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,144         568           0        568        568

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,338
  CKD stage |         101           0         392
  CKD stage |           1           0          13
   Dialysis |          29           0          83
  Transplan |         109           0         284
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   244.98414   121.47864       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,144         579           0        579        579

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,338
  CKD stage |          91           0         392
  CKD stage |           0           0          13
   Dialysis |          21           0          83
  Transplan |          62           0         284
  KRT uncle |           0           0          34
------------+------------------------------------
      Total |   231.60588   127.93588       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,144         504           0        504        504

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,338
  CKD stage |          90           0         392
  CKD stage |          -2           0          13
   Dialysis |          17           0          83
  Transplan |          81           0         284
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   225.21035   118.18143       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,144         513           0        513        513

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,338
  CKD stage |         107           0         392
  CKD stage |           6           0          13
   Dialysis |          21           0          83
  Transplan |          41           0         284
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   247.46688   140.53847       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,144         535           0        535        535

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,338
  CKD stage |          85           0         392
  CKD stage |           2           0          13
   Dialysis |          14           0          83
  Transplan |          56           0         284
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   263.85821   156.96207       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,144         547           0        547        547

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         270           0       1,338
  CKD stage |          98           0         392
  CKD stage |           2           0          13
   Dialysis |          22           0          83
  Transplan |          58           0         284
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   195.12127   98.227256       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,144         460           0        460        460

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         403           0       1,338
  CKD stage |          84           0         392
  CKD stage |           4           0          13
   Dialysis |          16           0          83
  Transplan |          49           0         284
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   274.03918   166.99683       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,144         559           0        559        559

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,338
  CKD stage |          92           0         392
  CKD stage |           0           0          13
   Dialysis |           9           0          83
  Transplan |          56           0         284
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   261.18797   152.97009       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,144         541           0        541        541

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,338
  CKD stage |         105           0         392
  CKD stage |           4           0          13
   Dialysis |          18           0          83
  Transplan |          83           0         284
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   242.64646   125.66362       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,144         560           0        560        560

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,338
  CKD stage |          69           0         392
  CKD stage |           6           0          13
   Dialysis |          18           0          83
  Transplan |          68           0         284
  KRT uncle |          20           0          34
------------+------------------------------------
      Total |    264.1875   158.69694       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,144         568           0        568        568

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,338
  CKD stage |         123           0         392
  CKD stage |           0           0          13
   Dialysis |          27           0          83
  Transplan |          53           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   233.51912   120.66657       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,144         537           0        537        537

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,338
  CKD stage |          97           0         392
  CKD stage |           0           0          13
   Dialysis |          13           0          83
  Transplan |          54           0         284
  KRT uncle |           7           0          34
------------+------------------------------------
      Total |   224.57976   123.25015       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,144         490           0        490        490

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,338
  CKD stage |         104           0         392
  CKD stage |           0           0          13
   Dialysis |          21           0          83
  Transplan |          66           0         284
  KRT uncle |          20           0          34
------------+------------------------------------
      Total |    249.1833   135.12423       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,144         564           0        564        564

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,338
  CKD stage |          68           0         392
  CKD stage |          10           0          13
   Dialysis |          14           0          83
  Transplan |          90           0         284
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   241.05877   136.15666       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,144         539           0        539        539

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         263           0       1,338
  CKD stage |          69           0         392
  CKD stage |           0           0          13
   Dialysis |          40           0          83
  Transplan |          77           0         284
  KRT uncle |          22           0          34
------------+------------------------------------
      Total |   188.84235   96.096013       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         471           0        471        471

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,338
  CKD stage |         114           0         392
  CKD stage |           3           0          13
   Dialysis |          11           0          83
  Transplan |          88           0         284
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   245.94123    124.4839       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         569           0        569        569

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,338
  CKD stage |         128           0         392
  CKD stage |          12           0          13
   Dialysis |           6           0          83
  Transplan |          83           0         284
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   242.53265   119.57076       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         563           0        563        563

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,338
  CKD stage |         110           0         392
  CKD stage |           2           0          13
   Dialysis |          18           0          83
  Transplan |          83           0         284
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   237.88433   120.48719       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         551           0        551        551

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,338
  CKD stage |          91           0         392
  CKD stage |           4           0          13
   Dialysis |          21           0          83
  Transplan |          60           0         284
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   242.02192   136.32902       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,144         526           0        526        526

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,338
  CKD stage |          78           0         392
  CKD stage |           3           0          13
   Dialysis |          27           0          83
  Transplan |          55           0         284
  KRT uncle |          15           0          34
------------+------------------------------------
      Total |   240.02332   139.71348       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,144         526           0        526        526

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,338
  CKD stage |          82           0         392
  CKD stage |           0           0          13
   Dialysis |          13           0          83
  Transplan |          65           0         284
  KRT uncle |           7           0          34
------------+------------------------------------
      Total |   249.50513   144.50726       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,144         528           0        528        528

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,338
  CKD stage |         102           0         392
  CKD stage |           5           0          13
   Dialysis |           8           0          83
  Transplan |          74           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   247.35774   133.79921       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,144         548           0        548        548

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,338
  CKD stage |         108           0         392
  CKD stage |           0           0          13
   Dialysis |          26           0          83
  Transplan |          81           0         284
  KRT uncle |          13           0          34
------------+------------------------------------
      Total |   269.45802   144.99285       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,144         609           0        609        609

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,338
  CKD stage |         115           0         392
  CKD stage |           0           0          13
   Dialysis |          16           0          83
  Transplan |          64           0         284
  KRT uncle |          13           0          34
------------+------------------------------------
      Total |    256.2416   138.21204       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,144         570           0        570        570

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,338
  CKD stage |         120           0         392
  CKD stage |           2           0          13
   Dialysis |           9           0          83
  Transplan |          70           0         284
  KRT uncle |           7           0          34
------------+------------------------------------
      Total |   261.96502   140.15327       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,144         577           0        577        577

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,338
  CKD stage |          92           0         392
  CKD stage |           5           0          13
   Dialysis |          24           0          83
  Transplan |          32           0         284
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   228.60121   133.52473       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,144         485           0        485        485

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,338
  CKD stage |         125           0         392
  CKD stage |           1           0          13
   Dialysis |          18           0          83
  Transplan |          67           0         284
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   270.98461   145.28983       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         603           0        603        603

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,338
  CKD stage |          93           0         392
  CKD stage |          10           0          13
   Dialysis |          28           0          83
  Transplan |          70           0         284
  KRT uncle |          19           0          34
------------+------------------------------------
      Total |   240.52892   130.33807       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         561           0        561        561

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,338
  CKD stage |         106           0         392
  CKD stage |           8           0          13
   Dialysis |          23           0          83
  Transplan |          79           0         284
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   229.41185   115.70845       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         545           0        545        545

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,338
  CKD stage |         105           0         392
  CKD stage |           5           0          13
   Dialysis |          14           0          83
  Transplan |          60           0         284
  KRT uncle |          13           0          34
------------+------------------------------------
      Total |   233.24207    125.1325       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         526           0        526        526

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,338
  CKD stage |          88           0         392
  CKD stage |           8           0          13
   Dialysis |          13           0          83
  Transplan |         113           0         284
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   249.47248   129.99172       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,144         575           0        575        575

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,338
  CKD stage |         134           0         392
  CKD stage |           9           0          13
   Dialysis |          32           0          83
  Transplan |          66           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   258.09468   131.45175       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,144         608           0        608        608

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,338
  CKD stage |         113           0         392
  CKD stage |           0           0          13
   Dialysis |          11           0          83
  Transplan |          61           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   259.59002   142.93234       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,144         563           0        563        563

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         272           0       1,338
  CKD stage |         104           0         392
  CKD stage |           0           0          13
   Dialysis |          14           0          83
  Transplan |          75           0         284
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   199.26959   95.902093       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,144         467           0        467        467

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         406           0       1,338
  CKD stage |          84           0         392
  CKD stage |          10           0          13
   Dialysis |          40           0          83
  Transplan |          83           0         284
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   281.50746   160.93929       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,144         634           0        634        634

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         434           0       1,338
  CKD stage |          91           0         392
  CKD stage |           3           0          13
   Dialysis |          24           0          83
  Transplan |          72           0         284
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   298.15812   175.75075       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,144         636           0        636        636

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         399           0       1,338
  CKD stage |          81           0         392
  CKD stage |           2           0          13
   Dialysis |          25           0          83
  Transplan |          84           0         284
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   276.01446   159.18224       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,144         597           0        597        597

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,338
  CKD stage |          92           0         392
  CKD stage |           0           0          13
   Dialysis |          21           0          83
  Transplan |          72           0         284
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   259.40345   146.05611       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,144         562           0        562        562

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         258           0       1,338
  CKD stage |          97           0         392
  CKD stage |           4           0          13
   Dialysis |          33           0          83
  Transplan |          60           0         284
  KRT uncle |          15           0          34
------------+------------------------------------
      Total |   188.23181   91.411603       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,144         467           0        467        467

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,338
  CKD stage |          92           0         392
  CKD stage |           8           0          13
   Dialysis |          16           0          83
  Transplan |          63           0         284
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |    254.9459   145.43521       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,144         551           0        551        551

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,338
  CKD stage |          84           0         392
  CKD stage |           7           0          13
   Dialysis |          41           0          83
  Transplan |          82           0         284
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   219.53358   113.46995       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,144         527           0        527        527

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,338
  CKD stage |         106           0         392
  CKD stage |           5           0          13
   Dialysis |          44           0          83
  Transplan |          51           0         284
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   237.61987   128.34874       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         546           0        546        546

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,338
  CKD stage |         103           0         392
  CKD stage |           0           0          13
   Dialysis |          30           0          83
  Transplan |          49           0         284
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   238.74627   132.07386       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,144         527           0        527        527

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,338
  CKD stage |         130           0         392
  CKD stage |           6           0          13
   Dialysis |          30           0          83
  Transplan |          75           0         284
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   228.45709   107.96438       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,144         557           0        557        557

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,338
  CKD stage |          96           0         392
  CKD stage |           0           0          13
   Dialysis |          19           0          83
  Transplan |          68           0         284
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   250.88573   139.14648       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,144         552           0        552        552

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,338
  CKD stage |          91           0         392
  CKD stage |           0           0          13
   Dialysis |          21           0          83
  Transplan |          91           0         284
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   216.89972   108.42517       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,144         514           0        514        514

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,338
  CKD stage |          83           0         392
  CKD stage |           0           0          13
   Dialysis |          19           0          83
  Transplan |          44           0         284
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   238.96222   141.46923       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,144         497           0        497        497

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,338
  CKD stage |         110           0         392
  CKD stage |           2           0          13
   Dialysis |           9           0          83
  Transplan |          69           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   269.39692   149.35047       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,144         583           0        583        583

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,338
  CKD stage |          98           0         392
  CKD stage |           5           0          13
   Dialysis |          38           0          83
  Transplan |          61           0         284
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   204.86147   103.33167       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,144         494           0        494        494

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,338
  CKD stage |          77           0         392
  CKD stage |           0           0          13
   Dialysis |          26           0          83
  Transplan |          70           0         284
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   244.71642   140.16757       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,144         530           0        530        530

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,338
  CKD stage |          87           0         392
  CKD stage |           5           0          13
   Dialysis |          25           0          83
  Transplan |          66           0         284
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   220.48321   118.86628       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         503           0        503        503

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,338
  CKD stage |         104           0         392
  CKD stage |           0           0          13
   Dialysis |          13           0          83
  Transplan |          63           0         284
  KRT uncle |           0           0          34
------------+------------------------------------
      Total |   219.45196   114.78035       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         487           0        487        487

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,338
  CKD stage |         117           0         392
  CKD stage |           3           0          13
   Dialysis |          16           0          83
  Transplan |         103           0         284
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   249.82323   122.20831       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         588           0        588        588

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,338
  CKD stage |         106           0         392
  CKD stage |          -2           0          13
   Dialysis |          37           0          83
  Transplan |          62           0         284
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   238.10774    126.3515       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         540           0        540        540

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,338
  CKD stage |         105           0         392
  CKD stage |           0           0          13
   Dialysis |          40           0          83
  Transplan |          89           0         284
  KRT uncle |          14           0          34
------------+------------------------------------
      Total |   224.97015   108.28416       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,144         556           0        556        556

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,338
  CKD stage |         114           0         392
  CKD stage |           3           0          13
   Dialysis |          28           0          83
  Transplan |          83           0         284
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   246.49767   124.73828       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,144         578           0        578        578

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,338
  CKD stage |          72           0         392
  CKD stage |           7           0          13
   Dialysis |          13           0          83
  Transplan |          56           0         284
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   247.13526   148.61142       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,144         516           0        516        516

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,338
  CKD stage |         127           0         392
  CKD stage |           7           0          13
   Dialysis |          25           0          83
  Transplan |          50           0         284
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   227.48228   116.12889       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,144         527           0        527        527

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,338
  CKD stage |          87           0         392
  CKD stage |           1           0          13
   Dialysis |          23           0          83
  Transplan |          70           0         284
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   261.44403    149.6981       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,144         564           0        564        564

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         376           0       1,338
  CKD stage |         108           0         392
  CKD stage |           0           0          13
   Dialysis |          38           0          83
  Transplan |          63           0         284
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   264.25933   145.32502       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,144         588           0        588        588

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,338
  CKD stage |         126           0         392
  CKD stage |           0           0          13
   Dialysis |          20           0          83
  Transplan |          82           0         284
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   228.30877   108.00086       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,144         549           0        549        549

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,338
  CKD stage |         102           0         392
  CKD stage |           2           0          13
   Dialysis |          16           0          83
  Transplan |          59           0         284
  KRT uncle |          17           0          34
------------+------------------------------------
      Total |   210.84142   108.95479       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,144         490           0        490        490

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,338
  CKD stage |          93           0         392
  CKD stage |           6           0          13
   Dialysis |          33           0          83
  Transplan |          92           0         284
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   243.39039    126.8111       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,144         570           0        570        570

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         390           0       1,338
  CKD stage |          86           0         392
  CKD stage |           0           0          13
   Dialysis |          41           0          83
  Transplan |          74           0         284
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   270.68983   154.28452       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,144         603           0        603        603

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,338
  CKD stage |          72           0         392
  CKD stage |           1           0          13
   Dialysis |          15           0          83
  Transplan |          75           0         284
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   239.08396   137.22044       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,144         514           0        514        514

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,338
  CKD stage |         145           0         392
  CKD stage |           1           0          13
   Dialysis |          38           0          83
  Transplan |          58           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |    243.0042   118.69975       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         583           0        583        583

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,338
  CKD stage |          91           0         392
  CKD stage |           0           0          13
   Dialysis |          18           0          83
  Transplan |          71           0         284
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   230.85728   125.05032       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,144         510           0        510        510

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,338
  CKD stage |         124           0         392
  CKD stage |           0           0          13
   Dialysis |          22           0          83
  Transplan |          56           0         284
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   256.32463   137.41013       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,144         569           0        569        569

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,338
  CKD stage |         126           0         392
  CKD stage |           1           0          13
   Dialysis |          26           0          83
  Transplan |          76           0         284
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   232.72901   112.45818       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,144         557           0        557        557

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         386           0       1,338
  CKD stage |         122           0         392
  CKD stage |          -1           0          13
   Dialysis |          16           0          83
  Transplan |          67           0         284
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |    272.8111   147.96862       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,144         598           0        598        598

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,338
  CKD stage |          72           0         392
  CKD stage |           4           0          13
   Dialysis |          30           0          83
  Transplan |          66           0         284
  KRT uncle |          13           0          34
------------+------------------------------------
      Total |   249.83489    146.2452       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,144         548           0        548        548

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,338
  CKD stage |         112           0         392
  CKD stage |           9           0          13
   Dialysis |          19           0          83
  Transplan |          93           0         284
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   239.70336   118.17477       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,144         574           0        574        574

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         449           0       1,338
  CKD stage |          98           0         392
  CKD stage |           7           0          13
   Dialysis |          10           0          83
  Transplan |          84           0         284
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |    309.8708   180.29108       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,144         660           0        660        660

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,338
  CKD stage |          91           0         392
  CKD stage |           8           0          13
   Dialysis |          10           0          83
  Transplan |          90           0         284
  KRT uncle |          -1           0          34
------------+------------------------------------
      Total |   226.80877   117.76002       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,144         515           0        515        515

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         411           0       1,338
  CKD stage |         134           0         392
  CKD stage |           4           0          13
   Dialysis |          12           0          83
  Transplan |         109           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   296.06157   150.46562       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         679           0        679        679

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,338
  CKD stage |         105           0         392
  CKD stage |           1           0          13
   Dialysis |          20           0          83
  Transplan |         111           0         284
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   236.41371   113.52438       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         570           0        570        570

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,338
  CKD stage |         107           0         392
  CKD stage |           5           0          13
   Dialysis |          42           0          83
  Transplan |          77           0         284
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |    240.5611   122.96684       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         571           0        571        571

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,338
  CKD stage |          74           0         392
  CKD stage |           7           0          13
   Dialysis |          20           0          83
  Transplan |          49           0         284
  KRT uncle |          13           0          34
------------+------------------------------------
      Total |   242.58722   145.42036       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,144         518           0        518        518

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,338
  CKD stage |          83           0         392
  CKD stage |           3           0          13
   Dialysis |          39           0          83
  Transplan |          29           0         284
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   247.84795   150.66374       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,144         527           0        527        527

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,338
  CKD stage |         103           0         392
  CKD stage |           0           0          13
   Dialysis |          20           0          83
  Transplan |          82           0         284
  KRT uncle |          27           0          34
------------+------------------------------------
      Total |   232.47015   118.02483       2,144

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,144         555           0        555        555

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(95 real changes made)

. replace ethnicity=2 if ethnicity==3
(69 real changes made)

. replace ethnicity=3 if ethnicity==4
(78 real changes made)

. replace ethnicity=4 if ethnicity==6
(95 real changes made)

. replace ethnicity=6 if ethnicity==.
(565 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,931 missing values generated)

. replace region = 2 if region_string=="East"
(215 real changes made)

. replace region = 3 if region_string=="London"
(438 real changes made)

. replace region = 4 if region_string=="North East"
(236 real changes made)

. replace region = 5 if region_string=="North West"
(206 real changes made)

. replace region = 6 if region_string=="South East"
(210 real changes made)

. replace region = 7 if region_string=="South West"
(197 real changes made)

. replace region = 8 if region_string=="West Midlands"
(215 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(214 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,144 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(855 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,289 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. }
  5. }

. 
. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2021_ckd_complete.dta not found)
file ./output/2021_ckd_complete.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_ckd_complete.log
  log type:  text
 closed on:  18 Aug 2023, 17:36:00
-------------------------------------------------------------------------------
