-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_01_ckd.log
  log type:  text
 opened on:  25 Apr 2023, 13:07:01

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(19 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,717 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,970 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,710 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,364       10.01       10.01
           East Midlands |      3,351        9.97       19.98
                  London |      6,576       19.57       39.55
              North East |      3,438       10.23       49.78
              North West |      3,334        9.92       59.71
              South East |      3,381       10.06       69.77
              South West |      3,375       10.04       79.81
           West Midlands |      3,343        9.95       89.76
Yorkshire and The Humber |      3,441       10.24      100.00
-------------------------+-----------------------------------
                   Total |     33,603      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,751        5.21        5.21
          1 |      6,250       18.60       23.81
          2 |      6,378       18.98       42.79
          3 |      6,369       18.95       61.74
          4 |      6,440       19.16       80.91
          5 |      6,415       19.09      100.00
------------+-----------------------------------
      Total |     33,603      100.00

. drop if imd==0
(1,751 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,944 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(833 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(729 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,038 real changes made, 14,038 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,038 missing values generated)

. gen min_baseline_creatinine=.
(31,852 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,040 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,774 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,040 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,774 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,268 real changes made)

. gen max_baseline_creatinine=.
(31,852 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,040 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,774 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,814 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,584 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,038 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,814 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,040 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,584 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,852
25%            0              0       Sum of Wgt.      31,852

50%     9.764803                      Mean           12.52039
                        Largest       Std. Dev.      13.00518
75%     25.00357       42.82246
90%     29.28287       42.97813       Variance       169.1346
95%     31.47568       44.46976       Skewness       .2152334
99%     35.35876       44.77518       Kurtosis       1.307048

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,697        5.95        5.95
         <= |      1,514        5.31       11.26
          = |     20,478       71.79       83.05
          > |      1,639        5.75       88.79
         >= |      1,628        5.71       94.50
          ~ |      1,569        5.50      100.00
------------+-----------------------------------
      Total |     28,525      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,470       54.85       54.85
   Albuminuria |     14,382       45.15      100.00
---------------+-----------------------------------
         Total |     31,852      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,886       46.73       46.73
          1 |     16,966       53.27      100.00
------------+-----------------------------------
      Total |     31,852      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14038 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17814 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,038 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,279       95.06       95.06
          1 |      1,573        4.94      100.00
------------+-----------------------------------
      Total |     31,852      100.00
(1,573 real changes made)
(708 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,246       94.96       94.96
          1 |      1,606        5.04      100.00
------------+-----------------------------------
      Total |     31,852      100.00
(1,524 real changes made)
(696 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,234       94.92       94.92
          1 |      1,618        5.08      100.00
------------+-----------------------------------
      Total |     31,852      100.00
(1,458 real changes made)
(677 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,250       94.97       94.97
          1 |      1,602        5.03      100.00
------------+-----------------------------------
      Total |     31,852      100.00
(1,363 real changes made)
(650 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,241       94.94       94.94
          1 |      1,611        5.06      100.00
------------+-----------------------------------
      Total |     31,852      100.00
(1,317 real changes made)
(611 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,251       94.97       94.97
          1 |      1,601        5.03      100.00
------------+-----------------------------------
      Total |     31,852      100.00
(1,235 real changes made)
(582 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,670      4,638 |    10,308 
 eGFR >=60 |     5,292      4,264 |     9,556 
  eGFR <60 |     1,894      1,624 |     3,518 
       KRT |     4,614      3,856 |     8,470 
-----------+----------------------+----------
     Total |    17,470     14,382 |    31,852 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,962       34.42       34.42
          1 |     20,890       65.58      100.00
------------+-----------------------------------
      Total |     31,852      100.00

. drop if ckd==0
(10,962 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,638 |     4,638 
 eGFR >=60 |         0      4,264 |     4,264 
  eGFR <60 |     1,894      1,624 |     3,518 
       KRT |     4,614      3,856 |     8,470 
-----------+----------------------+----------
     Total |     6,508     14,382 |    20,890 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2021_01_ckd.csv not found)
file ./output/2021_01_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_01_ckd.log
  log type:  text
 closed on:  25 Apr 2023, 13:07:04
-------------------------------------------------------------------------------
