-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_01_ukrr_v3.log
  log type:  text
 opened on:  25 Apr 2023, 13:10:48

. clear

. 
. use ./output/`dataset'_ckd_complete_v3.dta, clear

. 
. tab ukrr

       ukrr |      Freq.     Percent        Cum.
------------+-----------------------------------
       ICHD |         49       50.52       50.52
         Tx |         48       49.48      100.00
------------+-----------------------------------
      Total |         97      100.00

. rename ukrr ukrr_string

. gen ukrr = 0

. replace ukrr = 1 if ukrr_string=="HD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="HHD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="ICHD"
(49 real changes made)

. replace ukrr = 1 if ukrr_string=="PD"
(0 real changes made)

. replace ukrr = 2 if ukrr_string=="Tx"
(48 real changes made)

. drop ukrr_string

. 
. tab ckd_group ukrr, m

                     |               ukrr
           CKD group |         0          1          2 |     Total
---------------------+---------------------------------+----------
         Albuminuria |     1,239         30         24 |     1,293 
         CKD stage 3 |       404          9         12 |       425 
       CKD stage 4/5 |        21          0          0 |        21 
            Dialysis |        76          2          2 |        80 
          Transplant |       270          8         10 |       288 
KRT unclear modality |        29          0          0 |        29 
---------------------+---------------------------------+----------
               Total |     2,039         49         48 |     2,136 

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_01_ukrr_v3.log
  log type:  text
 closed on:  25 Apr 2023, 13:10:48
-------------------------------------------------------------------------------
