-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2021_dialysis_ukrr.log
  log type:  text
 opened on:  29 Mar 2023, 19:23:07

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(19 vars, 50,000 obs)

. 
. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,745 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,941 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,743 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,264        9.72        9.72
           East Midlands |      3,474       10.35       20.07
                  London |      6,748       20.10       40.17
              North East |      3,365       10.02       50.20
              North West |      3,355        9.99       60.19
              South East |      3,280        9.77       69.96
              South West |      3,315        9.87       79.83
           West Midlands |      3,298        9.82       89.66
Yorkshire and The Humber |      3,472       10.34      100.00
-------------------------+-----------------------------------
                   Total |     33,571      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,690        5.03        5.03
          1 |      6,283       18.72       23.75
          2 |      6,479       19.30       43.05
          3 |      6,280       18.71       61.76
          4 |      6,419       19.12       80.88
          5 |      6,420       19.12      100.00
------------+-----------------------------------
      Total |     33,571      100.00

. drop if imd==0
(1,690 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * Calculate eGFR
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace latest_creatinine = . if !inrange(latest_creatinine, 20, 3000)
(14,022 real changes made, 14,022 to missing)

. gen mgdl_latest_creatinine = latest_creatinine/88.4
(14,022 missing values generated)

. gen min_latest_creatinine=.
(31,881 missing values generated)

. replace min_latest_creatinine = mgdl_latest_creatinine/0.7 if male==0
(9,066 real changes made)

. replace min_latest_creatinine = mgdl_latest_creatinine/0.9 if male==1
(8,793 real changes made)

. replace min_latest_creatinine = min_latest_creatinine^-0.329  if male==0
(9,066 real changes made)

. replace min_latest_creatinine = min_latest_creatinine^-0.411  if male==1
(8,793 real changes made)

. replace min_latest_creatinine = 1 if min_latest_creatinine<1
(11,296 real changes made)

. gen max_latest_creatinine=.
(31,881 missing values generated)

. replace max_latest_creatinine = mgdl_latest_creatinine/0.7 if male==0
(9,066 real changes made)

. replace max_latest_creatinine = mgdl_latest_creatinine/0.9 if male==1
(8,793 real changes made)

. replace max_latest_creatinine = max_latest_creatinine^-1.209
(17,859 real changes made)

. replace max_latest_creatinine = 1 if max_latest_creatinine>1
(20,585 real changes made)

. gen latest_egfr = min_latest_creatinine*max_latest_creatinine*141
(14,022 missing values generated)

. replace latest_egfr = latest_egfr*(0.993^age)
(17,859 real changes made)

. replace latest_egfr = latest_egfr*1.018 if male==0
(9,066 real changes made)

. drop latest_creatinine

. drop mgdl_latest_creatinine

. drop min_latest_creatinine

. drop max_latest_creatinine

. egen esrd_egfr = cut(latest_egfr), at(0, 15, 5000)
(14022 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 17859 changes made)

. replace esrd_egfr = 0 if latest_egfr==.
(14,022 real changes made)

. 
. * Correlate dialysis codes
. tab dialysis_primary_care dialysis_icd_10

dialysis_p |
rimary_car |    dialysis_icd_10
         e |         0          1 |     Total
-----------+----------------------+----------
         0 |    28,766      1,492 |    30,258 
         1 |     1,550         73 |     1,623 
-----------+----------------------+----------
     Total |    30,316      1,565 |    31,881 

. tab dialysis_primary_care dialysis_opcs_4

dialysis_p |
rimary_car |    dialysis_opcs_4
         e |         0          1 |     Total
-----------+----------------------+----------
         0 |    28,737      1,521 |    30,258 
         1 |     1,529         94 |     1,623 
-----------+----------------------+----------
     Total |    30,266      1,615 |    31,881 

. tab esrd_egfr dialysis_primary_care

           | dialysis_primary_care
 esrd_egfr |         0          1 |     Total
-----------+----------------------+----------
         0 |    30,258      1,623 |    31,881 
-----------+----------------------+----------
     Total |    30,258      1,623 |    31,881 

. tab esrd_egfr dialysis_icd_10

           |    dialysis_icd_10
 esrd_egfr |         0          1 |     Total
-----------+----------------------+----------
         0 |    30,316      1,565 |    31,881 
-----------+----------------------+----------
     Total |    30,316      1,565 |    31,881 

. tab esrd_egfr dialysis_opcs_4

           |    dialysis_opcs_4
 esrd_egfr |         0          1 |     Total
-----------+----------------------+----------
         0 |    30,266      1,615 |    31,881 
-----------+----------------------+----------
     Total |    30,266      1,615 |    31,881 

. 
. gen dialysis_sus = dialysis_icd_10

. replace dialysis_sus = 1 if dialysis_opcs_4==1
(1,516 real changes made)

. tab esrd_egfr dialysis_sus

           |     dialysis_sus
 esrd_egfr |         0          1 |     Total
-----------+----------------------+----------
         0 |    28,800      3,081 |    31,881 
-----------+----------------------+----------
     Total |    28,800      3,081 |    31,881 

. tab dialysis_primary_care dialysis_sus

dialysis_p |
rimary_car |     dialysis_sus
         e |         0          1 |     Total
-----------+----------------------+----------
         0 |    27,338      2,920 |    30,258 
         1 |     1,462        161 |     1,623 
-----------+----------------------+----------
     Total |    28,800      3,081 |    31,881 

. 
. gen dialysis_sus_egfr = dialysis_sus

. replace dialysis_sus_egfr = 0 if esrd_egfr==0
(3,081 real changes made)

. tab dialysis_primary_care dialysis_sus_egfr

dialysis_p | dialysis_s
rimary_car |  us_egfr
         e |         0 |     Total
-----------+-----------+----------
         0 |    30,258 |    30,258 
         1 |     1,623 |     1,623 
-----------+-----------+----------
     Total |    31,881 |    31,881 

. 
. tab ukrr

       ukrr |      Freq.     Percent        Cum.
------------+-----------------------------------
       ICHD |        786       48.49       48.49
         Tx |        835       51.51      100.00
------------+-----------------------------------
      Total |      1,621      100.00

. rename ukrr ukrr_string

. gen ukrr = 0

. replace ukrr = 1 if ukrr_string=="HD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="HHD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="ICHD"
(786 real changes made)

. replace ukrr = 1 if ukrr_string=="PD"
(0 real changes made)

. replace ukrr = 2 if ukrr_string=="Tx"
(835 real changes made)

. drop ukrr_string

. gen ukrr_dialysis = ukrr

. replace ukrr_dialysis = 0 if ukrr==2
(835 real changes made)

. 
. tab ukrr_dialysis dialysis_primary_care

ukrr_dialy | dialysis_primary_care
       sis |         0          1 |     Total
-----------+----------------------+----------
         0 |    29,510      1,585 |    31,095 
         1 |       748         38 |       786 
-----------+----------------------+----------
     Total |    30,258      1,623 |    31,881 

. tab ukrr_dialysis dialysis_sus

ukrr_dialy |     dialysis_sus
       sis |         0          1 |     Total
-----------+----------------------+----------
         0 |    28,079      3,016 |    31,095 
         1 |       721         65 |       786 
-----------+----------------------+----------
     Total |    28,800      3,081 |    31,881 

. tab ukrr_dialysis dialysis_sus_egfr

           | dialysis_s
ukrr_dialy |  us_egfr
       sis |         0 |     Total
-----------+-----------+----------
         0 |    31,095 |    31,095 
         1 |       786 |       786 
-----------+-----------+----------
     Total |    31,881 |    31,881 

. 
. gen dialysis_oscodes = dialysis_primary_care

. replace dialysis_oscodes = 1 if dialysis_sus==1
(2,920 real changes made)

. gen dialysis_oscodes_egfr = dialysis_primary_care

. replace dialysis_oscodes_egfr = 1 if dialysis_sus_egfr==1
(0 real changes made)

. tab ukrr_dialysis dialysis_oscodes

ukrr_dialy |   dialysis_oscodes
       sis |         0          1 |     Total
-----------+----------------------+----------
         0 |    26,651      4,444 |    31,095 
         1 |       687         99 |       786 
-----------+----------------------+----------
     Total |    27,338      4,543 |    31,881 

. tab ukrr_dialysis dialysis_oscodes_egfr

ukrr_dialy | dialysis_oscodes_egfr
       sis |         0          1 |     Total
-----------+----------------------+----------
         0 |    29,510      1,585 |    31,095 
         1 |       748         38 |       786 
-----------+----------------------+----------
     Total |    30,258      1,623 |    31,881 

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2021_dialysis_ukrr.log
  log type:  text
 closed on:  29 Mar 2023, 19:23:09
-------------------------------------------------------------------------------
