-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_v2.log
  log type:  text
 opened on:  24 Mar 2023, 17:55:59

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,551 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,979 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,722 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,387       10.04       10.04
           East Midlands |      3,477       10.30       20.34
                  London |      6,649       19.70       40.04
              North East |      3,349        9.92       49.96
              North West |      3,429       10.16       60.13
              South East |      3,318        9.83       69.96
              South West |      3,375       10.00       79.96
           West Midlands |      3,381       10.02       89.98
Yorkshire and The Humber |      3,383       10.02      100.00
-------------------------+-----------------------------------
                   Total |     33,748      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,720        5.10        5.10
          1 |      6,526       19.34       24.43
          2 |      6,377       18.90       43.33
          3 |      6,413       19.00       62.33
          4 |      6,385       18.92       81.25
          5 |      6,327       18.75      100.00
------------+-----------------------------------
      Total |     33,748      100.00

. drop if imd==0
(1,720 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,091 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(845 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(821 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,930 real changes made, 13,930 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,930 missing values generated)

. gen min_baseline_creatinine=.
(32,028 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,206 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,892 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,206 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,892 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,481 real changes made)

. gen max_baseline_creatinine=.
(32,028 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,206 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,892 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,098 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,547 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,930 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,098 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,206 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,674 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,028
25%            0              0       Sum of Wgt.      32,028

50%     11.76738                      Mean           12.50275
                        Largest       Std. Dev.      12.94392
75%     24.92564       41.70832
90%     29.12105       43.91414       Variance        167.545
95%     31.28555       44.89445       Skewness       .2091994
99%     35.35394       45.79845       Kurtosis       1.305345

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,647        5.69        5.69
         <= |      1,628        5.63       11.32
          = |     20,788       71.83       83.15
          > |      1,583        5.47       88.62
         >= |      1,662        5.74       94.36
          ~ |      1,631        5.64      100.00
------------+-----------------------------------
      Total |     28,939      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,603       54.96       54.96
   Albuminuria |     14,425       45.04      100.00
---------------+-----------------------------------
         Total |     32,028      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,929       46.61       46.61
          1 |     17,099       53.39      100.00
------------+-----------------------------------
      Total |     32,028      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(13930 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 18098 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(13,930 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,438       95.04       95.04
          1 |      1,590        4.96      100.00
------------+-----------------------------------
      Total |     32,028      100.00
(1,590 real changes made)
(721 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,416       94.97       94.97
          1 |      1,612        5.03      100.00
------------+-----------------------------------
      Total |     32,028      100.00
(1,536 real changes made)
(716 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,461       95.11       95.11
          1 |      1,567        4.89      100.00
------------+-----------------------------------
      Total |     32,028      100.00
(1,432 real changes made)
(646 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,404       94.93       94.93
          1 |      1,624        5.07      100.00
------------+-----------------------------------
      Total |     32,028      100.00
(1,402 real changes made)
(633 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,428       95.00       95.00
          1 |      1,600        5.00      100.00
------------+-----------------------------------
      Total |     32,028      100.00
(1,296 real changes made)
(593 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,375       94.84       94.84
          1 |      1,653        5.16      100.00
------------+-----------------------------------
      Total |     32,028      100.00
(1,295 real changes made)
(616 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,728      4,544 |    10,272 
 eGFR >=60 |     5,276      4,440 |     9,716 
  eGFR <60 |     1,938      1,551 |     3,489 
       KRT |     4,661      3,890 |     8,551 
-----------+----------------------+----------
     Total |    17,603     14,425 |    32,028 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,004       34.36       34.36
          1 |     21,024       65.64      100.00
------------+-----------------------------------
      Total |     32,028      100.00

. drop if ckd==0
(11,004 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,544 |     4,544 
 eGFR >=60 |         0      4,440 |     4,440 
  eGFR <60 |     1,938      1,551 |     3,489 
       KRT |     4,661      3,890 |     8,551 
-----------+----------------------+----------
     Total |     6,599     14,425 |    21,024 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd_v2.csv", replace
(note: file ./output/2022_ckd_v2.csv not found)
file ./output/2022_ckd_v2.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_v2.log
  log type:  text
 closed on:  24 Mar 2023, 17:56:01
-------------------------------------------------------------------------------
