-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete.log
  log type:  text
 opened on:  20 Sep 2023, 14:26:25

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,004 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(236 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,896
        from master                    47,946  (_merge==1)
        from using                     18,950  (_merge==2)

    matched                             2,054  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,896 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        166        8.08        8.08
Kidney transplant |        195        9.49       17.58
 Modality unclear |         42        2.04       19.62
          Pre KRT |      1,651       80.38      100.00
------------------+-----------------------------------
            Total |      2,054      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(783 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1271 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,271       61.88       61.88
          . |        783       38.12      100.00
------------+-----------------------------------
      Total |      2,054      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(166 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(25 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(122 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(294 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(12 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(42 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(0 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |        97         69 |       166 
Kidney transplant |       195          0 |       195 
 Modality unclear |        42          0 |        42 
          Pre KRT |     1,651          0 |     1,651 
------------------+----------------------+----------
            Total |     1,985         69 |     2,054 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       151         15 |       166 
Kidney transplant |       166         29 |       195 
 Modality unclear |        42          0 |        42 
          Pre KRT |     1,413        238 |     1,651 
------------------+----------------------+----------
            Total |     1,772        282 |     2,054 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       166          0 |       166 
Kidney transplant |       195          0 |       195 
 Modality unclear |         0         42 |        42 
          Pre KRT |     1,651          0 |     1,651 
------------------+----------------------+----------
            Total |     2,012         42 |     2,054 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,703        282 |     1,985 
         1 |        69          0 |        69 
-----------+----------------------+----------
     Total |     1,772        282 |     2,054 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(783 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1271 changes made)

. replace ckd_group = 4 if dialysis==1
(69 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(282 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(42 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(597 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,278       62.22       62.22
         CKD stage 3 |        366       17.82       80.04
       CKD stage 4/5 |         17        0.83       80.87
            Dialysis |         69        3.36       84.23
          Transplant |        282       13.73       97.96
KRT unclear modality |         42        2.04      100.00
---------------------+-----------------------------------
               Total |      2,054      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        52        138          0      1,088 |     1,278 
         CKD stage 3 |        30         26          0        310 |       366 
       CKD stage 4/5 |         0          2          0         15 |        17 
            Dialysis |        69          0          0          0 |        69 
          Transplant |        15         29          0        238 |       282 
KRT unclear modality |         0          0         42          0 |        42 
---------------------+--------------------------------------------+----------
               Total |       166        195         42      1,651 |     2,054 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       123         67         56         18 |     1,278 
         CKD stage 3 |        35         18         17          5 |       366 
       CKD stage 4/5 |         1          0          1          0 |        17 
            Dialysis |         4          4          0          0 |        69 
          Transplant |        33         14          8          1 |       282 
KRT unclear modality |         3          1          2          0 |        42 
---------------------+--------------------------------------------+----------
               Total |       199        104         84         24 |     2,054 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,014 |     1,278 
         CKD stage 3 |       291 |       366 
       CKD stage 4/5 |        15 |        17 
            Dialysis |        61 |        69 
          Transplant |       226 |       282 
KRT unclear modality |        36 |        42 
---------------------+-----------+----------
               Total |     1,643 |     2,054 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,089 missing values generated)

. replace sex = 0 if male == "Female"
(1,089 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(904 real changes made, 904 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(904 missing values generated)

. gen min_creatinine_outcome=.
(2,054 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(599 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(551 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(599 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(551 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(728 real changes made)

. gen max_creatinine_outcome=.
(2,054 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(599 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(551 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,150 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,326 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(904 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,150 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(599 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(904 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1150 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(184 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(12 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(6 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(904 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1150 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,150       55.99       55.99
          . |        904       44.01      100.00
------------+-----------------------------------
      Total |      2,054      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(104 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(84 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(14 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(24 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(104 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(98 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(199 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,479       72.01       72.01
               CKD 3 |        148        7.21       79.21
     CKD 4/5 pre-KRT |         16        0.78       79.99
            Dialysis |        104        5.06       85.05
   Kidney transplant |         98        4.77       89.82
KRT unclear modality |         10        0.49       90.31
            Deceased |        199        9.69      100.00
---------------------+-----------------------------------
               Total |      2,054      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(783 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1271 changes made)

. replace access_egfr=0 if ckd_group==4
(69 real changes made)

. replace access_egfr=3 if access_egfr==.
(714 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,278
  CKD stage |         132           0         366
  CKD stage |           1           0          17
   Dialysis |          26           0          69
  Transplan |          52           0         282
  KRT uncle |           2           0          42
------------+------------------------------------
      Total |   228.19815   116.45373       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,054         529           0        529        529

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,278
  CKD stage |         103           0         366
  CKD stage |           8           0          17
   Dialysis |          14           0          69
  Transplan |          51           0         282
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   227.06719    124.9733       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,054         509           0        509        509

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,278
  CKD stage |          79           0         366
  CKD stage |           0           0          17
   Dialysis |          14           0          69
  Transplan |          81           0         282
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   218.75463   118.18704       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,054         494           0        494        494

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,278
  CKD stage |          72           0         366
  CKD stage |           7           0          17
   Dialysis |          17           0          69
  Transplan |          53           0         282
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   221.14508   130.13465       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,054         474           0        474        474

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,278
  CKD stage |          64           0         366
  CKD stage |           4           0          17
   Dialysis |          30           0          69
  Transplan |          55           0         282
  KRT uncle |          27           0          42
------------+------------------------------------
      Total |    235.2074   141.19155       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,054         525           0        525        525

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,278
  CKD stage |         100           0         366
  CKD stage |           2           0          17
   Dialysis |          34           0          69
  Transplan |          89           0         282
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   203.87342   95.364431       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,054         518           0        518        518

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,278
  CKD stage |          96           0         366
  CKD stage |          12           0          17
   Dialysis |          16           0          69
  Transplan |          67           0         282
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |    238.7147   131.22814       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,054         542           0        542        542

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,278
  CKD stage |         109           0         366
  CKD stage |           9           0          17
   Dialysis |          13           0          69
  Transplan |          84           0         282
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   230.89776   116.20466       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,054         551           0        551        551

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,278
  CKD stage |          84           0         366
  CKD stage |           6           0          17
   Dialysis |          20           0          69
  Transplan |          66           0         282
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   223.55988   123.36313       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,054         511           0        511        511

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         271           0       1,278
  CKD stage |         106           0         366
  CKD stage |           0           0          17
   Dialysis |          18           0          69
  Transplan |          53           0         282
  KRT uncle |           2           0          42
------------+------------------------------------
      Total |   195.42648   99.534407       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,054         450           0        450        450

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,278
  CKD stage |         100           0         366
  CKD stage |           6           0          17
   Dialysis |           3           0          69
  Transplan |         114           0         282
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   257.19523   132.73214       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,054         592           0        592        592

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,278
  CKD stage |         106           0         366
  CKD stage |           9           0          17
   Dialysis |          10           0          69
  Transplan |          76           0         282
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   266.93427   147.90595       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,054         589           0        589        589

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,278
  CKD stage |         111           0         366
  CKD stage |           3           0          17
   Dialysis |          10           0          69
  Transplan |          72           0         282
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   260.38218   142.48471       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,054         573           0        573        573

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,278
  CKD stage |          89           0         366
  CKD stage |           9           0          17
   Dialysis |          15           0          69
  Transplan |          53           0         282
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |   242.95326    141.0118       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,054         529           0        529        529

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,278
  CKD stage |          87           0         366
  CKD stage |          10           0          17
   Dialysis |          11           0          69
  Transplan |          72           0         282
  KRT uncle |           6           0          42
------------+------------------------------------
      Total |    221.9557   120.60958       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,054         501           0        501        501

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,278
  CKD stage |          68           0         366
  CKD stage |           9           0          17
   Dialysis |           3           0          69
  Transplan |          85           0         282
  KRT uncle |           4           0          42
------------+------------------------------------
      Total |    220.6592   123.54998       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,054         485           0        485        485

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,278
  CKD stage |         106           0         366
  CKD stage |           0           0          17
   Dialysis |          14           0          69
  Transplan |          92           0         282
  KRT uncle |          26           0          42
------------+------------------------------------
      Total |   236.60273   118.95147       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,054         566           0        566        566

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,278
  CKD stage |         106           0         366
  CKD stage |           7           0          17
   Dialysis |          14           0          69
  Transplan |          73           0         282
  KRT uncle |          14           0          42
------------+------------------------------------
      Total |   231.31792   120.66483       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,054         538           0        538        538

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,278
  CKD stage |          83           0         366
  CKD stage |           2           0          17
   Dialysis |          28           0          69
  Transplan |          66           0         282
  KRT uncle |          13           0          42
------------+------------------------------------
      Total |   219.82278   120.40261       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,054         505           0        505        505

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,278
  CKD stage |          93           0         366
  CKD stage |           0           0          17
   Dialysis |          16           0          69
  Transplan |          83           0         282
  KRT uncle |          13           0          42
------------+------------------------------------
      Total |   273.29503   154.65688       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,054         598           0        598        598

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,278
  CKD stage |         101           0         366
  CKD stage |          15           0          17
   Dialysis |          13           0          69
  Transplan |          24           0         282
  KRT uncle |          15           0          42
------------+------------------------------------
      Total |   229.35248   135.31622       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,054         501           0        501        501

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,278
  CKD stage |         120           0         366
  CKD stage |           0           0          17
   Dialysis |           9           0          69
  Transplan |          51           0         282
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   252.26144   139.61115       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,054         549           0        549        549

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,278
  CKD stage |         109           0         366
  CKD stage |           5           0          17
   Dialysis |          16           0          69
  Transplan |          72           0         282
  KRT uncle |          13           0          42
------------+------------------------------------
      Total |   252.90019   136.51129       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,054         573           0        573        573

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         383           0       1,278
  CKD stage |          93           0         366
  CKD stage |           4           0          17
   Dialysis |          23           0          69
  Transplan |          95           0         282
  KRT uncle |          23           0          42
------------+------------------------------------
      Total |   269.19328   147.05248       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,054         621           0        621        621

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,278
  CKD stage |          95           0         366
  CKD stage |           3           0          17
   Dialysis |          17           0          69
  Transplan |          54           0         282
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   221.88023   122.19006       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,054         501           0        501        501

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,278
  CKD stage |          98           0         366
  CKD stage |           5           0          17
   Dialysis |          10           0          69
  Transplan |          68           0         282
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |   210.20497   109.31819       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         480           0        480        480

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,278
  CKD stage |          80           0         366
  CKD stage |           5           0          17
   Dialysis |          26           0          69
  Transplan |          82           0         282
  KRT uncle |           4           0          42
------------+------------------------------------
      Total |   208.19231   108.62702       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         489           0        489        489

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,278
  CKD stage |          76           0         366
  CKD stage |           9           0          17
   Dialysis |          33           0          69
  Transplan |          73           0         282
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   216.52872   118.09169       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         506           0        506        506

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,278
  CKD stage |         119           0         366
  CKD stage |           4           0          17
   Dialysis |          12           0          69
  Transplan |          90           0         282
  KRT uncle |          15           0          42
------------+------------------------------------
      Total |   260.78481   134.47733       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         604           0        604        604

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,278
  CKD stage |         106           0         366
  CKD stage |          11           0          17
   Dialysis |          18           0          69
  Transplan |          77           0         282
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   246.86514   131.32654       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,054         569           0        569        569

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,278
  CKD stage |          83           0         366
  CKD stage |           4           0          17
   Dialysis |           9           0          69
  Transplan |          67           0         282
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   244.12415   140.68704       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,054         524           0        524        524

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,278
  CKD stage |          93           0         366
  CKD stage |           0           0          17
   Dialysis |          16           0          69
  Transplan |          70           0         282
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   220.38754    117.6424       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,054         498           0        498        498

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,278
  CKD stage |         118           0         366
  CKD stage |           1           0          17
   Dialysis |           9           0          69
  Transplan |          85           0         282
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   255.93866   133.13595       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,054         580           0        580        580

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,278
  CKD stage |          98           0         366
  CKD stage |           0           0          17
   Dialysis |           3           0          69
  Transplan |          88           0         282
  KRT uncle |          12           0          42
------------+------------------------------------
      Total |   271.92648   151.64751       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,054         590           0        590        590

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,278
  CKD stage |         115           0         366
  CKD stage |           2           0          17
   Dialysis |           9           0          69
  Transplan |         101           0         282
  KRT uncle |           1           0          42
------------+------------------------------------
      Total |   252.46787   127.46492       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,054         578           0        578        578

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,278
  CKD stage |         130           0         366
  CKD stage |           1           0          17
   Dialysis |           3           0          69
  Transplan |          73           0         282
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   238.16358   119.90566       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,054         544           0        544        544

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,278
  CKD stage |          80           0         366
  CKD stage |          -1           0          17
   Dialysis |          30           0          69
  Transplan |          47           0         282
  KRT uncle |          12           0          42
------------+------------------------------------
      Total |   220.43476   127.31472       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,054         487           0        487        487

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         273           0       1,278
  CKD stage |          74           0         366
  CKD stage |           0           0          17
   Dialysis |           3           0          69
  Transplan |          78           0         282
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   193.99951   102.73107       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         435           0        435        435

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,278
  CKD stage |          75           0         366
  CKD stage |           5           0          17
   Dialysis |          12           0          69
  Transplan |          60           0         282
  KRT uncle |          13           0          42
------------+------------------------------------
      Total |   220.17186   126.31944       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         483           0        483        483

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,278
  CKD stage |          76           0         366
  CKD stage |          16           0          17
   Dialysis |          11           0          69
  Transplan |          76           0         282
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |   237.37342   135.15451       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         526           0        526        526

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,278
  CKD stage |         112           0         366
  CKD stage |           2           0          17
   Dialysis |          22           0          69
  Transplan |          97           0         282
  KRT uncle |          12           0          42
------------+------------------------------------
      Total |   210.35833   95.558737       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         528           0        528        528

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,278
  CKD stage |          88           0         366
  CKD stage |           4           0          17
   Dialysis |          13           0          69
  Transplan |          61           0         282
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   233.28968   131.57744       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,054         517           0        517        517

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,278
  CKD stage |         121           0         366
  CKD stage |           3           0          17
   Dialysis |           8           0          69
  Transplan |          97           0         282
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |   271.14946   140.58909       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,054         616           0        616        616

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,278
  CKD stage |          97           0         366
  CKD stage |           6           0          17
   Dialysis |           9           0          69
  Transplan |          70           0         282
  KRT uncle |           0           0          42
------------+------------------------------------
      Total |   239.41723   131.87227       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,054         523           0        523        523

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         248           0       1,278
  CKD stage |         115           0         366
  CKD stage |           2           0          17
   Dialysis |          22           0          69
  Transplan |          57           0         282
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   183.44012   86.256943       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,054         447           0        447        447

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,278
  CKD stage |          88           0         366
  CKD stage |          11           0          17
   Dialysis |          23           0          69
  Transplan |          95           0         282
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |   243.84907   129.67172       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,054         572           0        572        572

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,278
  CKD stage |          85           0         366
  CKD stage |           5           0          17
   Dialysis |          33           0          69
  Transplan |          49           0         282
  KRT uncle |          13           0          42
------------+------------------------------------
      Total |   265.32522   159.44975       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,054         574           0        574        574

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,278
  CKD stage |          97           0         366
  CKD stage |           7           0          17
   Dialysis |          15           0          69
  Transplan |          51           0         282
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   209.82571   113.60654       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,054         476           0        476        476

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,278
  CKD stage |          73           0         366
  CKD stage |           9           0          17
   Dialysis |          10           0          69
  Transplan |          80           0         282
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |   214.39776    117.2828       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,054         488           0        488        488

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         273           0       1,278
  CKD stage |          82           0         366
  CKD stage |          15           0          17
   Dialysis |           5           0          69
  Transplan |          91           0         282
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |   197.36027   98.812667       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,054         471           0        471        471

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,278
  CKD stage |          90           0         366
  CKD stage |           7           0          17
   Dialysis |          33           0          69
  Transplan |          73           0         282
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |   228.92113   123.00844       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,054         532           0        532        532

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,278
  CKD stage |          73           0         366
  CKD stage |           4           0          17
   Dialysis |          18           0          69
  Transplan |          61           0         282
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   229.41772   133.58479       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,054         499           0        499        499

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,278
  CKD stage |          74           0         366
  CKD stage |           0           0          17
   Dialysis |          23           0          69
  Transplan |          56           0         282
  KRT uncle |           4           0          42
------------+------------------------------------
      Total |   222.07741    128.9433       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         479           0        479        479

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         276           0       1,278
  CKD stage |         119           0         366
  CKD stage |          10           0          17
   Dialysis |          19           0          69
  Transplan |          67           0         282
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   203.05599   96.561887       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,054         501           0        501        501

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         257           0       1,278
  CKD stage |          61           0         366
  CKD stage |           6           0          17
   Dialysis |          22           0          69
  Transplan |          51           0         282
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   178.62707   101.14326       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,054         400           0        400        400

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,278
  CKD stage |          83           0         366
  CKD stage |           1           0          17
   Dialysis |          25           0          69
  Transplan |         107           0         282
  KRT uncle |          23           0          42
------------+------------------------------------
      Total |   239.23564   124.22365       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,054         574           0        574        574

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,278
  CKD stage |          92           0         366
  CKD stage |           5           0          17
   Dialysis |          20           0          69
  Transplan |          67           0         282
  KRT uncle |          12           0          42
------------+------------------------------------
      Total |     201.389   103.52951       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,054         477           0        477        477

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,278
  CKD stage |          81           0         366
  CKD stage |           2           0          17
   Dialysis |          14           0          69
  Transplan |          73           0         282
  KRT uncle |          17           0          42
------------+------------------------------------
      Total |   249.28238   142.89399       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,054         547           0        547        547

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,278
  CKD stage |          91           0         366
  CKD stage |           0           0          17
   Dialysis |          17           0          69
  Transplan |          79           0         282
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   200.16602   100.11527       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,054         473           0        473        473

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,278
  CKD stage |         109           0         366
  CKD stage |           7           0          17
   Dialysis |          16           0          69
  Transplan |          75           0         282
  KRT uncle |          21           0          42
------------+------------------------------------
      Total |   224.87098   113.64058       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,054         540           0        540        540

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,278
  CKD stage |          92           0         366
  CKD stage |           0           0          17
   Dialysis |          18           0          69
  Transplan |          72           0         282
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   229.28238   124.05434       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,054         516           0        516        516

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,278
  CKD stage |         131           0         366
  CKD stage |          10           0          17
   Dialysis |          32           0          69
  Transplan |          63           0         282
  KRT uncle |           7           0          42
------------+------------------------------------
      Total |   217.46446     104.251       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         539           0        539        539

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,278
  CKD stage |          91           0         366
  CKD stage |           5           0          17
   Dialysis |           6           0          69
  Transplan |          76           0         282
  KRT uncle |          15           0          42
------------+------------------------------------
      Total |    216.3481   113.91097       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         497           0        497        497

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,278
  CKD stage |          81           0         366
  CKD stage |           9           0          17
   Dialysis |          16           0          69
  Transplan |          59           0         282
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   240.35492    140.2862       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         517           0        517        517

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,278
  CKD stage |          89           0         366
  CKD stage |           1           0          17
   Dialysis |          10           0          69
  Transplan |          97           0         282
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |   213.79406   107.32911       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         498           0        498        498

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,278
  CKD stage |         103           0         366
  CKD stage |          14           0          17
   Dialysis |           8           0          69
  Transplan |          76           0         282
  KRT uncle |          11           0          42
------------+------------------------------------
      Total |   240.94547   128.72215       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,054         552           0        552        552

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,278
  CKD stage |          77           0         366
  CKD stage |           0           0          17
   Dialysis |          25           0          69
  Transplan |         104           0         282
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   255.52434   140.42964       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,054         580           0        580        580

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,278
  CKD stage |         100           0         366
  CKD stage |           7           0          17
   Dialysis |           9           0          69
  Transplan |          76           0         282
  KRT uncle |           6           0          42
------------+------------------------------------
      Total |   240.90652   130.00438       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,054         539           0        539        539

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,278
  CKD stage |          98           0         366
  CKD stage |           0           0          17
   Dialysis |          20           0          69
  Transplan |          90           0         282
  KRT uncle |          13           0          42
------------+------------------------------------
      Total |   244.79357   128.65919       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,054         565           0        565        565

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,278
  CKD stage |         117           0         366
  CKD stage |          14           0          17
   Dialysis |          25           0          69
  Transplan |          63           0         282
  KRT uncle |          21           0          42
------------+------------------------------------
      Total |   267.94109   146.80975       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,054         621           0        621        621

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,278
  CKD stage |          68           0         366
  CKD stage |           1           0          17
   Dialysis |          18           0          69
  Transplan |         111           0         282
  KRT uncle |          14           0          42
------------+------------------------------------
      Total |    242.9148   132.62285       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,054         557           0        557        557

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,278
  CKD stage |         105           0         366
  CKD stage |           3           0          17
   Dialysis |          19           0          69
  Transplan |          88           0         282
  KRT uncle |          13           0          42
------------+------------------------------------
      Total |   205.31451   96.574306       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,054         507           0        507        507

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,278
  CKD stage |          83           0         366
  CKD stage |           0           0          17
   Dialysis |          36           0          69
  Transplan |          62           0         282
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   233.89776   131.71298       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,054         533           0        533        533

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,278
  CKD stage |          60           0         366
  CKD stage |           8           0          17
   Dialysis |          21           0          69
  Transplan |          74           0         282
  KRT uncle |          16           0          42
------------+------------------------------------
      Total |   221.67624   128.03777       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,054         500           0        500        500

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,278
  CKD stage |          93           0         366
  CKD stage |           2           0          17
   Dialysis |          12           0          69
  Transplan |          70           0         282
  KRT uncle |           0           0          42
------------+------------------------------------
      Total |   224.46154   121.50053       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,054         495           0        495        495

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,278
  CKD stage |          98           0         366
  CKD stage |           3           0          17
   Dialysis |          14           0          69
  Transplan |          66           0         282
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   234.89533   128.68051       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,054         518           0        518        518

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,278
  CKD stage |          83           0         366
  CKD stage |           1           0          17
   Dialysis |          23           0          69
  Transplan |          71           0         282
  KRT uncle |          18           0          42
------------+------------------------------------
      Total |   240.96787   135.55383       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         542           0        542        542

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,278
  CKD stage |         114           0         366
  CKD stage |           4           0          17
   Dialysis |          13           0          69
  Transplan |          92           0         282
  KRT uncle |           5           0          42
------------+------------------------------------
      Total |   236.35394   117.27153       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,054         554           0        554        554

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,278
  CKD stage |          66           0         366
  CKD stage |           2           0          17
   Dialysis |          26           0          69
  Transplan |          76           0         282
  KRT uncle |          18           0          42
------------+------------------------------------
      Total |   216.95716   121.30615       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,054         499           0        499        499

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,278
  CKD stage |          89           0         366
  CKD stage |           2           0          17
   Dialysis |           2           0          69
  Transplan |          72           0         282
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   226.98247   124.59962       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,054         497           0        497        497

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,278
  CKD stage |          86           0         366
  CKD stage |           4           0          17
   Dialysis |          25           0          69
  Transplan |          88           0         282
  KRT uncle |          15           0          42
------------+------------------------------------
      Total |   229.55648   120.96001       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,054         541           0        541        541

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         405           0       1,278
  CKD stage |          80           0         366
  CKD stage |           0           0          17
   Dialysis |           7           0          69
  Transplan |          74           0         282
  KRT uncle |           4           0          42
------------+------------------------------------
      Total |   276.72298   165.49434       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,054         570           0        570        570

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         267           0       1,278
  CKD stage |          77           0         366
  CKD stage |           4           0          17
   Dialysis |          20           0          69
  Transplan |          69           0         282
  KRT uncle |           6           0          42
------------+------------------------------------
      Total |   190.14898   99.642851       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,054         443           0        443        443

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         273           0       1,278
  CKD stage |          89           0         366
  CKD stage |          10           0          17
   Dialysis |          14           0          69
  Transplan |          77           0         282
  KRT uncle |           4           0          42
------------+------------------------------------
      Total |     196.926   99.146904       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,054         467           0        467        467

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,278
  CKD stage |          82           0         366
  CKD stage |           0           0          17
   Dialysis |           8           0          69
  Transplan |          59           0         282
  KRT uncle |           3           0          42
------------+------------------------------------
      Total |   214.67965   120.92393       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,054         460           0        460        460

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,278
  CKD stage |          73           0         366
  CKD stage |          11           0          17
   Dialysis |          17           0          69
  Transplan |          70           0         282
  KRT uncle |          15           0          42
------------+------------------------------------
      Total |   202.15871   109.66022       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         473           0        473        473

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,278
  CKD stage |          84           0         366
  CKD stage |           6           0          17
   Dialysis |           9           0          69
  Transplan |          59           0         282
  KRT uncle |          10           0          42
------------+------------------------------------
      Total |   228.32863   130.23898       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         497           0        497        497

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,278
  CKD stage |         104           0         366
  CKD stage |           4           0          17
   Dialysis |          32           0          69
  Transplan |          60           0         282
  KRT uncle |           8           0          42
------------+------------------------------------
      Total |    240.2113   130.82186       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         549           0        549        549

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,278
  CKD stage |          90           0         366
  CKD stage |           0           0          17
   Dialysis |          22           0          69
  Transplan |          34           0         282
  KRT uncle |           9           0          42
------------+------------------------------------
      Total |   238.15385   142.35009       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,054         503           0        503        503

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,278
  CKD stage |         113           0         366
  CKD stage |           3           0          17
   Dialysis |           8           0          69
  Transplan |          40           0         282
  KRT uncle |          19           0          42
------------+------------------------------------
      Total |   198.65871   103.85261       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,054         460           0        460        460

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,278
  CKD stage |          78           0         366
  CKD stage |           3           0          17
   Dialysis |          26           0          69
  Transplan |          56           0         282
  KRT uncle |           4           0          42
------------+------------------------------------
      Total |   214.82717    121.6659       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,054         476           0        476        476

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(80 real changes made)

. replace ethnicity=2 if ethnicity==3
(77 real changes made)

. replace ethnicity=3 if ethnicity==4
(85 real changes made)

. replace ethnicity=4 if ethnicity==6
(80 real changes made)

. replace ethnicity=6 if ethnicity==.
(505 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,851 missing values generated)

. replace region = 2 if region_string=="East"
(220 real changes made)

. replace region = 3 if region_string=="London"
(407 real changes made)

. replace region = 4 if region_string=="North East"
(209 real changes made)

. replace region = 5 if region_string=="North West"
(211 real changes made)

. replace region = 6 if region_string=="South East"
(204 real changes made)

. replace region = 7 if region_string=="South West"
(194 real changes made)

. replace region = 8 if region_string=="West Midlands"
(191 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(215 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,054 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(859 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,195 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2022_ckd_complete.dta not found)
file ./output/2022_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,554
        from master                       500  (_merge==1)
        from using                      2,054  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(500 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,278
  CKD stage |           0           0         366
  CKD stage |           0           0          17
   Dialysis |           0           0          69
  Transplan |           0           0         282
  KRT uncle |           0           0          42
------------+------------------------------------
      Total |           0           0       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,054           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,278
  CKD stage |           0           0         366
  CKD stage |           0           0          17
   Dialysis |           0           0          69
  Transplan |           0           0         282
  KRT uncle |           0           0          42
------------+------------------------------------
      Total |           0           0       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,054           0           0          0          0

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,278
  CKD stage |           0           0         366
  CKD stage |           0           0          17
   Dialysis |           0           0          69
  Transplan |           0           0         282
  KRT uncle |           0           0          42
------------+------------------------------------
      Total |           0           0       2,054

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,054           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2022_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete.log
  log type:  text
 closed on:  20 Sep 2023, 14:26:27
-------------------------------------------------------------------------------
