-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete_v3.log
  log type:  text
 opened on:  21 Apr 2023, 07:56:56

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 20,898 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,744
        from master                    47,923  (_merge==1)
        from using                     18,821  (_merge==2)

    matched                             2,077  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,744 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v3

. save ``dataset'_ckd_complete_v3', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v3
> save 2017_ckd_complete_v3, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        180        8.67        8.67
Kidney transplant |        193        9.29       17.96
 Modality unclear |         34        1.64       19.60
          Pre KRT |      1,670       80.40      100.00
------------------+-----------------------------------
            Total |      2,077      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(832 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1245 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,245       59.94       59.94
          . |        832       40.06      100.00
------------+-----------------------------------
      Total |      2,077      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(180 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(22 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(132 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(286 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(7 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       110         70 |       180 
Kidney transplant |       193          0 |       193 
 Modality unclear |        34          0 |        34 
          Pre KRT |     1,670          0 |     1,670 
------------------+----------------------+----------
            Total |     2,007         70 |     2,077 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       168         12 |       180 
Kidney transplant |       165         28 |       193 
 Modality unclear |        31          3 |        34 
          Pre KRT |     1,434        236 |     1,670 
------------------+----------------------+----------
            Total |     1,798        279 |     2,077 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(832 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1245 changes made)

. replace ckd_group = 4 if dialysis==1
(70 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(279 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(34 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(640 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,288       62.01       62.01
         CKD stage 3 |        386       18.58       80.60
       CKD stage 4/5 |         23        1.11       81.70
            Dialysis |         70        3.37       85.07
          Transplant |        276       13.29       98.36
KRT unclear modality |         34        1.64      100.00
---------------------+-----------------------------------
               Total |      2,077      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        60        122          0      1,106 |     1,288 
         CKD stage 3 |        35         41          0        310 |       386 
       CKD stage 4/5 |         3          2          0         18 |        23 
            Dialysis |        70          0          0          0 |        70 
          Transplant |        12         28          0        236 |       276 
KRT unclear modality |         0          0         34          0 |        34 
---------------------+--------------------------------------------+----------
               Total |       180        193         34      1,670 |     2,077 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       123         60         57         13 |     1,288 
         CKD stage 3 |        44         26         13          3 |       386 
       CKD stage 4/5 |         3          3          0          0 |        23 
            Dialysis |         3          3          4          1 |        70 
          Transplant |        24         12         10          3 |       276 
KRT unclear modality |         0          1          0          1 |        34 
---------------------+--------------------------------------------+----------
               Total |       197        105         84         21 |     2,077 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,035 |     1,288 
         CKD stage 3 |       300 |       386 
       CKD stage 4/5 |        17 |        23 
            Dialysis |        59 |        70 
          Transplant |       227 |       276 
KRT unclear modality |        32 |        34 
---------------------+-----------+----------
               Total |     1,670 |     2,077 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,153 missing values generated)

. replace sex = 0 if male == "Female"
(1,153 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(928 real changes made, 928 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(928 missing values generated)

. gen min_creatinine_outcome=.
(2,077 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(628 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(521 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(628 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(521 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(730 real changes made)

. gen max_creatinine_outcome=.
(2,077 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(628 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(521 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,149 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,347 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(928 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,149 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(628 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(928 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1149 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(181 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(8 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(6 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(928 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1149 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,149       55.32       55.32
          . |        928       44.68      100.00
------------+-----------------------------------
      Total |      2,077      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(105 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(84 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(14 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(21 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(105 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(98 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(197 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,509       72.65       72.65
               CKD 3 |        149        7.17       79.83
     CKD 4/5 pre-KRT |         12        0.58       80.40
            Dialysis |        105        5.06       85.46
   Kidney transplant |         98        4.72       90.18
KRT unclear modality |          7        0.34       90.52
            Deceased |        197        9.48      100.00
---------------------+-----------------------------------
               Total |      2,077      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,288
  CKD stage |          85           0         386
  CKD stage |           8           0          23
   Dialysis |          19           0          70
  Transplan |          41           0         276
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   210.50843   120.75476       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,077         458           0        458        458

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,288
  CKD stage |          63           0         386
  CKD stage |           6           0          23
   Dialysis |          34           0          70
  Transplan |          68           0         276
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   199.39432   111.19109       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,077         462           0        462        462

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,288
  CKD stage |          92           0         386
  CKD stage |           0           0          23
   Dialysis |          10           0          70
  Transplan |          37           0         276
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   251.96148   152.25514       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,077         519           0        519        519

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         410           0       1,288
  CKD stage |          95           0         386
  CKD stage |           0           0          23
   Dialysis |          10           0          70
  Transplan |         100           0         276
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   285.72845   160.08263       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,077         627           0        627        627

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,288
  CKD stage |          89           0         386
  CKD stage |           6           0          23
   Dialysis |          28           0          70
  Transplan |          67           0         276
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   236.74145   131.61652       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,077         533           0        533        533

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,288
  CKD stage |          80           0         386
  CKD stage |           5           0          23
   Dialysis |          21           0          70
  Transplan |          73           0         276
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   249.96389   143.89482       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,077         550           0        550        550

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,288
  CKD stage |          65           0         386
  CKD stage |          19           0          23
   Dialysis |          18           0          70
  Transplan |          83           0         276
  KRT uncle |          17           0          34
------------+------------------------------------
      Total |   223.26481   125.61458       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,077         523           0        523        523

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         407           0       1,288
  CKD stage |         108           0         386
  CKD stage |           6           0          23
   Dialysis |          39           0          70
  Transplan |          72           0         276
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   283.57439   158.84173       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,077         642           0        642        642

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,288
  CKD stage |         114           0         386
  CKD stage |          10           0          23
   Dialysis |          16           0          70
  Transplan |         100           0         276
  KRT uncle |          28           0          34
------------+------------------------------------
      Total |   241.46461     117.562       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,077         600           0        600        600

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,288
  CKD stage |         147           0         386
  CKD stage |           8           0          23
   Dialysis |          20           0          70
  Transplan |          87           0         276
  KRT uncle |          15           0          34
------------+------------------------------------
      Total |    224.6856   98.133623       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,077         575           0        575        575

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,288
  CKD stage |          74           0         386
  CKD stage |           4           0          23
   Dialysis |          12           0          70
  Transplan |          52           0         276
  KRT uncle |           0           0          34
------------+------------------------------------
      Total |    227.6129   135.45589       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,077         475           0        475        475

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,288
  CKD stage |          96           0         386
  CKD stage |           3           0          23
   Dialysis |          21           0          70
  Transplan |          75           0         276
  KRT uncle |          19           0          34
------------+------------------------------------
      Total |   217.37747   111.99846       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,077         518           0        518        518

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,288
  CKD stage |          88           0         386
  CKD stage |          10           0          23
   Dialysis |          33           0          70
  Transplan |          67           0         276
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   230.63264   126.54572       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,077         535           0        535        535

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,288
  CKD stage |         108           0         386
  CKD stage |           8           0          23
   Dialysis |          15           0          70
  Transplan |          57           0         276
  KRT uncle |          -1           0          34
------------+------------------------------------
      Total |   218.60183   115.21091       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         494           0        494        494

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,288
  CKD stage |         109           0         386
  CKD stage |           3           0          23
   Dialysis |          19           0          70
  Transplan |          78           0         276
  KRT uncle |           0           0          34
------------+------------------------------------
      Total |   213.61242   104.90438       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         503           0        503        503

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,288
  CKD stage |          92           0         386
  CKD stage |           7           0          23
   Dialysis |          21           0          70
  Transplan |          79           0         276
  KRT uncle |          18           0          34
------------+------------------------------------
      Total |   263.70294   148.22203       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         596           0        596        596

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,288
  CKD stage |          87           0         386
  CKD stage |           6           0          23
   Dialysis |          17           0          70
  Transplan |          99           0         276
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   221.02744   112.69426       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         521           0        521        521

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,288
  CKD stage |         102           0         386
  CKD stage |           9           0          23
   Dialysis |          11           0          70
  Transplan |          73           0         276
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   266.19499    149.3008       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         588           0        588        588

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,288
  CKD stage |         102           0         386
  CKD stage |           7           0          23
   Dialysis |          23           0          70
  Transplan |          51           0         276
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   236.98844   131.94612       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         533           0        533        533

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,288
  CKD stage |         121           0         386
  CKD stage |           3           0          23
   Dialysis |          25           0          70
  Transplan |         120           0         276
  KRT uncle |          18           0          34
------------+------------------------------------
      Total |   241.76456    110.0959       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         613           0        613        613

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,288
  CKD stage |         135           0         386
  CKD stage |           1           0          23
   Dialysis |          26           0          70
  Transplan |          56           0         276
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   214.62542    103.1649       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         518           0        518        518

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,288
  CKD stage |          82           0         386
  CKD stage |           9           0          23
   Dialysis |          23           0          70
  Transplan |          59           0         276
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   259.06355   153.96173       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         557           0        557        557

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,288
  CKD stage |         120           0         386
  CKD stage |           4           0          23
   Dialysis |          24           0          70
  Transplan |          80           0         276
  KRT uncle |          14           0          34
------------+------------------------------------
      Total |   241.13625   120.78261       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         576           0        576        576

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,288
  CKD stage |         140           0         386
  CKD stage |           8           0          23
   Dialysis |          30           0          70
  Transplan |          50           0         276
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   245.91045   126.78402       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         574           0        574        574

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,288
  CKD stage |         122           0         386
  CKD stage |          12           0          23
   Dialysis |           9           0          70
  Transplan |          40           0         276
  KRT uncle |          24           0          34
------------+------------------------------------
      Total |   248.34184   137.98402       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,077         561           0        561        561

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,288
  CKD stage |         112           0         386
  CKD stage |           4           0          23
   Dialysis |          27           0          70
  Transplan |          54           0         276
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   212.55079   109.10729       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         496           0        496        496

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,288
  CKD stage |         106           0         386
  CKD stage |           9           0          23
   Dialysis |          13           0          70
  Transplan |          76           0         276
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   271.59798   151.47904       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         595           0        595        595

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         433           0       1,288
  CKD stage |          79           0         386
  CKD stage |           6           0          23
   Dialysis |          36           0          70
  Transplan |          44           0         276
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   290.46991   182.68135       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         607           0        607        607

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         258           0       1,288
  CKD stage |          91           0         386
  CKD stage |           2           0          23
   Dialysis |          11           0          70
  Transplan |          75           0         276
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   187.41069   91.930507       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         446           0        446        446

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,288
  CKD stage |          80           0         386
  CKD stage |          10           0          23
   Dialysis |          11           0          70
  Transplan |          58           0         276
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   220.35436   125.71121       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         483           0        483        483

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,288
  CKD stage |          84           0         386
  CKD stage |           5           0          23
   Dialysis |          15           0          70
  Transplan |          74           0         276
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   202.75734   106.35528       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         464           0        464        464

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         387           0       1,288
  CKD stage |          96           0         386
  CKD stage |           2           0          23
   Dialysis |          25           0          70
  Transplan |          70           0         276
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   268.19259   152.79676       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         592           0        592        592

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,288
  CKD stage |         126           0         386
  CKD stage |           6           0          23
   Dialysis |           7           0          70
  Transplan |          72           0         276
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   265.99711   141.78629       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         596           0        596        596

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,288
  CKD stage |          95           0         386
  CKD stage |           4           0          23
   Dialysis |          24           0          70
  Transplan |          53           0         276
  KRT uncle |          20           0          34
------------+------------------------------------
      Total |   259.66586   150.99353       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         573           0        573        573

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,288
  CKD stage |          81           0         386
  CKD stage |           0           0          23
   Dialysis |          33           0          70
  Transplan |          51           0         276
  KRT uncle |          22           0          34
------------+------------------------------------
      Total |   213.06115   119.53014       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         493           0        493        493

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,288
  CKD stage |          81           0         386
  CKD stage |          15           0          23
   Dialysis |          30           0          70
  Transplan |          57           0         276
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   218.58979   122.68564       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         501           0        501        501

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,288
  CKD stage |          70           0         386
  CKD stage |           8           0          23
   Dialysis |          22           0          70
  Transplan |          92           0         276
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |    225.8103   123.96297       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,077         518           0        518        518

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         408           0       1,288
  CKD stage |         126           0         386
  CKD stage |           7           0          23
   Dialysis |          21           0          70
  Transplan |          50           0         276
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   283.90611   161.04832       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,077         615           0        615        615

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,288
  CKD stage |         103           0         386
  CKD stage |          15           0          23
   Dialysis |          15           0          70
  Transplan |          46           0         276
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   235.05585   132.09223       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,077         525           0        525        525

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,288
  CKD stage |         116           0         386
  CKD stage |           7           0          23
   Dialysis |          14           0          70
  Transplan |          85           0         276
  KRT uncle |           7           0          34
------------+------------------------------------
      Total |   212.73327   100.05808       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,077         518           0        518        518

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,288
  CKD stage |         120           0         386
  CKD stage |           7           0          23
   Dialysis |          15           0          70
  Transplan |          31           0         276
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   246.62638   140.38913       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,077         533           0        533        533

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,288
  CKD stage |         137           0         386
  CKD stage |           2           0          23
   Dialysis |          19           0          70
  Transplan |          61           0         276
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   257.65431   134.11904       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,077         590           0        590        590

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,288
  CKD stage |         147           0         386
  CKD stage |           8           0          23
   Dialysis |          22           0          70
  Transplan |          58           0         276
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   234.31295   114.38768       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,077         556           0        556        556

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,288
  CKD stage |          89           0         386
  CKD stage |           8           0          23
   Dialysis |          23           0          70
  Transplan |          65           0         276
  KRT uncle |          13           0          34
------------+------------------------------------
      Total |   228.41502   125.67188       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,077         524           0        524        524

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,288
  CKD stage |          68           0         386
  CKD stage |          20           0          23
   Dialysis |          23           0          70
  Transplan |          91           0         276
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   218.76553    118.7921       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,077         524           0        524        524

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,288
  CKD stage |          86           0         386
  CKD stage |          11           0          23
   Dialysis |          26           0          70
  Transplan |          59           0         276
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   208.41069   112.98356       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         480           0        480        480

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,288
  CKD stage |          96           0         386
  CKD stage |           5           0          23
   Dialysis |          43           0          70
  Transplan |          91           0         276
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   251.77901   132.83528       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         602           0        602        602

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,288
  CKD stage |          86           0         386
  CKD stage |           5           0          23
   Dialysis |           6           0          70
  Transplan |          82           0         276
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   236.80453   130.56484       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,077         521           0        521        521

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,288
  CKD stage |         134           0         386
  CKD stage |           6           0          23
   Dialysis |          45           0          70
  Transplan |          64           0         276
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   258.36688   132.56795       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,077         617           0        617        617

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,288
  CKD stage |         106           0         386
  CKD stage |           9           0          23
   Dialysis |          27           0          70
  Transplan |          58           0         276
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   236.25662   127.84936       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         541           0        541        541

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,288
  CKD stage |          61           0         386
  CKD stage |           4           0          23
   Dialysis |           5           0          70
  Transplan |          88           0         276
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |    220.5739    125.6461       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         484           0        484        484

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,288
  CKD stage |          85           0         386
  CKD stage |           4           0          23
   Dialysis |          26           0          70
  Transplan |          78           0         276
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   230.64709   125.30292       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         531           0        531        531

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,288
  CKD stage |          88           0         386
  CKD stage |           5           0          23
   Dialysis |           5           0          70
  Transplan |          76           0         276
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   227.17429   123.71924       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         509           0        509        509

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,288
  CKD stage |         123           0         386
  CKD stage |           1           0          23
   Dialysis |           8           0          70
  Transplan |          79           0         276
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |    253.3091   131.14442       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         574           0        574        574

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         256           0       1,288
  CKD stage |         112           0         386
  CKD stage |          10           0          23
   Dialysis |          23           0          70
  Transplan |          39           0         276
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   185.76601   93.215003       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         448           0        448        448

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,288
  CKD stage |          84           0         386
  CKD stage |           4           0          23
   Dialysis |          11           0          70
  Transplan |          76           0         276
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   263.16033   152.75295       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         566           0        566        566

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,288
  CKD stage |         104           0         386
  CKD stage |          12           0          23
   Dialysis |          15           0          70
  Transplan |          50           0         276
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   241.19018   135.74454       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         528           0        528        528

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,288
  CKD stage |         113           0         386
  CKD stage |           7           0          23
   Dialysis |          12           0          70
  Transplan |         115           0         276
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   240.19788   114.72911       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         577           0        577        577

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,288
  CKD stage |          92           0         386
  CKD stage |           8           0          23
   Dialysis |          18           0          70
  Transplan |          82           0         276
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   207.38373   104.45874       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         494           0        494        494

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,288
  CKD stage |         155           0         386
  CKD stage |           0           0          23
   Dialysis |          16           0          70
  Transplan |          82           0         276
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   228.23784   101.06004       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         562           0        562        562

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,288
  CKD stage |         102           0         386
  CKD stage |           5           0          23
   Dialysis |          19           0          70
  Transplan |          66           0         276
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   245.04237   134.24588       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,077         553           0        553        553

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,288
  CKD stage |          85           0         386
  CKD stage |           2           0          23
   Dialysis |          13           0          70
  Transplan |          44           0         276
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   252.26866   152.75055       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,077         521           0        521        521

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,288
  CKD stage |          85           0         386
  CKD stage |          10           0          23
   Dialysis |          19           0          70
  Transplan |          82           0         276
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   230.35628   124.51255       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,077         531           0        531        531

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,288
  CKD stage |         101           0         386
  CKD stage |          20           0          23
   Dialysis |          20           0          70
  Transplan |          64           0         276
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   217.45595   113.42656       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,077         519           0        519        519

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,288
  CKD stage |          80           0         386
  CKD stage |           4           0          23
   Dialysis |          21           0          70
  Transplan |          58           0         276
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   237.97208    138.8141       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,077         514           0        514        514

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         413           0       1,288
  CKD stage |          62           0         386
  CKD stage |           0           0          23
   Dialysis |          19           0          70
  Transplan |          78           0         276
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |    278.7376    172.1318       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,077         578           0        578        578

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         262           0       1,288
  CKD stage |         113           0         386
  CKD stage |           1           0          23
   Dialysis |          19           0          70
  Transplan |         100           0         276
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   197.59316   85.113777       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,077         506           0        506        506

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,288
  CKD stage |          97           0         386
  CKD stage |           0           0          23
   Dialysis |          20           0          70
  Transplan |          83           0         276
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   206.59701   101.83769       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,077         493           0        493        493

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,288
  CKD stage |         107           0         386
  CKD stage |           6           0          23
   Dialysis |          26           0          70
  Transplan |          73           0         276
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   229.75253   118.23503       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,077         543           0        543        543

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,288
  CKD stage |          92           0         386
  CKD stage |          15           0          23
   Dialysis |          15           0          70
  Transplan |          61           0         276
  KRT uncle |           7           0          34
------------+------------------------------------
      Total |   232.49157   129.61152       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         523           0        523        523

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,288
  CKD stage |         117           0         386
  CKD stage |           8           0          23
   Dialysis |          25           0          70
  Transplan |          95           0         276
  KRT uncle |          14           0          34
------------+------------------------------------
      Total |   262.49398   133.95271       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         625           0        625        625

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,288
  CKD stage |          87           0         386
  CKD stage |          20           0          23
   Dialysis |          12           0          70
  Transplan |          68           0         276
  KRT uncle |          16           0          34
------------+------------------------------------
      Total |   205.30862   108.08358       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,077         492           0        492        492

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,288
  CKD stage |         127           0         386
  CKD stage |           0           0          23
   Dialysis |          20           0          70
  Transplan |          81           0         276
  KRT uncle |          19           0          34
------------+------------------------------------
      Total |   238.75205    116.6546       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,077         575           0        575        575

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,288
  CKD stage |         150           0         386
  CKD stage |           6           0          23
   Dialysis |           5           0          70
  Transplan |          70           0         276
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   249.00722   122.25509       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         580           0        580        580

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,288
  CKD stage |          76           0         386
  CKD stage |           5           0          23
   Dialysis |          15           0          70
  Transplan |          50           0         276
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   255.75301   156.91318       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         525           0        525        525

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         247           0       1,288
  CKD stage |         123           0         386
  CKD stage |           4           0          23
   Dialysis |          30           0          70
  Transplan |          80           0         276
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   187.87963   78.941199       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         494           0        494        494

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,288
  CKD stage |         112           0         386
  CKD stage |          16           0          23
   Dialysis |           8           0          70
  Transplan |          52           0         276
  KRT uncle |          15           0          34
------------+------------------------------------
      Total |     216.935   113.81636       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         507           0        507        507

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,288
  CKD stage |         119           0         386
  CKD stage |          13           0          23
   Dialysis |          14           0          70
  Transplan |          90           0         276
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   244.94608    122.4365       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         577           0        577        577

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,288
  CKD stage |         137           0         386
  CKD stage |           0           0          23
   Dialysis |          12           0          70
  Transplan |          82           0         276
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   250.86856   123.57525       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         586           0        586        586

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,288
  CKD stage |          88           0         386
  CKD stage |           7           0          23
   Dialysis |          21           0          70
  Transplan |          86           0         276
  KRT uncle |          20           0          34
------------+------------------------------------
      Total |   206.87097    103.5983       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         509           0        509        509

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,288
  CKD stage |          99           0         386
  CKD stage |           0           0          23
   Dialysis |          24           0          70
  Transplan |          96           0         276
  KRT uncle |          25           0          34
------------+------------------------------------
      Total |    246.3168   127.36566       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         589           0        589        589

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,288
  CKD stage |          76           0         386
  CKD stage |           4           0          23
   Dialysis |          27           0          70
  Transplan |          57           0         276
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   232.41887   135.52659       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         512           0        512        512

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,288
  CKD stage |          68           0         386
  CKD stage |           5           0          23
   Dialysis |          12           0          70
  Transplan |          77           0         276
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   208.94319   115.94711       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         473           0        473        473

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         267           0       1,288
  CKD stage |          88           0         386
  CKD stage |           5           0          23
   Dialysis |          38           0          70
  Transplan |          72           0         276
  KRT uncle |           0           0          34
------------+------------------------------------
      Total |   192.83149   95.945561       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         470           0        470        470

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(75 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(79 real changes made)

. replace ethnicity=4 if ethnicity==6
(75 real changes made)

. replace ethnicity=6 if ethnicity==.
(486 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,885 missing values generated)

. replace region = 2 if region_string=="East"
(204 real changes made)

. replace region = 3 if region_string=="London"
(428 real changes made)

. replace region = 4 if region_string=="North East"
(209 real changes made)

. replace region = 5 if region_string=="North West"
(198 real changes made)

. replace region = 6 if region_string=="South East"
(213 real changes made)

. replace region = 7 if region_string=="South West"
(200 real changes made)

. replace region = 8 if region_string=="West Midlands"
(187 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(246 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,077 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(862 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,215 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v3.dta", replace
(note: file ./output/2022_ckd_complete_v3.dta not found)
file ./output/2022_ckd_complete_v3.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete_v3.log
  log type:  text
 closed on:  21 Apr 2023, 07:57:12
-------------------------------------------------------------------------------
