-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_01_ckd.log
  log type:  text
 opened on:  25 Apr 2023, 13:07:36

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(19 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,691 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,957 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,760 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,331        9.92        9.92
           East Midlands |      3,358       10.00       19.91
                  London |      6,647       19.79       39.70
              North East |      3,335        9.93       49.63
              North West |      3,413       10.16       59.79
              South East |      3,402       10.13       69.92
              South West |      3,269        9.73       79.65
           West Midlands |      3,442       10.25       89.89
Yorkshire and The Humber |      3,395       10.11      100.00
-------------------------+-----------------------------------
                   Total |     33,592      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,700        5.06        5.06
          1 |      6,223       18.53       23.59
          2 |      6,438       19.17       42.75
          3 |      6,436       19.16       61.91
          4 |      6,381       19.00       80.91
          5 |      6,414       19.09      100.00
------------+-----------------------------------
      Total |     33,592      100.00

. drop if imd==0
(1,700 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,958 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(768 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(821 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,886 real changes made, 13,886 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,886 missing values generated)

. gen min_baseline_creatinine=.
(31,892 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,180 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,826 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,180 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,826 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,409 real changes made)

. gen max_baseline_creatinine=.
(31,892 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,180 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,826 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,006 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,483 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,886 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,006 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,180 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,748 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,892
25%            0              0       Sum of Wgt.      31,892

50%     8.594441                      Mean           12.52518
                        Largest       Std. Dev.      13.00077
75%     25.05304       44.43813
90%     29.18484       46.05721       Variance       169.0201
95%     31.36442       46.16689       Skewness       .2099181
99%     35.35299       47.06572       Kurtosis       1.298525

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,558        5.42        5.42
         <= |      1,639        5.70       11.12
          = |     20,652       71.83       82.95
          > |      1,663        5.78       88.73
         >= |      1,626        5.66       94.39
          ~ |      1,613        5.61      100.00
------------+-----------------------------------
      Total |     28,751      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,523       54.94       54.94
   Albuminuria |     14,369       45.06      100.00
---------------+-----------------------------------
         Total |     31,892      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,775       46.33       46.33
          1 |     17,117       53.67      100.00
------------+-----------------------------------
      Total |     31,892      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(13886 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 18006 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(13,886 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,282       94.95       94.95
          1 |      1,610        5.05      100.00
------------+-----------------------------------
      Total |     31,892      100.00
(1,610 real changes made)
(725 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,313       95.05       95.05
          1 |      1,579        4.95      100.00
------------+-----------------------------------
      Total |     31,892      100.00
(1,495 real changes made)
(704 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,296       95.00       95.00
          1 |      1,596        5.00      100.00
------------+-----------------------------------
      Total |     31,892      100.00
(1,432 real changes made)
(686 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,305       95.02       95.02
          1 |      1,587        4.98      100.00
------------+-----------------------------------
      Total |     31,892      100.00
(1,375 real changes made)
(626 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,317       95.06       95.06
          1 |      1,575        4.94      100.00
------------+-----------------------------------
      Total |     31,892      100.00
(1,267 real changes made)
(577 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,283       94.95       94.95
          1 |      1,609        5.05      100.00
------------+-----------------------------------
      Total |     31,892      100.00
(1,231 real changes made)
(586 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,609      4,643 |    10,252 
 eGFR >=60 |     5,262      4,263 |     9,525 
  eGFR <60 |     2,017      1,688 |     3,705 
       KRT |     4,635      3,775 |     8,410 
-----------+----------------------+----------
     Total |    17,523     14,369 |    31,892 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,871       34.09       34.09
          1 |     21,021       65.91      100.00
------------+-----------------------------------
      Total |     31,892      100.00

. drop if ckd==0
(10,871 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,643 |     4,643 
 eGFR >=60 |         0      4,263 |     4,263 
  eGFR <60 |     2,017      1,688 |     3,705 
       KRT |     4,635      3,775 |     8,410 
-----------+----------------------+----------
     Total |     6,652     14,369 |    21,021 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2022_01_ckd.csv not found)
file ./output/2022_01_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_01_ckd.log
  log type:  text
 closed on:  25 Apr 2023, 13:07:38
-------------------------------------------------------------------------------
