-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd.log
  log type:  text
 opened on:   7 Jun 2024, 10:21:46

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve)
(19 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,711 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,953 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,703 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,420       10.17       10.17
           East Midlands |      3,303        9.82       19.99
                  London |      6,774       20.14       40.13
              North East |      3,192        9.49       49.62
              North West |      3,386       10.07       59.69
              South East |      3,412       10.14       69.83
              South West |      3,386       10.07       79.90
           West Midlands |      3,423       10.18       90.08
Yorkshire and The Humber |      3,337        9.92      100.00
-------------------------+-----------------------------------
                   Total |     33,633      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,693        5.03        5.03
          1 |      6,416       19.08       24.11
          2 |      6,459       19.20       43.31
          3 |      6,322       18.80       62.11
          4 |      6,259       18.61       80.72
          5 |      6,484       19.28      100.00
------------+-----------------------------------
      Total |     33,633      100.00

. drop if imd==0
(1,693 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * Code sex
. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. 
. save ./output/input_`dataset', replace
(note: file ./output/input_2022.dta not found)
file ./output/input_2022.dta saved

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,982 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(841 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(762 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,129 real changes made, 14,129 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,129 missing values generated)

. gen min_baseline_creatinine=.
(31,940 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,027 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,784 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,027 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,784 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,287 real changes made)

. gen max_baseline_creatinine=.
(31,940 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,027 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,784 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,811 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,653 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,129 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,811 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,027 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,660 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,940
25%            0              0       Sum of Wgt.      31,940

50%      8.72857                      Mean           12.50638
                        Largest       Std. Dev.      12.99203
75%     25.01394       43.27636
90%     29.20441       43.62946       Variance       168.7927
95%     31.43532       43.65624       Skewness       .2139175
99%     35.16505       46.76251       Kurtosis       1.303388

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,622        5.61        5.61
         <= |      1,579        5.47       11.08
          = |     20,958       72.54       83.62
          > |      1,564        5.41       89.04
         >= |      1,586        5.49       94.53
          ~ |      1,581        5.47      100.00
------------+-----------------------------------
      Total |     28,890      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,561       54.98       54.98
   Albuminuria |     14,379       45.02      100.00
---------------+-----------------------------------
         Total |     31,940      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,901       46.65       46.65
          1 |     17,039       53.35      100.00
------------+-----------------------------------
      Total |     31,940      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14129 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17811 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,129 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,311       94.90       94.90
          1 |      1,629        5.10      100.00
------------+-----------------------------------
      Total |     31,940      100.00
(1,629 real changes made)
(757 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,357       95.04       95.04
          1 |      1,583        4.96      100.00
------------+-----------------------------------
      Total |     31,940      100.00
(1,495 real changes made)
(690 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,356       95.04       95.04
          1 |      1,584        4.96      100.00
------------+-----------------------------------
      Total |     31,940      100.00
(1,436 real changes made)
(696 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,329       94.96       94.96
          1 |      1,611        5.04      100.00
------------+-----------------------------------
      Total |     31,940      100.00
(1,404 real changes made)
(646 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,332       94.97       94.97
          1 |      1,608        5.03      100.00
------------+-----------------------------------
      Total |     31,940      100.00
(1,289 real changes made)
(606 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,347       95.01       95.01
          1 |      1,593        4.99      100.00
------------+-----------------------------------
      Total |     31,940      100.00
(1,215 real changes made)
(604 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,724      4,680 |    10,404 
 eGFR >=60 |     5,178      4,318 |     9,496 
  eGFR <60 |     1,934      1,638 |     3,572 
       KRT |     4,725      3,743 |     8,468 
-----------+----------------------+----------
     Total |    17,561     14,379 |    31,940 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,902       34.13       34.13
          1 |     21,038       65.87      100.00
------------+-----------------------------------
      Total |     31,940      100.00

. drop if ckd==0
(10,902 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,680 |     4,680 
 eGFR >=60 |         0      4,318 |     4,318 
  eGFR <60 |     1,934      1,638 |     3,572 
       KRT |     4,725      3,743 |     8,468 
-----------+----------------------+----------
     Total |     6,659     14,379 |    21,038 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2022_ckd.csv not found)
file ./output/2022_ckd.csv saved

. 
. *Create dataset of non-CKD
. merge 1:1 patient_id using ./output/input_`dataset'
(label sexLab already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,902
        from master                         0  (_merge==1)
        from using                     10,902  (_merge==2)

    matched                            21,038  (_merge==3)
    -----------------------------------------

. keep if _merge==2
(21,038 observations deleted)

. drop _merge

. 
. export delimited using "./output/`dataset'_nockd.csv", replace
(note: file ./output/2022_nockd.csv not found)
file ./output/2022_nockd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd.log
  log type:  text
 closed on:   7 Jun 2024, 10:21:49
-------------------------------------------------------------------------------
