-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ukrr_v3.log
  log type:  text
 opened on:  24 Apr 2023, 08:56:03

. clear

. 
. use ./output/`dataset'_ckd_complete_v3.dta, clear

. 
. tab ukrr

       ukrr |      Freq.     Percent        Cum.
------------+-----------------------------------
       ICHD |         51       47.66       47.66
         Tx |         56       52.34      100.00
------------+-----------------------------------
      Total |        107      100.00

. rename ukrr ukrr_string

. gen ukrr = 0

. replace ukrr = 1 if ukrr_string=="HD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="HHD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="ICHD"
(51 real changes made)

. replace ukrr = 1 if ukrr_string=="PD"
(0 real changes made)

. replace ukrr = 2 if ukrr_string=="Tx"
(56 real changes made)

. drop ukrr_string

. 
. tab ckd_group ukrr, m

                     |               ukrr
           CKD group |         0          1          2 |     Total
---------------------+---------------------------------+----------
         Albuminuria |     1,181         39         31 |     1,251 
         CKD stage 3 |       372          6         14 |       392 
       CKD stage 4/5 |        19          0          0 |        19 
            Dialysis |        68          0          2 |        70 
          Transplant |       273          4          8 |       285 
KRT unclear modality |        40          2          1 |        43 
---------------------+---------------------------------+----------
               Total |     1,953         51         56 |     2,060 

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ukrr_v3.log
  log type:  text
 closed on:  24 Apr 2023, 08:56:04
-------------------------------------------------------------------------------
