-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete.log
  log type:  text
 opened on:   9 Feb 2023, 22:14:03

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(7 vars, 20,898 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,744
        from master                    47,923  (_merge==1)
        from using                     18,821  (_merge==2)

    matched                             2,077  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,744 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save 2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        180        8.67        8.67
Kidney transplant |        193        9.29       17.96
 Modality unclear |         34        1.64       19.60
          Pre KRT |      1,670       80.40      100.00
------------------+-----------------------------------
            Total |      2,077      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(832 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1245 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(180 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(193 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(34 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(669 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,281       61.68       61.68
  CKD stage 3 |        368       17.72       79.39
CKD stage 4/5 |         21        1.01       80.40
     Dialysis |        180        8.67       89.07
   Transplant |        193        9.29       98.36
  KRT unclear |         34        1.64      100.00
--------------+-----------------------------------
        Total |      2,077      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,281 |     1,281 
  CKD stage 3 |         0          0          0        368 |       368 
CKD stage 4/5 |         0          0          0         21 |        21 
     Dialysis |       180          0          0          0 |       180 
   Transplant |         0        193          0          0 |       193 
  KRT unclear |         0          0         34          0 |        34 
--------------+--------------------------------------------+----------
        Total |       180        193         34      1,670 |     2,077 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       128         57         52         11 |     1,281 
  CKD stage 3 |        44         21         13          3 |       368 
CKD stage 4/5 |         3          2          0          0 |        21 
     Dialysis |         9         12         14          4 |       180 
   Transplant |        13         12          5          2 |       193 
  KRT unclear |         0          1          0          1 |        34 
--------------+--------------------------------------------+----------
        Total |       197        105         84         21 |     2,077 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |     1,033 |     1,281 
  CKD stage 3 |       287 |       368 
CKD stage 4/5 |        16 |        21 
     Dialysis |       141 |       180 
   Transplant |       161 |       193 
  KRT unclear |        32 |        34 
--------------+-----------+----------
        Total |     1,670 |     2,077 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,153 missing values generated)

. replace sex = 0 if male == "Female"
(1,153 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(928 real changes made, 928 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(928 missing values generated)

. gen min_creatinine_outcome=.
(2,077 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(628 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(521 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(628 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(521 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(730 real changes made)

. gen max_creatinine_outcome=.
(2,077 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(628 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(521 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,149 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,347 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(928 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,149 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(628 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(928 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1149 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(184 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(5 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(6 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(105 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(84 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(21 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(197 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,506       72.51       72.51
               CKD 3 |        154        7.41       79.92
     CKD 4/5 pre-KRT |         10        0.48       80.40
            Dialysis |        105        5.06       85.46
   Kidney transplant |         84        4.04       89.50
KRT unclear modality |         21        1.01       90.52
            Deceased |        197        9.48      100.00
---------------------+-----------------------------------
               Total |      2,077      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,281
  CKD stage |          76           0         368
  CKD stage |           9           0          21
   Dialysis |          34           0         180
  Transplan |          56           0         193
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   195.64805   110.40986       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,077         458           0        458        458

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,281
  CKD stage |          60           0         368
  CKD stage |           6           0          21
   Dialysis |          58           0         180
  Transplan |          47           0         193
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   196.55898     113.817       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,077         462           0        462        462

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,281
  CKD stage |          95           0         368
  CKD stage |           0           0          21
   Dialysis |          36           0         180
  Transplan |          38           0         193
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   233.34328   136.76241       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,077         519           0        519        519

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         415           0       1,281
  CKD stage |          87           0         368
  CKD stage |           0           0          21
   Dialysis |          39           0         180
  Transplan |          74           0         193
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   281.82041   169.69331       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,077         627           0        627        627

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,281
  CKD stage |          77           0         368
  CKD stage |          11           0          21
   Dialysis |          49           0         180
  Transplan |          77           0         193
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |    219.4988   121.80281       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,077         533           0        533        533

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,281
  CKD stage |          80           0         368
  CKD stage |           6           0          21
   Dialysis |          44           0         180
  Transplan |          67           0         193
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   236.58498   136.89933       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,077         550           0        550        550

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,281
  CKD stage |          73           0         368
  CKD stage |          11           0          21
   Dialysis |          59           0         180
  Transplan |          55           0         193
  KRT uncle |          17           0          34
------------+------------------------------------
      Total |   213.50794   120.25833       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,077         523           0        523        523

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         422           0       1,281
  CKD stage |          95           0         368
  CKD stage |           2           0          21
   Dialysis |          74           0         180
  Transplan |          39           0         193
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   287.32354   171.78531       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,077         642           0        642        642

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,281
  CKD stage |         103           0         368
  CKD stage |          16           0          21
   Dialysis |          63           0         180
  Transplan |          60           0         193
  KRT uncle |          28           0          34
------------+------------------------------------
      Total |    233.4338   123.50796       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,077         600           0        600        600

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,281
  CKD stage |         146           0         368
  CKD stage |           8           0          21
   Dialysis |          45           0         180
  Transplan |          54           0         193
  KRT uncle |          15           0          34
------------+------------------------------------
      Total |   224.45595   109.45939       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,077         575           0        575        575

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,281
  CKD stage |          79           0         368
  CKD stage |           0           0          21
   Dialysis |          35           0         180
  Transplan |          49           0         193
  KRT uncle |           0           0          34
------------+------------------------------------
      Total |   214.01107   125.21678       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,077         475           0        475        475

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,281
  CKD stage |          92           0         368
  CKD stage |           1           0          21
   Dialysis |          48           0         180
  Transplan |          50           0         193
  KRT uncle |          19           0          34
------------+------------------------------------
      Total |   215.38806   118.57543       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,077         518           0        518        518

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,281
  CKD stage |          87           0         368
  CKD stage |          13           0          21
   Dialysis |          66           0         180
  Transplan |          36           0         193
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   225.18729   127.61277       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,077         535           0        535        535

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,281
  CKD stage |         126           0         368
  CKD stage |           8           0          21
   Dialysis |          30           0         180
  Transplan |          34           0         193
  KRT uncle |          -1           0          34
------------+------------------------------------
      Total |   211.32451   112.91765       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         494           0        494        494

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,281
  CKD stage |         107           0         368
  CKD stage |           3           0          21
   Dialysis |          47           0         180
  Transplan |          47           0         193
  KRT uncle |           0           0          34
------------+------------------------------------
      Total |   211.83871   112.66896       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         503           0        503        503

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         376           0       1,281
  CKD stage |          91           0         368
  CKD stage |           1           0          21
   Dialysis |          47           0         180
  Transplan |          63           0         193
  KRT uncle |          18           0          34
------------+------------------------------------
      Total |   258.25518   150.14074       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         596           0        596        596

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,281
  CKD stage |          81           0         368
  CKD stage |           9           0          21
   Dialysis |          47           0         180
  Transplan |          51           0         193
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   226.23255   131.07997       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         521           0        521        521

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,281
  CKD stage |          93           0         368
  CKD stage |           9           0          21
   Dialysis |          71           0         180
  Transplan |          68           0         193
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   236.45017   127.00398       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         588           0        588        588

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,281
  CKD stage |          93           0         368
  CKD stage |           4           0          21
   Dialysis |          60           0         180
  Transplan |          50           0         193
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   220.82186   120.50337       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         533           0        533        533

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,281
  CKD stage |          99           0         368
  CKD stage |           3           0          21
   Dialysis |          83           0         180
  Transplan |          64           0         193
  KRT uncle |          18           0          34
------------+------------------------------------
      Total |   244.40299   129.73155       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         613           0        613        613

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,281
  CKD stage |         137           0         368
  CKD stage |           1           0          21
   Dialysis |          53           0         180
  Transplan |          27           0         193
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   211.60905   107.01316       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         518           0        518        518

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,281
  CKD stage |          71           0         368
  CKD stage |           7           0          21
   Dialysis |          51           0         180
  Transplan |          54           0         193
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   249.75253   151.66791       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         557           0        557        557

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,281
  CKD stage |         110           0         368
  CKD stage |           4           0          21
   Dialysis |          51           0         180
  Transplan |          47           0         193
  KRT uncle |          14           0          34
------------+------------------------------------
      Total |   244.41069   135.65642       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         576           0        576        576

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,281
  CKD stage |         133           0         368
  CKD stage |          11           0          21
   Dialysis |          52           0         180
  Transplan |          72           0         193
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   221.19836   105.72998       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         574           0        574        574

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,281
  CKD stage |         118           0         368
  CKD stage |           7           0          21
   Dialysis |          50           0         180
  Transplan |          55           0         193
  KRT uncle |          24           0          34
------------+------------------------------------
      Total |    220.1584   112.42601       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,077         561           0        561        561

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,281
  CKD stage |          97           0         368
  CKD stage |           4           0          21
   Dialysis |          50           0         180
  Transplan |          55           0         193
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   203.72845   107.08341       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         496           0        496        496

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         396           0       1,281
  CKD stage |         109           0         368
  CKD stage |          13           0          21
   Dialysis |          21           0         180
  Transplan |          54           0         193
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   270.54935   161.08569       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         595           0        595        595

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,281
  CKD stage |          77           0         368
  CKD stage |          11           0          21
   Dialysis |          75           0         180
  Transplan |          47           0         193
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   264.06933   157.71464       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         607           0        607        607

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         278           0       1,281
  CKD stage |          75           0         368
  CKD stage |           2           0          21
   Dialysis |          23           0         180
  Transplan |          59           0         193
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |    192.3895   109.65701       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         446           0        446        446

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,281
  CKD stage |          82           0         368
  CKD stage |          10           0          21
   Dialysis |          38           0         180
  Transplan |          36           0         193
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   213.17718   125.11875       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         483           0        483        483

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         263           0       1,281
  CKD stage |          98           0         368
  CKD stage |           5           0          21
   Dialysis |          54           0         180
  Transplan |          43           0         193
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   188.31247   96.590085       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         464           0        464        464

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,281
  CKD stage |         104           0         368
  CKD stage |           7           0          21
   Dialysis |          49           0         180
  Transplan |          65           0         193
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   247.92826   137.06588       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         592           0        592        592

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,281
  CKD stage |         140           0         368
  CKD stage |           3           0          21
   Dialysis |          44           0         180
  Transplan |          62           0         193
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   242.41984   123.62696       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         596           0        596        596

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,281
  CKD stage |          94           0         368
  CKD stage |           4           0          21
   Dialysis |          61           0         180
  Transplan |          23           0         193
  KRT uncle |          20           0          34
------------+------------------------------------
      Total |    253.2624   150.67762       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         573           0        573        573

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,281
  CKD stage |          64           0         368
  CKD stage |           0           0          21
   Dialysis |          60           0         180
  Transplan |          41           0         193
  KRT uncle |          22           0          34
------------+------------------------------------
      Total |   209.43621   122.86597       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         493           0        493        493

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,281
  CKD stage |          61           0         368
  CKD stage |          10           0          21
   Dialysis |          48           0         180
  Transplan |          64           0         193
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   214.74242   126.26867       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         501           0        501        501

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,281
  CKD stage |          77           0         368
  CKD stage |           8           0          21
   Dialysis |          43           0         180
  Transplan |          40           0         193
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   234.62975   141.96596       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,077         518           0        518        518

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         395           0       1,281
  CKD stage |         123           0         368
  CKD stage |           7           0          21
   Dialysis |          49           0         180
  Transplan |          38           0         193
  KRT uncle |           3           0          34
------------+------------------------------------
      Total |   273.30862   156.73817       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,077         615           0        615        615

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,281
  CKD stage |          97           0         368
  CKD stage |          12           0          21
   Dialysis |          39           0         180
  Transplan |          52           0         193
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   220.56139   122.47249       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,077         525           0        525        525

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,281
  CKD stage |         102           0         368
  CKD stage |           7           0          21
   Dialysis |          53           0         180
  Transplan |          60           0         193
  KRT uncle |           7           0          34
------------+------------------------------------
      Total |   206.66827    105.9634       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,077         518           0        518        518

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,281
  CKD stage |         125           0         368
  CKD stage |           7           0          21
   Dialysis |          35           0         180
  Transplan |          42           0         193
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   225.38036   120.90922       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,077         533           0        533        533

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,281
  CKD stage |         105           0         368
  CKD stage |           2           0          21
   Dialysis |          67           0         180
  Transplan |          44           0         193
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   251.34762   140.47898       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,077         590           0        590        590

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,281
  CKD stage |         121           0         368
  CKD stage |          10           0          21
   Dialysis |          47           0         180
  Transplan |          41           0         193
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   236.66875   128.71591       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,077         556           0        556        556

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,281
  CKD stage |          77           0         368
  CKD stage |           8           0          21
   Dialysis |          39           0         180
  Transplan |          57           0         193
  KRT uncle |          13           0          34
------------+------------------------------------
      Total |   226.14203   132.36486       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,077         524           0        524        524

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,281
  CKD stage |          75           0         368
  CKD stage |          26           0          21
   Dialysis |          57           0         180
  Transplan |          30           0         193
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   221.90419   131.46192       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,077         524           0        524        524

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,281
  CKD stage |          78           0         368
  CKD stage |          11           0          21
   Dialysis |          53           0         180
  Transplan |          39           0         193
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   205.35725   117.05704       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         480           0        480        480

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,281
  CKD stage |         111           0         368
  CKD stage |           6           0          21
   Dialysis |          82           0         180
  Transplan |          58           0         193
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   237.79923   122.19292       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         602           0        602        602

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,281
  CKD stage |          76           0         368
  CKD stage |           5           0          21
   Dialysis |          29           0         180
  Transplan |          77           0         193
  KRT uncle |           4           0          34
------------+------------------------------------
      Total |   226.77901   131.87868       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,077         521           0        521        521

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,281
  CKD stage |         117           0         368
  CKD stage |           3           0          21
   Dialysis |          72           0         180
  Transplan |          54           0         193
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   256.03081   137.37996       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,077         617           0        617        617

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,281
  CKD stage |          97           0         368
  CKD stage |           9           0          21
   Dialysis |          48           0         180
  Transplan |          50           0         193
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |    230.3274   128.95754       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         541           0        541        541

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,281
  CKD stage |          68           0         368
  CKD stage |           4           0          21
   Dialysis |          20           0         180
  Transplan |          26           0         193
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   237.16707   154.03555       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         484           0        484        484

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,281
  CKD stage |          67           0         368
  CKD stage |           4           0          21
   Dialysis |          56           0         180
  Transplan |          55           0         193
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   231.11892   137.19045       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         531           0        531        531

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,281
  CKD stage |          82           0         368
  CKD stage |           0           0          21
   Dialysis |          33           0         180
  Transplan |          65           0         193
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   219.13625   125.07838       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         509           0        509        509

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,281
  CKD stage |         105           0         368
  CKD stage |           1           0          21
   Dialysis |          31           0         180
  Transplan |          40           0         193
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   264.46558   158.44713       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         574           0        574        574

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         237           0       1,281
  CKD stage |         103           0         368
  CKD stage |           7           0          21
   Dialysis |          58           0         180
  Transplan |          35           0         193
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   172.90082   83.891599       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         448           0        448        448

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,281
  CKD stage |          89           0         368
  CKD stage |           0           0          21
   Dialysis |          43           0         180
  Transplan |          64           0         193
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   248.23832   143.90773       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         566           0        566        566

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,281
  CKD stage |         100           0         368
  CKD stage |          13           0          21
   Dialysis |          31           0         180
  Transplan |          54           0         193
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   228.48243   129.18879       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         528           0        528        528

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,281
  CKD stage |         113           0         368
  CKD stage |          11           0          21
   Dialysis |          40           0         180
  Transplan |          50           0         193
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   250.92634   141.62062       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         577           0        577        577

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,281
  CKD stage |         107           0         368
  CKD stage |           7           0          21
   Dialysis |          41           0         180
  Transplan |          50           0         193
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   201.86808   105.15455       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         494           0        494        494

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,281
  CKD stage |         124           0         368
  CKD stage |           0           0          21
   Dialysis |          50           0         180
  Transplan |          56           0         193
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   232.66731   121.04618       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         562           0        562        562

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,281
  CKD stage |          78           0         368
  CKD stage |           5           0          21
   Dialysis |          61           0         180
  Transplan |          36           0         193
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   245.34714   147.35951       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,077         553           0        553        553

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,281
  CKD stage |          77           0         368
  CKD stage |           2           0          21
   Dialysis |          40           0         180
  Transplan |          51           0         193
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   234.74723   140.51325       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,077         521           0        521        521

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,281
  CKD stage |         100           0         368
  CKD stage |           8           0          21
   Dialysis |          44           0         180
  Transplan |          35           0         193
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   232.22484   133.28328       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,077         531           0        531        531

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,281
  CKD stage |          80           0         368
  CKD stage |          12           0          21
   Dialysis |          49           0         180
  Transplan |          53           0         193
  KRT uncle |           9           0          34
------------+------------------------------------
      Total |   218.50891   124.31332       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,077         519           0        519        519

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,281
  CKD stage |          67           0         368
  CKD stage |           2           0          21
   Dialysis |          55           0         180
  Transplan |          45           0         193
  KRT uncle |           5           0          34
------------+------------------------------------
      Total |   230.61772   139.16822       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,077         514           0        514        514

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         397           0       1,281
  CKD stage |          69           0         368
  CKD stage |           2           0          21
   Dialysis |          35           0         180
  Transplan |          69           0         193
  KRT uncle |           6           0          34
------------+------------------------------------
      Total |   266.64035    165.8766       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,077         578           0        578        578

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,281
  CKD stage |         102           0         368
  CKD stage |           3           0          21
   Dialysis |          48           0         180
  Transplan |          34           0         193
  KRT uncle |          11           0          34
------------+------------------------------------
      Total |   215.56235   119.16409       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,077         506           0        506        506

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,281
  CKD stage |          84           0         368
  CKD stage |           0           0          21
   Dialysis |          38           0         180
  Transplan |          45           0         193
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   218.61675   127.07378       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,077         493           0        493        493

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,281
  CKD stage |         111           0         368
  CKD stage |           6           0          21
   Dialysis |          48           0         180
  Transplan |          57           0         193
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |    221.1584   115.91023       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,077         543           0        543        543

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,281
  CKD stage |          83           0         368
  CKD stage |          10           0          21
   Dialysis |          39           0         180
  Transplan |          38           0         193
  KRT uncle |           7           0          34
------------+------------------------------------
      Total |   235.22966   141.42299       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         523           0        523        523

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,281
  CKD stage |         131           0         368
  CKD stage |          11           0          21
   Dialysis |          34           0         180
  Transplan |          53           0         193
  KRT uncle |          14           0          34
------------+------------------------------------
      Total |   267.02263   148.71149       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         625           0        625        625

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,281
  CKD stage |          88           0         368
  CKD stage |          16           0          21
   Dialysis |          48           0         180
  Transplan |          40           0         193
  KRT uncle |          16           0          34
------------+------------------------------------
      Total |   199.05055    108.8888       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,077         492           0        492        492

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,281
  CKD stage |         133           0         368
  CKD stage |           0           0          21
   Dialysis |          40           0         180
  Transplan |          91           0         193
  KRT uncle |          19           0          34
------------+------------------------------------
      Total |   215.89071   100.15588       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,077         575           0        575        575

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,281
  CKD stage |         129           0         368
  CKD stage |           4           0          21
   Dialysis |          26           0         180
  Transplan |          53           0         193
  KRT uncle |           8           0          34
------------+------------------------------------
      Total |   252.23736   139.95151       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         580           0        580        580

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,281
  CKD stage |          78           0         368
  CKD stage |           5           0          21
   Dialysis |          44           0         180
  Transplan |          53           0         193
  KRT uncle |           1           0          34
------------+------------------------------------
      Total |   234.78864   139.19396       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         525           0        525        525

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         276           0       1,281
  CKD stage |         129           0         368
  CKD stage |           1           0          21
   Dialysis |          49           0         180
  Transplan |          29           0         193
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   200.19547   100.72181       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         494           0        494        494

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,281
  CKD stage |         100           0         368
  CKD stage |           8           0          21
   Dialysis |          32           0         180
  Transplan |          54           0         193
  KRT uncle |          15           0          34
------------+------------------------------------
      Total |   209.62831   113.87863       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         507           0        507        507

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,281
  CKD stage |         112           0         368
  CKD stage |          10           0          21
   Dialysis |          56           0         180
  Transplan |          48           0         193
  KRT uncle |           2           0          34
------------+------------------------------------
      Total |   244.53876   134.31428       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         577           0        577        577

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,281
  CKD stage |         121           0         368
  CKD stage |           0           0          21
   Dialysis |          39           0         180
  Transplan |          56           0         193
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   252.21762   139.08974       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         586           0        586        586

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,281
  CKD stage |          93           0         368
  CKD stage |          11           0          21
   Dialysis |          44           0         180
  Transplan |          34           0         193
  KRT uncle |          20           0          34
------------+------------------------------------
      Total |   213.23255   120.34441       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         509           0        509        509

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,281
  CKD stage |          90           0         368
  CKD stage |           2           0          21
   Dialysis |          61           0         180
  Transplan |          66           0         193
  KRT uncle |          25           0          34
------------+------------------------------------
      Total |   240.57535   133.09376       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         589           0        589        589

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,281
  CKD stage |          74           0         368
  CKD stage |           4           0          21
   Dialysis |          40           0         180
  Transplan |          41           0         193
  KRT uncle |          10           0          34
------------+------------------------------------
      Total |   232.13866   141.24001       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         512           0        512        512

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         307           0       1,281
  CKD stage |          65           0         368
  CKD stage |           5           0          21
   Dialysis |          26           0         180
  Transplan |          58           0         193
  KRT uncle |          12           0          34
------------+------------------------------------
      Total |   208.75012   125.22715       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         473           0        473        473

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         254           0       1,281
  CKD stage |          81           0         368
  CKD stage |          11           0          21
   Dialysis |          79           0         180
  Transplan |          45           0         193
  KRT uncle |           0           0          34
------------+------------------------------------
      Total |   182.14636   92.250135       2,077

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         470           0        470        470

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(75 real changes made)

. replace ethnicity=2 if ethnicity==3
(84 real changes made)

. replace ethnicity=3 if ethnicity==4
(79 real changes made)

. replace ethnicity=4 if ethnicity==6
(75 real changes made)

. replace ethnicity=6 if ethnicity==.
(486 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,885 missing values generated)

. replace region = 2 if region_string=="East"
(204 real changes made)

. replace region = 3 if region_string=="London"
(428 real changes made)

. replace region = 4 if region_string=="North East"
(209 real changes made)

. replace region = 5 if region_string=="North West"
(198 real changes made)

. replace region = 6 if region_string=="South East"
(213 real changes made)

. replace region = 7 if region_string=="South West"
(200 real changes made)

. replace region = 8 if region_string=="West Midlands"
(187 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(246 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,077 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(862 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,215 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2022_ckd_complete.dta not found)
file ./output/2022_ckd_complete.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete.log
  log type:  text
 closed on:   9 Feb 2023, 22:14:12
-------------------------------------------------------------------------------
