-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_01_ukrr_v3.log
  log type:  text
 opened on:  25 Apr 2023, 13:11:27

. clear

. 
. use ./output/`dataset'_ckd_complete_v3.dta, clear

. 
. tab ukrr

       ukrr |      Freq.     Percent        Cum.
------------+-----------------------------------
       ICHD |         56       49.12       49.12
         Tx |         58       50.88      100.00
------------+-----------------------------------
      Total |        114      100.00

. rename ukrr ukrr_string

. gen ukrr = 0

. replace ukrr = 1 if ukrr_string=="HD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="HHD"
(0 real changes made)

. replace ukrr = 1 if ukrr_string=="ICHD"
(56 real changes made)

. replace ukrr = 1 if ukrr_string=="PD"
(0 real changes made)

. replace ukrr = 2 if ukrr_string=="Tx"
(58 real changes made)

. drop ukrr_string

. 
. tab ckd_group ukrr, m

                     |               ukrr
           CKD group |         0          1          2 |     Total
---------------------+---------------------------------+----------
         Albuminuria |     1,198         39         42 |     1,279 
         CKD stage 3 |       331          9          8 |       348 
       CKD stage 4/5 |        15          0          0 |        15 
            Dialysis |        69          1          1 |        71 
          Transplant |       312          5          6 |       323 
KRT unclear modality |        38          2          1 |        41 
---------------------+---------------------------------+----------
               Total |     1,963         56         58 |     2,077 

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_01_ukrr_v3.log
  log type:  text
 closed on:  25 Apr 2023, 13:11:27
-------------------------------------------------------------------------------
