-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete_v3.log
  log type:  text
 opened on:  24 Apr 2023, 08:55:13

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,004 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00015.000001 not found)
file /tmp/St00015.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,884
        from master                    47,940  (_merge==1)
        from using                     18,944  (_merge==2)

    matched                             2,060  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,884 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v3

. save ``dataset'_ckd_complete_v3', replace
(note: file /tmp/St00015.000002 not found)
file /tmp/St00015.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v3
> save 2017_ckd_complete_v3, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        188        9.13        9.13
Kidney transplant |        166        8.06       17.18
 Modality unclear |         47        2.28       19.47
          Pre KRT |      1,659       80.53      100.00
------------------+-----------------------------------
            Total |      2,060      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(807 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1253 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,253       60.83       60.83
          . |        807       39.17      100.00
------------+-----------------------------------
      Total |      2,060      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(188 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(28 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(146 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(300 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(15 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(47 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(4 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       118         70 |       188 
Kidney transplant |       166          0 |       166 
 Modality unclear |        47          0 |        47 
          Pre KRT |     1,659          0 |     1,659 
------------------+----------------------+----------
            Total |     1,990         70 |     2,060 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       165         23 |       188 
Kidney transplant |       144         22 |       166 
 Modality unclear |        43          4 |        47 
          Pre KRT |     1,423        236 |     1,659 
------------------+----------------------+----------
            Total |     1,775        285 |     2,060 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       188          0 |       188 
Kidney transplant |       166          0 |       166 
 Modality unclear |         4         43 |        47 
          Pre KRT |     1,659          0 |     1,659 
------------------+----------------------+----------
            Total |     2,017         43 |     2,060 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,705        285 |     1,990 
         1 |        70          0 |        70 
-----------+----------------------+----------
     Total |     1,775        285 |     2,060 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(807 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1253 changes made)

. replace ckd_group = 4 if dialysis==1
(70 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(285 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(43 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(601 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,251       60.73       60.73
         CKD stage 3 |        392       19.03       79.76
       CKD stage 4/5 |         19        0.92       80.68
            Dialysis |         70        3.40       84.08
          Transplant |        285       13.83       97.91
KRT unclear modality |         43        2.09      100.00
---------------------+-----------------------------------
               Total |      2,060      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        57        103          0      1,091 |     1,251 
         CKD stage 3 |        36         38          0        318 |       392 
       CKD stage 4/5 |         2          3          0         14 |        19 
            Dialysis |        70          0          0          0 |        70 
          Transplant |        23         22          4        236 |       285 
KRT unclear modality |         0          0         43          0 |        43 
---------------------+--------------------------------------------+----------
               Total |       188        166         47      1,659 |     2,060 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       130         51         43         12 |     1,251 
         CKD stage 3 |        39         17         14          5 |       392 
       CKD stage 4/5 |         0          1          0          0 |        19 
            Dialysis |         9          4          2          1 |        70 
          Transplant |        25         21         14          4 |       285 
KRT unclear modality |         3          2          3          0 |        43 
---------------------+--------------------------------------------+----------
               Total |       206         96         76         22 |     2,060 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,015 |     1,251 
         CKD stage 3 |       317 |       392 
       CKD stage 4/5 |        18 |        19 
            Dialysis |        54 |        70 
          Transplant |       221 |       285 
KRT unclear modality |        35 |        43 
---------------------+-----------+----------
               Total |     1,660 |     2,060 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,083 missing values generated)

. replace sex = 0 if male == "Female"
(1,083 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(920 real changes made, 920 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(920 missing values generated)

. gen min_creatinine_outcome=.
(2,060 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(591 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(549 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(591 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(549 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(728 real changes made)

. gen max_creatinine_outcome=.
(2,060 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(591 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(549 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,140 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,332 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(920 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,140 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(591 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(920 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1140 changes made)

. label define egfr_end 1 "≥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(181 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(9 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(4 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(920 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1140 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,140       55.34       55.34
          . |        920       44.66      100.00
------------+-----------------------------------
      Total |      2,060      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(96 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(76 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(12 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(22 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(96 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(88 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(206 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,504       73.01       73.01
               CKD 3 |        148        7.18       80.19
     CKD 4/5 pre-KRT |          8        0.39       80.58
            Dialysis |         96        4.66       85.24
   Kidney transplant |         88        4.27       89.51
KRT unclear modality |         10        0.49       90.00
            Deceased |        206       10.00      100.00
---------------------+-----------------------------------
               Total |      2,060      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         212           0       1,251
  CKD stage |         106           0         392
  CKD stage |           3           0          19
   Dialysis |           4           0          70
  Transplan |         107           0         285
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   164.13204   63.890737       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,060         444           0        444        444

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,251
  CKD stage |          94           0         392
  CKD stage |           0           0          19
   Dialysis |          10           0          70
  Transplan |          61           0         285
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   207.36311     113.046       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,060         478           0        478        478

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,251
  CKD stage |         121           0         392
  CKD stage |           0           0          19
   Dialysis |          23           0          70
  Transplan |          81           0         285
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   219.75194    107.4696       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,060         535           0        535        535

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,251
  CKD stage |          98           0         392
  CKD stage |           6           0          19
   Dialysis |           9           0          70
  Transplan |          67           0         285
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   224.24126   123.07978       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,060         522           0        522        522

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         257           0       1,251
  CKD stage |          83           0         392
  CKD stage |          13           0          19
   Dialysis |           8           0          70
  Transplan |          64           0         285
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   181.48738   95.211155       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,060         443           0        443        443

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,251
  CKD stage |         105           0         392
  CKD stage |           7           0          19
   Dialysis |          15           0          70
  Transplan |          48           0         285
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   248.97864   146.11863       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,060         546           0        546        546

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,251
  CKD stage |          58           0         392
  CKD stage |           4           0          19
   Dialysis |          25           0          70
  Transplan |          80           0         285
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   226.19903   134.69385       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,060         519           0        519        519

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         266           0       1,251
  CKD stage |         122           0         392
  CKD stage |           8           0          19
   Dialysis |           9           0          70
  Transplan |          74           0         285
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   195.53689    91.28394       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,060         487           0        487        487

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,251
  CKD stage |          94           0         392
  CKD stage |           0           0          19
   Dialysis |          11           0          70
  Transplan |          51           0         285
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   217.00728   123.39226       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,060         490           0        490        490

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,251
  CKD stage |         134           0         392
  CKD stage |           6           0          19
   Dialysis |          14           0          70
  Transplan |         102           0         285
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   229.31942   104.98944       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,060         582           0        582        582

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,251
  CKD stage |          93           0         392
  CKD stage |           0           0          19
   Dialysis |          21           0          70
  Transplan |          73           0         285
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   219.57233   118.63894       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,060         519           0        519        519

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,251
  CKD stage |          87           0         392
  CKD stage |           0           0          19
   Dialysis |          21           0          70
  Transplan |          55           0         285
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   206.62233   116.10546       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,060         470           0        470        470

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,251
  CKD stage |          67           0         392
  CKD stage |           5           0          19
   Dialysis |           8           0          70
  Transplan |          59           0         285
  KRT uncle |           2           0          43
------------+------------------------------------
      Total |    213.7801   129.11072       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,060         458           0        458        458

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,251
  CKD stage |          74           0         392
  CKD stage |           8           0          19
   Dialysis |          26           0          70
  Transplan |          87           0         285
  KRT uncle |          23           0          43
------------+------------------------------------
      Total |   224.92184   125.24256       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,060         543           0        543        543

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,251
  CKD stage |         106           0         392
  CKD stage |           7           0          19
   Dialysis |          24           0          70
  Transplan |          57           0         285
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   213.04757   113.92586       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,060         502           0        502        502

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,251
  CKD stage |          97           0         392
  CKD stage |           0           0          19
   Dialysis |          15           0          70
  Transplan |         103           0         285
  KRT uncle |           2           0          43
------------+------------------------------------
      Total |   243.37913   129.39079       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,060         563           0        563        563

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         372           0       1,251
  CKD stage |          99           0         392
  CKD stage |          17           0          19
   Dialysis |          16           0          70
  Transplan |          56           0         285
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   253.32087   148.95765       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,060         566           0        566        566

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,251
  CKD stage |          95           0         392
  CKD stage |           9           0          19
   Dialysis |          13           0          70
  Transplan |          84           0         285
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   211.29806   109.49231       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,060         504           0        504        504

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,251
  CKD stage |          99           0         392
  CKD stage |           1           0          19
   Dialysis |          19           0          70
  Transplan |          48           0         285
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   224.25437   128.27518       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         500           0        500        500

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,251
  CKD stage |         105           0         392
  CKD stage |           2           0          19
   Dialysis |          13           0          70
  Transplan |          73           0         285
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   255.56845   143.79847       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         579           0        579        579

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,251
  CKD stage |         117           0         392
  CKD stage |           0           0          19
   Dialysis |          17           0          70
  Transplan |          74           0         285
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   217.88107   109.68237       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         521           0        521        521

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,251
  CKD stage |         114           0         392
  CKD stage |           8           0          19
   Dialysis |          16           0          70
  Transplan |          58           0         285
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   221.85825   118.29399       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         522           0        522        522

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,251
  CKD stage |         108           0         392
  CKD stage |          11           0          19
   Dialysis |          12           0          70
  Transplan |          49           0         285
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   234.56602   133.22874       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,060         532           0        532        532

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,251
  CKD stage |          87           0         392
  CKD stage |           0           0          19
   Dialysis |          11           0          70
  Transplan |          48           0         285
  KRT uncle |          24           0          43
------------+------------------------------------
      Total |   193.50243   107.74533       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,060         449           0        449        449

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,251
  CKD stage |         112           0         392
  CKD stage |          14           0          19
   Dialysis |           4           0          70
  Transplan |          83           0         285
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   242.88592   129.00909       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,060         573           0        573        573

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,251
  CKD stage |         117           0         392
  CKD stage |           2           0          19
   Dialysis |           6           0          70
  Transplan |          83           0         285
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   203.46359     97.1493       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,060         490           0        490        490

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,251
  CKD stage |         105           0         392
  CKD stage |           2           0          19
   Dialysis |          16           0          70
  Transplan |          56           0         285
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |    227.0801   126.17851       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,060         516           0        516        516

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         371           0       1,251
  CKD stage |          86           0         392
  CKD stage |           0           0          19
   Dialysis |          15           0          70
  Transplan |          74           0         285
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   252.64369   148.13449       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,060         557           0        557        557

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,251
  CKD stage |         110           0         392
  CKD stage |           4           0          19
   Dialysis |          11           0          70
  Transplan |          55           0         285
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |      230.15   127.67242       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,060         520           0        520        520

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,251
  CKD stage |          97           0         392
  CKD stage |           3           0          19
   Dialysis |          17           0          70
  Transplan |          98           0         285
  KRT uncle |          26           0          43
------------+------------------------------------
      Total |   260.89515   143.12865       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,060         616           0        616        616

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,251
  CKD stage |         127           0         392
  CKD stage |           2           0          19
   Dialysis |           1           0          70
  Transplan |          45           0         285
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   228.58592   125.08516       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         509           0        509        509

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,251
  CKD stage |          87           0         392
  CKD stage |           5           0          19
   Dialysis |           9           0          70
  Transplan |          83           0         285
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   214.63592   114.91729       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         510           0        510        510

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,251
  CKD stage |         108           0         392
  CKD stage |           4           0          19
   Dialysis |           8           0          70
  Transplan |          67           0         285
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   208.25097   107.77898       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         489           0        489        489

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,251
  CKD stage |         113           0         392
  CKD stage |          12           0          19
   Dialysis |          21           0          70
  Transplan |          84           0         285
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |    222.6233   110.61306       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         560           0        560        560

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,251
  CKD stage |         124           0         392
  CKD stage |          -1           0          19
   Dialysis |          22           0          70
  Transplan |          81           0         285
  KRT uncle |           4           0          43
------------+------------------------------------
      Total |   250.60194   130.99432       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,060         584           0        584        584

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,251
  CKD stage |         115           0         392
  CKD stage |          15           0          19
   Dialysis |          22           0          70
  Transplan |          86           0         285
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   205.50146   96.360081       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,060         528           0        528        528

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,251
  CKD stage |         101           0         392
  CKD stage |           0           0          19
   Dialysis |          10           0          70
  Transplan |          77           0         285
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   220.60437   116.63882       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,060         516           0        516        516

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,251
  CKD stage |         122           0         392
  CKD stage |           8           0          19
   Dialysis |          17           0          70
  Transplan |          57           0         285
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   230.50097   122.90722       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,060         539           0        539        539

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,251
  CKD stage |         150           0         392
  CKD stage |           5           0          19
   Dialysis |          18           0          70
  Transplan |          43           0         285
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |    225.4801   114.94135       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,060         541           0        541        541

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,251
  CKD stage |          71           0         392
  CKD stage |           5           0          19
   Dialysis |          26           0          70
  Transplan |          73           0         285
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   255.51553   155.36022       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,060         565           0        565        565

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,251
  CKD stage |         100           0         392
  CKD stage |           9           0          19
   Dialysis |          33           0          70
  Transplan |          63           0         285
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |   234.21068   130.46711       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,060         543           0        543        543

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         390           0       1,251
  CKD stage |          81           0         392
  CKD stage |           2           0          19
   Dialysis |          19           0          70
  Transplan |          86           0         285
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   264.96165   156.39624       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,060         585           0        585        585

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,251
  CKD stage |          88           0         392
  CKD stage |           2           0          19
   Dialysis |           4           0          70
  Transplan |          73           0         285
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   217.22476   120.53094       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,060         487           0        487        487

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,251
  CKD stage |         115           0         392
  CKD stage |           2           0          19
   Dialysis |          23           0          70
  Transplan |          69           0         285
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   236.56845   125.69839       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,060         559           0        559        559

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,251
  CKD stage |         109           0         392
  CKD stage |           4           0          19
   Dialysis |          14           0          70
  Transplan |          77           0         285
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |       226.3   118.61236       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,060         527           0        527        527

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,251
  CKD stage |         111           0         392
  CKD stage |           4           0          19
   Dialysis |           9           0          70
  Transplan |          62           0         285
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   253.24903   143.36558       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         569           0        569        569

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,251
  CKD stage |         114           0         392
  CKD stage |           5           0          19
   Dialysis |          15           0          70
  Transplan |         117           0         285
  KRT uncle |           7           0          43
------------+------------------------------------
      Total |   268.74175   139.26093       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,060         637           0        637        637

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,251
  CKD stage |         108           0         392
  CKD stage |           4           0          19
   Dialysis |          16           0          70
  Transplan |          78           0         285
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   222.19029   114.91068       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,060         528           0        528        528

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,251
  CKD stage |          78           0         392
  CKD stage |           8           0          19
   Dialysis |          16           0          70
  Transplan |          72           0         285
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   216.81942   123.04043       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,060         494           0        494        494

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,251
  CKD stage |          89           0         392
  CKD stage |           7           0          19
   Dialysis |          25           0          70
  Transplan |          78           0         285
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   206.28058   107.74327       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,060         506           0        506        506

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,251
  CKD stage |         107           0         392
  CKD stage |           0           0          19
   Dialysis |          15           0          70
  Transplan |          59           0         285
  KRT uncle |           6           0          43
------------+------------------------------------
      Total |   221.05971   120.20384       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,060         503           0        503        503

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,251
  CKD stage |          70           0         392
  CKD stage |           3           0          19
   Dialysis |          10           0          70
  Transplan |          66           0         285
  KRT uncle |          14           0          43
------------+------------------------------------
      Total |   226.55049   135.56777       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,060         498           0        498        498

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,251
  CKD stage |         120           0         392
  CKD stage |           3           0          19
   Dialysis |           5           0          70
  Transplan |          71           0         285
  KRT uncle |          17           0          43
------------+------------------------------------
      Total |   212.35825   105.84265       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,060         511           0        511        511

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,251
  CKD stage |          87           0         392
  CKD stage |           6           0          19
   Dialysis |           5           0          70
  Transplan |          69           0         285
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   203.21262    110.6223       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,060         466           0        466        466

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,251
  CKD stage |         108           0         392
  CKD stage |           2           0          19
   Dialysis |          19           0          70
  Transplan |         114           0         285
  KRT uncle |          15           0          43
------------+------------------------------------
      Total |   236.48883   115.96502       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         586           0        586        586

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         273           0       1,251
  CKD stage |         131           0         392
  CKD stage |           3           0          19
   Dialysis |          11           0          70
  Transplan |         100           0         285
  KRT uncle |          19           0          43
------------+------------------------------------
      Total |   205.34903   88.070665       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         537           0        537        537

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,251
  CKD stage |         126           0         392
  CKD stage |          -1           0          19
   Dialysis |           4           0          70
  Transplan |          64           0         285
  KRT uncle |           2           0          43
------------+------------------------------------
      Total |   207.28932   103.17878       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         482           0        482        482

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,251
  CKD stage |          89           0         392
  CKD stage |           6           0          19
   Dialysis |          26           0          70
  Transplan |          75           0         285
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   217.78544   118.32379       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         511           0        511        511

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,251
  CKD stage |         100           0         392
  CKD stage |           0           0          19
   Dialysis |           7           0          70
  Transplan |         105           0         285
  KRT uncle |          22           0          43
------------+------------------------------------
      Total |   212.18641   102.74508       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,060         527           0        527        527

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,251
  CKD stage |         161           0         392
  CKD stage |           0           0          19
   Dialysis |          12           0          70
  Transplan |          43           0         285
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   251.57282   132.61875       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,060         579           0        579        579

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,251
  CKD stage |          92           0         392
  CKD stage |           0           0          19
   Dialysis |          23           0          70
  Transplan |          53           0         285
  KRT uncle |          -1           0          43
------------+------------------------------------
      Total |   227.21748     131.662       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,060         499           0        499        499

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,251
  CKD stage |          83           0         392
  CKD stage |          27           0          19
   Dialysis |          30           0          70
  Transplan |          83           0         285
  KRT uncle |          18           0          43
------------+------------------------------------
      Total |   235.39709    130.7912       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,060         581           0        581        581

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,251
  CKD stage |          89           0         392
  CKD stage |           0           0          19
   Dialysis |          16           0          70
  Transplan |          68           0         285
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   204.31796   110.43365       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,060         470           0        470        470

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,251
  CKD stage |          84           0         392
  CKD stage |           3           0          19
   Dialysis |          10           0          70
  Transplan |          75           0         285
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   233.53786   133.41735       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,060         528           0        528        528

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,251
  CKD stage |          77           0         392
  CKD stage |           5           0          19
   Dialysis |          14           0          70
  Transplan |          51           0         285
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |    202.1733   117.63044       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,060         452           0        452        452

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,251
  CKD stage |         112           0         392
  CKD stage |           5           0          19
   Dialysis |           8           0          70
  Transplan |          61           0         285
  KRT uncle |          16           0          43
------------+------------------------------------
      Total |   258.13447    147.2605       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,060         577           0        577        577

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,251
  CKD stage |          93           0         392
  CKD stage |           0           0          19
   Dialysis |          30           0          70
  Transplan |          82           0         285
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |   223.99272   119.33363       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,060         534           0        534        534

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,251
  CKD stage |         130           0         392
  CKD stage |           2           0          19
   Dialysis |          15           0          70
  Transplan |          94           0         285
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   246.21165   121.92697       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,060         595           0        595        595

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,251
  CKD stage |         131           0         392
  CKD stage |           3           0          19
   Dialysis |           9           0          70
  Transplan |          85           0         285
  KRT uncle |          24           0          43
------------+------------------------------------
      Total |   226.99417   108.97085       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,060         564           0        564        564

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,251
  CKD stage |          92           0         392
  CKD stage |           3           0          19
   Dialysis |          10           0          70
  Transplan |          59           0         285
  KRT uncle |           2           0          43
------------+------------------------------------
      Total |   234.37621   136.45029       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         509           0        509        509

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         398           0       1,251
  CKD stage |         103           0         392
  CKD stage |           0           0          19
   Dialysis |          20           0          70
  Transplan |          92           0         285
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   274.76845   154.63928       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,060         616           0        616        616

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,251
  CKD stage |         133           0         392
  CKD stage |           5           0          19
   Dialysis |          21           0          70
  Transplan |          52           0         285
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   200.07524   96.594106       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,060         505           0        505        505

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,251
  CKD stage |          81           0         392
  CKD stage |           2           0          19
   Dialysis |          10           0          70
  Transplan |         100           0         285
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |   221.50777   119.23652       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,060         509           0        509        509

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,251
  CKD stage |         113           0         392
  CKD stage |           0           0          19
   Dialysis |          23           0          70
  Transplan |          63           0         285
  KRT uncle |          12           0          43
------------+------------------------------------
      Total |   251.69417   140.28685       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,060         574           0        574        574

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,251
  CKD stage |          82           0         392
  CKD stage |           4           0          19
   Dialysis |          27           0          70
  Transplan |          59           0         285
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   258.62864   157.87396       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,060         562           0        562        562

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,251
  CKD stage |          84           0         392
  CKD stage |           6           0          19
   Dialysis |          32           0          70
  Transplan |          38           0         285
  KRT uncle |          20           0          43
------------+------------------------------------
      Total |   244.45971   150.80293       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,060         545           0        545        545

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,251
  CKD stage |         120           0         392
  CKD stage |          10           0          19
   Dialysis |          35           0          70
  Transplan |          72           0         285
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   240.61602    125.7517       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,060         580           0        580        580

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,251
  CKD stage |         104           0         392
  CKD stage |           5           0          19
   Dialysis |          11           0          70
  Transplan |          98           0         285
  KRT uncle |           3           0          43
------------+------------------------------------
      Total |   214.19369   105.28805       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,060         518           0        518        518

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,251
  CKD stage |          66           0         392
  CKD stage |           0           0          19
   Dialysis |          10           0          70
  Transplan |          85           0         285
  KRT uncle |           5           0          43
------------+------------------------------------
      Total |   222.73689   129.49237       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         492           0        492        492

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,251
  CKD stage |         105           0         392
  CKD stage |          14           0          19
   Dialysis |           4           0          70
  Transplan |          52           0         285
  KRT uncle |           8           0          43
------------+------------------------------------
      Total |   261.41019   155.45577       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         568           0        568        568

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,251
  CKD stage |         118           0         392
  CKD stage |           2           0          19
   Dialysis |          11           0          70
  Transplan |          78           0         285
  KRT uncle |          11           0          43
------------+------------------------------------
      Total |   208.15728    100.9687       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         507           0        507        507

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,251
  CKD stage |          93           0         392
  CKD stage |           2           0          19
   Dialysis |          19           0          70
  Transplan |          82           0         285
  KRT uncle |          10           0          43
------------+------------------------------------
      Total |    226.0665   121.85526       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,060         529           0        529        529

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,251
  CKD stage |          94           0         392
  CKD stage |           3           0          19
   Dialysis |          24           0          70
  Transplan |          69           0         285
  KRT uncle |           0           0          43
------------+------------------------------------
      Total |   246.89806   141.82579       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,060         550           0        550        550

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,251
  CKD stage |         109           0         392
  CKD stage |           4           0          19
   Dialysis |          25           0          70
  Transplan |          54           0         285
  KRT uncle |           9           0          43
------------+------------------------------------
      Total |   218.75874   118.12687       2,060

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,060         513           0        513        513

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(61 real changes made)

. replace ethnicity=2 if ethnicity==3
(82 real changes made)

. replace ethnicity=3 if ethnicity==4
(95 real changes made)

. replace ethnicity=4 if ethnicity==6
(61 real changes made)

. replace ethnicity=6 if ethnicity==.
(500 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,831 missing values generated)

. replace region = 2 if region_string=="East"
(229 real changes made)

. replace region = 3 if region_string=="London"
(416 real changes made)

. replace region = 4 if region_string=="North East"
(203 real changes made)

. replace region = 5 if region_string=="North West"
(193 real changes made)

. replace region = 6 if region_string=="South East"
(198 real changes made)

. replace region = 7 if region_string=="South West"
(199 real changes made)

. replace region = 8 if region_string=="West Midlands"
(199 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(194 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,060 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(842 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,218 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v3.dta", replace
(note: file ./output/2022_ckd_complete_v3.dta not found)
file ./output/2022_ckd_complete_v3.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete_v3.log
  log type:  text
 closed on:  24 Apr 2023, 08:55:18
-------------------------------------------------------------------------------
