-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd.log
  log type:  text
 opened on:  28 Dec 2022, 15:51:23

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,696 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,984 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,717 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,245        9.66        9.66
           East Midlands |      3,308        9.84       19.50
                  London |      6,717       19.99       39.49
              North East |      3,434       10.22       49.71
              North West |      3,291        9.79       59.50
              South East |      3,331        9.91       69.42
              South West |      3,482       10.36       79.78
           West Midlands |      3,518       10.47       90.25
Yorkshire and The Humber |      3,277        9.75      100.00
-------------------------+-----------------------------------
                   Total |     33,603      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,609        4.79        4.79
          1 |      6,463       19.23       24.02
          2 |      6,287       18.71       42.73
          3 |      6,423       19.11       61.85
          4 |      6,376       18.97       80.82
          5 |      6,445       19.18      100.00
------------+-----------------------------------
      Total |     33,603      100.00

. drop if imd==0
(1,609 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,995 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(825 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(783 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,962 real changes made, 13,962 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,962 missing values generated)

. gen min_baseline_creatinine=.
(31,994 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,172 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,860 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,172 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,860 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,403 real changes made)

. gen max_baseline_creatinine=.
(31,994 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,172 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,860 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(18,032 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,591 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,962 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(18,032 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,172 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,719 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,994
25%            0              0       Sum of Wgt.      31,994

50%            0                      Mean           12.48585
                        Largest       Std. Dev.      12.98274
75%     24.97568       41.17031
90%     29.17969       41.83043       Variance       168.5516
95%     31.42076       41.91975       Skewness        .215744
99%     35.38055       45.86388       Kurtosis       1.303259

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,648        5.73        5.73
         <= |      1,593        5.53       11.26
          = |     20,749       72.09       83.34
          > |      1,614        5.61       88.95
         >= |      1,612        5.60       94.55
          ~ |      1,568        5.45      100.00
------------+-----------------------------------
      Total |     28,784      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,607       55.03       55.03
          1 |     14,387       44.97      100.00
------------+-----------------------------------
      Total |     31,994      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,888       46.53       46.53
          1 |     17,106       53.47      100.00
------------+-----------------------------------
      Total |     31,994      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,376       94.94       94.94
          1 |      1,618        5.06      100.00
------------+-----------------------------------
      Total |     31,994      100.00
(736 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,404       95.03       95.03
          1 |      1,590        4.97      100.00
------------+-----------------------------------
      Total |     31,994      100.00
(694 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,397       95.01       95.01
          1 |      1,597        4.99      100.00
------------+-----------------------------------
      Total |     31,994      100.00
(636 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,437       95.13       95.13
          1 |      1,557        4.87      100.00
------------+-----------------------------------
      Total |     31,994      100.00
(598 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,353       94.87       94.87
          1 |      1,641        5.13      100.00
------------+-----------------------------------
      Total |     31,994      100.00
(633 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,402       95.02       95.02
          1 |      1,592        4.98      100.00
------------+-----------------------------------
      Total |     31,994      100.00
(583 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,008       34.41       34.41
          1 |     20,986       65.59      100.00
------------+-----------------------------------
      Total |     31,994      100.00

. drop if ckd==0
(11,008 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2022_ckd.csv not found)
file ./output/2022_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd.log
  log type:  text
 closed on:  28 Dec 2022, 15:51:26
-------------------------------------------------------------------------------
