-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete_v2.log
  log type:  text
 opened on:  24 Mar 2023, 18:46:34

. clear

. 
. *Merge `dataset'_ckd_v2 with `dataset'_ckd_complete_v2
. capture noisily import delimited ./output/`dataset'_ckd_v2.csv, clear
(7 vars, 21,024 obs)

. tempfile `dataset'_ckd_v2

. save ``dataset'_ckd'_v2, replace
(note: file _v2.dta not found)
file _v2.dta saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete_v2.csv
> , clear
(210 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'_v2

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,770
        from master                    47,873  (_merge==1)
        from using                     18,897  (_merge==2)

    matched                             2,127  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,770 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v2

. save ``dataset'_ckd_complete'_v2, replace
file _v2.dta saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd_v2.csv, clear
> tempfile 2017_ckd_v2
> save 2017_ckd_v2, replace
> capture noisily import delimited ./output/input_2017_ckd_complete_v2.csv, cle
> ar
> merge 1:1 patient_id using 2017_ckd_v2
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v2
> save 2017_ckd_complete_v2, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        180        8.46        8.46
Kidney transplant |        205        9.64       18.10
 Modality unclear |         54        2.54       20.64
          Pre KRT |      1,688       79.36      100.00
------------------+-----------------------------------
            Total |      2,127      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(857 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1270 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(180 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(205 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(54 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(685 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,307       61.45       61.45
  CKD stage 3 |        365       17.16       78.61
CKD stage 4/5 |         16        0.75       79.36
     Dialysis |        180        8.46       87.82
   Transplant |        205        9.64       97.46
  KRT unclear |         54        2.54      100.00
--------------+-----------------------------------
        Total |      2,127      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,307 |     1,307 
  CKD stage 3 |         0          0          0        365 |       365 
CKD stage 4/5 |         0          0          0         16 |        16 
     Dialysis |       180          0          0          0 |       180 
   Transplant |         0        205          0          0 |       205 
  KRT unclear |         0          0         54          0 |        54 
--------------+--------------------------------------------+----------
        Total |       180        205         54      1,688 |     2,127 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       145         68         50         13 |     1,307 
  CKD stage 3 |        44         14         13          7 |       365 
CKD stage 4/5 |         2          2          0          0 |        16 
     Dialysis |        16         10          3          1 |       180 
   Transplant |        21         14          8          3 |       205 
  KRT unclear |         6          6          2          2 |        54 
--------------+--------------------------------------------+----------
        Total |       234        114         76         26 |     2,127 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |     1,031 |     1,307 
  CKD stage 3 |       287 |       365 
CKD stage 4/5 |        12 |        16 
     Dialysis |       150 |       180 
   Transplant |       159 |       205 
  KRT unclear |        38 |        54 
--------------+-----------+----------
        Total |     1,677 |     2,127 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,124 missing values generated)

. replace sex = 0 if male == "Female"
(1,124 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(902 real changes made, 902 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(902 missing values generated)

. gen min_creatinine_outcome=.
(2,127 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(661 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(564 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(661 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(564 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(745 real changes made)

. gen max_creatinine_outcome=.
(2,127 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(661 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(564 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,225 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,382 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(902 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,225 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(661 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(902 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1225 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(187 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(16 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(114 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(76 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(26 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(234 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,521       71.51       71.51
               CKD 3 |        141        6.63       78.14
     CKD 4/5 pre-KRT |         15        0.71       78.84
            Dialysis |        114        5.36       84.20
   Kidney transplant |         76        3.57       87.78
KRT unclear modality |         26        1.22       89.00
            Deceased |        234       11.00      100.00
---------------------+-----------------------------------
               Total |      2,127      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,307
  CKD stage |         104           0         365
  CKD stage |           0           0          16
   Dialysis |          36           0         180
  Transplan |          46           0         205
  KRT uncle |           7           0          54
------------+------------------------------------
      Total |   198.17348   106.88103       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,127         474           0        474        474

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,307
  CKD stage |         114           0         365
  CKD stage |           2           0          16
   Dialysis |          31           0         180
  Transplan |          52           0         205
  KRT uncle |          22           0          54
------------+------------------------------------
      Total |   212.73014   114.05684       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,127         522           0        522        522

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         297           0       1,307
  CKD stage |          79           0         365
  CKD stage |           3           0          16
   Dialysis |          40           0         180
  Transplan |          43           0         205
  KRT uncle |          11           0          54
------------+------------------------------------
      Total |   203.88858   118.43343       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,127         473           0        473        473

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,307
  CKD stage |          71           0         365
  CKD stage |           0           0          16
   Dialysis |          47           0         180
  Transplan |          40           0         205
  KRT uncle |           2           0          54
------------+------------------------------------
      Total |   242.50917   151.42776       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,127         522           0        522        522

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,307
  CKD stage |         110           0         365
  CKD stage |           2           0          16
   Dialysis |          37           0         180
  Transplan |          49           0         205
  KRT uncle |           6           0          54
------------+------------------------------------
      Total |   233.97743   132.18667       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,127         541           0        541        541

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,307
  CKD stage |         105           0         365
  CKD stage |           0           0          16
   Dialysis |          69           0         180
  Transplan |          76           0         205
  KRT uncle |          17           0          54
------------+------------------------------------
      Total |   209.81335   102.56691       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,127         557           0        557        557

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,307
  CKD stage |          97           0         365
  CKD stage |           7           0          16
   Dialysis |          39           0         180
  Transplan |          38           0         205
  KRT uncle |          37           0          54
------------+------------------------------------
      Total |   217.54725   123.22045       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,127         532           0        532        532

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,307
  CKD stage |          80           0         365
  CKD stage |           5           0          16
   Dialysis |          49           0         180
  Transplan |          63           0         205
  KRT uncle |           3           0          54
------------+------------------------------------
      Total |   231.75505   134.84528       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,127         538           0        538        538

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,307
  CKD stage |          87           0         365
  CKD stage |           5           0          16
   Dialysis |          41           0         180
  Transplan |          80           0         205
  KRT uncle |          23           0          54
------------+------------------------------------
      Total |   227.05172   125.82154       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,127         562           0        562        562

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,307
  CKD stage |          91           0         365
  CKD stage |           0           0          16
   Dialysis |          23           0         180
  Transplan |          56           0         205
  KRT uncle |          17           0          54
------------+------------------------------------
      Total |    220.6394   128.13296       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,127         508           0        508        508

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,307
  CKD stage |         138           0         365
  CKD stage |           0           0          16
   Dialysis |          54           0         180
  Transplan |          49           0         205
  KRT uncle |          10           0          54
------------+------------------------------------
      Total |   257.51293   138.95705       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,127         616           0        616        616

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,307
  CKD stage |         129           0         365
  CKD stage |          11           0          16
   Dialysis |          35           0         180
  Transplan |          68           0         205
  KRT uncle |          19           0          54
------------+------------------------------------
      Total |   236.83968   124.37209       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,127         595           0        595        595

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,307
  CKD stage |          92           0         365
  CKD stage |           0           0          16
   Dialysis |          15           0         180
  Transplan |          39           0         205
  KRT uncle |           8           0          54
------------+------------------------------------
      Total |   218.88152   132.02491       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,127         476           0        476        476

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,307
  CKD stage |         118           0         365
  CKD stage |           3           0          16
   Dialysis |          34           0         180
  Transplan |          75           0         205
  KRT uncle |          15           0          54
------------+------------------------------------
      Total |   251.35684   138.05327       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,127         604           0        604        604

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,307
  CKD stage |          85           0         365
  CKD stage |           1           0          16
   Dialysis |          56           0         180
  Transplan |          52           0         205
  KRT uncle |          22           0          54
------------+------------------------------------
      Total |    243.6582   142.46104       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,127         572           0        572        572

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,307
  CKD stage |         118           0         365
  CKD stage |           3           0          16
   Dialysis |          39           0         180
  Transplan |          42           0         205
  KRT uncle |          17           0          54
------------+------------------------------------
      Total |    236.3606   132.11405       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,127         558           0        558        558

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,307
  CKD stage |          70           0         365
  CKD stage |           5           0          16
   Dialysis |          40           0         180
  Transplan |          51           0         205
  KRT uncle |           9           0          54
------------+------------------------------------
      Total |   252.23789   157.96348       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,127         552           0        552        552

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,307
  CKD stage |          96           0         365
  CKD stage |           6           0          16
   Dialysis |          47           0         180
  Transplan |          38           0         205
  KRT uncle |          18           0          54
------------+------------------------------------
      Total |   256.88952   154.05995       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,127         583           0        583        583

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,307
  CKD stage |          81           0         365
  CKD stage |           4           0          16
   Dialysis |          48           0         180
  Transplan |          48           0         205
  KRT uncle |          20           0          54
------------+------------------------------------
      Total |   203.16878   114.16791       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         494           0        494        494

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,307
  CKD stage |          95           0         365
  CKD stage |           5           0          16
   Dialysis |          76           0         180
  Transplan |          47           0         205
  KRT uncle |          10           0          54
------------+------------------------------------
      Total |   259.21439   149.68996       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         610           0        610        610

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,307
  CKD stage |         103           0         365
  CKD stage |           5           0          16
   Dialysis |          40           0         180
  Transplan |          60           0         205
  KRT uncle |          13           0          54
------------+------------------------------------
      Total |   230.60367    128.2972       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         552           0        552        552

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         287           0       1,307
  CKD stage |          88           0         365
  CKD stage |           0           0          16
   Dialysis |          46           0         180
  Transplan |          56           0         205
  KRT uncle |           9           0          54
------------+------------------------------------
      Total |   200.97555   109.73103       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         486           0        486        486

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,307
  CKD stage |          77           0         365
  CKD stage |           0           0          16
   Dialysis |          31           0         180
  Transplan |          47           0         205
  KRT uncle |          31           0          54
------------+------------------------------------
      Total |   214.71509   127.33005       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,127         501           0        501        501

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,307
  CKD stage |         108           0         365
  CKD stage |           3           0          16
   Dialysis |          54           0         180
  Transplan |          75           0         205
  KRT uncle |          12           0          54
------------+------------------------------------
      Total |   221.14763   113.77873       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,127         562           0        562        562

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,307
  CKD stage |         104           0         365
  CKD stage |           0           0          16
   Dialysis |          50           0         180
  Transplan |          58           0         205
  KRT uncle |           1           0          54
------------+------------------------------------
      Total |   237.84579   133.04762       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,127         555           0        555        555

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,307
  CKD stage |          78           0         365
  CKD stage |          10           0          16
   Dialysis |          33           0         180
  Transplan |          47           0         205
  KRT uncle |           8           0          54
------------+------------------------------------
      Total |   191.19699   109.31273       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,127         453           0        453        453

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,307
  CKD stage |          82           0         365
  CKD stage |           0           0          16
   Dialysis |          45           0         180
  Transplan |          34           0         205
  KRT uncle |          18           0          54
------------+------------------------------------
      Total |    224.3921   134.23282       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,127         509           0        509        509

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         396           0       1,307
  CKD stage |         127           0         365
  CKD stage |           7           0          16
   Dialysis |          26           0         180
  Transplan |          60           0         205
  KRT uncle |           8           0          54
------------+------------------------------------
      Total |   273.36671   157.53297       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,127         624           0        624        624

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,307
  CKD stage |         124           0         365
  CKD stage |           0           0          16
   Dialysis |          17           0         180
  Transplan |          46           0         205
  KRT uncle |          15           0          54
------------+------------------------------------
      Total |   243.82887   139.87835       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,127         554           0        554        554

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,307
  CKD stage |         100           0         365
  CKD stage |           2           0          16
   Dialysis |          25           0         180
  Transplan |          72           0         205
  KRT uncle |          10           0          54
------------+------------------------------------
      Total |   242.78138   139.54953       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,127         561           0        561        561

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,307
  CKD stage |         106           0         365
  CKD stage |           8           0          16
   Dialysis |          44           0         180
  Transplan |          52           0         205
  KRT uncle |           5           0          54
------------+------------------------------------
      Total |   241.56606   137.30528       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         564           0        564        564

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,307
  CKD stage |         139           0         365
  CKD stage |           8           0          16
   Dialysis |          30           0         180
  Transplan |          48           0         205
  KRT uncle |          16           0          54
------------+------------------------------------
      Total |   230.57593   122.34472       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         565           0        565        565

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,307
  CKD stage |         101           0         365
  CKD stage |           0           0          16
   Dialysis |          31           0         180
  Transplan |          49           0         205
  KRT uncle |          27           0          54
------------+------------------------------------
      Total |   252.10672   149.00565       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         577           0        577        577

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,307
  CKD stage |          67           0         365
  CKD stage |           8           0          16
   Dialysis |          48           0         180
  Transplan |          74           0         205
  KRT uncle |          16           0          54
------------+------------------------------------
      Total |   203.81523   114.36257       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         507           0        507        507

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,307
  CKD stage |          69           0         365
  CKD stage |          17           0          16
   Dialysis |          29           0         180
  Transplan |          69           0         205
  KRT uncle |           6           0          54
------------+------------------------------------
      Total |   227.69064   137.43495       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,127         526           0        526        526

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,307
  CKD stage |          71           0         365
  CKD stage |          12           0          16
   Dialysis |          55           0         180
  Transplan |          51           0         205
  KRT uncle |          13           0          54
------------+------------------------------------
      Total |   238.47109   143.71829       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,127         554           0        554        554

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,307
  CKD stage |          97           0         365
  CKD stage |           2           0          16
   Dialysis |          35           0         180
  Transplan |          34           0         205
  KRT uncle |          10           0          54
------------+------------------------------------
      Total |   244.98072   148.00919       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,127         539           0        539        539

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         273           0       1,307
  CKD stage |          89           0         365
  CKD stage |           0           0          16
   Dialysis |          54           0         180
  Transplan |          71           0         205
  KRT uncle |           3           0          54
------------+------------------------------------
      Total |   194.51481   100.28685       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,127         490           0        490        490

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,307
  CKD stage |          98           0         365
  CKD stage |           7           0          16
   Dialysis |          35           0         180
  Transplan |          24           0         205
  KRT uncle |          25           0          54
------------+------------------------------------
      Total |   248.29384   151.48668       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,127         556           0        556        556

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,307
  CKD stage |          80           0         365
  CKD stage |           2           0          16
   Dialysis |          40           0         180
  Transplan |          45           0         205
  KRT uncle |          26           0          54
------------+------------------------------------
      Total |   227.97649   135.79943       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,127         528           0        528        528

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,307
  CKD stage |          85           0         365
  CKD stage |           0           0          16
   Dialysis |          53           0         180
  Transplan |          55           0         205
  KRT uncle |           6           0          54
------------+------------------------------------
      Total |   205.79643   113.57408       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,127         494           0        494        494

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,307
  CKD stage |          68           0         365
  CKD stage |          10           0          16
   Dialysis |          51           0         180
  Transplan |          42           0         205
  KRT uncle |          24           0          54
------------+------------------------------------
      Total |   230.86977   140.63975       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,127         537           0        537        537

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,307
  CKD stage |         103           0         365
  CKD stage |           6           0          16
   Dialysis |          44           0         180
  Transplan |          65           0         205
  KRT uncle |          30           0          54
------------+------------------------------------
      Total |   230.63423   125.46687       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,127         577           0        577        577

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,307
  CKD stage |          80           0         365
  CKD stage |           4           0          16
   Dialysis |          28           0         180
  Transplan |          61           0         205
  KRT uncle |           9           0          54
------------+------------------------------------
      Total |   242.21956   147.03585       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,127         540           0        540        540

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,307
  CKD stage |          84           0         365
  CKD stage |           5           0          16
   Dialysis |          46           0         180
  Transplan |          49           0         205
  KRT uncle |          12           0          54
------------+------------------------------------
      Total |   213.86131   122.25832       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,127         506           0        506        506

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,307
  CKD stage |          88           0         365
  CKD stage |          14           0          16
   Dialysis |          55           0         180
  Transplan |          48           0         205
  KRT uncle |          25           0          54
------------+------------------------------------
      Total |    216.2252   120.46138       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         541           0        541        541

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,307
  CKD stage |          79           0         365
  CKD stage |           5           0          16
   Dialysis |          79           0         180
  Transplan |          32           0         205
  KRT uncle |           7           0          54
------------+------------------------------------
      Total |   240.45322   143.04167       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,127         555           0        555        555

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,307
  CKD stage |          76           0         365
  CKD stage |           0           0          16
   Dialysis |          36           0         180
  Transplan |          45           0         205
  KRT uncle |          13           0          54
------------+------------------------------------
      Total |   222.30512   134.15468       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,127         498           0        498        498

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,307
  CKD stage |          77           0         365
  CKD stage |           1           0          16
   Dialysis |          55           0         180
  Transplan |          57           0         205
  KRT uncle |          30           0          54
------------+------------------------------------
      Total |   215.84861   121.82679       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,127         532           0        532        532

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,307
  CKD stage |         106           0         365
  CKD stage |           5           0          16
   Dialysis |          59           0         180
  Transplan |          48           0         205
  KRT uncle |           9           0          54
------------+------------------------------------
      Total |   211.19041   111.44414       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,127         525           0        525        525

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,307
  CKD stage |          67           0         365
  CKD stage |           0           0          16
   Dialysis |          60           0         180
  Transplan |          49           0         205
  KRT uncle |          12           0          54
------------+------------------------------------
      Total |   233.59803   141.03155       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,127         533           0        533        533

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         294           0       1,307
  CKD stage |          91           0         365
  CKD stage |           6           0          16
   Dialysis |          46           0         180
  Transplan |          93           0         205
  KRT uncle |           7           0          54
------------+------------------------------------
      Total |   209.35214   108.28504       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,127         537           0        537        537

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,307
  CKD stage |         105           0         365
  CKD stage |           9           0          16
   Dialysis |          23           0         180
  Transplan |          40           0         205
  KRT uncle |          14           0          54
------------+------------------------------------
      Total |   250.98637   150.93481       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,127         560           0        560        560

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         374           0       1,307
  CKD stage |          99           0         365
  CKD stage |          10           0          16
   Dialysis |          54           0         180
  Transplan |          47           0         205
  KRT uncle |          15           0          54
------------+------------------------------------
      Total |   256.36013   149.62989       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,127         599           0        599        599

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,307
  CKD stage |          93           0         365
  CKD stage |          12           0          16
   Dialysis |          53           0         180
  Transplan |          43           0         205
  KRT uncle |          14           0          54
------------+------------------------------------
      Total |    198.9323   107.47407       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         498           0        498        498

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,307
  CKD stage |         110           0         365
  CKD stage |           0           0          16
   Dialysis |          41           0         180
  Transplan |          37           0         205
  KRT uncle |          14           0          54
------------+------------------------------------
      Total |   211.84062   116.31236       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         504           0        504        504

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         356           0       1,307
  CKD stage |         134           0         365
  CKD stage |          11           0          16
   Dialysis |          54           0         180
  Transplan |          48           0         205
  KRT uncle |          12           0          54
------------+------------------------------------
      Total |   251.33333   135.17266       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         615           0        615        615

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,307
  CKD stage |         111           0         365
  CKD stage |           6           0          16
   Dialysis |          82           0         180
  Transplan |          58           0         205
  KRT uncle |          18           0          54
------------+------------------------------------
      Total |   245.30418   129.76449       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         622           0        622        622

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,307
  CKD stage |          93           0         365
  CKD stage |           0           0          16
   Dialysis |          43           0         180
  Transplan |          57           0         205
  KRT uncle |           7           0          54
------------+------------------------------------
      Total |   221.90315   125.07678       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,127         520           0        520        520

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         364           0       1,307
  CKD stage |         107           0         365
  CKD stage |           0           0          16
   Dialysis |          46           0         180
  Transplan |          45           0         205
  KRT uncle |          20           0          54
------------+------------------------------------
      Total |    250.7701   144.53188       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,127         582           0        582        582

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,307
  CKD stage |          90           0         365
  CKD stage |           1           0          16
   Dialysis |          41           0         180
  Transplan |          49           0         205
  KRT uncle |           9           0          54
------------+------------------------------------
      Total |   226.65115   131.60562       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,127         520           0        520        520

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,307
  CKD stage |         117           0         365
  CKD stage |           4           0          16
   Dialysis |          45           0         180
  Transplan |          64           0         205
  KRT uncle |          14           0          54
------------+------------------------------------
      Total |   243.04984   131.97888       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,127         590           0        590        590

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,307
  CKD stage |          85           0         365
  CKD stage |           0           0          16
   Dialysis |          68           0         180
  Transplan |          45           0         205
  KRT uncle |          19           0          54
------------+------------------------------------
      Total |   216.26375    120.4386       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,127         528           0        528        528

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,307
  CKD stage |          68           0         365
  CKD stage |           3           0          16
   Dialysis |          16           0         180
  Transplan |          43           0         205
  KRT uncle |           6           0          54
------------+------------------------------------
      Total |    214.5905   135.16854       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,127         457           0        457        457

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         402           0       1,307
  CKD stage |          58           0         365
  CKD stage |          12           0          16
   Dialysis |          74           0         180
  Transplan |          62           0         205
  KRT uncle |          16           0          54
------------+------------------------------------
      Total |   269.70851   167.30732       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,127         624           0        624        624

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         392           0       1,307
  CKD stage |         104           0         365
  CKD stage |           1           0          16
   Dialysis |          61           0         180
  Transplan |          51           0         205
  KRT uncle |          14           0          54
------------+------------------------------------
      Total |   269.16361   156.24526       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,127         623           0        623        623

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,307
  CKD stage |          65           0         365
  CKD stage |           2           0          16
   Dialysis |          43           0         180
  Transplan |          80           0         205
  KRT uncle |          16           0          54
------------+------------------------------------
      Total |   231.84814   137.09149       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,127         546           0        546        546

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,307
  CKD stage |         113           0         365
  CKD stage |           0           0          16
   Dialysis |          15           0         180
  Transplan |          47           0         205
  KRT uncle |          24           0          54
------------+------------------------------------
      Total |   240.86789   140.36934       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,127         549           0        549        549

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,307
  CKD stage |          75           0         365
  CKD stage |           2           0          16
   Dialysis |          51           0         180
  Transplan |          31           0         205
  KRT uncle |           9           0          54
------------+------------------------------------
      Total |   224.42501   136.57514       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,127         500           0        500        500

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,307
  CKD stage |         111           0         365
  CKD stage |           0           0          16
   Dialysis |          37           0         180
  Transplan |          61           0         205
  KRT uncle |          20           0          54
------------+------------------------------------
      Total |   229.50118   125.06522       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         556           0        556        556

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,307
  CKD stage |          96           0         365
  CKD stage |           5           0          16
   Dialysis |          56           0         180
  Transplan |          60           0         205
  KRT uncle |          16           0          54
------------+------------------------------------
      Total |   265.85802   155.04098       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,127         621           0        621        621

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,307
  CKD stage |          54           0         365
  CKD stage |           3           0          16
   Dialysis |          62           0         180
  Transplan |          48           0         205
  KRT uncle |           9           0          54
------------+------------------------------------
      Total |    236.3023   147.61825       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,127         529           0        529        529

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,307
  CKD stage |          81           0         365
  CKD stage |          12           0          16
   Dialysis |          58           0         180
  Transplan |          54           0         205
  KRT uncle |          11           0          54
------------+------------------------------------
      Total |   225.31735   129.00182       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,127         543           0        543        543

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,307
  CKD stage |          85           0         365
  CKD stage |           0           0          16
   Dialysis |          51           0         180
  Transplan |          62           0         205
  KRT uncle |          10           0          54
------------+------------------------------------
      Total |   241.42877    140.3245       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,127         560           0        560        560

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,307
  CKD stage |          85           0         365
  CKD stage |          11           0          16
   Dialysis |          41           0         180
  Transplan |          54           0         205
  KRT uncle |          37           0          54
------------+------------------------------------
      Total |   250.41138    149.0597       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,127         596           0        596        596

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,307
  CKD stage |          81           0         365
  CKD stage |           0           0          16
   Dialysis |          56           0         180
  Transplan |          62           0         205
  KRT uncle |          20           0          54
------------+------------------------------------
      Total |   243.26281   141.57842       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,127         574           0        574        574

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,307
  CKD stage |         152           0         365
  CKD stage |          11           0          16
   Dialysis |          49           0         180
  Transplan |          56           0         205
  KRT uncle |          13           0          54
------------+------------------------------------
      Total |   228.37283   111.92469       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,127         594           0        594        594

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,307
  CKD stage |         105           0         365
  CKD stage |           0           0          16
   Dialysis |          50           0         180
  Transplan |          70           0         205
  KRT uncle |          24           0          54
------------+------------------------------------
      Total |   237.91443   128.88607       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,127         588           0        588        588

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,307
  CKD stage |          70           0         365
  CKD stage |          12           0          16
   Dialysis |          36           0         180
  Transplan |          42           0         205
  KRT uncle |           6           0          54
------------+------------------------------------
      Total |   228.27268    141.6245       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         506           0        506        506

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         271           0       1,307
  CKD stage |         108           0         365
  CKD stage |           2           0          16
   Dialysis |          22           0         180
  Transplan |          55           0         205
  KRT uncle |          21           0          54
------------+------------------------------------
      Total |   192.76822   101.58071       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         479           0        479        479

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,307
  CKD stage |         113           0         365
  CKD stage |           0           0          16
   Dialysis |          51           0         180
  Transplan |          40           0         205
  KRT uncle |          15           0          54
------------+------------------------------------
      Total |   224.57687   122.74506       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         539           0        539        539

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         390           0       1,307
  CKD stage |          96           0         365
  CKD stage |           0           0          16
   Dialysis |          26           0         180
  Transplan |          49           0         205
  KRT uncle |           0           0          54
------------+------------------------------------
      Total |   263.04419   161.71778       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,127         561           0        561        561

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,307
  CKD stage |          57           0         365
  CKD stage |           0           0          16
   Dialysis |          54           0         180
  Transplan |          57           0         205
  KRT uncle |          12           0          54
------------+------------------------------------
      Total |   211.25294   126.22978       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,127         491           0        491        491

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         258           0       1,307
  CKD stage |          99           0         365
  CKD stage |          -1           0          16
   Dialysis |          49           0         180
  Transplan |          48           0         205
  KRT uncle |          26           0          54
------------+------------------------------------
      Total |   184.95016   93.937022       2,127

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,127         479           0        479        479

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(77 real changes made)

. replace ethnicity=2 if ethnicity==3
(76 real changes made)

. replace ethnicity=3 if ethnicity==4
(76 real changes made)

. replace ethnicity=4 if ethnicity==6
(77 real changes made)

. replace ethnicity=6 if ethnicity==.
(520 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,905 missing values generated)

. replace region = 2 if region_string=="East"
(232 real changes made)

. replace region = 3 if region_string=="London"
(430 real changes made)

. replace region = 4 if region_string=="North East"
(184 real changes made)

. replace region = 5 if region_string=="North West"
(212 real changes made)

. replace region = 6 if region_string=="South East"
(212 real changes made)

. replace region = 7 if region_string=="South West"
(211 real changes made)

. replace region = 8 if region_string=="West Midlands"
(201 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(223 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,127 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(820 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,307 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v2.dta", replace
(note: file ./output/2022_ckd_complete_v2.dta not found)
file ./output/2022_ckd_complete_v2.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete_v2.log
  log type:  text
 closed on:  24 Mar 2023, 18:46:40
-------------------------------------------------------------------------------
