-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete.log
  log type:  text
 opened on:  12 Sep 2023, 14:39:16

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(9 vars, 21,004 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00016.000001 not found)
file /tmp/St00016.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(235 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,788
        from master                    47,892  (_merge==1)
        from using                     18,896  (_merge==2)

    matched                             2,108  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,788 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete

. save ``dataset'_ckd_complete', replace
(note: file /tmp/St00016.000002 not found)
file /tmp/St00016.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save ./output/2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using ./output/2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete
> save ./output/2017_ckd_complete, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        193        9.16        9.16
Kidney transplant |        205        9.72       18.88
 Modality unclear |         44        2.09       20.97
          Pre KRT |      1,666       79.03      100.00
------------------+-----------------------------------
            Total |      2,108      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(819 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1289 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,289       61.15       61.15
          . |        819       38.85      100.00
------------+-----------------------------------
      Total |      2,108      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(193 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(28 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(139 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(313 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(13 real changes made)

. gen modality_unclear = 0

. replace modality_unclear = 1 if modality_baseline=="Modality unclear"
(44 real changes made)

. replace modality_unclear = 0 if dialysis==1
(0 real changes made)

. replace modality_unclear = 0 if kidney_transplant==1
(13 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       111         82 |       193 
Kidney transplant |       205          0 |       205 
 Modality unclear |        44          0 |        44 
          Pre KRT |     1,666          0 |     1,666 
------------------+----------------------+----------
            Total |     2,026         82 |     2,108 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       176         17 |       193 
Kidney transplant |       175         30 |       205 
 Modality unclear |        31         13 |        44 
          Pre KRT |     1,426        240 |     1,666 
------------------+----------------------+----------
            Total |     1,808        300 |     2,108 

. tab modality_baseline modality_unclear

                  |   modality_unclear
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       193          0 |       193 
Kidney transplant |       205          0 |       205 
 Modality unclear |        13         31 |        44 
          Pre KRT |     1,666          0 |     1,666 
------------------+----------------------+----------
            Total |     2,077         31 |     2,108 

. tab dialysis kidney_transplant

           |   kidney_transplant
  dialysis |         0          1 |     Total
-----------+----------------------+----------
         0 |     1,726        300 |     2,026 
         1 |        82          0 |        82 
-----------+----------------------+----------
     Total |     1,808        300 |     2,108 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(819 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1289 changes made)

. replace ckd_group = 4 if dialysis==1
(82 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(300 real changes made)

. replace ckd_group = 6 if modality_unclear==1
(31 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(615 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,293       61.34       61.34
         CKD stage 3 |        388       18.41       79.74
       CKD stage 4/5 |         14        0.66       80.41
            Dialysis |         82        3.89       84.30
          Transplant |        300       14.23       98.53
KRT unclear modality |         31        1.47      100.00
---------------------+-----------------------------------
               Total |      2,108      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        61        140          0      1,092 |     1,293 
         CKD stage 3 |        30         35          0        323 |       388 
       CKD stage 4/5 |         3          0          0         11 |        14 
            Dialysis |        82          0          0          0 |        82 
          Transplant |        17         30         13        240 |       300 
KRT unclear modality |         0          0         31          0 |        31 
---------------------+--------------------------------------------+----------
               Total |       193        205         44      1,666 |     2,108 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       139         67         48         13 |     1,293 
         CKD stage 3 |        44         16         14          2 |       388 
       CKD stage 4/5 |         2          0          0          0 |        14 
            Dialysis |         8          3          5          1 |        82 
          Transplant |        30         21         13          2 |       300 
KRT unclear modality |         2          1          0          0 |        31 
---------------------+--------------------------------------------+----------
               Total |       225        108         80         18 |     2,108 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,026 |     1,293 
         CKD stage 3 |       312 |       388 
       CKD stage 4/5 |        12 |        14 
            Dialysis |        65 |        82 
          Transplant |       234 |       300 
KRT unclear modality |        28 |        31 
---------------------+-----------+----------
               Total |     1,677 |     2,108 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,114 missing values generated)

. replace sex = 0 if male == "Female"
(1,114 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(940 real changes made, 940 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(940 missing values generated)

. gen min_creatinine_outcome=.
(2,108 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(619 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(549 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(619 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(549 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(793 real changes made)

. gen max_creatinine_outcome=.
(2,108 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(619 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(549 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,168 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,315 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(940 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,168 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(619 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(940 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1168 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(189 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(7 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(7 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(940 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1168 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,168       55.41       55.41
          . |        940       44.59      100.00
------------+-----------------------------------
      Total |      2,108      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(108 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(80 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(9 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(18 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(108 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(89 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(225 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,512       71.73       71.73
               CKD 3 |        156        7.40       79.13
     CKD 4/5 pre-KRT |          9        0.43       79.55
            Dialysis |        108        5.12       84.68
   Kidney transplant |         89        4.22       88.90
KRT unclear modality |          9        0.43       89.33
            Deceased |        225       10.67      100.00
---------------------+-----------------------------------
               Total |      2,108      100.00

. 
. *eGFR cut-offs to investigate timing of access formation
. egen access_egfr = cut(baseline_egfr), at (0, 15, 5000)
(819 missing values generated)

. recode access_egfr 0=1 15=2
(access_egfr: 1289 changes made)

. replace access_egfr=0 if ckd_group==4
(82 real changes made)

. replace access_egfr=3 if access_egfr==.
(737 real changes made)

. label define access_egfr 0 "Dialysis" 1 "eGFR 0-14" 2 "eGFR >= 15" 3 "Unknown
> "

. label values access_egfr access_egfr

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions m4_hospital_days m5_hospital_day
> s m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hos
> pital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_d
> ays m3_hospital_days m4_critical_care_days m5_critical_care_days m6_critical_
> care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m
> 10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critic
> al_care_days m2_critical_care_days m3_critical_care_days m4_emergency_days m5
> _emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emer
> gency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emerge
> ncy_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_ap
> pts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appt
> s m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_app
> ts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m1
> 2_neph_appts m1_neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appt
> s m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m
> 12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_inte
> ractions m6_gp_interactions m7_gp_interactions m8_gp_interactions m9_gp_inter
> actions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_int
> eractions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |   Summary of total_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,293
  CKD stage |          65           0         388
  CKD stage |           5           0          14
   Dialysis |          17           0          82
  Transplan |         101           0         300
  KRT uncle |          14           0          31
------------+------------------------------------
      Total |    247.4407   141.70055       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ho~s |      2,108         561           0        561        561

            | Summary of total_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,293
  CKD stage |         128           0         388
  CKD stage |           6           0          14
   Dialysis |           7           0          82
  Transplan |          77           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   237.91698   120.27657       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_cr~s |      2,108         553           0        553        553

            |   Summary of total_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,293
  CKD stage |         119           0         388
  CKD stage |           3           0          14
   Dialysis |          27           0          82
  Transplan |          53           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   250.20825   138.03326       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_em~s |      2,108         567           0        567        567

            |      Summary of total_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,293
  CKD stage |          73           0         388
  CKD stage |           5           0          14
   Dialysis |          23           0          82
  Transplan |          69           0         300
  KRT uncle |          19           0          31
------------+------------------------------------
      Total |   256.32021   153.74487       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~s |      2,108         567           0        567        567

            |     Summary of total_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         266           0       1,293
  CKD stage |          84           0         388
  CKD stage |           2           0          14
   Dialysis |          23           0          82
  Transplan |          87           0         300
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   192.02657   94.486187       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ne~s |      2,108         470           0        470        470

            |      Summary of total_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,293
  CKD stage |         119           0         388
  CKD stage |           6           0          14
   Dialysis |          24           0          82
  Transplan |          33           0         300
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   210.43311   113.92509       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_tx~s |      2,108         485           0        485        485

            |  Summary of total_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,293
  CKD stage |         116           0         388
  CKD stage |           2           0          14
   Dialysis |          24           0          82
  Transplan |          75           0         300
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   243.49241   127.21341       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_gp~s |      2,108         569           0        569        569

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,293
  CKD stage |          99           0         388
  CKD stage |           3           0          14
   Dialysis |          16           0          82
  Transplan |          53           0         300
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   214.12998   117.48593       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,108         479           0        479        479

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,293
  CKD stage |         125           0         388
  CKD stage |          10           0          14
   Dialysis |          30           0          82
  Transplan |          57           0         300
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   235.45446    123.0651       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,108         558           0        558        558

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,293
  CKD stage |          64           0         388
  CKD stage |           2           0          14
   Dialysis |          20           0          82
  Transplan |          59           0         300
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   200.80503   116.65114       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,108         446           0        446        446

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,293
  CKD stage |         128           0         388
  CKD stage |           0           0          14
   Dialysis |          24           0          82
  Transplan |          79           0         300
  KRT uncle |           1           0          31
------------+------------------------------------
      Total |   238.77894   118.82694       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,108         563           0        563        563

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         367           0       1,293
  CKD stage |          92           0         388
  CKD stage |           0           0          14
   Dialysis |          23           0          82
  Transplan |          81           0         300
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |    254.5389   142.64425       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,108         568           0        568        568

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,293
  CKD stage |          71           0         388
  CKD stage |           7           0          14
   Dialysis |          19           0          82
  Transplan |          67           0         300
  KRT uncle |          20           0          31
------------+------------------------------------
      Total |   240.20541   142.58446       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,108         537           0        537        537

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,293
  CKD stage |          67           0         388
  CKD stage |           0           0          14
   Dialysis |          29           0          82
  Transplan |          84           0         300
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   230.96964   131.76141       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,108         520           0        520        520

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         415           0       1,293
  CKD stage |         133           0         388
  CKD stage |           4           0          14
   Dialysis |          37           0          82
  Transplan |          79           0         300
  KRT uncle |          21           0          31
------------+------------------------------------
      Total |   292.04934   156.72166       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,108         689           0        689        689

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,293
  CKD stage |         110           0         388
  CKD stage |           3           0          14
   Dialysis |          10           0          82
  Transplan |          62           0         300
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   238.68501   130.91995       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,108         529           0        529        529

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,293
  CKD stage |          95           0         388
  CKD stage |           6           0          14
   Dialysis |          22           0          82
  Transplan |          72           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   260.48482    149.0571       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,108         573           0        573        573

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         392           0       1,293
  CKD stage |         114           0         388
  CKD stage |           8           0          14
   Dialysis |          13           0          82
  Transplan |          52           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   269.48909   156.28777       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,108         586           0        586        586

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,293
  CKD stage |         118           0         388
  CKD stage |          10           0          14
   Dialysis |           9           0          82
  Transplan |          61           0         300
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   238.89896   128.54103       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,108         547           0        547        547

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,293
  CKD stage |          92           0         388
  CKD stage |           8           0          14
   Dialysis |          23           0          82
  Transplan |          65           0         300
  KRT uncle |          15           0          31
------------+------------------------------------
      Total |   208.91224    110.8453       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,108         499           0        499        499

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,293
  CKD stage |          88           0         388
  CKD stage |           2           0          14
   Dialysis |          18           0          82
  Transplan |          74           0         300
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   228.14896   125.54636       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,108         518           0        518        518

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,293
  CKD stage |          62           0         388
  CKD stage |           1           0          14
   Dialysis |          24           0          82
  Transplan |          81           0         300
  KRT uncle |          21           0          31
------------+------------------------------------
      Total |   205.13472   113.90892       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,108         484           0        484        484

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,293
  CKD stage |          96           0         388
  CKD stage |           3           0          14
   Dialysis |          22           0          82
  Transplan |          48           0         300
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   251.27609    148.2633       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,108         549           0        549        549

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,293
  CKD stage |          93           0         388
  CKD stage |           0           0          14
   Dialysis |          25           0          82
  Transplan |          55           0         300
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   221.08918   123.29509       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,108         499           0        499        499

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,293
  CKD stage |          72           0         388
  CKD stage |           4           0          14
   Dialysis |          21           0          82
  Transplan |          69           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   224.49004   129.80394       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,108         493           0        493        493

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,293
  CKD stage |          94           0         388
  CKD stage |           2           0          14
   Dialysis |          13           0          82
  Transplan |          85           0         300
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   203.54744    101.7815       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         480           0        480        480

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,293
  CKD stage |          83           0         388
  CKD stage |           5           0          14
   Dialysis |          28           0          82
  Transplan |          50           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   219.28558   126.46939       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         492           0        492        492

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         408           0       1,293
  CKD stage |         108           0         388
  CKD stage |           0           0          14
   Dialysis |          26           0          82
  Transplan |          65           0         300
  KRT uncle |          24           0          31
------------+------------------------------------
      Total |   280.75142   161.49066       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         631           0        631        631

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,293
  CKD stage |         102           0         388
  CKD stage |           6           0          14
   Dialysis |          32           0          82
  Transplan |          64           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   222.48387   117.93473       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         526           0        526        526

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,293
  CKD stage |         107           0         388
  CKD stage |           3           0          14
   Dialysis |          22           0          82
  Transplan |          52           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   266.67742   155.63835       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,108         580           0        580        580

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,293
  CKD stage |          75           0         388
  CKD stage |           8           0          14
   Dialysis |          24           0          82
  Transplan |          69           0         300
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   207.54459   114.62576       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,108         484           0        484        484

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,293
  CKD stage |         111           0         388
  CKD stage |           0           0          14
   Dialysis |          27           0          82
  Transplan |          81           0         300
  KRT uncle |          19           0          31
------------+------------------------------------
      Total |   210.55408   100.68221       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,108         527           0        527        527

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,293
  CKD stage |          81           0         388
  CKD stage |          -1           0          14
   Dialysis |          39           0          82
  Transplan |          78           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   200.59535   103.33524       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,108         486           0        486        486

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,293
  CKD stage |          96           0         388
  CKD stage |           0           0          14
   Dialysis |          16           0          82
  Transplan |          46           0         300
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   208.96964   116.40638       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,108         466           0        466        466

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,293
  CKD stage |          97           0         388
  CKD stage |          -2           0          14
   Dialysis |           8           0          82
  Transplan |          79           0         300
  KRT uncle |          19           0          31
------------+------------------------------------
      Total |   252.33017   140.68002       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,108         564           0        564        564

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,293
  CKD stage |         125           0         388
  CKD stage |           6           0          14
   Dialysis |          26           0          82
  Transplan |          77           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   243.01091   123.24519       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,108         577           0        577        577

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,293
  CKD stage |          88           0         388
  CKD stage |           9           0          14
   Dialysis |          31           0          82
  Transplan |          60           0         300
  KRT uncle |          17           0          31
------------+------------------------------------
      Total |   215.78558    118.2751       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,108         514           0        514        514

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,293
  CKD stage |         140           0         388
  CKD stage |           3           0          14
   Dialysis |          19           0          82
  Transplan |          53           0         300
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   220.66935   109.63252       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         528           0        528        528

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,293
  CKD stage |          62           0         388
  CKD stage |           3           0          14
   Dialysis |          11           0          82
  Transplan |          55           0         300
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   232.57306   144.63338       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         481           0        481        481

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,293
  CKD stage |          87           0         388
  CKD stage |           4           0          14
   Dialysis |           9           0          82
  Transplan |          65           0         300
  KRT uncle |          15           0          31
------------+------------------------------------
      Total |    217.8482   121.00455       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         493           0        493        493

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,293
  CKD stage |         103           0         388
  CKD stage |           5           0          14
   Dialysis |          25           0          82
  Transplan |         102           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   229.59298   113.04151       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         557           0        557        557

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,293
  CKD stage |         100           0         388
  CKD stage |          10           0          14
   Dialysis |          29           0          82
  Transplan |          54           0         300
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   228.56167   126.67398       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,108         527           0        527        527

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,293
  CKD stage |          85           0         388
  CKD stage |           0           0          14
   Dialysis |          10           0          82
  Transplan |          70           0         300
  KRT uncle |          16           0          31
------------+------------------------------------
      Total |   240.91366   138.35925       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,108         531           0        531        531

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,293
  CKD stage |          78           0         388
  CKD stage |           5           0          14
   Dialysis |          18           0          82
  Transplan |          65           0         300
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   213.40797   119.94442       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,108         484           0        484        484

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,293
  CKD stage |         104           0         388
  CKD stage |           8           0          14
   Dialysis |          27           0          82
  Transplan |          79           0         300
  KRT uncle |          15           0          31
------------+------------------------------------
      Total |   235.96395   123.51584       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,108         566           0        566        566

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,293
  CKD stage |          90           0         388
  CKD stage |           3           0          14
   Dialysis |          27           0          82
  Transplan |          75           0         300
  KRT uncle |          12           0          31
------------+------------------------------------
      Total |   218.01945   115.59288       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,108         516           0        516        516

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,293
  CKD stage |          77           0         388
  CKD stage |           0           0          14
   Dialysis |          22           0          82
  Transplan |         128           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |    244.3055   127.86429       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,108         575           0        575        575

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,293
  CKD stage |         107           0         388
  CKD stage |          10           0          14
   Dialysis |           6           0          82
  Transplan |          94           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   235.78653   120.72829       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,108         547           0        547        547

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,293
  CKD stage |         120           0         388
  CKD stage |           3           0          14
   Dialysis |          20           0          82
  Transplan |          77           0         300
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   246.77372   128.36332       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,108         573           0        573        573

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,293
  CKD stage |          64           0         388
  CKD stage |           1           0          14
   Dialysis |          16           0          82
  Transplan |          64           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   230.67884   139.52587       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,108         486           0        486        486

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,293
  CKD stage |         130           0         388
  CKD stage |           0           0          14
   Dialysis |          29           0          82
  Transplan |          37           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   254.87666   143.35848       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,108         566           0        566        566

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         334           0       1,293
  CKD stage |          70           0         388
  CKD stage |           6           0          14
   Dialysis |          21           0          82
  Transplan |          90           0         300
  KRT uncle |           2           0          31
------------+------------------------------------
      Total |   231.44687   130.14775       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,108         523           0        523        523

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,293
  CKD stage |         118           0         388
  CKD stage |           6           0          14
   Dialysis |          25           0          82
  Transplan |          76           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   208.97343   99.579449       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         511           0        511        511

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         406           0       1,293
  CKD stage |         116           0         388
  CKD stage |           0           0          14
   Dialysis |          14           0          82
  Transplan |          70           0         300
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   280.93311    159.3021       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,108         609           0        609        609

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,293
  CKD stage |          89           0         388
  CKD stage |           7           0          14
   Dialysis |          23           0          82
  Transplan |          54           0         300
  KRT uncle |          18           0          31
------------+------------------------------------
      Total |   250.99526   148.24459       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,108         559           0        559        559

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,293
  CKD stage |          93           0         388
  CKD stage |           0           0          14
   Dialysis |          19           0          82
  Transplan |          79           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   206.46869   105.36009       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4.. |      2,108         487           0        487        487

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,293
  CKD stage |         103           0         388
  CKD stage |           0           0          14
   Dialysis |          24           0          82
  Transplan |          75           0         300
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   250.81214   137.58899       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,108         564           0        564        564

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,293
  CKD stage |         109           0         388
  CKD stage |          19           0          14
   Dialysis |           8           0          82
  Transplan |          82           0         300
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   225.53083   114.69344       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,108         543           0        543        543

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,293
  CKD stage |          70           0         388
  CKD stage |           2           0          14
   Dialysis |          37           0          82
  Transplan |          95           0         300
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   225.48197   122.48654       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,108         534           0        534        534

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,293
  CKD stage |         111           0         388
  CKD stage |           0           0          14
   Dialysis |          11           0          82
  Transplan |          85           0         300
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   266.15655   145.06581       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,108         595           0        595        595

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,293
  CKD stage |         100           0         388
  CKD stage |           3           0          14
   Dialysis |          15           0          82
  Transplan |         118           0         300
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |   217.55361   101.24467       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,108         545           0        545        545

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         407           0       1,293
  CKD stage |         117           0         388
  CKD stage |           0           0          14
   Dialysis |          19           0          82
  Transplan |          73           0         300
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   282.44023   158.54989       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         625           0        625        625

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         389           0       1,293
  CKD stage |          93           0         388
  CKD stage |           3           0          14
   Dialysis |          19           0          82
  Transplan |          94           0         300
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   269.90228   151.14292       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         601           0        601        601

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,293
  CKD stage |          77           0         388
  CKD stage |           4           0          14
   Dialysis |          21           0          82
  Transplan |          74           0         300
  KRT uncle |          16           0          31
------------+------------------------------------
      Total |   236.78463   135.71318       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         536           0        536        536

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,293
  CKD stage |         107           0         388
  CKD stage |           0           0          14
   Dialysis |          18           0          82
  Transplan |          55           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   257.07068   147.69658       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         557           0        557        557

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,293
  CKD stage |         133           0         388
  CKD stage |          17           0          14
   Dialysis |          28           0          82
  Transplan |          43           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |    254.5166   140.02284       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,108         588           0        588        588

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,293
  CKD stage |          81           0         388
  CKD stage |           4           0          14
   Dialysis |          19           0          82
  Transplan |         107           0         300
  KRT uncle |           5           0          31
------------+------------------------------------
      Total |   221.12287   113.61291       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,108         526           0        526        526

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,293
  CKD stage |          80           0         388
  CKD stage |           0           0          14
   Dialysis |          10           0          82
  Transplan |          89           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   237.65797   132.58961       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~4_tx_appts |      2,108         528           0        528        528

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,293
  CKD stage |          97           0         388
  CKD stage |           8           0          14
   Dialysis |          30           0          82
  Transplan |          74           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   248.63994   137.50755       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,108         570           0        570        570

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,293
  CKD stage |          78           0         388
  CKD stage |           8           0          14
   Dialysis |          32           0          82
  Transplan |          81           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   218.04554   117.82935       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,108         517           0        517        517

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,293
  CKD stage |          84           0         388
  CKD stage |           0           0          14
   Dialysis |          25           0          82
  Transplan |         105           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   265.07353   147.23071       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,108         595           0        595        595

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,293
  CKD stage |          88           0         388
  CKD stage |           2           0          14
   Dialysis |          26           0          82
  Transplan |          81           0         300
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   229.36812   123.97968       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,108         527           0        527        527

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,293
  CKD stage |          94           0         388
  CKD stage |           2           0          14
   Dialysis |          30           0          82
  Transplan |          67           0         300
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   217.63899   116.21687       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,108         508           0        508        508

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         400           0       1,293
  CKD stage |          70           0         388
  CKD stage |           0           0          14
   Dialysis |          19           0          82
  Transplan |          69           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   268.79412   165.82125       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,108         558           0        558        558

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,293
  CKD stage |         126           0         388
  CKD stage |           0           0          14
   Dialysis |          16           0          82
  Transplan |          62           0         300
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   250.43074   134.43671       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,108         562           0        562        562

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,293
  CKD stage |         102           0         388
  CKD stage |           3           0          14
   Dialysis |          36           0          82
  Transplan |          91           0         300
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   237.53226   121.43885       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,108         574           0        574        574

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,293
  CKD stage |         116           0         388
  CKD stage |           0           0          14
   Dialysis |          15           0          82
  Transplan |          78           0         300
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |    253.9834   135.45252       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         578           0        578        578

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,293
  CKD stage |         105           0         388
  CKD stage |          19           0          14
   Dialysis |          11           0          82
  Transplan |          64           0         300
  KRT uncle |           8           0          31
------------+------------------------------------
      Total |   237.04127   130.11407       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,108         546           0        546        546

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,293
  CKD stage |          61           0         388
  CKD stage |           0           0          14
   Dialysis |          24           0          82
  Transplan |          76           0         300
  KRT uncle |          14           0          31
------------+------------------------------------
      Total |   237.86528   141.77656       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,108         525           0        525        525

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,293
  CKD stage |          55           0         388
  CKD stage |           4           0          14
   Dialysis |          35           0          82
  Transplan |          60           0         300
  KRT uncle |           3           0          31
------------+------------------------------------
      Total |   233.54981   144.44332       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,108         505           0        505        505

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,293
  CKD stage |         105           0         388
  CKD stage |           0           0          14
   Dialysis |          19           0          82
  Transplan |         105           0         300
  KRT uncle |          13           0          31
------------+------------------------------------
      Total |    254.7889   131.60008       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,108         600           0        600        600

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         376           0       1,293
  CKD stage |          88           0         388
  CKD stage |           6           0          14
   Dialysis |          28           0          82
  Transplan |          69           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   257.83491   149.60798       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,108         571           0        571        571

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,293
  CKD stage |          87           0         388
  CKD stage |           7           0          14
   Dialysis |          19           0          82
  Transplan |          70           0         300
  KRT uncle |           6           0          31
------------+------------------------------------
      Total |   242.14469   138.01854       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,108         540           0        540        540

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,293
  CKD stage |          86           0         388
  CKD stage |           7           0          14
   Dialysis |          30           0          82
  Transplan |          71           0         300
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   221.10674   120.34685       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,108         519           0        519        519

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,293
  CKD stage |          95           0         388
  CKD stage |           0           0          14
   Dialysis |          17           0          82
  Transplan |          64           0         300
  KRT uncle |           7           0          31
------------+------------------------------------
      Total |   250.01423   143.46719       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,108         546           0        546        546

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         251           0       1,293
  CKD stage |          61           0         388
  CKD stage |           0           0          14
   Dialysis |          26           0          82
  Transplan |          93           0         300
  KRT uncle |          21           0          31
------------+------------------------------------
      Total |   179.74099   91.044309       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         452           0        452        452

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,293
  CKD stage |         116           0         388
  CKD stage |           0           0          14
   Dialysis |          27           0          82
  Transplan |          84           0         300
  KRT uncle |           9           0          31
------------+------------------------------------
      Total |   249.78368   129.20995       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         587           0        587        587

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,293
  CKD stage |         129           0         388
  CKD stage |          15           0          14
   Dialysis |          30           0          82
  Transplan |          82           0         300
  KRT uncle |           4           0          31
------------+------------------------------------
      Total |   215.23197   98.376001       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         551           0        551        551

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,293
  CKD stage |          93           0         388
  CKD stage |           0           0          14
   Dialysis |          29           0          82
  Transplan |          74           0         300
  KRT uncle |          10           0          31
------------+------------------------------------
      Total |   214.77751   112.23022       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,108         509           0        509        509

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,293
  CKD stage |          81           0         388
  CKD stage |           1           0          14
   Dialysis |          13           0          82
  Transplan |          54           0         300
  KRT uncle |          26           0          31
------------+------------------------------------
      Total |   245.53131   147.45603       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,108         537           0        537        537

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,293
  CKD stage |         111           0         388
  CKD stage |          -2           0          14
   Dialysis |          21           0          82
  Transplan |          72           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |   260.27087   143.63226       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,108         575           0        575        575

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(82 real changes made)

. replace ethnicity=2 if ethnicity==3
(72 real changes made)

. replace ethnicity=3 if ethnicity==4
(88 real changes made)

. replace ethnicity=4 if ethnicity==6
(82 real changes made)

. replace ethnicity=6 if ethnicity==.
(507 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,906 missing values generated)

. replace region = 2 if region_string=="East"
(207 real changes made)

. replace region = 3 if region_string=="London"
(412 real changes made)

. replace region = 4 if region_string=="North East"
(198 real changes made)

. replace region = 5 if region_string=="North West"
(221 real changes made)

. replace region = 6 if region_string=="South East"
(216 real changes made)

. replace region = 7 if region_string=="South West"
(229 real changes made)

. replace region = 8 if region_string=="West Midlands"
(201 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(222 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,108 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(847 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,261 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. * Create variable for total # of each aggregated outcome
. * `var'_`aggregate' = total # of each aggregated outcome overall stratified b
> y ethnicity/imd/region/urban
. * `var'_`aggregate'_ckd = total # of each aggregated outcome in each CKD grou
> p stratified by ethnicity/imd/region/urban
. foreach aggregate of varlist hospital_days critical_care_days emergency_days 
> op_appts neph_appts tx_appts gp_interactions {
  2. foreach var of varlist ethnicity imd region urban {
  3. bysort `var': egen `var'_`aggregate' = total(`aggregate')
  4. bysort `var' ckd_group: egen `var'_`aggregate'_ckd = total(`aggregate')
  5. }
  6. }

. 
. *Merge cost data
. save "./output/`dataset'_ckd_complete.dta", replace
(note: file ./output/2022_ckd_complete.dta not found)
file ./output/2022_ckd_complete.dta saved

. capture noisily import delimited ./output/costs_`dataset'.csv, clear
(7 vars, 500 obs)

. keep patient_id apcs_cost ec_cost opa_cost

. merge 1:1 patient_id using ./output/`dataset'_ckd_complete
(note: variable patient_id was int, now long to accommodate using data's
       values)

    Result                           # of obs.
    -----------------------------------------
    not matched                         2,608
        from master                       500  (_merge==1)
        from using                      2,108  (_merge==2)

    matched                                 0  (_merge==3)
    -----------------------------------------

. drop if _merge==1
(500 observations deleted)

. foreach cost of varlist apcs_cost ec_cost opa_cost {
  2. sum `cost', d
  3. bysort ckd_group: egen total_`cost' = total(`cost')
  4. egen overall_`cost' = total(`cost')
  5. tab ckd_group, sum(total_`cost')
  6. sum overall_`cost'
  7. foreach var of varlist ethnicity imd region urban {
  8. bysort `var': egen `var'_`cost' = total(`cost')
  9. bysort `var' ckd_group: egen `var'_`cost'_ckd = total(`cost')
 10. }
 11. }

                          apcs_cost
-------------------------------------------------------------
no observations

            |     Summary of total_apcs_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,293
  CKD stage |           0           0         388
  CKD stage |           0           0          14
   Dialysis |           0           0          82
  Transplan |           0           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |           0           0       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ap~t |      2,108           0           0          0          0

                           ec_cost
-------------------------------------------------------------
no observations

            |      Summary of total_ec_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,293
  CKD stage |           0           0         388
  CKD stage |           0           0          14
   Dialysis |           0           0          82
  Transplan |           0           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |           0           0       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_ec~t |      2,108           0           0          0          0

                          opa_cost
-------------------------------------------------------------
no observations

            |      Summary of total_opa_cost
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |           0           0       1,293
  CKD stage |           0           0         388
  CKD stage |           0           0          14
   Dialysis |           0           0          82
  Transplan |           0           0         300
  KRT uncle |           0           0          31
------------+------------------------------------
      Total |           0           0       2,108

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_op~t |      2,108           0           0          0          0

. save "./output/`dataset'_ckd_complete.dta", replace
file ./output/2022_ckd_complete.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd_complete.log
  log type:  text
 closed on:  12 Sep 2023, 14:39:19
-------------------------------------------------------------------------------
