-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd.log
  log type:  text
 opened on:  12 Jan 2023, 18:25:36

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(17 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,706 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,966 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,746 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,327        9.91        9.91
           East Midlands |      3,283        9.78       19.68
                  London |      6,614       19.70       39.38
              North East |      3,459       10.30       49.68
              North West |      3,410       10.15       59.83
              South East |      3,328        9.91       69.74
              South West |      3,459       10.30       80.04
           West Midlands |      3,361       10.01       90.05
Yorkshire and The Humber |      3,341        9.95      100.00
-------------------------+-----------------------------------
                   Total |     33,582      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,701        5.07        5.07
          1 |      6,411       19.09       24.16
          2 |      6,414       19.10       43.26
          3 |      6,316       18.81       62.06
          4 |      6,316       18.81       80.87
          5 |      6,424       19.13      100.00
------------+-----------------------------------
      Total |     33,582      100.00

. drop if imd==0
(1,701 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,933 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(767 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(785 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,934 real changes made, 13,934 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,934 missing values generated)

. gen min_baseline_creatinine=.
(31,881 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,096 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,851 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,096 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,851 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,246 real changes made)

. gen max_baseline_creatinine=.
(31,881 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,096 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,851 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,947 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,635 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,934 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,947 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,096 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,719 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,881
25%            0              0       Sum of Wgt.      31,881

50%            0                      Mean             12.495
                        Largest       Std. Dev.      12.99001
75%     24.96369       43.08352
90%     29.16741       43.21716       Variance       168.7403
95%     31.41544        43.8582       Skewness       .2147261
99%      35.3198       45.41449       Kurtosis       1.303735

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,531        5.34        5.34
         <= |      1,557        5.43       10.77
          = |     20,828       72.64       83.41
          > |      1,560        5.44       88.85
         >= |      1,590        5.55       94.40
          ~ |      1,607        5.60      100.00
------------+-----------------------------------
      Total |     28,673      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,500       54.89       54.89
          1 |     14,381       45.11      100.00
------------+-----------------------------------
      Total |     31,881      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,781       46.36       46.36
          1 |     17,100       53.64      100.00
------------+-----------------------------------
      Total |     31,881      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,277       94.97       94.97
          1 |      1,604        5.03      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(714 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,294       95.02       95.02
          1 |      1,587        4.98      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(697 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,288       95.00       95.00
          1 |      1,593        5.00      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(643 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,313       95.08       95.08
          1 |      1,568        4.92      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(606 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,278       94.97       94.97
          1 |      1,603        5.03      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(615 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,283       94.99       94.99
          1 |      1,598        5.01      100.00
------------+-----------------------------------
      Total |     31,881      100.00
(594 real changes made)

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,912       34.23       34.23
          1 |     20,969       65.77      100.00
------------+-----------------------------------
      Total |     31,881      100.00

. drop if ckd==0
(10,912 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2022_ckd.csv not found)
file ./output/2022_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2022_ckd.log
  log type:  text
 closed on:  12 Jan 2023, 18:25:38
-------------------------------------------------------------------------------
