-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2023_ckd_complete_v2.log
  log type:  text
 opened on:  19 Apr 2023, 12:48:36

. clear

. 
. *Merge `dataset'_ckd_v2 with `dataset'_ckd_complete_v2
. capture noisily import delimited ./output/`dataset'_ckd_v2.csv, clear
(8 vars, 20,994 obs)

. tempfile `dataset'_ckd_v2

. save ``dataset'_ckd'_v2, replace
(note: file _v2.dta not found)
file _v2.dta saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete_v2.csv
> , clear
(210 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'_v2

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,936
        from master                    47,971  (_merge==1)
        from using                     18,965  (_merge==2)

    matched                             2,029  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,936 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v2

. save ``dataset'_ckd_complete'_v2, replace
file _v2.dta saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd_v2.csv, clear
> tempfile 2017_ckd_v2
> save 2017_ckd_v2, replace
> capture noisily import delimited ./output/input_2017_ckd_complete_v2.csv, cle
> ar
> merge 1:1 patient_id using 2017_ckd_v2
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v2
> save 2017_ckd_complete_v2, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    ///
>                                                 kidney_transplant_baseline_da
> te {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        164        8.08        8.08
Kidney transplant |        187        9.22       17.30
 Modality unclear |         45        2.22       19.52
          Pre KRT |      1,633       80.48      100.00
------------------+-----------------------------------
            Total |      2,029      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(784 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1245 changes made)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(164 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(187 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(45 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(637 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,230       60.62       60.62
  CKD stage 3 |        389       19.17       79.79
CKD stage 4/5 |         14        0.69       80.48
     Dialysis |        164        8.08       88.57
   Transplant |        187        9.22       97.78
  KRT unclear |         45        2.22      100.00
--------------+-----------------------------------
        Total |      2,029      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,230 |     1,230 
  CKD stage 3 |         0          0          0        389 |       389 
CKD stage 4/5 |         0          0          0         14 |        14 
     Dialysis |       164          0          0          0 |       164 
   Transplant |         0        187          0          0 |       187 
  KRT unclear |         0          0         45          0 |        45 
--------------+--------------------------------------------+----------
        Total |       164        187         45      1,633 |     2,029 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |              modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
--------------+--------------------------------------------+----------
  Albuminuria |       126         53         44         14 |     1,230 
  CKD stage 3 |        43         21         15          5 |       389 
CKD stage 4/5 |         1          1          0          0 |        14 
     Dialysis |         6          5          8          1 |       164 
   Transplant |        18         10          6          2 |       187 
  KRT unclear |         5          3          1          2 |        45 
--------------+--------------------------------------------+----------
        Total |       199         93         74         24 |     2,029 


              | modality_o
              |   utcome
    CKD group | Unchanged |     Total
--------------+-----------+----------
  Albuminuria |       993 |     1,230 
  CKD stage 3 |       305 |       389 
CKD stage 4/5 |        12 |        14 
     Dialysis |       144 |       164 
   Transplant |       151 |       187 
  KRT unclear |        34 |        45 
--------------+-----------+----------
        Total |     1,639 |     2,029 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,071 missing values generated)

. replace sex = 0 if male == "Female"
(1,071 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(889 real changes made, 889 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(889 missing values generated)

. gen min_creatinine_outcome=.
(2,029 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(599 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(541 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(599 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(541 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(739 real changes made)

. gen max_creatinine_outcome=.
(2,029 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(599 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(541 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,140 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,290 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(889 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,140 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(599 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(889 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1140 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(171 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(10 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(93 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(74 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(24 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(199 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,504       74.13       74.13
               CKD 3 |        123        6.06       80.19
     CKD 4/5 pre-KRT |         12        0.59       80.78
            Dialysis |         93        4.58       85.36
   Kidney transplant |         74        3.65       89.01
KRT unclear modality |         24        1.18       90.19
            Deceased |        199        9.81      100.00
---------------------+-----------------------------------
               Total |      2,029      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,230
  CKD stage |          96           0         389
  CKD stage |           4           0          14
   Dialysis |          61           0         164
  Transplan |          45           0         187
  KRT uncle |          10           0          45
------------+------------------------------------
      Total |   226.56925   127.08045       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,029         544           0        544        544

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         285           0       1,230
  CKD stage |          81           0         389
  CKD stage |           9           0          14
   Dialysis |          42           0         164
  Transplan |          44           0         187
  KRT uncle |          13           0          45
------------+------------------------------------
      Total |   196.09956   111.23694       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,029         474           0        474        474

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,230
  CKD stage |         128           0         389
  CKD stage |           0           0          14
   Dialysis |          24           0         164
  Transplan |          48           0         187
  KRT uncle |          11           0          45
------------+------------------------------------
      Total |   225.13504    121.6558       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,029         531           0        531        531

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,230
  CKD stage |         120           0         389
  CKD stage |           3           0          14
   Dialysis |          38           0         164
  Transplan |          57           0         187
  KRT uncle |          17           0          45
------------+------------------------------------
      Total |   206.92361   104.89376       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,029         524           0        524        524

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,230
  CKD stage |         142           0         389
  CKD stage |          10           0          14
   Dialysis |          43           0         164
  Transplan |          44           0         187
  KRT uncle |           9           0          45
------------+------------------------------------
      Total |   223.55495   113.39737       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,029         559           0        559        559

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,230
  CKD stage |          90           0         389
  CKD stage |           0           0          14
   Dialysis |          52           0         164
  Transplan |          44           0         187
  KRT uncle |           8           0          45
------------+------------------------------------
      Total |   237.86397    140.1516       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,029         544           0        544        544

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         383           0       1,230
  CKD stage |          87           0         389
  CKD stage |           5           0          14
   Dialysis |          65           0         164
  Transplan |          57           0         187
  KRT uncle |           7           0          45
------------+------------------------------------
      Total |   259.55495   153.81985       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,029         604           0        604        604

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,230
  CKD stage |          88           0         389
  CKD stage |           7           0          14
   Dialysis |          39           0         164
  Transplan |          61           0         187
  KRT uncle |          11           0          45
------------+------------------------------------
      Total |   235.68655   137.79631       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,029         552           0        552        552

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         280           0       1,230
  CKD stage |          94           0         389
  CKD stage |           0           0          14
   Dialysis |          29           0         164
  Transplan |          77           0         187
  KRT uncle |           5           0          45
------------+------------------------------------
      Total |   197.31198   104.44725       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,029         485           0        485        485

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,230
  CKD stage |          78           0         389
  CKD stage |           8           0          14
   Dialysis |          32           0         164
  Transplan |          42           0         187
  KRT uncle |          10           0          45
------------+------------------------------------
      Total |   219.31296   133.23127       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,029         496           0        496        496

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         282           0       1,230
  CKD stage |         105           0         389
  CKD stage |          11           0          14
   Dialysis |          50           0         164
  Transplan |          45           0         187
  KRT uncle |          13           0          45
------------+------------------------------------
      Total |    199.6348   104.24271       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,029         506           0        506        506

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         404           0       1,230
  CKD stage |          94           0         389
  CKD stage |           2           0          14
   Dialysis |          26           0         164
  Transplan |          40           0         187
  KRT uncle |          17           0          45
------------+------------------------------------
      Total |   269.10941   168.64128       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,029         583           0        583        583

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,230
  CKD stage |          71           0         389
  CKD stage |           4           0          14
   Dialysis |          38           0         164
  Transplan |          53           0         187
  KRT uncle |           4           0          45
------------+------------------------------------
      Total |   204.75998   121.29264       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,029         472           0        472        472

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,230
  CKD stage |         110           0         389
  CKD stage |           7           0          14
   Dialysis |          62           0         164
  Transplan |          64           0         187
  KRT uncle |          16           0          45
------------+------------------------------------
      Total |   202.74717   98.890769       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,029         540           0        540        540

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,230
  CKD stage |         101           0         389
  CKD stage |           3           0          14
   Dialysis |          23           0         164
  Transplan |          62           0         187
  KRT uncle |          12           0          45
------------+------------------------------------
      Total |   204.23706   111.07302       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,029         493           0        493        493

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         279           0       1,230
  CKD stage |          90           0         389
  CKD stage |          22           0          14
   Dialysis |          57           0         164
  Transplan |          54           0         187
  KRT uncle |          26           0          45
------------+------------------------------------
      Total |   196.69985   102.98062       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,029         528           0        528        528

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,230
  CKD stage |          94           0         389
  CKD stage |           7           0          14
   Dialysis |          38           0         164
  Transplan |          51           0         187
  KRT uncle |          14           0          45
------------+------------------------------------
      Total |    203.1656   111.68227       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,029         496           0        496        496

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         266           0       1,230
  CKD stage |          74           0         389
  CKD stage |           0           0          14
   Dialysis |          32           0         164
  Transplan |          40           0         187
  KRT uncle |           6           0          45
------------+------------------------------------
      Total |   181.84524   105.41187       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,029         418           0        418        418

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,230
  CKD stage |         128           0         389
  CKD stage |           0           0          14
   Dialysis |          26           0         164
  Transplan |          60           0         187
  KRT uncle |          11           0          45
------------+------------------------------------
      Total |   241.55791   131.69175       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         570           0        570        570

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,230
  CKD stage |          77           0         389
  CKD stage |           5           0          14
   Dialysis |          44           0         164
  Transplan |          67           0         187
  KRT uncle |          22           0          45
------------+------------------------------------
      Total |   217.79103   124.87974       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         533           0        533        533

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,230
  CKD stage |         103           0         389
  CKD stage |           5           0          14
   Dialysis |          36           0         164
  Transplan |          50           0         187
  KRT uncle |          13           0          45
------------+------------------------------------
      Total |   245.82356   143.24365       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         567           0        567        567

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,230
  CKD stage |          94           0         389
  CKD stage |           4           0          14
   Dialysis |          63           0         164
  Transplan |          84           0         187
  KRT uncle |          15           0          45
------------+------------------------------------
      Total |    240.3583   130.61656       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         605           0        605        605

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,230
  CKD stage |          94           0         389
  CKD stage |           1           0          14
   Dialysis |          22           0         164
  Transplan |          61           0         187
  KRT uncle |           5           0          45
------------+------------------------------------
      Total |   221.34549   127.81301       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,029         506           0        506        506

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,230
  CKD stage |          98           0         389
  CKD stage |          12           0          14
   Dialysis |          29           0         164
  Transplan |          54           0         187
  KRT uncle |          16           0          45
------------+------------------------------------
      Total |   252.66338   150.66009       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,029         582           0        582        582

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,230
  CKD stage |         105           0         389
  CKD stage |           9           0          14
   Dialysis |          44           0         164
  Transplan |          32           0         187
  KRT uncle |           6           0          45
------------+------------------------------------
      Total |   192.93297   103.24665       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,029         470           0        470        470

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,230
  CKD stage |          94           0         389
  CKD stage |           0           0          14
   Dialysis |          38           0         164
  Transplan |          38           0         187
  KRT uncle |           7           0          45
------------+------------------------------------
      Total |   216.91917   125.76257       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,029         494           0        494        494

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,230
  CKD stage |          95           0         389
  CKD stage |           2           0          14
   Dialysis |          48           0         164
  Transplan |          43           0         187
  KRT uncle |           5           0          45
------------+------------------------------------
      Total |   243.20404   143.67935       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,029         551           0        551        551

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,230
  CKD stage |          85           0         389
  CKD stage |           3           0          14
   Dialysis |          60           0         164
  Transplan |          38           0         187
  KRT uncle |          11           0          45
------------+------------------------------------
      Total |   206.16954   116.22625       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,029         496           0        496        496

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,230
  CKD stage |          96           0         389
  CKD stage |           0           0          14
   Dialysis |          59           0         164
  Transplan |          65           0         187
  KRT uncle |           8           0          45
------------+------------------------------------
      Total |   250.60867   142.85215       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,029         593           0        593        593

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         270           0       1,230
  CKD stage |          78           0         389
  CKD stage |           0           0          14
   Dialysis |          37           0         164
  Transplan |          21           0         187
  KRT uncle |          12           0          45
------------+------------------------------------
      Total |   183.82307   108.29812       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,029         418           0        418        418

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,230
  CKD stage |         141           0         389
  CKD stage |           2           0          14
   Dialysis |          42           0         164
  Transplan |          39           0         187
  KRT uncle |           8           0          45
------------+------------------------------------
      Total |   223.95663   115.47978       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         545           0        545        545

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         267           0       1,230
  CKD stage |         103           0         389
  CKD stage |           5           0          14
   Dialysis |          45           0         164
  Transplan |          47           0         187
  KRT uncle |           7           0          45
------------+------------------------------------
      Total |   189.76392   98.045787       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         474           0        474        474

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         269           0       1,230
  CKD stage |          93           0         389
  CKD stage |           2           0          14
   Dialysis |          25           0         164
  Transplan |          65           0         187
  KRT uncle |           2           0          45
------------+------------------------------------
      Total |   188.96994   101.28964       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         456           0        456        456

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,230
  CKD stage |         106           0         389
  CKD stage |           0           0          14
   Dialysis |          28           0         164
  Transplan |          51           0         187
  KRT uncle |           5           0          45
------------+------------------------------------
      Total |   218.95909   122.70226       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         506           0        506        506

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,230
  CKD stage |         109           0         389
  CKD stage |           6           0          14
   Dialysis |          30           0         164
  Transplan |          39           0         187
  KRT uncle |          18           0          45
------------+------------------------------------
      Total |   215.28241   120.06479       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,029         512           0        512        512

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,230
  CKD stage |         104           0         389
  CKD stage |           3           0          14
   Dialysis |          43           0         164
  Transplan |          41           0         187
  KRT uncle |          10           0          45
------------+------------------------------------
      Total |   206.26762   112.23012       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,029         496           0        496        496

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,230
  CKD stage |         114           0         389
  CKD stage |           0           0          14
   Dialysis |          25           0         164
  Transplan |          73           0         187
  KRT uncle |          20           0          45
------------+------------------------------------
      Total |   205.63677    105.0836       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,029         520           0        520        520

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         290           0       1,230
  CKD stage |          98           0         389
  CKD stage |          13           0          14
   Dialysis |          30           0         164
  Transplan |          49           0         187
  KRT uncle |          18           0          45
------------+------------------------------------
      Total |   202.01922   110.99651       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,029         498           0        498        498

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,230
  CKD stage |          87           0         389
  CKD stage |           7           0          14
   Dialysis |          38           0         164
  Transplan |          45           0         187
  KRT uncle |           9           0          45
------------+------------------------------------
      Total |   209.64662   120.72764       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,029         492           0        492        492

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,230
  CKD stage |         116           0         389
  CKD stage |          15           0          14
   Dialysis |          25           0         164
  Transplan |          55           0         187
  KRT uncle |           3           0          45
------------+------------------------------------
      Total |   227.12371   125.53489       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,029         540           0        540        540

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,230
  CKD stage |         105           0         389
  CKD stage |           3           0          14
   Dialysis |          27           0         164
  Transplan |          35           0         187
  KRT uncle |          18           0          45
------------+------------------------------------
      Total |   192.06013   104.51265       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,029         462           0        462        462

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         274           0       1,230
  CKD stage |         100           0         389
  CKD stage |           2           0          14
   Dialysis |          32           0         164
  Transplan |          31           0         187
  KRT uncle |           5           0          45
------------+------------------------------------
      Total |   190.84179   105.76323       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,029         444           0        444        444

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         235           0       1,230
  CKD stage |          91           0         389
  CKD stage |           0           0          14
   Dialysis |          28           0         164
  Transplan |          57           0         187
  KRT uncle |          13           0          45
------------+------------------------------------
      Total |   167.71069   85.491874       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,029         424           0        424        424

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,230
  CKD stage |         111           0         389
  CKD stage |           0           0          14
   Dialysis |          44           0         164
  Transplan |          58           0         187
  KRT uncle |           7           0          45
------------+------------------------------------
      Total |   203.71414   104.50488       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,029         506           0        506        506

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,230
  CKD stage |         100           0         389
  CKD stage |          13           0          14
   Dialysis |          27           0         164
  Transplan |          28           0         187
  KRT uncle |          20           0          45
------------+------------------------------------
      Total |   221.48645   130.54309       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,029         513           0        513        513

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         384           0       1,230
  CKD stage |          61           0         389
  CKD stage |           1           0          14
   Dialysis |          45           0         164
  Transplan |          25           0         187
  KRT uncle |           5           0          45
------------+------------------------------------
      Total |   250.53869   166.03758       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         521           0        521        521

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,230
  CKD stage |          84           0         389
  CKD stage |           7           0          14
   Dialysis |          46           0         164
  Transplan |          27           0         187
  KRT uncle |          12           0          45
------------+------------------------------------
      Total |   214.79399   127.99835       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,029         493           0        493        493

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         288           0       1,230
  CKD stage |         133           0         389
  CKD stage |          13           0          14
   Dialysis |          50           0         164
  Transplan |          50           0         187
  KRT uncle |          20           0          45
------------+------------------------------------
      Total |   209.27008   101.61915       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,029         554           0        554        554

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,230
  CKD stage |          83           0         389
  CKD stage |          11           0          14
   Dialysis |          32           0         164
  Transplan |          51           0         187
  KRT uncle |           6           0          45
------------+------------------------------------
      Total |   225.27649   134.63406       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,029         516           0        516        516

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,230
  CKD stage |         103           0         389
  CKD stage |           7           0          14
   Dialysis |          54           0         164
  Transplan |          48           0         187
  KRT uncle |          18           0          45
------------+------------------------------------
      Total |   233.88221   130.58671       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,029         568           0        568        568

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,230
  CKD stage |         106           0         389
  CKD stage |           7           0          14
   Dialysis |          56           0         164
  Transplan |          45           0         187
  KRT uncle |           5           0          45
------------+------------------------------------
      Total |    221.3238   120.56341       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,029         536           0        536        536

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,230
  CKD stage |         102           0         389
  CKD stage |           2           0          14
   Dialysis |          50           0         164
  Transplan |          42           0         187
  KRT uncle |          13           0          45
------------+------------------------------------
      Total |   212.66387    116.3465       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,029         514           0        514        514

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,230
  CKD stage |         114           0         389
  CKD stage |           2           0          14
   Dialysis |          44           0         164
  Transplan |          59           0         187
  KRT uncle |           8           0          45
------------+------------------------------------
      Total |   249.27698   139.30436       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,029         587           0        587        587

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,230
  CKD stage |          77           0         389
  CKD stage |           1           0          14
   Dialysis |          29           0         164
  Transplan |          51           0         187
  KRT uncle |           6           0          45
------------+------------------------------------
      Total |    218.3588   131.94969       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,029         488           0        488        488

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,230
  CKD stage |         101           0         389
  CKD stage |          10           0          14
   Dialysis |          31           0         164
  Transplan |          57           0         187
  KRT uncle |           4           0          45
------------+------------------------------------
      Total |   210.96205   116.15115       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         506           0        506        506

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         225           0       1,230
  CKD stage |         100           0         389
  CKD stage |           6           0          14
   Dialysis |          42           0         164
  Transplan |          49           0         187
  KRT uncle |          15           0          45
------------+------------------------------------
      Total |   163.85412   78.297726       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         437           0        437        437

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,230
  CKD stage |         127           0         389
  CKD stage |           8           0          14
   Dialysis |          59           0         164
  Transplan |          49           0         187
  KRT uncle |          30           0          45
------------+------------------------------------
      Total |   228.34105   116.43988       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         593           0        593        593

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,230
  CKD stage |          80           0         389
  CKD stage |           2           0          14
   Dialysis |          46           0         164
  Transplan |          37           0         187
  KRT uncle |           6           0          45
------------+------------------------------------
      Total |   212.96254   126.29225       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         485           0        485        485

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         342           0       1,230
  CKD stage |         110           0         389
  CKD stage |           0           0          14
   Dialysis |          24           0         164
  Transplan |          43           0         187
  KRT uncle |           2           0          45
------------+------------------------------------
      Total |   234.36028   136.11026       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,029         521           0        521        521

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,230
  CKD stage |         126           0         389
  CKD stage |           0           0          14
   Dialysis |          53           0         164
  Transplan |          34           0         187
  KRT uncle |           2           0          45
------------+------------------------------------
      Total |   234.69887   127.80387       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,029         550           0        550        550

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,230
  CKD stage |         124           0         389
  CKD stage |          10           0          14
   Dialysis |          35           0         164
  Transplan |         101           0         187
  KRT uncle |          10           0          45
------------+------------------------------------
      Total |   248.37506    128.7194       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,029         630           0        630        630

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,230
  CKD stage |         143           0         389
  CKD stage |           0           0          14
   Dialysis |          30           0         164
  Transplan |          33           0         187
  KRT uncle |           4           0          45
------------+------------------------------------
      Total |   214.83391   111.82755       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,029         510           0        510        510

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,230
  CKD stage |          90           0         389
  CKD stage |           5           0          14
   Dialysis |          25           0         164
  Transplan |          42           0         187
  KRT uncle |           7           0          45
------------+------------------------------------
      Total |   212.47363   125.06339       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,029         481           0        481        481

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,230
  CKD stage |          99           0         389
  CKD stage |          11           0          14
   Dialysis |          36           0         164
  Transplan |          57           0         187
  KRT uncle |           0           0          45
------------+------------------------------------
      Total |   211.50715   116.52894       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,029         507           0        507        507

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,230
  CKD stage |          92           0         389
  CKD stage |           3           0          14
   Dialysis |          34           0         164
  Transplan |          38           0         187
  KRT uncle |          34           0          45
------------+------------------------------------
      Total |   216.83194   125.63464       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,029         518           0        518        518

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         414           0       1,230
  CKD stage |         132           0         389
  CKD stage |           2           0          14
   Dialysis |          48           0         164
  Transplan |          31           0         187
  KRT uncle |           8           0          45
------------+------------------------------------
      Total |   283.20601   165.30747       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,029         635           0        635        635

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         381           0       1,230
  CKD stage |         118           0         389
  CKD stage |           3           0          14
   Dialysis |          39           0         164
  Transplan |          63           0         187
  KRT uncle |           8           0          45
------------+------------------------------------
      Total |   262.74569   148.77293       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,029         612           0        612        612

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         330           0       1,230
  CKD stage |          83           0         389
  CKD stage |           5           0          14
   Dialysis |          25           0         164
  Transplan |          53           0         187
  KRT uncle |          22           0          45
------------+------------------------------------
      Total |   223.38985   133.27815       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,029         518           0        518        518

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         318           0       1,230
  CKD stage |          98           0         389
  CKD stage |           0           0          14
   Dialysis |          14           0         164
  Transplan |          37           0         187
  KRT uncle |           8           0          45
------------+------------------------------------
      Total |   216.28241   128.51907       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,029         475           0        475        475

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,230
  CKD stage |          63           0         389
  CKD stage |           4           0          14
   Dialysis |          34           0         164
  Transplan |          49           0         187
  KRT uncle |          18           0          45
------------+------------------------------------
      Total |   216.78758   134.63269       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         493           0        493        493

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,230
  CKD stage |         123           0         389
  CKD stage |           6           0          14
   Dialysis |          27           0         164
  Transplan |          71           0         187
  KRT uncle |          20           0          45
------------+------------------------------------
      Total |   212.23066   107.28787       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,029         543           0        543        543

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         373           0       1,230
  CKD stage |          76           0         389
  CKD stage |           0           0          14
   Dialysis |          37           0         164
  Transplan |          12           0         187
  KRT uncle |           7           0          45
------------+------------------------------------
      Total |   244.93889   159.97289       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,029         505           0        505        505

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,230
  CKD stage |          89           0         389
  CKD stage |           3           0          14
   Dialysis |          14           0         164
  Transplan |          61           0         187
  KRT uncle |           9           0          45
------------+------------------------------------
      Total |   229.54214    137.3507       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,029         515           0        515        515

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,230
  CKD stage |         111           0         389
  CKD stage |           4           0          14
   Dialysis |          46           0         164
  Transplan |          45           0         187
  KRT uncle |          13           0          45
------------+------------------------------------
      Total |   225.87432   123.89333       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,029         543           0        543        543

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,230
  CKD stage |         104           0         389
  CKD stage |           6           0          14
   Dialysis |          24           0         164
  Transplan |          55           0         187
  KRT uncle |           4           0          45
------------+------------------------------------
      Total |   240.46378    140.3507       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,029         545           0        545        545

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,230
  CKD stage |         104           0         389
  CKD stage |          11           0          14
   Dialysis |          54           0         164
  Transplan |          55           0         187
  KRT uncle |           1           0          45
------------+------------------------------------
      Total |   224.06407   121.88554       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,029         546           0        546        546

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,230
  CKD stage |         129           0         389
  CKD stage |           0           0          14
   Dialysis |          39           0         164
  Transplan |          57           0         187
  KRT uncle |          11           0          45
------------+------------------------------------
      Total |   240.09906   128.32276       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,029         577           0        577        577

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,230
  CKD stage |          90           0         389
  CKD stage |           1           0          14
   Dialysis |          43           0         164
  Transplan |          46           0         187
  KRT uncle |          13           0          45
------------+------------------------------------
      Total |    204.7033   114.53328       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,029         489           0        489        489

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,230
  CKD stage |          92           0         389
  CKD stage |           7           0          14
   Dialysis |          41           0         164
  Transplan |          44           0         187
  KRT uncle |          10           0          45
------------+------------------------------------
      Total |    221.6895   128.21442       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         518           0        518        518

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,230
  CKD stage |         106           0         389
  CKD stage |           4           0          14
   Dialysis |          32           0         164
  Transplan |          40           0         187
  KRT uncle |           9           0          45
------------+------------------------------------
      Total |   206.26072   113.85473       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         487           0        487        487

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,230
  CKD stage |         123           0         389
  CKD stage |           8           0          14
   Dialysis |          57           0         164
  Transplan |          32           0         187
  KRT uncle |          12           0          45
------------+------------------------------------
      Total |   216.35338   113.36395       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         537           0        537        537

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         409           0       1,230
  CKD stage |         112           0         389
  CKD stage |          -1           0          14
   Dialysis |          43           0         164
  Transplan |          54           0         187
  KRT uncle |          11           0          45
------------+------------------------------------
      Total |   278.10202   164.02976       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,029         628           0        628        628

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         302           0       1,230
  CKD stage |         114           0         389
  CKD stage |           6           0          14
   Dialysis |          29           0         164
  Transplan |          42           0         187
  KRT uncle |           7           0          45
------------+------------------------------------
      Total |   211.34303   115.55501       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,029         500           0        500        500

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,230
  CKD stage |          68           0         389
  CKD stage |           1           0          14
   Dialysis |          34           0         164
  Transplan |          40           0         187
  KRT uncle |           1           0          45
------------+------------------------------------
      Total |   229.85559   145.93656       2,029

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,029         491           0        491        491

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(81 real changes made)

. replace ethnicity=2 if ethnicity==3
(69 real changes made)

. replace ethnicity=3 if ethnicity==4
(83 real changes made)

. replace ethnicity=4 if ethnicity==6
(81 real changes made)

. replace ethnicity=6 if ethnicity==.
(495 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,829 missing values generated)

. replace region = 2 if region_string=="East"
(193 real changes made)

. replace region = 3 if region_string=="London"
(423 real changes made)

. replace region = 4 if region_string=="North East"
(204 real changes made)

. replace region = 5 if region_string=="North West"
(177 real changes made)

. replace region = 6 if region_string=="South East"
(194 real changes made)

. replace region = 7 if region_string=="South West"
(210 real changes made)

. replace region = 8 if region_string=="West Midlands"
(201 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(227 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,029 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(809 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,220 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v2.dta", replace
(note: file ./output/2023_ckd_complete_v2.dta not found)
file ./output/2023_ckd_complete_v2.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2023_ckd_complete_v2.log
  log type:  text
 closed on:  19 Apr 2023, 12:48:42
-------------------------------------------------------------------------------
