-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2023_ckd.log
  log type:  text
 opened on:  21 Apr 2023, 07:57:39

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve) 
(18 vars, 50,000 obs)

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,652 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,972 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,743 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,262        9.70        9.70
           East Midlands |      3,400       10.11       19.81
                  London |      6,827       20.30       40.11
              North East |      3,301        9.81       49.92
              North West |      3,266        9.71       59.63
              South East |      3,287        9.77       69.41
              South West |      3,372       10.03       79.43
           West Midlands |      3,474       10.33       89.76
Yorkshire and The Humber |      3,444       10.24      100.00
-------------------------+-----------------------------------
                   Total |     33,633      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,676        4.98        4.98
          1 |      6,362       18.92       23.90
          2 |      6,422       19.09       42.99
          3 |      6,346       18.87       61.86
          4 |      6,548       19.47       81.33
          5 |      6,279       18.67      100.00
------------+-----------------------------------
      Total |     33,633      100.00

. drop if imd==0
(1,676 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,950 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(805 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(826 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(13,986 real changes made, 13,986 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(13,986 missing values generated)

. gen min_baseline_creatinine=.
(31,957 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,059 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,912 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,059 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,912 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,510 real changes made)

. gen max_baseline_creatinine=.
(31,957 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,059 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,912 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,971 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,447 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(13,986 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,971 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,059 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,695 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,957
25%            0              0       Sum of Wgt.      31,957

50%            0                      Mean           12.44583
                        Largest       Std. Dev.      12.95448
75%     24.96796       43.19224
90%     29.15554        43.4479       Variance       167.8187
95%      31.2595       43.60263       Skewness       .2156524
99%     35.18051       44.36634       Kurtosis       1.299304

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,625        5.67        5.67
         <= |      1,608        5.61       11.28
          = |     20,617       71.93       83.21
          > |      1,664        5.81       89.02
         >= |      1,607        5.61       94.63
          ~ |      1,540        5.37      100.00
------------+-----------------------------------
      Total |     28,661      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,638       55.19       55.19
   Albuminuria |     14,319       44.81      100.00
---------------+-----------------------------------
         Total |     31,957      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,943       46.76       46.76
          1 |     17,014       53.24      100.00
------------+-----------------------------------
      Total |     31,957      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(13986 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17971 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(13,986 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,390       95.10       95.10
          1 |      1,567        4.90      100.00
------------+-----------------------------------
      Total |     31,957      100.00
(1,567 real changes made)
(749 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,331       94.91       94.91
          1 |      1,626        5.09      100.00
------------+-----------------------------------
      Total |     31,957      100.00
(1,533 real changes made)
(716 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,320       94.88       94.88
          1 |      1,637        5.12      100.00
------------+-----------------------------------
      Total |     31,957      100.00
(1,462 real changes made)
(666 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,337       94.93       94.93
          1 |      1,620        5.07      100.00
------------+-----------------------------------
      Total |     31,957      100.00
(1,398 real changes made)
(667 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,378       95.06       95.06
          1 |      1,579        4.94      100.00
------------+-----------------------------------
      Total |     31,957      100.00
(1,298 real changes made)
(619 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,325       94.89       94.89
          1 |      1,632        5.11      100.00
------------+-----------------------------------
      Total |     31,957      100.00
(1,249 real changes made)
(563 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,669      4,602 |    10,271 
 eGFR >=60 |     5,294      4,240 |     9,534 
  eGFR <60 |     2,015      1,630 |     3,645 
       KRT |     4,660      3,847 |     8,507 
-----------+----------------------+----------
     Total |    17,638     14,319 |    31,957 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,963       34.31       34.31
          1 |     20,994       65.69      100.00
------------+-----------------------------------
      Total |     31,957      100.00

. drop if ckd==0
(10,963 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,602 |     4,602 
 eGFR >=60 |         0      4,240 |     4,240 
  eGFR <60 |     2,015      1,630 |     3,645 
       KRT |     4,660      3,847 |     8,507 
-----------+----------------------+----------
     Total |     6,675     14,319 |    20,994 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2023_ckd.csv not found)
file ./output/2023_ckd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2023_ckd.log
  log type:  text
 closed on:  21 Apr 2023, 07:57:42
-------------------------------------------------------------------------------
