-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2023_ckd.log
  log type:  text
 opened on:  20 Sep 2023, 14:55:08

. clear

. 
. import delimited ./output/input_`dataset'.csv, delimiter(comma) varnames(1) c
> ase(preserve)
(18 vars, 50,000 obs)

. save ./output/input_`dataset', replace
(note: file ./output/input_2023.dta not found)
file ./output/input_2023.dta saved

. 
. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,631 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,949 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,714 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,336        9.90        9.90
           East Midlands |      3,378       10.02       19.92
                  London |      6,678       19.81       39.73
              North East |      3,360        9.97       49.70
              North West |      3,455       10.25       59.95
              South East |      3,310        9.82       69.77
              South West |      3,349        9.94       79.71
           West Midlands |      3,303        9.80       89.51
Yorkshire and The Humber |      3,537       10.49      100.00
-------------------------+-----------------------------------
                   Total |     33,706      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,605        4.76        4.76
          1 |      6,542       19.41       24.17
          2 |      6,424       19.06       43.23
          3 |      6,292       18.67       61.90
          4 |      6,407       19.01       80.91
          5 |      6,436       19.09      100.00
------------+-----------------------------------
      Total |     33,706      100.00

. drop if imd==0
(1,605 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(16,065 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(820 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(799 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,110 real changes made, 14,110 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,110 missing values generated)

. gen min_baseline_creatinine=.
(32,101 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,116 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,875 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,116 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,875 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,392 real changes made)

. gen max_baseline_creatinine=.
(32,101 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,116 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,875 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,991 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,709 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,110 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,991 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,116 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,685 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              32,101
25%            0              0       Sum of Wgt.      32,101

50%     9.469906                      Mean           12.50794
                        Largest       Std. Dev.      12.99379
75%     24.95644       42.26842
90%     29.27088       42.47053       Variance       168.8386
95%     31.45131       43.63746       Skewness       .2150793
99%     35.33138       45.53928       Kurtosis       1.306313

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,629        5.63        5.63
         <= |      1,596        5.52       11.15
          = |     20,862       72.12       83.27
          > |      1,592        5.50       88.77
         >= |      1,653        5.71       94.48
          ~ |      1,596        5.52      100.00
------------+-----------------------------------
      Total |     28,928      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,655       55.00       55.00
   Albuminuria |     14,446       45.00      100.00
---------------+-----------------------------------
         Total |     32,101      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,970       46.63       46.63
          1 |     17,131       53.37      100.00
------------+-----------------------------------
      Total |     32,101      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14110 missing values generated)

. recode egfr_status 0=2 60=1
(egfr_status: 17991 changes made)

. replace egfr_status = 0 if baseline_egfr==.
(14,110 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10              
>                    ///
>                                                 dialysis_opcs_4              
>                    ///
>                                                 kidney_transplant_primary_car
> e  ///
>                                                 kidney_transplant_icd_10     
>            ///
>                                                 kidney_transplant_opcs_4     
>            {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,520       95.07       95.07
          1 |      1,581        4.93      100.00
------------+-----------------------------------
      Total |     32,101      100.00
(1,581 real changes made)
(738 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,498       95.01       95.01
          1 |      1,603        4.99      100.00
------------+-----------------------------------
      Total |     32,101      100.00
(1,530 real changes made)
(712 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,497       95.00       95.00
          1 |      1,604        5.00      100.00
------------+-----------------------------------
      Total |     32,101      100.00
(1,420 real changes made)
(620 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,488       94.98       94.98
          1 |      1,613        5.02      100.00
------------+-----------------------------------
      Total |     32,101      100.00
(1,374 real changes made)
(650 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,507       95.03       95.03
          1 |      1,594        4.97      100.00
------------+-----------------------------------
      Total |     32,101      100.00
(1,315 real changes made)
(600 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,478       94.94       94.94
          1 |      1,623        5.06      100.00
------------+-----------------------------------
      Total |     32,101      100.00
(1,241 real changes made)
(570 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,685      4,674 |    10,359 
 eGFR >=60 |     5,395      4,288 |     9,683 
  eGFR <60 |     1,947      1,651 |     3,598 
       KRT |     4,628      3,833 |     8,461 
-----------+----------------------+----------
     Total |    17,655     14,446 |    32,101 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     11,080       34.52       34.52
          1 |     21,021       65.48      100.00
------------+-----------------------------------
      Total |     32,101      100.00

. drop if ckd==0
(11,080 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,674 |     4,674 
 eGFR >=60 |         0      4,288 |     4,288 
  eGFR <60 |     1,947      1,651 |     3,598 
       KRT |     4,628      3,833 |     8,461 
-----------+----------------------+----------
     Total |     6,575     14,446 |    21,021 

. drop albuminuria

. drop egfr_status

. 
. export delimited using "./output/`dataset'_ckd.csv", replace
(note: file ./output/2023_ckd.csv not found)
file ./output/2023_ckd.csv saved

. 
. *Create dataset of non-CKD
. merge 1:1 patient_id using ./output/input_`dataset'

    Result                           # of obs.
    -----------------------------------------
    not matched                        28,979
        from master                         0  (_merge==1)
        from using                     28,979  (_merge==2)

    matched                            21,021  (_merge==3)
    -----------------------------------------

. keep if _merge==2
(21,021 observations deleted)

. 
. export delimited using "./output/`dataset'_nockd.csv", replace
(note: file ./output/2023_nockd.csv not found)
file ./output/2023_nockd.csv saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/logs/2023_ckd.log
  log type:  text
 closed on:  20 Sep 2023, 14:55:09
-------------------------------------------------------------------------------
