-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/2023_ckd_complete_v3.log
  log type:  text
 opened on:  21 Apr 2023, 07:59:23

. clear

. 
. *Merge `dataset'_ckd with `dataset'_ckd_complete
. capture noisily import delimited ./output/`dataset'_ckd.csv, clear
(8 vars, 20,994 obs)

. tempfile `dataset'_ckd

. save ``dataset'_ckd', replace
(note: file /tmp/St00014.000001 not found)
file /tmp/St00014.000001 saved

. capture noisily import delimited ./output/input_`dataset'_ckd_complete.csv, c
> lear
(220 vars, 50,000 obs)

. merge 1:1 patient_id using ``dataset'_ckd'

    Result                           # of obs.
    -----------------------------------------
    not matched                        66,646
        from master                    47,826  (_merge==1)
        from using                     18,820  (_merge==2)

    matched                             2,174  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,646 observations deleted)

. drop _merge

. tempfile `dataset'_ckd_complete_v3

. save ``dataset'_ckd_complete_v3', replace
(note: file /tmp/St00014.000002 not found)
file /tmp/St00014.000002 saved

. 
. /*Generate dummy data
> cd ckd-healthcare-use
> capture noisily import delimited ./output/2017_ckd.csv, clear
> tempfile 2017_ckd
> save 2017_ckd, replace
> capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
> merge 1:1 patient_id using 2017_ckd
> keep if _merge==3
> drop _merge
> tempfile 2017_ckd_complete_v3
> save 2017_ckd_complete_v3, replace
> */
. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10     
>            ///
>                                                 dialysis_baseline_opcs_4     
>            ///
>                                                 dialysis_baseline_date       
>            ///
>                                                 kt_baseline_primary_care     
>            ///
>                                                 kt_baseline_icd_10           
>                    ///
>                                                 kt_baseline_opcs_4           
>                    {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        209        9.61        9.61
Kidney transplant |        181        8.33       17.94
 Modality unclear |         38        1.75       19.69
          Pre KRT |      1,746       80.31      100.00
------------------+-----------------------------------
            Total |      2,174      100.00

. *To reduce misclassification of dialysis, anyone with eGFR >15 with modality_
> baseline=="Dialysis" will be reclassified as non-dialysis (e.g. they may have
>  received acute dialysis and recovered)
. *For modality_baseline="Modality unclear" (i.e. whose dialysis and kidney tra
> nsplant baseline dates are identical), those with eGFR <15 will be assumed to
>  be on dialysis and those >15 as kidney transplant
. egen esrd_egfr = cut(baseline_egfr), at (0, 15, 5000)
(848 missing values generated)

. recode esrd_egfr 0=1 15=0
(esrd_egfr: 1326 changes made)

. tab esrd_egfr, m

  esrd_egfr |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,326       60.99       60.99
          . |        848       39.01      100.00
------------+-----------------------------------
      Total |      2,174      100.00

. gen dialysis = 0

. replace dialysis = 1 if modality_baseline=="Dialysis"
(209 real changes made)

. replace dialysis = 1 if modality_baseline=="Modality unclear" & esrd_egfr!=.
(18 real changes made)

. replace dialysis = 0 if esrd_egfr==0
(139 real changes made)

. gen kidney_transplant = 0

. replace kidney_transplant = 1 if kidney_transplant_baseline_date!=""
(317 real changes made)

. replace kidney_transplant = 0 if dialysis==1
(10 real changes made)

. tab modality_baseline dialysis

                  |       dialysis
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       121         88 |       209 
Kidney transplant |       181          0 |       181 
 Modality unclear |        38          0 |        38 
          Pre KRT |     1,746          0 |     1,746 
------------------+----------------------+----------
            Total |     2,086         88 |     2,174 

. tab modality_baseline kidney_transplant

                  |   kidney_transplant
modality_baseline |         0          1 |     Total
------------------+----------------------+----------
         Dialysis |       186         23 |       209 
Kidney transplant |       153         28 |       181 
 Modality unclear |        33          5 |        38 
          Pre KRT |     1,495        251 |     1,746 
------------------+----------------------+----------
            Total |     1,867        307 |     2,174 

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(848 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(ckd_group: 1326 changes made)

. replace ckd_group = 4 if dialysis==1
(88 real changes made)

. replace ckd_group = 5 if kidney_transplant==1
(307 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(38 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement o
> r code for KRT
. replace ckd_group = 1 if ckd_group==.
(625 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "D
> ialysis" 5 "Transplant" 6 "KRT unclear modality"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

           CKD group |      Freq.     Percent        Cum.
---------------------+-----------------------------------
         Albuminuria |      1,309       60.21       60.21
         CKD stage 3 |        416       19.14       79.35
       CKD stage 4/5 |         21        0.97       80.31
            Dialysis |         88        4.05       84.36
          Transplant |        302       13.89       98.25
KRT unclear modality |         38        1.75      100.00
---------------------+-----------------------------------
               Total |      2,174      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

                     |              modality_baseline
           CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |        64        108          0      1,137 |     1,309 
         CKD stage 3 |        33         44          0        339 |       416 
       CKD stage 4/5 |         1          1          0         19 |        21 
            Dialysis |        88          0          0          0 |        88 
          Transplant |        23         28          0        251 |       302 
KRT unclear modality |         0          0         38          0 |        38 
---------------------+--------------------------------------------+----------
               Total |       209        181         38      1,746 |     2,174 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10      
>            ///
>                                                 dialysis_outcome_opcs_4      
>            ///
>                                                 dialysis_outcome_date        
>            ///
>                                                 kt_outcome_primary_care      
>            ///
>                                                 kt_outcome_icd_10            
>                    ///
>                                                 kt_outcome_opcs_4            
>                    ///
>                                                 kidney_transplant_outcome_dat
> e  ///
>                                                 died                         
>                            {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

                     |              modality_outcome
           CKD group |  Deceased   Dialysis  Kidney ..  Modalit.. |     Total
---------------------+--------------------------------------------+----------
         Albuminuria |       144         59         64         15 |     1,309 
         CKD stage 3 |        44         20         21          4 |       416 
       CKD stage 4/5 |         0          1          1          0 |        21 
            Dialysis |        10          5          2          1 |        88 
          Transplant |        24          9         13          2 |       302 
KRT unclear modality |         2          0          2          0 |        38 
---------------------+--------------------------------------------+----------
               Total |       224         94        103         22 |     2,174 


                     | modality_o
                     |   utcome
           CKD group | Unchanged |     Total
---------------------+-----------+----------
         Albuminuria |     1,027 |     1,309 
         CKD stage 3 |       327 |       416 
       CKD stage 4/5 |        19 |        21 
            Dialysis |        70 |        88 
          Transplant |       254 |       302 
KRT unclear modality |        34 |        38 
---------------------+-----------+----------
               Total |     1,731 |     2,174 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 mont
> hs by the end of year
. gen sex = 1 if male == "Male"
(1,120 missing values generated)

. replace sex = 0 if male == "Female"
(1,120 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(965 real changes made, 965 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(965 missing values generated)

. gen min_creatinine_outcome=.
(2,174 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(621 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(588 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(621 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(588 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(767 real changes made)

. gen max_creatinine_outcome=.
(2,174 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(621 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(588 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,209 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,407 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(965 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,209 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(621 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(965 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(egfr_end: 1209 changes made)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(170 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(6 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(6 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(965 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(esrd_egfr_end: 1209 changes made)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,209       55.61       55.61
          . |        965       44.39      100.00
------------+-----------------------------------
      Total |      2,174      100.00

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(94 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_e
> gfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant
> "
(103 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear"
>  & esrd_egfr_end==0
(14 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(22 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(94 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(117 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(224 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT"
>  3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,596       73.41       73.41
               CKD 3 |        129        5.93       79.35
     CKD 4/5 pre-KRT |          6        0.28       79.62
            Dialysis |         94        4.32       83.95
   Kidney transplant |        117        5.38       89.33
KRT unclear modality |          8        0.37       89.70
            Deceased |        224       10.30      100.00
---------------------+-----------------------------------
               Total |      2,174      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_da
> ys m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_h
> ospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_
> days m4_critical_care_days m5_critical_care_days m6_critical_care_days m7_cri
> tical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care
> _days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_
> critical_care_days m3_critical_care_days m4_emergency_days m5_emergency_days 
> m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_e
> mergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emer
> gency_days m3_emergency_days m4_op_appts m5_op_appts m6_op_appts m7_op_appts 
> m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2
> _op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts
>  m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1_
> neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7
> _tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_t
> x_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_i
> nteractions m7_gp_interactions m8_gp_interactions m9_gp_interactions m10_gp_i
> nteractions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_
> interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,309
  CKD stage |         125           0         416
  CKD stage |           5           0          21
   Dialysis |          32           0          88
  Transplan |          47           0         302
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   227.06946   122.45255       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,174         544           0        544        544

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,309
  CKD stage |         143           0         416
  CKD stage |           7           0          21
   Dialysis |          18           0          88
  Transplan |         100           0         302
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   225.78381   101.75658       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,174         578           0        578        578

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,309
  CKD stage |          89           0         416
  CKD stage |           3           0          21
   Dialysis |           6           0          88
  Transplan |          80           0         302
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   242.25391   140.03734       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,174         538           0        538        538

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,309
  CKD stage |         131           0         416
  CKD stage |           5           0          21
   Dialysis |          18           0          88
  Transplan |          69           0         302
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   236.12603   122.39305       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,174         567           0        567        567

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         337           0       1,309
  CKD stage |         140           0         416
  CKD stage |           2           0          21
   Dialysis |          13           0          88
  Transplan |          62           0         302
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   239.03542   124.67575       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,174         564           0        564        564

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         349           0       1,309
  CKD stage |          96           0         416
  CKD stage |           5           0          21
   Dialysis |          17           0          88
  Transplan |          91           0         302
  KRT uncle |          18           0          38
------------+------------------------------------
      Total |   242.20055   132.72819       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,174         576           0        576        576

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,309
  CKD stage |          66           0         416
  CKD stage |           5           0          21
   Dialysis |          21           0          88
  Transplan |          65           0         302
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |    251.5184   158.54194       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,174         546           0        546        546

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,309
  CKD stage |         106           0         416
  CKD stage |           7           0          21
   Dialysis |          32           0          88
  Transplan |          76           0         302
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   226.77461   119.97005       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,174         549           0        549        549

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,309
  CKD stage |         103           0         416
  CKD stage |           5           0          21
   Dialysis |          14           0          88
  Transplan |          99           0         302
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   238.79623   126.44385       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,174         561           0        561        561

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         414           0       1,309
  CKD stage |          88           0         416
  CKD stage |           0           0          21
   Dialysis |          20           0          88
  Transplan |          50           0         302
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   273.97516   173.19818       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,174         578           0        578        578

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,309
  CKD stage |          97           0         416
  CKD stage |           6           0          21
   Dialysis |          28           0          88
  Transplan |          97           0         302
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   227.10856     118.311       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,174         550           0        550        550

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,309
  CKD stage |         163           0         416
  CKD stage |           5           0          21
   Dialysis |          18           0          88
  Transplan |          87           0         302
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   276.02484   138.62906       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,174         667           0        667        667

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,309
  CKD stage |          94           0         416
  CKD stage |           1           0          21
   Dialysis |          23           0          88
  Transplan |          84           0         302
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |    228.1081   124.27489       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,174         531           0        531        531

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         299           0       1,309
  CKD stage |          81           0         416
  CKD stage |           1           0          21
   Dialysis |          12           0          88
  Transplan |          51           0         302
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   203.35695   118.77816       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,174         458           0        458        458

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,309
  CKD stage |         113           0         416
  CKD stage |           1           0          21
   Dialysis |          29           0          88
  Transplan |          66           0         302
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   220.62925   115.76808       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,174         533           0        533        533

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,309
  CKD stage |         109           0         416
  CKD stage |           6           0          21
   Dialysis |          46           0          88
  Transplan |          80           0         302
  KRT uncle |          31           0          38
------------+------------------------------------
      Total |   210.25023   101.99875       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,174         564           0        564        564

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,309
  CKD stage |          85           0         416
  CKD stage |           5           0          21
   Dialysis |          14           0          88
  Transplan |          84           0         302
  KRT uncle |          19           0          38
------------+------------------------------------
      Total |   231.19181   130.04534       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,174         543           0        543        543

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,309
  CKD stage |         125           0         416
  CKD stage |          11           0          21
   Dialysis |          26           0          88
  Transplan |          79           0         302
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   228.93882   114.61947       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,174         573           0        573        573

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         354           0       1,309
  CKD stage |         103           0         416
  CKD stage |           2           0          21
   Dialysis |          27           0          88
  Transplan |          81           0         302
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   245.31003   135.12071       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         572           0        572        572

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,309
  CKD stage |         105           0         416
  CKD stage |           2           0          21
   Dialysis |          33           0          88
  Transplan |          77           0         302
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   244.86523   134.37835       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         580           0        580        580

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,309
  CKD stage |         102           0         416
  CKD stage |           6           0          21
   Dialysis |          15           0          88
  Transplan |          50           0         302
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |   238.76863   139.75848       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         541           0        541        541

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,309
  CKD stage |          94           0         416
  CKD stage |           0           0          21
   Dialysis |          23           0          88
  Transplan |          81           0         302
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   223.60672   121.13814       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         528           0        528        528

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,309
  CKD stage |         114           0         416
  CKD stage |           6           0          21
   Dialysis |          21           0          88
  Transplan |         114           0         302
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   221.19181   103.30156       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,174         569           0        569        569

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,309
  CKD stage |         122           0         416
  CKD stage |           0           0          21
   Dialysis |          19           0          88
  Transplan |          53           0         302
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   246.65915   138.43054       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,174         564           0        564        564

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         361           0       1,309
  CKD stage |         117           0         416
  CKD stage |          10           0          21
   Dialysis |          18           0          88
  Transplan |          61           0         302
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   249.24333   139.66962       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,174         578           0        578        578

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         320           0       1,309
  CKD stage |         169           0         416
  CKD stage |           7           0          21
   Dialysis |          16           0          88
  Transplan |          91           0         302
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   238.37213   107.08443       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,174         603           0        603        603

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         369           0       1,309
  CKD stage |         127           0         416
  CKD stage |           5           0          21
   Dialysis |          35           0          88
  Transplan |          98           0         302
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   261.80589    133.8818       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,174         648           0        648        648

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,309
  CKD stage |          77           0         416
  CKD stage |           5           0          21
   Dialysis |          28           0          88
  Transplan |          41           0         302
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   231.40984   144.15839       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,174         514           0        514        514

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,309
  CKD stage |         140           0         416
  CKD stage |          12           0          21
   Dialysis |          20           0          88
  Transplan |          53           0         302
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   233.27829   122.15015       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,174         560           0        560        560

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,309
  CKD stage |          91           0         416
  CKD stage |           9           0          21
   Dialysis |          16           0          88
  Transplan |          69           0         302
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   208.57728    113.8048       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,174         497           0        497        497

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,309
  CKD stage |         115           0         416
  CKD stage |           0           0          21
   Dialysis |          30           0          88
  Transplan |          85           0         302
  KRT uncle |          18           0          38
------------+------------------------------------
      Total |   220.79393   109.32085       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         556           0        556        556

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,309
  CKD stage |         102           0         416
  CKD stage |           9           0          21
   Dialysis |          31           0          88
  Transplan |          72           0         302
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   242.94618   135.43236       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         574           0        574        574

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         343           0       1,309
  CKD stage |          53           0         416
  CKD stage |          18           0          21
   Dialysis |          16           0          88
  Transplan |          77           0         302
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   228.34269   141.71532       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         516           0        516        516

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,309
  CKD stage |          87           0         416
  CKD stage |           2           0          21
   Dialysis |          11           0          88
  Transplan |          73           0         302
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   242.41812   142.04887       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         542           0        542        542

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         351           0       1,309
  CKD stage |         111           0         416
  CKD stage |           6           0          21
   Dialysis |          34           0          88
  Transplan |          80           0         302
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   245.27001   131.63145       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,174         590           0        590        590

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         363           0       1,309
  CKD stage |         109           0         416
  CKD stage |           2           0          21
   Dialysis |          20           0          88
  Transplan |          77           0         302
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |    251.0207   139.46813       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,174         575           0        575        575

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         263           0       1,309
  CKD stage |          99           0         416
  CKD stage |           7           0          21
   Dialysis |          20           0          88
  Transplan |          73           0         302
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   188.33579    93.88207       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,174         463           0        463        463

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,309
  CKD stage |          81           0         416
  CKD stage |           1           0          21
   Dialysis |          13           0          88
  Transplan |          82           0         302
  KRT uncle |          19           0          38
------------+------------------------------------
      Total |   241.50966   140.59345       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,174         551           0        551        551

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         309           0       1,309
  CKD stage |         108           0         416
  CKD stage |           0           0          21
   Dialysis |          19           0          88
  Transplan |          83           0         302
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   219.15869   112.56363       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,174         527           0        527        527

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,309
  CKD stage |         100           0         416
  CKD stage |           4           0          21
   Dialysis |          20           0          88
  Transplan |          75           0         302
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   235.84591   130.81032       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,174         547           0        547        547

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,309
  CKD stage |          74           0         416
  CKD stage |           5           0          21
   Dialysis |          33           0          88
  Transplan |          92           0         302
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   246.36017   143.13626       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,174         570           0        570        570

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,309
  CKD stage |         119           0         416
  CKD stage |          16           0          21
   Dialysis |          22           0          88
  Transplan |          78           0         302
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   237.22447   123.64851       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,174         586           0        586        586

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,309
  CKD stage |         105           0         416
  CKD stage |           1           0          21
   Dialysis |          20           0          88
  Transplan |          49           0         302
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   235.50046   136.65475       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,174         523           0        523        523

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         375           0       1,309
  CKD stage |          93           0         416
  CKD stage |           5           0          21
   Dialysis |          41           0          88
  Transplan |          64           0         302
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |    254.4149   149.16797       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,174         591           0        591        591

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         336           0       1,309
  CKD stage |         129           0         416
  CKD stage |          12           0          21
   Dialysis |          35           0          88
  Transplan |         104           0         302
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   243.08004   116.76149       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,174         622           0        622        622

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,309
  CKD stage |         110           0         416
  CKD stage |          12           0          21
   Dialysis |           9           0          88
  Transplan |          97           0         302
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   236.81739   122.98231       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         569           0        569        569

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         331           0       1,309
  CKD stage |          97           0         416
  CKD stage |           4           0          21
   Dialysis |          18           0          88
  Transplan |          88           0         302
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   231.11546    124.3164       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,174         553           0        553        553

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         314           0       1,309
  CKD stage |          91           0         416
  CKD stage |          12           0          21
   Dialysis |          22           0          88
  Transplan |          62           0         302
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   216.35879   121.26563       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,174         516           0        516        516

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         293           0       1,309
  CKD stage |         110           0         416
  CKD stage |           8           0          21
   Dialysis |          15           0          88
  Transplan |          77           0         302
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   209.11178   105.45651       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,174         518           0        518        518

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,309
  CKD stage |         117           0         416
  CKD stage |           7           0          21
   Dialysis |          15           0          88
  Transplan |          96           0         302
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   240.65593   123.27949       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,174         582           0        582        582

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,309
  CKD stage |          87           0         416
  CKD stage |           7           0          21
   Dialysis |           9           0          88
  Transplan |          61           0         302
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   223.75437   130.70997       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,174         499           0        499        499

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         370           0       1,309
  CKD stage |          90           0         416
  CKD stage |           2           0          21
   Dialysis |          15           0          88
  Transplan |          83           0         302
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   252.31831   145.91927       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,174         569           0        569        569

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         406           0       1,309
  CKD stage |          79           0         416
  CKD stage |          20           0          21
   Dialysis |          38           0          88
  Transplan |          83           0         302
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   272.90708   164.31168       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,174         630           0        630        630

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,309
  CKD stage |         126           0         416
  CKD stage |           6           0          21
   Dialysis |           9           0          88
  Transplan |          47           0         302
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   218.35465   117.95495       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,174         501           0        501        501

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         365           0       1,309
  CKD stage |         160           0         416
  CKD stage |           8           0          21
   Dialysis |          26           0          88
  Transplan |          87           0         302
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   263.67387   129.14712       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         650           0        650        650

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,309
  CKD stage |          92           0         416
  CKD stage |          14           0          21
   Dialysis |          36           0          88
  Transplan |          80           0         302
  KRT uncle |           2           0          38
------------+------------------------------------
      Total |   211.58188   111.14935       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         525           0        525        525

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         352           0       1,309
  CKD stage |          91           0         416
  CKD stage |          15           0          21
   Dialysis |          27           0          88
  Transplan |          93           0         302
  KRT uncle |           5           0          38
------------+------------------------------------
      Total |   243.60212   134.49565       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         583           0        583        583

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,309
  CKD stage |          85           0         416
  CKD stage |           3           0          21
   Dialysis |          22           0          88
  Transplan |          96           0         302
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   235.36201    130.0015       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         553           0        553        553

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,309
  CKD stage |         129           0         416
  CKD stage |          13           0          21
   Dialysis |          14           0          88
  Transplan |          55           0         302
  KRT uncle |          29           0          38
------------+------------------------------------
      Total |   231.62006   123.13216       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,174         569           0        569        569

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         298           0       1,309
  CKD stage |         106           0         416
  CKD stage |           4           0          21
   Dialysis |          20           0          88
  Transplan |          76           0         302
  KRT uncle |           6           0          38
------------+------------------------------------
      Total |   211.22447    108.7628       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,174         510           0        510        510

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         345           0       1,309
  CKD stage |         107           0         416
  CKD stage |           5           0          21
   Dialysis |          23           0          88
  Transplan |          51           0         302
  KRT uncle |          23           0          38
------------+------------------------------------
      Total |   236.67065   135.07499       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,174         554           0        554        554

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         322           0       1,309
  CKD stage |         109           0         416
  CKD stage |           0           0          21
   Dialysis |          22           0          88
  Transplan |          71           0         302
  KRT uncle |           9           0          38
------------+------------------------------------
      Total |   225.64949   120.47199       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,174         533           0        533        533

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         317           0       1,309
  CKD stage |          91           0         416
  CKD stage |           6           0          21
   Dialysis |          16           0          88
  Transplan |          98           0         302
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   222.74287   117.59487       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,174         536           0        536        536

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         360           0       1,309
  CKD stage |         116           0         416
  CKD stage |           5           0          21
   Dialysis |          32           0          88
  Transplan |          80           0         302
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |    251.4678   135.32305       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,174         596           0        596        596

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         433           0       1,309
  CKD stage |          89           0         416
  CKD stage |           8           0          21
   Dialysis |           7           0          88
  Transplan |          88           0         302
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   290.40156   176.53814       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,174         629           0        629        629

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         328           0       1,309
  CKD stage |         102           0         416
  CKD stage |          17           0          21
   Dialysis |          21           0          88
  Transplan |          69           0         302
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   227.68123   124.97841       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,174         541           0        541        541

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,309
  CKD stage |         138           0         416
  CKD stage |           2           0          21
   Dialysis |          36           0          88
  Transplan |          78           0         302
  KRT uncle |           7           0          38
------------+------------------------------------
      Total |   267.04278   140.45777       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,174         640           0        640        640

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,309
  CKD stage |         103           0         416
  CKD stage |           3           0          21
   Dialysis |          17           0          88
  Transplan |          73           0         302
  KRT uncle |          10           0          38
------------+------------------------------------
      Total |   235.46136   130.20834       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,174         546           0        546        546

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         319           0       1,309
  CKD stage |         100           0         416
  CKD stage |           5           0          21
   Dialysis |          19           0          88
  Transplan |          86           0         302
  KRT uncle |          13           0          38
------------+------------------------------------
      Total |   224.20147   118.19808       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,174         542           0        542        542

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,309
  CKD stage |          90           0         416
  CKD stage |           0           0          21
   Dialysis |          27           0          88
  Transplan |          74           0         302
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   211.88224   114.45815       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         509           0        509        509

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,309
  CKD stage |         109           0         416
  CKD stage |           3           0          21
   Dialysis |          20           0          88
  Transplan |          95           0         302
  KRT uncle |           3           0          38
------------+------------------------------------
      Total |   212.56946   103.73962       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,174         525           0        525        525

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,309
  CKD stage |          83           0         416
  CKD stage |           4           0          21
   Dialysis |          30           0          88
  Transplan |         104           0         302
  KRT uncle |           1           0          38
------------+------------------------------------
      Total |   207.41766   105.73171       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,174         514           0        514        514

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,309
  CKD stage |         111           0         416
  CKD stage |           3           0          21
   Dialysis |          17           0          88
  Transplan |          77           0         302
  KRT uncle |           8           0          38
------------+------------------------------------
      Total |   211.01978   106.88815       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,174         512           0        512        512

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         362           0       1,309
  CKD stage |         122           0         416
  CKD stage |           5           0          21
   Dialysis |          23           0          88
  Transplan |          82           0         302
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   253.89098    135.1213       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,174         606           0        606        606

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         262           0       1,309
  CKD stage |         113           0         416
  CKD stage |          10           0          21
   Dialysis |           7           0          88
  Transplan |          64           0         302
  KRT uncle |          17           0          38
------------+------------------------------------
      Total |    188.9448   93.036878       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,174         473           0        473        473

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,309
  CKD stage |         113           0         416
  CKD stage |          11           0          21
   Dialysis |          26           0          88
  Transplan |          63           0         302
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   246.55842   137.76897       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,174         574           0        574        574

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,309
  CKD stage |         124           0         416
  CKD stage |           4           0          21
   Dialysis |          33           0          88
  Transplan |          63           0         302
  KRT uncle |          26           0          38
------------+------------------------------------
      Total |   245.04876   131.40733       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,174         600           0        600        600

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         291           0       1,309
  CKD stage |          91           0         416
  CKD stage |           2           0          21
   Dialysis |          13           0          88
  Transplan |          87           0         302
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |    205.5046    106.8046       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,174         498           0        498        498

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         388           0       1,309
  CKD stage |         131           0         416
  CKD stage |           4           0          21
   Dialysis |          42           0          88
  Transplan |          79           0         302
  KRT uncle |          15           0          38
------------+------------------------------------
      Total |   271.66329   145.18934       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         659           0        659        659

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,309
  CKD stage |          93           0         416
  CKD stage |          13           0          21
   Dialysis |          27           0          88
  Transplan |          88           0         302
  KRT uncle |          12           0          38
------------+------------------------------------
      Total |   212.68537   109.94187       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         534           0        534        534

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,309
  CKD stage |         106           0         416
  CKD stage |           0           0          21
   Dialysis |          19           0          88
  Transplan |          70           0         302
  KRT uncle |           4           0          38
------------+------------------------------------
      Total |   235.56578   130.25658       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         539           0        539        539

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,309
  CKD stage |          83           0         416
  CKD stage |           0           0          21
   Dialysis |          18           0          88
  Transplan |          76           0         302
  KRT uncle |           0           0          38
------------+------------------------------------
      Total |   258.98298   155.95302       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,174         562           0        562        562

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         280           0       1,309
  CKD stage |         128           0         416
  CKD stage |           3           0          21
   Dialysis |          13           0          88
  Transplan |          62           0         302
  KRT uncle |          14           0          38
------------+------------------------------------
      Total |   202.49816   99.420256       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,174         500           0        500        500

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. Dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,309
  CKD stage |         131           0         416
  CKD stage |           4           0          21
   Dialysis |          22           0          88
  Transplan |          90           0         302
  KRT uncle |          11           0          38
------------+------------------------------------
      Total |   242.20607   120.67275       2,174

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,174         596           0        596        596

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, whit
> e & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South As
> ian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(81 real changes made)

. replace ethnicity=2 if ethnicity==3
(77 real changes made)

. replace ethnicity=3 if ethnicity==4
(66 real changes made)

. replace ethnicity=4 if ethnicity==6
(81 real changes made)

. replace ethnicity=6 if ethnicity==.
(523 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"              
>            ///                                             
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,952 missing values generated)

. replace region = 2 if region_string=="East"
(207 real changes made)

. replace region = 3 if region_string=="London"
(473 real changes made)

. replace region = 4 if region_string=="North East"
(224 real changes made)

. replace region = 5 if region_string=="North West"
(195 real changes made)

. replace region = 6 if region_string=="South East"
(207 real changes made)

. replace region = 7 if region_string=="South West"
(217 real changes made)

. replace region = 8 if region_string=="West Midlands"
(217 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(212 real changes made)

. label define region     1 "East Midlands"                                    
>    ///
>                                                 2 "East"                     
>                                    ///
>                                                 3 "London"                   
>                                    ///
>                                                 4 "North East"               
>                            ///
>                                                 5 "North West"               
>                            ///
>                                                 6 "South East"               
>                            ///
>                                                 7 "South West"               
>                            ///
>                                                 8 "West Midlands"            
>                            ///
>                                                 9 "Yorkshire and The Humber" 
>            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                         
>                    ///
>                                                  2 "Urban minor conurbation" 
>                                            ///
>                                                  3 "Urban city and town"     
>                                                    ///
>                                                  4 "Urban city and town in a 
> sparse setting"            ///
>                                                  5 "Rural town and fringe"   
>                                                    ///
>                                                  6 "Rural town and fringe in 
> a sparse setting"          ///
>                                                  7 "Rural village and dispers
> ed"                                        ///
>                                                  8 "Rural village and dispers
> ed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,174 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(854 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,320 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
. 
. 
. save "./output/`dataset'_ckd_complete_v3.dta", replace
(note: file ./output/2023_ckd_complete_v3.dta not found)
file ./output/2023_ckd_complete_v3.dta saved

. log close
      name:  <unnamed>
       log:  /workspace/logs/2023_ckd_complete_v3.log
  log type:  text
 closed on:  21 Apr 2023, 07:59:26
-------------------------------------------------------------------------------
