-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/_nockd_complete.log
  log type:  text
 opened on:  22 Sep 2023, 11:20:23

. clear

. 
. *Merge `dataset'_nockd with `dataset'_nockd_complete
. capture noisily import delimited ./output/`dataset'_nockd.csv, clear
file ./output/_nockd.csv not found

. tempfile `dataset'_nockd

. save ``dataset'_nockd', replace
no variables defined
r(111);

end of do-file

r(111);

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD6f1c_000000.tmp"

. capture noisily import delimited ./output/2017_nockd.csv, clear
(encoding automatically selected: ISO-8859-1)
(17 vars, 10,901 obs)

. tempfile 2017_nockd

. save ./output/2017_nockd, replace
file ./output/2017_nockd.dta saved

. capture noisily import delimited ./output/input_2017_nockd_complete.csv, clear
(encoding automatically selected: ISO-8859-1)
(24 vars, 50,000 obs)

. merge 1:1 patient_id using ./output/2017_nockd

    Result                      Number of obs
    -----------------------------------------
    Not matched                        58,727
        from master                    48,913  (_merge==1)
        from using                      9,814  (_merge==2)

    Matched                             1,087  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(58,727 observations deleted)

. drop _merge

. tempfile 2017_nockd_complete

. save ./output/2017_nockd_complete, replace
file ./output/2017_nockd_complete.dta saved

. */
. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10                 ///
>                                                 dialysis_outcome_opcs_4                 ///
>                                                 dialysis_outcome_date                   ///
>                                                 kt_outcome_primary_care                 ///
>                                                 kt_outcome_icd_10                               ///
>                                                 kt_outcome_opcs_4                               ///
>                                                 kidney_transplant_outcome_date  ///
>                                                 died                                                    {
  2.         drop `var'
  3.         }

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 months by the end of year
. gen sex = 1 if male == "Male"
(487 missing values generated)

. replace sex = 0 if male == "Female"
(487 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(477 real changes made, 477 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(477 missing values generated)

. gen min_creatinine_outcome=.
(1,087 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(270 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(340 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(270 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(340 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(376 real changes made)

. gen max_creatinine_outcome=.
(1,087 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(270 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(340 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(610 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(711 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(477 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(610 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(270 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(477 missing values generated)

. recode egfr_end 0=3 30=2 60=1
(610 changes made to egfr_end)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2
(124 real changes made)

. replace ckd_progression = 2 if egfr_end==3
(7 real changes made)

. egen esrd_egfr_end = cut(egfr_outcome), at (0, 15, 5000)
(477 missing values generated)

. recode esrd_egfr_end 0=1 15=0
(610 changes made to esrd_egfr_end)

. tab esrd_egfr_end, m

esrd_egfr_e |
         nd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        610       56.12       56.12
          . |        477       43.88      100.00
------------+-----------------------------------
      Total |      1,087      100.00

. replace modality_outcome = "Unchanged" if modality_outcome_date==.
(150 real changes made)

. gen dialysis_outcome = 0

. replace dialysis_outcome = 1 if modality_outcome=="Dialysis"
(12 real changes made)

. replace dialysis_outcome = 1 if modality_outcome=="Modality unclear" & esrd_egfr_end==1
(0 real changes made)

. gen kidney_transplant_outcome = 0

. replace kidney_transplant_outcome = 1 if modality_outcome=="Kidney transplant"
(20 real changes made)

. replace kidney_transplant_outcome = 1 if modality_outcome=="Modality unclear" & esrd_egfr_end==0
(2 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear" & modality_outcome_date!=.
(2 real changes made)

. replace ckd_progression = 3 if dialysis_outcome==1
(12 real changes made)

. replace ckd_progression = 4 if kidney_transplant_outcome==1
(22 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(22 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT" 3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |        905       83.26       83.26
               CKD 3 |        119       10.95       94.20
     CKD 4/5 pre-KRT |          7        0.64       94.85
            Dialysis |         12        1.10       95.95
   Kidney transplant |         22        2.02       97.98
            Deceased |         22        2.02      100.00
---------------------+-----------------------------------
               Total |      1,087      100.00

. gen ckd_group = 0

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(49 real changes made)

. replace ethnicity=2 if ethnicity==3
(35 real changes made)

. replace ethnicity=3 if ethnicity==4
(41 real changes made)

. replace ethnicity=4 if ethnicity==6
(49 real changes made)

. replace ethnicity=6 if ethnicity==.
(267 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(983 missing values generated)

. replace region = 2 if region_string=="East"
(109 real changes made)

. replace region = 3 if region_string=="London"
(227 real changes made)

. replace region = 4 if region_string=="North East"
(108 real changes made)

. replace region = 5 if region_string=="North West"
(104 real changes made)

. replace region = 6 if region_string=="South East"
(122 real changes made)

. replace region = 7 if region_string=="South West"
(98 real changes made)

. replace region = 8 if region_string=="West Midlands"
(114 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(101 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(1,087 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(414 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(673 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
end of do-file

