------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/age_albuminuria.log
  log type:  text
 opened on:  18 Nov 2023, 22:24:58

. 
. cap file close tablecontent

. file open tablecontent using ./output/age_albuminuria.csv, write text replace

. 
. file write tablecontent ("stratum") _tab ("start_status") _tab ("median_2017") _tab ("median_2018") _tab ("median_2019") _tab ("median_2020") _tab ("median_2021") _tab ("median_2022") _tab ("mode_2017") _tab ("mode_2018") _tab ("mode_2019") _tab ("mo
> de_2020") _tab ("mode_2021") _tab ("mode_2022") _n

. 
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete.dta, clear
  3. drop _merge
  4. merge 1:1 patient_id using ./output/`x'_nockd_complete, force
  5. drop if ckd_progression!=1
  6. 
. qui su age, d
  7. local `x'_q2 = r(p50)
  8. local `x'_q1 = r(p25)
  9. local `x'_q3 = r(p75)
 10. egen mode_age = mode(age), minmode
 11. qui su mode_age
 12. local `x'_mode = r(mean)
 13. drop mode_age
 14. 
. bysort ckd_group: egen mode_age = mode(age), minmode
 15. 
. qui su age if ckd_group==0, d
 16. local `x'_q2_0 = r(p50)
 17. local `x'_q1_0 = r(p25)
 18. local `x'_q3_0 = r(p75)
 19. qui su mode_age if ckd_group==0
 20. local `x'_mode_0 = r(mean)
 21. } 
(note: variable region was str24 in the using data, but will be float now)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,210
        from master                     2,123  (_merge==1)
        from using                      1,087  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,076 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,988 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,133 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,078 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,146 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,004 observations deleted)

. 
. 
. 
. file write tablecontent ("All") _tab ("No CKD") _tab (`2017_q2_0') (" (") (`2017_q1_0') ("-") (`2017_q3_0') (")") _tab (`2018_q2_0') (" (") (`2018_q1_0') ("-") (`2018_q3_0') (")") _tab (`2019_q2_0') (" (") (`2019_q1_0') ("-") (`2019_q3_0') (")") _tab
>  (`2020_q2_0') (" (") (`2020_q1_0') ("-") (`2020_q3_0') (")") _tab (`2021_q2_0') (" (") (`2021_q1_0') ("-") (`2021_q3_0') (")") _tab (`2022_q2_0') (" (") (`2022_q1_0') ("-") (`2022_q3_0') (")") _tab (`2017_mode_0') _tab (`2018_mode_0') _tab (`2019_mo
> de_0') _tab (`2020_mode_0') _tab (`2021_mode_0') _tab (`2022_mode_0') _n

. 
. 
. *Ethnicity
. forvalues j=1/6 {
  2. local label`j': label ethnicity `j'
  3. foreach x of local year {
  4. use ./output/`x'_ckd_complete.dta, clear
  5. drop _merge
  6. merge 1:1 patient_id using ./output/`x'_nockd_complete
  7. drop if ckd_progression!=1 
  8. drop if ethnicity!=`j'
  9. 
. qui su age, d
 10. local `x'_q2_`j' = r(p50)
 11. local `x'_q1_`j' = r(p25)
 12. local `x'_q3_`j' = r(p75)
 13. egen mode_age = mode(age), minmode
 14. qui su mode_age
 15. local `x'_mode_`j' = r(mean)
 16. drop mode_age
 17. 
. bysort ckd_group: egen mode_age = mode(age), minmode
 18. qui su age if ckd_group==0, d
 19. local `x'_q2_0_`j' = r(p50)
 20. local `x'_q1_0_`j' = r(p25)
 21. local `x'_q3_0_`j' = r(p75)
 22. qui su mode_age if ckd_group==0
 23. local `x'_mode_0_`j' = r(mean)
 24. }
 25. 
. file write tablecontent ("`label`j''") _tab ("All") _tab (`2017_q2_`j'') (" (") (`2017_q1_`j'') ("-") (`2017_q3_`j'') (")") _tab (`2018_q2_`j'') (" (") (`2018_q1_`j'') ("-") (`2018_q3_`j'') (")") _tab (`2019_q2_`j'') (" (") (`2019_q1_`j'') ("-") (`20
> 19_q3_`j'') (")") _tab (`2020_q2_`j'') (" (") (`2020_q1_`j'') ("-") (`2020_q3_`j'') (")") _tab (`2021_q2_`j'') (" (") (`2021_q1_`j'') ("-") (`2021_q3_`j'') (")") _tab (`2022_q2_`j'') (" (") (`2022_q1_`j'') ("-") (`2022_q3_`j'') (")") _tab (`2017_mode
> _`j'') _tab (`2018_mode_`j'') _tab (`2019_mode_`j'') _tab (`2020_mode_`j'') _tab (`2021_mode_`j'') _tab (`2022_mode_`j'') _n
 26. file write tablecontent ("`label`j''") _tab ("No CKD") _tab (`2017_q2_0_`j'') (" (") (`2017_q1_0_`j'') ("-") (`2017_q3_0_`j'') (")") _tab (`2018_q2_0_`j'') (" (") (`2018_q1_0_`j'') ("-") (`2018_q3_0_`j'') (")") _tab (`2019_q2_0_`j'') (" (") (`2019
> _q1_0_`j'') ("-") (`2019_q3_0_`j'') (")") _tab (`2020_q2_0_`j'') (" (") (`2020_q1_0_`j'') ("-") (`2020_q3_0_`j'') (")") _tab (`2021_q2_0_`j'') (" (") (`2021_q1_0_`j'') ("-") (`2021_q3_0_`j'') (")") _tab (`2022_q2_0_`j'') (" (") (`2022_q1_0_`j'') ("-"
> ) (`2022_q3_0_`j'') (")") _tab (`2017_mode_0_`j'') _tab (`2018_mode_0_`j'') _tab (`2019_mode_0_`j'') _tab (`2020_mode_0_`j'') _tab (`2021_mode_0_`j'') _tab (`2022_mode_0_`j'') _n
 27. file write tablecontent ("`label`j''") _tab ("Albuminuria") _tab (`2017_q2_1_`j'') (" (") (`2017_q1_1_`j'') ("-") (`2017_q3_1_`j'') (")") _tab (`2018_q2_1_`j'') (" (") (`2018_q1_1_`j'') ("-") (`2018_q3_1_`j'') (")") _tab (`2019_q2_1_`j'') (" (") (
> `2019_q1_1_`j'') ("-") (`2019_q3_1_`j'') (")") _tab (`2020_q2_1_`j'') (" (") (`2020_q1_1_`j'') ("-") (`2020_q3_1_`j'') (")") _tab (`2021_q2_1_`j'') (" (") (`2021_q1_1_`j'') ("-") (`2021_q3_1_`j'') (")") _tab (`2022_q2_1_`j'') (" (") (`2022_q1_1_`j'')
>  ("-") (`2022_q3_1_`j'') (")") _tab (`2017_mode_1_`j'') _tab (`2018_mode_1_`j'') _tab (`2019_mode_1_`j'') _tab (`2020_mode_1_`j'') _tab (`2021_mode_1_`j'') _tab (`2022_mode_1_`j'') _n
 28. file write tablecontent ("`label`j''") _tab ("CKD stage 3") _tab (`2017_q2_2_`j'') (" (") (`2017_q1_2_`j'') ("-") (`2017_q3_2_`j'') (")") _tab (`2018_q2_2_`j'') (" (") (`2018_q1_2_`j'') ("-") (`2018_q3_2_`j'') (")") _tab (`2019_q2_2_`j'') (" (") (
> `2019_q1_2_`j'') ("-") (`2019_q3_2_`j'') (")") _tab (`2020_q2_2_`j'') (" (") (`2020_q1_2_`j'') ("-") (`2020_q3_2_`j'') (")") _tab (`2021_q2_2_`j'') (" (") (`2021_q1_2_`j'') ("-") (`2021_q3_2_`j'') (")") _tab (`2022_q2_2_`j'') (" (") (`2022_q1_2_`j'')
>  ("-") (`2022_q3_2_`j'') (")") _tab (`2017_mode_2_`j'') _tab (`2018_mode_2_`j'') _tab (`2019_mode_2_`j'') _tab (`2020_mode_2_`j'') _tab (`2021_mode_2_`j'') _tab (`2022_mode_2_`j'') _n
 29. file write tablecontent ("`label`j''") _tab ("CKD stage 4/5") _tab (`2017_q2_3_`j'') (" (") (`2017_q1_3_`j'') ("-") (`2017_q3_3_`j'') (")") _tab (`2018_q2_3_`j'') (" (") (`2018_q1_3_`j'') ("-") (`2018_q3_3_`j'') (")") _tab (`2019_q2_3_`j'') (" (")
>  (`2019_q1_3_`j'') ("-") (`2019_q3_3_`j'') (")") _tab (`2020_q2_3_`j'') (" (") (`2020_q1_3_`j'') ("-") (`2020_q3_3_`j'') (")") _tab (`2021_q2_3_`j'') (" (") (`2021_q1_3_`j'') ("-") (`2021_q3_3_`j'') (")") _tab (`2022_q2_3_`j'') (" (") (`2022_q1_3_`j'
> ') ("-") (`2022_q3_3_`j'') (")") _tab (`2017_mode_3_`j'') _tab (`2018_mode_3_`j'') _tab (`2019_mode_3_`j'') _tab (`2020_mode_3_`j'') _tab (`2021_mode_3_`j'') _tab (`2022_mode_3_`j'') _n
 30. file write tablecontent ("`label`j''") _tab ("Dialysis") _tab (`2017_q2_4_`j'') (" (") (`2017_q1_4_`j'') ("-") (`2017_q3_4_`j'') (")") _tab (`2018_q2_4_`j'') (" (") (`2018_q1_4_`j'') ("-") (`2018_q3_4_`j'') (")") _tab (`2019_q2_4_`j'') (" (") (`20
> 19_q1_4_`j'') ("-") (`2019_q3_4_`j'') (")") _tab (`2020_q2_4_`j'') (" (") (`2020_q1_4_`j'') ("-") (`2020_q3_4_`j'') (")") _tab (`2021_q2_4_`j'') (" (") (`2021_q1_4_`j'') ("-") (`2021_q3_4_`j'') (")") _tab (`2022_q2_4_`j'') (" (") (`2022_q1_4_`j'') ("
> -") (`2022_q3_4_`j'') (")") _tab (`2017_mode_4_`j'') _tab (`2018_mode_4_`j'') _tab (`2019_mode_4_`j'') _tab (`2020_mode_4_`j'') _tab (`2021_mode_4_`j'') _tab (`2022_mode_4_`j'') _n
 31. file write tablecontent ("`label`j''") _tab ("Transplant") _tab (`2017_q2_5_`j'') (" (") (`2017_q1_5_`j'') ("-") (`2017_q3_5_`j'') (")") _tab (`2018_q2_5_`j'') (" (") (`2018_q1_5_`j'') ("-") (`2018_q3_5_`j'') (")") _tab (`2019_q2_5_`j'') (" (") (`
> 2019_q1_5_`j'') ("-") (`2019_q3_5_`j'') (")") _tab (`2020_q2_5_`j'') (" (") (`2020_q1_5_`j'') ("-") (`2020_q3_5_`j'') (")") _tab (`2021_q2_5_`j'') (" (") (`2021_q1_5_`j'') ("-") (`2021_q3_5_`j'') (")") _tab (`2022_q2_5_`j'') (" (") (`2022_q1_5_`j'') 
> ("-") (`2022_q3_5_`j'') (")") _tab (`2017_mode_5_`j'') _tab (`2018_mode_5_`j'') _tab (`2019_mode_5_`j'') _tab (`2020_mode_5_`j'') _tab (`2021_mode_5_`j'') _tab (`2022_mode_5_`j'') _n
 32. }
variable region is float in master but str24 in using data
    You could specify merge's force option to ignore this numeric/string mismatch.  The using variable would then be treated as if it contained numeric missing value.
r(106);

end of do-file

r(106);

. cd ..
C:\Users\lsh1703468\Documents\repo

. cd ..
C:\Users\lsh1703468\Documents

. cd repos
C:\Users\lsh1703468\Documents\repos

. do "C:\Users\lsh1703468\Documents\Repos\analysis\crude_rates_esrd_2017.do"

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\Users\lsh1703468\Documents\repos

. cap log close
