-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/age_transplant.log
  log type:  text
 opened on:  22 Nov 2023, 13:44:32

. 
. cap file close tablecontent

. file open tablecontent using ./output/age_transplant.csv, write text replace

. 
. file write tablecontent ("stratum") _tab ("median_2017") _tab ("median_2018") _tab ("median_2019") _tab ("median_2020") _tab ("median_2021") _tab ("median_2022") _tab ("mode_2017") _tab ("mode_2018") _tab ("mode_2
> 019") _tab ("mode_2020") _tab ("mode_2021") _tab ("mode_2022") _n

. 
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete.dta, clear
  3. drop _merge
  4. merge 1:1 patient_id using ./output/`x'_nockd_complete, force
  5. drop if ckd_progression!=4
  6. qui su age, d
  7. local `x'_q2 = r(p50)
  8. local `x'_q1 = r(p25)
  9. local `x'_q3 = r(p75)
 10. egen mode_age = mode(age), minmode
 11. qui su mode_age
 12. local `x'_mode = r(mean)
 13. drop mode_age
 14. 
. bysort ckd_group: egen mode_age = mode(age), minmode
 15. 
. forvalues i=0/4{
 16. qui su age if ckd_group==`i', d
 17. local `x'_q2_`i' = r(p50)
 18. local `x'_q1_`i' = r(p25)
 19. local `x'_q3_`i' = r(p75)
 20. qui su mode_age if ckd_group==`i'
 21. local `x'_mode_`i' = r(mean)
 22. }
 23. }
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,132 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,184
        from master                     2,085  (_merge==1)
        from using                      1,099  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,091 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,042
        from master                     1,971  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,202
        from master                     2,092  (_merge==1)
        from using                      1,110  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,106 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,166
        from master                     2,095  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,067 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,273
        from master                     2,145  (_merge==1)
        from using                      1,128  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,173 observations deleted)

. 
. file write tablecontent ("All") _tab (`2017_q2') (" (") (`2017_q1') ("-") (`2017_q3') (")") _tab (`2018_q2') (" (") (`2018_q1') ("-") (`2018_q3') (")") _tab (`2019_q2') (" (") (`2019_q1') ("-") (`2019_q3') (")") _
> tab (`2020_q2') (" (") (`2020_q1') ("-") (`2020_q3') (")") _tab (`2021_q2') (" (") (`2021_q1') ("-") (`2021_q3') (")") _tab (`2022_q2') (" (") (`2022_q1') ("-") (`2022_q3') (")") _tab (`2017_mode') _tab (`2018_mod
> e') _tab (`2019_mode') _tab (`2020_mode') _tab (`2021_mode') _tab (`2022_mode') _n

. 
. *Ethnicity
. forvalues j=1/3 {
  2. local label`j': label ethnicity `j'
  3. foreach x of local year {
  4. use ./output/`x'_ckd_complete.dta, clear
  5. drop _merge
  6. merge 1:1 patient_id using ./output/`x'_nockd_complete, force
  7. drop if ckd_progression!=4 
  8. drop if ethnicity!=`j'
  9. 
. qui su age, d
 10. local `x'_q2_`j' = r(p50)
 11. local `x'_q1_`j' = r(p25)
 12. local `x'_q3_`j' = r(p75)
 13. egen mode_age = mode(age), minmode
 14. qui su mode_age
 15. local `x'_mode_`j' = r(mean)
 16. drop mode_age
 17. 
. bysort ckd_group: egen mode_age = mode(age), minmode
 18. forvalues i=0/4{
 19. qui su age if ckd_group==`i', d
 20. local `x'_q2_`i'_`j' = r(p50)
 21. local `x'_q1_`i'_`j' = r(p25)
 22. local `x'_q3_`i'_`j' = r(p75)
 23. qui su mode_age if ckd_group==`i'
 24. local `x'_mode_`i'_`j' = r(mean)
 25. }
 26. }
 27. 
. file write tablecontent ("`label`j''") _tab (`2017_q2_`j'') (" (") (`2017_q1_`j'') ("-") (`2017_q3_`j'') (")") _tab (`2018_q2_`j'') (" (") (`2018_q1_`j'') ("-") (`2018_q3_`j'') (")") _tab (`2019_q2_`j'') (" (") (`
> 2019_q1_`j'') ("-") (`2019_q3_`j'') (")") _tab (`2020_q2_`j'') (" (") (`2020_q1_`j'') ("-") (`2020_q3_`j'') (")") _tab (`2021_q2_`j'') (" (") (`2021_q1_`j'') ("-") (`2021_q3_`j'') (")") _tab (`2022_q2_`j'') (" (")
>  (`2022_q1_`j'') ("-") (`2022_q3_`j'') (")") _tab (`2017_mode_`j'') _tab (`2018_mode_`j'') _tab (`2019_mode_`j'') _tab (`2020_mode_`j'') _tab (`2021_mode_`j'') _tab (`2022_mode_`j'') _n
 28. }
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,132 observations deleted)
(48 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,184
        from master                     2,085  (_merge==1)
        from using                      1,099  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,091 observations deleted)
(41 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,042
        from master                     1,971  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(41 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,202
        from master                     2,092  (_merge==1)
        from using                      1,110  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,106 observations deleted)
(36 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,166
        from master                     2,095  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,067 observations deleted)
(40 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,273
        from master                     2,145  (_merge==1)
        from using                      1,128  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,173 observations deleted)
(31 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,132 observations deleted)
(125 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,184
        from master                     2,085  (_merge==1)
        from using                      1,099  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,091 observations deleted)
(90 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,042
        from master                     1,971  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(93 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,202
        from master                     2,092  (_merge==1)
        from using                      1,110  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,106 observations deleted)
(94 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,166
        from master                     2,095  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,067 observations deleted)
(95 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,273
        from master                     2,145  (_merge==1)
        from using                      1,128  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,173 observations deleted)
(96 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,132 observations deleted)
(123 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,184
        from master                     2,085  (_merge==1)
        from using                      1,099  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,091 observations deleted)
(87 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,042
        from master                     1,971  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(90 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,202
        from master                     2,092  (_merge==1)
        from using                      1,110  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,106 observations deleted)
(91 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,166
        from master                     2,095  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,067 observations deleted)
(98 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,273
        from master                     2,145  (_merge==1)
        from using                      1,128  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,173 observations deleted)
(99 observations deleted)

. 
. *IMD
. forvalues j=1/5 {
  2. local label`j': label imd `j'
  3. foreach x of local year {
  4. use ./output/`x'_ckd_complete.dta, clear
  5. drop _merge
  6. merge 1:1 patient_id using ./output/`x'_nockd_complete, force
  7. drop if ckd_progression!=4 
  8. drop if imd!=`j'
  9. 
. qui su age, d
 10. local `x'_q2_`j' = r(p50)
 11. local `x'_q1_`j' = r(p25)
 12. local `x'_q3_`j' = r(p75)
 13. egen mode_age = mode(age), minmode
 14. qui su mode_age
 15. local `x'_mode_`j' = r(mean)
 16. drop mode_age
 17. 
. bysort ckd_group: egen mode_age = mode(age), minmode
 18. forvalues i=0/4{
 19. qui su age if ckd_group==`i', d
 20. local `x'_q2_`i'_`j' = r(p50)
 21. local `x'_q1_`i'_`j' = r(p25)
 22. local `x'_q3_`i'_`j' = r(p75)
 23. qui su mode_age if ckd_group==`i'
 24. local `x'_mode_`i'_`j' = r(mean)
 25. }
 26. }
 27. 
. 
. file write tablecontent ("`label`j''") _tab (`2017_q2_`j'') (" (") (`2017_q1_`j'') ("-") (`2017_q3_`j'') (")") _tab (`2018_q2_`j'') (" (") (`2018_q1_`j'') ("-") (`2018_q3_`j'') (")") _tab (`2019_q2_`j'') (" (") (`
> 2019_q1_`j'') ("-") (`2019_q3_`j'') (")") _tab (`2020_q2_`j'') (" (") (`2020_q1_`j'') ("-") (`2020_q3_`j'') (")") _tab (`2021_q2_`j'') (" (") (`2021_q1_`j'') ("-") (`2021_q3_`j'') (")") _tab (`2022_q2_`j'') (" (")
>  (`2022_q1_`j'') ("-") (`2022_q3_`j'') (")") _tab (`2017_mode_`j'') _tab (`2018_mode_`j'') _tab (`2019_mode_`j'') _tab (`2020_mode_`j'') _tab (`2021_mode_`j'') _tab (`2022_mode_`j'') _n
 28. }
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,132 observations deleted)
(107 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,184
        from master                     2,085  (_merge==1)
        from using                      1,099  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,091 observations deleted)
(73 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,042
        from master                     1,971  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(78 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,202
        from master                     2,092  (_merge==1)
        from using                      1,110  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,106 observations deleted)
(70 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,166
        from master                     2,095  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,067 observations deleted)
(76 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,273
        from master                     2,145  (_merge==1)
        from using                      1,128  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,173 observations deleted)
(82 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,132 observations deleted)
(105 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,184
        from master                     2,085  (_merge==1)
        from using                      1,099  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,091 observations deleted)
(69 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,042
        from master                     1,971  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(74 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,202
        from master                     2,092  (_merge==1)
        from using                      1,110  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,106 observations deleted)
(71 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,166
        from master                     2,095  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,067 observations deleted)
(78 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,273
        from master                     2,145  (_merge==1)
        from using                      1,128  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,173 observations deleted)
(80 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,132 observations deleted)
(97 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,184
        from master                     2,085  (_merge==1)
        from using                      1,099  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,091 observations deleted)
(79 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,042
        from master                     1,971  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(77 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,202
        from master                     2,092  (_merge==1)
        from using                      1,110  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,106 observations deleted)
(80 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,166
        from master                     2,095  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,067 observations deleted)
(81 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,273
        from master                     2,145  (_merge==1)
        from using                      1,128  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,173 observations deleted)
(82 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,132 observations deleted)
(106 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,184
        from master                     2,085  (_merge==1)
        from using                      1,099  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,091 observations deleted)
(73 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,042
        from master                     1,971  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(80 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,202
        from master                     2,092  (_merge==1)
        from using                      1,110  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,106 observations deleted)
(79 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,166
        from master                     2,095  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,067 observations deleted)
(78 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,273
        from master                     2,145  (_merge==1)
        from using                      1,128  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,173 observations deleted)
(80 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,132 observations deleted)
(97 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,184
        from master                     2,085  (_merge==1)
        from using                      1,099  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,091 observations deleted)
(78 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,042
        from master                     1,971  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(79 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,202
        from master                     2,092  (_merge==1)
        from using                      1,110  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,106 observations deleted)
(84 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,166
        from master                     2,095  (_merge==1)
        from using                      1,071  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,067 observations deleted)
(83 observations deleted)
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,273
        from master                     2,145  (_merge==1)
        from using                      1,128  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,173 observations deleted)
(76 observations deleted)

. 
. file close tablecontent

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD569c_000000.tmp"

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use

. cap log close
