-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/ckd_progression.log
  log type:  text
 opened on:  30 Aug 2023, 15:06:35

. 
. cap file close tablecontent

. file open tablecontent using ./output/ckd_progression.csv, write text replace

. 
. file write tablecontent ("stratum") _tab ("start_status") _tab ("end_status") _tab ("count_2017") _tab ("count_2018") _tab ("count_2019") _tab ("count_2020") _tab ("count_2021") _tab ("count_2022") _n

. 
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete.dta, clear
  3. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  4. local baseline_ckd_`x' = round(r(N),5)
  5. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  6. local none_ckd_`x' = round(r(N),5)
  7. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
  8. local ckd3_ckd_`x' = round(r(N),5)
  9. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 10. local ckd4_ckd_`x' = round(r(N),5)
 11. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 12. local dialysis_ckd_`x' = round(r(N),5)
 13. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 14. local kt_ckd_`x' = round(r(N),5)
 15. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 16. local deceased_ckd_`x' = round(r(N),5)
 17. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 18. local baseline_ckd2_`x' = round(r(N),5)
 19. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 20. local none_ckd2_`x' = round(r(N),5)
 21. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 22. local ckd3_ckd2_`x' = round(r(N),5)
 23. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 24. local ckd4_ckd2_`x' = round(r(N),5)
 25. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 26. local dialysis_ckd2_`x' = round(r(N),5)
 27. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 28. local kt_ckd2_`x' = round(r(N),5)
 29. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 30. local deceased_ckd2_`x' = round(r(N),5)
 31. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 32. local baseline_ckd3_`x' = round(r(N),5)
 33. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 34. local none_ckd3_`x' = round(r(N),5)
 35. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 36. local ckd4_ckd3_`x' = round(r(N),5)
 37. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 38. local dialysis_ckd3_`x' = round(r(N),5)
 39. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 40. local kt_ckd3_`x' = round(r(N),5)
 41. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 42. local deceased_ckd3_`x' = round(r(N),5)
 43. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 44. local baseline_ckd4_`x' = round(r(N),5)
 45. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 46. local none_ckd4_`x' = round(r(N),5)
 47. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 48. local dialysis_ckd4_`x' = round(r(N),5)
 49. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 50. local kt_ckd4_`x' = round(r(N),5)
 51. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 52. local deceased_ckd4_`x' = round(r(N),5)
 53. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 54. local baseline_dialysis_`x' = round(r(N),5)
 55. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 56. local none_dialysis_`x' = round(r(N),5)
 57. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 58. local kt_dialysis_`x' = round(r(N),5)
 59. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 60. local deceased_dialysis_`x' = round(r(N),5)
 61. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 62. local baseline_kt_`x' = round(r(N),5)
 63. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 64. local none_kt_`x' = round(r(N),5)
 65. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 66. local dialysis_kt_`x' = round(r(N),5)
 67. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 68. local deceased_kt_`x' = round(r(N),5)
 69. }

. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("All") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`baseline_
> ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _tab (`dial
> ysis_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _tab (`dece
> ased_ckd_2022') _n

. 
. *eGFR >60 with albuminuria
. file write tablecontent ("All") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') _tab (`
> baseline_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (`none_ckd2
> _2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ckd3_ckd2_20
> 22') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`ckd4_ckd2_
> 2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2_2021') _t
> ab (`dialysis_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2_2021') _t
> ab (`deceased_ckd2_2022') _n

. 
. *CKD stage 3
. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') _tab (`
> baseline_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (`none_ckd3
> _2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`ckd4_ckd3_
> 2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3_2021') _t
> ab (`dialysis_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3_2021') _t
> ab (`deceased_ckd3_2022') _n

. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021') _tab 
> (`baseline_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab (`none_ck
> d4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ckd4_2021') 
> _tab (`dialysis_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ckd4_2021') 
> _tab (`deceased_ckd4_2022') _n

. 
. *Dialysis
. file write tablecontent ("All") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline_dialys
> is_2021') _tab (`baseline_dialysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialysis_2021')
>  _tab (`none_dialysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _tab (`kt_dia
> lysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`deceased_d
> ialysis_2021') _tab (`deceased_dialysis_2022') _n

. 
. *Kidney Transplant
. file write tablecontent ("All") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`baseline_kt
> _2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _tab (`dialys
> is_kt_2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _tab (`deceas
> ed_kt_2022') _n

. 
. 
. forvalues i=1/6 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. local label`i': label ethnicity `i'
  5. drop if ethnicity!=`i'
  6. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  7. local baseline_ckd_`x' = round(r(N),5)
  8. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  9. local none_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 11. local ckd3_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 13. local ckd4_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 15. local dialysis_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 17. local kt_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 19. local deceased_ckd_`x' = round(r(N),5)
 20. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 21. local baseline_ckd2_`x' = round(r(N),5)
 22. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 23. local none_ckd2_`x' = round(r(N),5)
 24. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 25. local ckd3_ckd2_`x' = round(r(N),5)
 26. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 27. local ckd4_ckd2_`x' = round(r(N),5)
 28. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 29. local dialysis_ckd2_`x' = round(r(N),5)
 30. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 31. local kt_ckd2_`x' = round(r(N),5)
 32. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 33. local deceased_ckd2_`x' = round(r(N),5)
 34. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 35. local baseline_ckd3_`x' = round(r(N),5)
 36. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 37. local none_ckd3_`x' = round(r(N),5)
 38. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 39. local ckd4_ckd3_`x' = round(r(N),5)
 40. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 41. local dialysis_ckd3_`x' = round(r(N),5)
 42. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 43. local kt_ckd3_`x' = round(r(N),5)
 44. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 45. local deceased_ckd3_`x' = round(r(N),5)
 46. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 47. local baseline_ckd4_`x' = round(r(N),5)
 48. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 49. local none_ckd4_`x' = round(r(N),5)
 50. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 51. local dialysis_ckd4_`x' = round(r(N),5)
 52. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 53. local kt_ckd4_`x' = round(r(N),5)
 54. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 55. local deceased_ckd4_`x' = round(r(N),5)
 56. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 57. local baseline_dialysis_`x' = round(r(N),5)
 58. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 59. local none_dialysis_`x' = round(r(N),5)
 60. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 61. local kt_dialysis_`x' = round(r(N),5)
 62. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 63. local deceased_dialysis_`x' = round(r(N),5)
 64. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 65. local baseline_kt_`x' = round(r(N),5)
 66. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 67. local none_kt_`x' = round(r(N),5)
 68. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 69. local dialysis_kt_`x' = round(r(N),5)
 70. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 71. local deceased_kt_`x' = round(r(N),5)
 72. }
 73. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
 74. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
 75. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
 76. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
 77. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
 78. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
 79. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
 80. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
 81. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
 82. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
 83. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
 84. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
 85. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
 86. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
 87. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
 88. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
 89. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
 90. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
 91. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
 92. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
 93. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
 94. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
 95. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
 96. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
 97. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
 98. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
 99. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
100. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
101. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
102. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
103. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
104. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
105. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
106. }
(816 observations deleted)
(816 observations deleted)
(832 observations deleted)
(830 observations deleted)
(887 observations deleted)
(845 observations deleted)
(2,010 observations deleted)
(2,027 observations deleted)
(1,983 observations deleted)
(2,053 observations deleted)
(2,075 observations deleted)
(1,991 observations deleted)
(2,015 observations deleted)
(2,026 observations deleted)
(1,986 observations deleted)
(2,047 observations deleted)
(2,066 observations deleted)
(1,994 observations deleted)
(2,006 observations deleted)
(2,020 observations deleted)
(1,962 observations deleted)
(2,064 observations deleted)
(2,049 observations deleted)
(1,987 observations deleted)
(2,004 observations deleted)
(2,005 observations deleted)
(1,978 observations deleted)
(2,069 observations deleted)
(2,064 observations deleted)
(2,007 observations deleted)
(1,539 observations deleted)
(1,571 observations deleted)
(1,529 observations deleted)
(1,587 observations deleted)
(1,579 observations deleted)
(1,541 observations deleted)

. 
. forvalues i=1/5 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. local label`i': label imd `i'
  5. drop if imd!=`i'
  6. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  7. local baseline_ckd_`x' = round(r(N),5)
  8. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  9. local none_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 11. local ckd3_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 13. local ckd4_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 15. local dialysis_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 17. local kt_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 19. local deceased_ckd_`x' = round(r(N),5)
 20. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 21. local baseline_ckd2_`x' = round(r(N),5)
 22. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 23. local none_ckd2_`x' = round(r(N),5)
 24. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 25. local ckd3_ckd2_`x' = round(r(N),5)
 26. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 27. local ckd4_ckd2_`x' = round(r(N),5)
 28. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 29. local dialysis_ckd2_`x' = round(r(N),5)
 30. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 31. local kt_ckd2_`x' = round(r(N),5)
 32. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 33. local deceased_ckd2_`x' = round(r(N),5)
 34. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 35. local baseline_ckd3_`x' = round(r(N),5)
 36. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 37. local none_ckd3_`x' = round(r(N),5)
 38. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 39. local ckd4_ckd3_`x' = round(r(N),5)
 40. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 41. local dialysis_ckd3_`x' = round(r(N),5)
 42. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 43. local kt_ckd3_`x' = round(r(N),5)
 44. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 45. local deceased_ckd3_`x' = round(r(N),5)
 46. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 47. local baseline_ckd4_`x' = round(r(N),5)
 48. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 49. local none_ckd4_`x' = round(r(N),5)
 50. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 51. local dialysis_ckd4_`x' = round(r(N),5)
 52. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 53. local kt_ckd4_`x' = round(r(N),5)
 54. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 55. local deceased_ckd4_`x' = round(r(N),5)
 56. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 57. local baseline_dialysis_`x' = round(r(N),5)
 58. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 59. local none_dialysis_`x' = round(r(N),5)
 60. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 61. local kt_dialysis_`x' = round(r(N),5)
 62. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 63. local deceased_dialysis_`x' = round(r(N),5)
 64. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 65. local baseline_kt_`x' = round(r(N),5)
 66. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 67. local none_kt_`x' = round(r(N),5)
 68. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 69. local dialysis_kt_`x' = round(r(N),5)
 70. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 71. local deceased_kt_`x' = round(r(N),5)
 72. }
 73. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
 74. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
 75. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
 76. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
 77. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
 78. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
 79. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
 80. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
 81. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
 82. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
 83. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
 84. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
 85. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
 86. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
 87. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
 88. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
 89. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
 90. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
 91. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
 92. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
 93. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
 94. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
 95. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
 96. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
 97. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
 98. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
 99. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
100. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
101. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
102. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
103. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
104. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
105. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
106. }
(1,659 observations deleted)
(1,674 observations deleted)
(1,632 observations deleted)
(1,688 observations deleted)
(1,692 observations deleted)
(1,672 observations deleted)
(1,659 observations deleted)
(1,672 observations deleted)
(1,670 observations deleted)
(1,685 observations deleted)
(1,724 observations deleted)
(1,655 observations deleted)
(1,665 observations deleted)
(1,659 observations deleted)
(1,664 observations deleted)
(1,719 observations deleted)
(1,729 observations deleted)
(1,648 observations deleted)
(1,678 observations deleted)
(1,712 observations deleted)
(1,624 observations deleted)
(1,728 observations deleted)
(1,714 observations deleted)
(1,647 observations deleted)
(1,651 observations deleted)
(1,655 observations deleted)
(1,626 observations deleted)
(1,700 observations deleted)
(1,717 observations deleted)
(1,670 observations deleted)

. 
. forvalues i=1/9 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. local label`i': label region `i'
  5. drop if region!=`i'
  6. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  7. local baseline_ckd_`x' = round(r(N),5)
  8. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  9. local none_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 11. local ckd3_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 13. local ckd4_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 15. local dialysis_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 17. local kt_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 19. local deceased_ckd_`x' = round(r(N),5)
 20. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 21. local baseline_ckd2_`x' = round(r(N),5)
 22. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 23. local none_ckd2_`x' = round(r(N),5)
 24. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 25. local ckd3_ckd2_`x' = round(r(N),5)
 26. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 27. local ckd4_ckd2_`x' = round(r(N),5)
 28. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 29. local dialysis_ckd2_`x' = round(r(N),5)
 30. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 31. local kt_ckd2_`x' = round(r(N),5)
 32. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 33. local deceased_ckd2_`x' = round(r(N),5)
 34. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 35. local baseline_ckd3_`x' = round(r(N),5)
 36. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 37. local none_ckd3_`x' = round(r(N),5)
 38. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 39. local ckd4_ckd3_`x' = round(r(N),5)
 40. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 41. local dialysis_ckd3_`x' = round(r(N),5)
 42. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 43. local kt_ckd3_`x' = round(r(N),5)
 44. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 45. local deceased_ckd3_`x' = round(r(N),5)
 46. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 47. local baseline_ckd4_`x' = round(r(N),5)
 48. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 49. local none_ckd4_`x' = round(r(N),5)
 50. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 51. local dialysis_ckd4_`x' = round(r(N),5)
 52. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 53. local kt_ckd4_`x' = round(r(N),5)
 54. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 55. local deceased_ckd4_`x' = round(r(N),5)
 56. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 57. local baseline_dialysis_`x' = round(r(N),5)
 58. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 59. local none_dialysis_`x' = round(r(N),5)
 60. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 61. local kt_dialysis_`x' = round(r(N),5)
 62. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 63. local deceased_dialysis_`x' = round(r(N),5)
 64. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 65. local baseline_kt_`x' = round(r(N),5)
 66. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 67. local none_kt_`x' = round(r(N),5)
 68. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 69. local dialysis_kt_`x' = round(r(N),5)
 70. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 71. local deceased_kt_`x' = round(r(N),5)
 72. }
 73. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
 74. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
 75. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
 76. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
 77. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
 78. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
 79. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
 80. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
 81. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
 82. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
 83. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
 84. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
 85. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
 86. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
 87. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
 88. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
 89. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
 90. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
 91. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
 92. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
 93. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
 94. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
 95. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
 96. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
 97. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
 98. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
 99. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
100. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
101. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
102. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
103. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
104. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
105. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
106. }
(1,877 observations deleted)
(1,908 observations deleted)
(1,843 observations deleted)
(1,930 observations deleted)
(1,931 observations deleted)
(1,861 observations deleted)
(1,895 observations deleted)
(1,882 observations deleted)
(1,849 observations deleted)
(1,923 observations deleted)
(1,929 observations deleted)
(1,862 observations deleted)
(1,639 observations deleted)
(1,668 observations deleted)
(1,629 observations deleted)
(1,685 observations deleted)
(1,706 observations deleted)
(1,647 observations deleted)
(1,881 observations deleted)
(1,880 observations deleted)
(1,833 observations deleted)
(1,920 observations deleted)
(1,908 observations deleted)
(1,874 observations deleted)
(1,876 observations deleted)
(1,873 observations deleted)
(1,845 observations deleted)
(1,933 observations deleted)
(1,938 observations deleted)
(1,885 observations deleted)
(1,869 observations deleted)
(1,886 observations deleted)
(1,859 observations deleted)
(1,930 observations deleted)
(1,934 observations deleted)
(1,860 observations deleted)
(1,859 observations deleted)
(1,899 observations deleted)
(1,871 observations deleted)
(1,918 observations deleted)
(1,947 observations deleted)
(1,849 observations deleted)
(1,857 observations deleted)
(1,890 observations deleted)
(1,853 observations deleted)
(1,908 observations deleted)
(1,929 observations deleted)
(1,893 observations deleted)
(1,871 observations deleted)
(1,858 observations deleted)
(1,850 observations deleted)
(1,893 observations deleted)
(1,930 observations deleted)
(1,853 observations deleted)

. 
. forvalues i=0/1 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. local label`i': label urban `i'
  5. drop if urban!=`i'
  6. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  7. local baseline_ckd_`x' = round(r(N),5)
  8. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  9. local none_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 11. local ckd3_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 13. local ckd4_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 15. local dialysis_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 17. local kt_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 19. local deceased_ckd_`x' = round(r(N),5)
 20. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 21. local baseline_ckd2_`x' = round(r(N),5)
 22. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 23. local none_ckd2_`x' = round(r(N),5)
 24. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 25. local ckd3_ckd2_`x' = round(r(N),5)
 26. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 27. local ckd4_ckd2_`x' = round(r(N),5)
 28. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 29. local dialysis_ckd2_`x' = round(r(N),5)
 30. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 31. local kt_ckd2_`x' = round(r(N),5)
 32. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 33. local deceased_ckd2_`x' = round(r(N),5)
 34. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 35. local baseline_ckd3_`x' = round(r(N),5)
 36. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 37. local none_ckd3_`x' = round(r(N),5)
 38. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 39. local ckd4_ckd3_`x' = round(r(N),5)
 40. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 41. local dialysis_ckd3_`x' = round(r(N),5)
 42. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 43. local kt_ckd3_`x' = round(r(N),5)
 44. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 45. local deceased_ckd3_`x' = round(r(N),5)
 46. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 47. local baseline_ckd4_`x' = round(r(N),5)
 48. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 49. local none_ckd4_`x' = round(r(N),5)
 50. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 51. local dialysis_ckd4_`x' = round(r(N),5)
 52. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 53. local kt_ckd4_`x' = round(r(N),5)
 54. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 55. local deceased_ckd4_`x' = round(r(N),5)
 56. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 57. local baseline_dialysis_`x' = round(r(N),5)
 58. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 59. local none_dialysis_`x' = round(r(N),5)
 60. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 61. local kt_dialysis_`x' = round(r(N),5)
 62. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 63. local deceased_dialysis_`x' = round(r(N),5)
 64. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 65. local baseline_kt_`x' = round(r(N),5)
 66. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 67. local none_kt_`x' = round(r(N),5)
 68. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 69. local dialysis_kt_`x' = round(r(N),5)
 70. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 71. local deceased_kt_`x' = round(r(N),5)
 72. }
 73. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
 74. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
 75. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
 76. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
 77. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
 78. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
 79. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
 80. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
 81. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
 82. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
 83. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
 84. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
 85. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
 86. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
 87. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
 88. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
 89. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
 90. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
 91. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
 92. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
 93. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
 94. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
 95. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
 96. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
 97. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
 98. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
 99. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
100. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
101. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
102. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
103. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
104. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
105. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
106. }
(822 observations deleted)
(861 observations deleted)
(835 observations deleted)
(823 observations deleted)
(855 observations deleted)
(814 observations deleted)
(1,256 observations deleted)
(1,232 observations deleted)
(1,219 observations deleted)
(1,307 observations deleted)
(1,289 observations deleted)
(1,259 observations deleted)

. 
. 
. file close tablecontent

. 
. **Redact counts of 0 from each column in table (adapted from code by Emily Herrett)
. clear

. import delimited ./output/ckd_progression.csv
(encoding automatically selected: ISO-8859-1)
(9 vars, 759 obs)

. local columns " "count_2017" "count_2018" "count_2019" "count_2020" "count_2021" "count_2022" "

. foreach col in `columns' {
  2. replace `col'=. if `col'<=5
  3. }
(176 real changes made, 176 to missing)
(180 real changes made, 180 to missing)
(176 real changes made, 176 to missing)
(161 real changes made, 161 to missing)
(147 real changes made, 147 to missing)
(160 real changes made, 160 to missing)

.         
. export delimited "./output/ckd_progression.csv", replace
file ./output/ckd_progression.csv saved

. 
end of do-file

