-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/ckd_progression.log
  log type:  text
 opened on:  21 Sep 2023, 09:39:52

. 
. cap file close tablecontent

. file open tablecontent using ./output/ckd_progression.csv, write text replace

. 
. file write tablecontent ("stratum") _tab ("start_status") _tab ("end_status") _tab ("count_2017") _tab ("count_2018") _tab ("count_2019") _tab ("count_2020") _tab ("count_2021") _tab ("count_2022") _n

. 
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete.dta, clear
  3. drop _merge
  4. merge 1:1 patient_id using ./output/`x'_nockd_complete
  5. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  6. local baseline_ckd_`x' = round(r(N),5)
  7. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  8. local none_ckd_`x' = round(r(N),5)
  9. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 10. local ckd3_ckd_`x' = round(r(N),5)
 11. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 12. local ckd4_ckd_`x' = round(r(N),5)
 13. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 14. local dialysis_ckd_`x' = round(r(N),5)
 15. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 16. local kt_ckd_`x' = round(r(N),5)
 17. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 18. local deceased_ckd_`x' = round(r(N),5)
 19. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1
 20. local cardio_ckd_`x' = round(r(N),5)
 21. 
. **No CKD
. *Number of people without CKD at the beginning of each year
. qui safecount if ckd_group==0
 22. local baseline_nockd_`x' = round(r(N),5)
 23. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==0
 24. local none_nockd_`x' = round(r(N),5)
 25. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==1
 26. local ckd3_nockd_`x' = round(r(N),5)
 27. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==2
 28. local ckd4_nockd_`x' = round(r(N),5)
 29. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==3
 30. local dialysis_nockd_`x' = round(r(N),5)
 31. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==4
 32. local kt_nockd_`x' = round(r(N),5)
 33. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==6
 34. local deceased_nockd_`x' = round(r(N),5)
 35. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==0
 36. local cardio_nockd_`x' = round(r(N),5)
 37. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 38. local baseline_ckd2_`x' = round(r(N),5)
 39. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 40. local none_ckd2_`x' = round(r(N),5)
 41. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 42. local ckd3_ckd2_`x' = round(r(N),5)
 43. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 44. local ckd4_ckd2_`x' = round(r(N),5)
 45. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 46. local dialysis_ckd2_`x' = round(r(N),5)
 47. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 48. local kt_ckd2_`x' = round(r(N),5)
 49. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 50. local deceased_ckd2_`x' = round(r(N),5)
 51. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==1
 52. local cardio_ckd2_`x' = round(r(N),5)
 53. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 54. local baseline_ckd3_`x' = round(r(N),5)
 55. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 56. local none_ckd3_`x' = round(r(N),5)
 57. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 58. local ckd4_ckd3_`x' = round(r(N),5)
 59. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 60. local dialysis_ckd3_`x' = round(r(N),5)
 61. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 62. local kt_ckd3_`x' = round(r(N),5)
 63. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 64. local deceased_ckd3_`x' = round(r(N),5)
 65. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==2
 66. local cardio_ckd3_`x' = round(r(N),5)
 67. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 68. local baseline_ckd4_`x' = round(r(N),5)
 69. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 70. local none_ckd4_`x' = round(r(N),5)
 71. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 72. local dialysis_ckd4_`x' = round(r(N),5)
 73. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 74. local kt_ckd4_`x' = round(r(N),5)
 75. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 76. local deceased_ckd4_`x' = round(r(N),5)
 77. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==3
 78. local cardio_ckd4_`x' = round(r(N),5)
 79. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 80. local baseline_dialysis_`x' = round(r(N),5)
 81. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 82. local none_dialysis_`x' = round(r(N),5)
 83. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 84. local kt_dialysis_`x' = round(r(N),5)
 85. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 86. local deceased_dialysis_`x' = round(r(N),5)
 87. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==4
 88. local cardio_dialysis_`x' = round(r(N),5)
 89. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 90. local baseline_kt_`x' = round(r(N),5)
 91. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 92. local none_kt_`x' = round(r(N),5)
 93. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 94. local dialysis_kt_`x' = round(r(N),5)
 95. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 96. local deceased_kt_`x' = round(r(N),5)
 97. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==5
 98. local cardio_kt_`x' = round(r(N),5)
 99. }
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------

. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("All") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`baseline_
> ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _tab (`dial
> ysis_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _tab (`dece
> ased_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Cardiovascular admission") _tab (`cardio_ckd_2017') _tab (`cardio_ckd_2018') _tab (`cardio_ckd_2019') _tab (`cardio_ckd_2020') _tab (`cardio_ckd_2021') _tab 
> (`cardio_ckd_2022') _n

. 
. *No CKD
. file write tablecontent ("All") _tab ("No CKD") _tab ("N/A") _tab (`baseline_nockd_2017') _tab (`baseline_nockd_2018') _tab (`baseline_nockd_2019') _tab (`baseline_nockd_2020') _tab (`baseline_nockd_2021') _tab (`
> baseline_nockd_2022') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("No progression") _tab (`none_nockd_2017') _tab (`none_nockd_2018') _tab (`none_nockd_2019') _tab (`none_nockd_2020') _tab (`none_nockd_2021') _tab (`none_nock
> d_2022') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("CKD stage 3") _tab (`ckd3_nockd_2017') _tab (`ckd3_nockd_2018') _tab (`ckd3_nockd_2019') _tab (`ckd3_nockd_2020') _tab (`ckd3_nockd_2021') _tab (`ckd3_nockd_2
> 022') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("CKD stage 4/5") _tab (`ckd4_nockd_2017') _tab (`ckd4_nockd_2018') _tab (`ckd4_nockd_2019') _tab (`ckd4_nockd_2020') _tab (`ckd4_nockd_2021') _tab (`ckd4_nockd
> _2022') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("Dialysis") _tab (`dialysis_nockd_2017') _tab (`dialysis_nockd_2018') _tab (`dialysis_nockd_2019') _tab (`dialysis_nockd_2020') _tab (`dialysis_nockd_2021') _t
> ab (`dialysis_nockd_2022') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("Transplant") _tab (`kt_nockd_2017') _tab (`kt_nockd_2018') _tab (`kt_nockd_2019') _tab (`kt_nockd_2020') _tab (`kt_nockd_2021') _tab (`kt_nockd_2022') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("Deceased") _tab (`deceased_nockd_2017') _tab (`deceased_nockd_2018') _tab (`deceased_nockd_2019') _tab (`deceased_nockd_2020') _tab (`deceased_nockd_2021') _t
> ab (`deceased_nockd_2022') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("Cardiovascular admission") _tab (`cardio_nockd_2017') _tab (`cardio_nockd_2018') _tab (`cardio_nockd_2019') _tab (`cardio_nockd_2020') _tab (`cardio_nockd_202
> 1') _tab (`cardio_nockd_2022') _n

. 
. *eGFR >60 with albuminuria
. file write tablecontent ("All") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') _tab (`
> baseline_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (`none_ckd2
> _2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ckd3_ckd2_20
> 22') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`ckd4_ckd2_
> 2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2_2021') _t
> ab (`dialysis_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2_2021') _t
> ab (`deceased_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Cardiovascular admission") _tab (`cardio_ckd2_2017') _tab (`cardio_ckd2_2018') _tab (`cardio_ckd2_2019') _tab (`cardio_ckd2_2020') _tab (`cardio_ckd2_202
> 1') _tab (`cardio_ckd2_2022') _n

. 
. *CKD stage 3
. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') _tab (`
> baseline_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (`none_ckd3
> _2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`ckd4_ckd3_
> 2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3_2021') _t
> ab (`dialysis_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3_2021') _t
> ab (`deceased_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Cardiovascular admission") _tab (`cardio_ckd3_2017') _tab (`cardio_ckd3_2018') _tab (`cardio_ckd3_2019') _tab (`cardio_ckd3_2020') _tab (`cardio_ckd3_202
> 1') _tab (`cardio_ckd3_2022') _n

. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021') _tab 
> (`baseline_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab (`none_ck
> d4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ckd4_2021') 
> _tab (`dialysis_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ckd4_2021') 
> _tab (`deceased_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Cardiovascular admission") _tab (`cardio_ckd4_2017') _tab (`cardio_ckd4_2018') _tab (`cardio_ckd4_2019') _tab (`cardio_ckd4_2020') _tab (`cardio_ckd4_2
> 021') _tab (`cardio_ckd4_2022') _n

. 
. *Dialysis
. file write tablecontent ("All") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline_dialys
> is_2021') _tab (`baseline_dialysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialysis_2021')
>  _tab (`none_dialysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _tab (`kt_dia
> lysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`deceased_d
> ialysis_2021') _tab (`deceased_dialysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Cardiovascular admission") _tab (`cardio_dialysis_2017') _tab (`cardio_dialysis_2018') _tab (`cardio_dialysis_2019') _tab (`cardio_dialysis_2020') _tab (`ca
> rdio_dialysis_2021') _tab (`cardio_dialysis_2022') _n

. 
. *Kidney Transplant
. file write tablecontent ("All") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`baseline_kt
> _2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _tab (`dialys
> is_kt_2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _tab (`deceas
> ed_kt_2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Cardiovascular admission") _tab (`cardio_kt_2017') _tab (`cardio_kt_2018') _tab (`cardio_kt_2019') _tab (`cardio_kt_2020') _tab (`cardio_kt_2021') _tab (`
> cardio_kt_2022') _n

. 
. 
. forvalues i=1/6 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. drop _merge
  5. merge 1:1 patient_id using ./output/`x'_nockd_complete
  6. local label`i': label ethnicity `i'
  7. drop if ethnicity!=`i'
  8. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  9. local baseline_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
 11. local none_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 13. local ckd3_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 15. local ckd4_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 17. local dialysis_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 19. local kt_ckd_`x' = round(r(N),5)
 20. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 21. local deceased_ckd_`x' = round(r(N),5)
 22. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1
 23. local cardio_ckd_`x' = round(r(N),5)
 24. 
. **No CKD
. *Number of people without CKD at the beginning of each year
. qui safecount if ckd_group==0
 25. local baseline_nockd_`x' = round(r(N),5)
 26. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==0
 27. local none_nockd_`x' = round(r(N),5)
 28. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==1
 29. local ckd3_nockd_`x' = round(r(N),5)
 30. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==2
 31. local ckd4_nockd_`x' = round(r(N),5)
 32. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==3
 33. local dialysis_nockd_`x' = round(r(N),5)
 34. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==4
 35. local kt_nockd_`x' = round(r(N),5)
 36. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==6
 37. local deceased_nockd_`x' = round(r(N),5)
 38. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==0
 39. local cardio_nockd_`x' = round(r(N),5)
 40. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 41. local baseline_ckd2_`x' = round(r(N),5)
 42. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 43. local none_ckd2_`x' = round(r(N),5)
 44. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 45. local ckd3_ckd2_`x' = round(r(N),5)
 46. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 47. local ckd4_ckd2_`x' = round(r(N),5)
 48. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 49. local dialysis_ckd2_`x' = round(r(N),5)
 50. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 51. local kt_ckd2_`x' = round(r(N),5)
 52. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 53. local deceased_ckd2_`x' = round(r(N),5)
 54. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==1
 55. local cardio_ckd2_`x' = round(r(N),5)
 56. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 57. local baseline_ckd3_`x' = round(r(N),5)
 58. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 59. local none_ckd3_`x' = round(r(N),5)
 60. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 61. local ckd4_ckd3_`x' = round(r(N),5)
 62. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 63. local dialysis_ckd3_`x' = round(r(N),5)
 64. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 65. local kt_ckd3_`x' = round(r(N),5)
 66. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 67. local deceased_ckd3_`x' = round(r(N),5)
 68. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==2
 69. local cardio_ckd3_`x' = round(r(N),5)
 70. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 71. local baseline_ckd4_`x' = round(r(N),5)
 72. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 73. local none_ckd4_`x' = round(r(N),5)
 74. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 75. local dialysis_ckd4_`x' = round(r(N),5)
 76. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 77. local kt_ckd4_`x' = round(r(N),5)
 78. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 79. local deceased_ckd4_`x' = round(r(N),5)
 80. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==3
 81. local cardio_ckd4_`x' = round(r(N),5)
 82. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 83. local baseline_dialysis_`x' = round(r(N),5)
 84. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 85. local none_dialysis_`x' = round(r(N),5)
 86. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 87. local kt_dialysis_`x' = round(r(N),5)
 88. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 89. local deceased_dialysis_`x' = round(r(N),5)
 90. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==4
 91. local cardio_dialysis_`x' = round(r(N),5)
 92. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 93. local baseline_kt_`x' = round(r(N),5)
 94. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 95. local none_kt_`x' = round(r(N),5)
 96. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 97. local dialysis_kt_`x' = round(r(N),5)
 98. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 99. local deceased_kt_`x' = round(r(N),5)
100. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==5
101. local cardio_kt_`x' = round(r(N),5)
102. }
103. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
104. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
105. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
106. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
107. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
108. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
109. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
110. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Cardiovascular admission") _tab (`cardio_ckd_2017') _tab (`cardio_ckd_2018') _tab (`cardio_ckd_2019') _tab (`cardio_ckd_2020') _tab (`cardio_ckd_20
> 21') _tab (`cardio_ckd_2022') _n
111. 
. *No CKD
. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("N/A") _tab (`baseline_nockd_2017') _tab (`baseline_nockd_2018') _tab (`baseline_nockd_2019') _tab (`baseline_nockd_2020') _tab (`baseline_nockd_2021') 
> _tab (`baseline_nockd_2022') _n
112. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("No progression") _tab (`none_nockd_2017') _tab (`none_nockd_2018') _tab (`none_nockd_2019') _tab (`none_nockd_2020') _tab (`none_nockd_2021') _tab (
> `none_nockd_2022') _n
113. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 3") _tab (`ckd3_nockd_2017') _tab (`ckd3_nockd_2018') _tab (`ckd3_nockd_2019') _tab (`ckd3_nockd_2020') _tab (`ckd3_nockd_2021') _tab (`ck
> d3_nockd_2022') _n
114. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 4/5") _tab (`ckd4_nockd_2017') _tab (`ckd4_nockd_2018') _tab (`ckd4_nockd_2019') _tab (`ckd4_nockd_2020') _tab (`ckd4_nockd_2021') _tab (`
> ckd4_nockd_2022') _n
115. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Dialysis") _tab (`dialysis_nockd_2017') _tab (`dialysis_nockd_2018') _tab (`dialysis_nockd_2019') _tab (`dialysis_nockd_2020') _tab (`dialysis_nockd
> _2021') _tab (`dialysis_nockd_2022') _n
116. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Transplant") _tab (`kt_nockd_2017') _tab (`kt_nockd_2018') _tab (`kt_nockd_2019') _tab (`kt_nockd_2020') _tab (`kt_nockd_2021') _tab (`kt_nockd_2022
> ') _n
117. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Deceased") _tab (`deceased_nockd_2017') _tab (`deceased_nockd_2018') _tab (`deceased_nockd_2019') _tab (`deceased_nockd_2020') _tab (`deceased_nockd
> _2021') _tab (`deceased_nockd_2022') _n
118. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Cardiovascular admission") _tab (`cardio_nockd_2017') _tab (`cardio_nockd_2018') _tab (`cardio_nockd_2019') _tab (`cardio_nockd_2020') _tab (`cardio
> _nockd_2021') _tab (`cardio_nockd_2022') _n
119. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
120. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
121. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
122. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
123. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
124. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
125. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
126. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Cardiovascular admission") _tab (`cardio_ckd2_2017') _tab (`cardio_ckd2_2018') _tab (`cardio_ckd2_2019') _tab (`cardio_ckd2_2020') _tab (`cardi
> o_ckd2_2021') _tab (`cardio_ckd2_2022') _n
127. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
128. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
129. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
130. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
131. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
132. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
133. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Cardiovascular admission") _tab (`cardio_ckd3_2017') _tab (`cardio_ckd3_2018') _tab (`cardio_ckd3_2019') _tab (`cardio_ckd3_2020') _tab (`cardi
> o_ckd3_2021') _tab (`cardio_ckd3_2022') _n
134. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
135. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
136. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
137. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
138. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
139. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Cardiovascular admission") _tab (`cardio_ckd4_2017') _tab (`cardio_ckd4_2018') _tab (`cardio_ckd4_2019') _tab (`cardio_ckd4_2020') _tab (`car
> dio_ckd4_2021') _tab (`cardio_ckd4_2022') _n
140. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
141. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
142. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
143. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
144. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Cardiovascular admission") _tab (`cardio_dialysis_2017') _tab (`cardio_dialysis_2018') _tab (`cardio_dialysis_2019') _tab (`cardio_dialysis_2020')
>  _tab (`cardio_dialysis_2021') _tab (`cardio_dialysis_2022') _n
145. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
146. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
147. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
148. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
149. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Cardiovascular admission") _tab (`cardio_kt_2017') _tab (`cardio_kt_2018') _tab (`cardio_kt_2019') _tab (`cardio_kt_2020') _tab (`cardio_kt_2021
> ') _tab (`cardio_kt_2022') _n
150. }
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,318 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,262 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,303 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,308 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,336 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,275 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,103 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,021 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,166 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,090 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,162 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,033 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,111 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,034 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,181 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,103 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,171 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,019 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,115 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,015 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,179 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,103 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,140 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,029 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,108 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,016 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,192 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,115 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,156 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(3,049 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,455 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,337 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,444 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,436 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,435 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,355 observations deleted)

. 
. forvalues i=1/5 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. drop _merge
  5. merge 1:1 patient_id using ./output/`x'_nockd_complete
  6. local label`i': label imd `i'
  7. drop if imd!=`i'
  8. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  9. local baseline_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
 11. local none_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 13. local ckd3_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 15. local ckd4_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 17. local dialysis_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 19. local kt_ckd_`x' = round(r(N),5)
 20. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 21. local deceased_ckd_`x' = round(r(N),5)
 22. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1
 23. local cardio_ckd_`x' = round(r(N),5)
 24. 
. **No CKD
. *Number of people without CKD at the beginning of each year
. qui safecount if ckd_group==0
 25. local baseline_nockd_`x' = round(r(N),5)
 26. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==0
 27. local none_nockd_`x' = round(r(N),5)
 28. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==1
 29. local ckd3_nockd_`x' = round(r(N),5)
 30. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==2
 31. local ckd4_nockd_`x' = round(r(N),5)
 32. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==3
 33. local dialysis_nockd_`x' = round(r(N),5)
 34. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==4
 35. local kt_nockd_`x' = round(r(N),5)
 36. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==6
 37. local deceased_nockd_`x' = round(r(N),5)
 38. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==0
 39. local cardio_nockd_`x' = round(r(N),5)
 40. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 41. local baseline_ckd2_`x' = round(r(N),5)
 42. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 43. local none_ckd2_`x' = round(r(N),5)
 44. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 45. local ckd3_ckd2_`x' = round(r(N),5)
 46. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 47. local ckd4_ckd2_`x' = round(r(N),5)
 48. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 49. local dialysis_ckd2_`x' = round(r(N),5)
 50. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 51. local kt_ckd2_`x' = round(r(N),5)
 52. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 53. local deceased_ckd2_`x' = round(r(N),5)
 54. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==1
 55. local cardio_ckd2_`x' = round(r(N),5)
 56. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 57. local baseline_ckd3_`x' = round(r(N),5)
 58. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 59. local none_ckd3_`x' = round(r(N),5)
 60. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 61. local ckd4_ckd3_`x' = round(r(N),5)
 62. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 63. local dialysis_ckd3_`x' = round(r(N),5)
 64. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 65. local kt_ckd3_`x' = round(r(N),5)
 66. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 67. local deceased_ckd3_`x' = round(r(N),5)
 68. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==2
 69. local cardio_ckd3_`x' = round(r(N),5)
 70. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 71. local baseline_ckd4_`x' = round(r(N),5)
 72. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 73. local none_ckd4_`x' = round(r(N),5)
 74. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 75. local dialysis_ckd4_`x' = round(r(N),5)
 76. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 77. local kt_ckd4_`x' = round(r(N),5)
 78. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 79. local deceased_ckd4_`x' = round(r(N),5)
 80. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==3
 81. local cardio_ckd4_`x' = round(r(N),5)
 82. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 83. local baseline_dialysis_`x' = round(r(N),5)
 84. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 85. local none_dialysis_`x' = round(r(N),5)
 86. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 87. local kt_dialysis_`x' = round(r(N),5)
 88. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 89. local deceased_dialysis_`x' = round(r(N),5)
 90. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==4
 91. local cardio_dialysis_`x' = round(r(N),5)
 92. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 93. local baseline_kt_`x' = round(r(N),5)
 94. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 95. local none_kt_`x' = round(r(N),5)
 96. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 97. local dialysis_kt_`x' = round(r(N),5)
 98. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 99. local deceased_kt_`x' = round(r(N),5)
100. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==5
101. local cardio_kt_`x' = round(r(N),5)
102. }
103. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
104. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
105. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
106. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
107. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
108. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
109. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
110. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Cardiovascular admission") _tab (`cardio_ckd_2017') _tab (`cardio_ckd_2018') _tab (`cardio_ckd_2019') _tab (`cardio_ckd_2020') _tab (`cardio_ckd_20
> 21') _tab (`cardio_ckd_2022') _n
111. 
. *No CKD
. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("N/A") _tab (`baseline_nockd_2017') _tab (`baseline_nockd_2018') _tab (`baseline_nockd_2019') _tab (`baseline_nockd_2020') _tab (`baseline_nockd_2021') 
> _tab (`baseline_nockd_2022') _n
112. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("No progression") _tab (`none_nockd_2017') _tab (`none_nockd_2018') _tab (`none_nockd_2019') _tab (`none_nockd_2020') _tab (`none_nockd_2021') _tab (
> `none_nockd_2022') _n
113. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 3") _tab (`ckd3_nockd_2017') _tab (`ckd3_nockd_2018') _tab (`ckd3_nockd_2019') _tab (`ckd3_nockd_2020') _tab (`ckd3_nockd_2021') _tab (`ck
> d3_nockd_2022') _n
114. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 4/5") _tab (`ckd4_nockd_2017') _tab (`ckd4_nockd_2018') _tab (`ckd4_nockd_2019') _tab (`ckd4_nockd_2020') _tab (`ckd4_nockd_2021') _tab (`
> ckd4_nockd_2022') _n
115. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Dialysis") _tab (`dialysis_nockd_2017') _tab (`dialysis_nockd_2018') _tab (`dialysis_nockd_2019') _tab (`dialysis_nockd_2020') _tab (`dialysis_nockd
> _2021') _tab (`dialysis_nockd_2022') _n
116. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Transplant") _tab (`kt_nockd_2017') _tab (`kt_nockd_2018') _tab (`kt_nockd_2019') _tab (`kt_nockd_2020') _tab (`kt_nockd_2021') _tab (`kt_nockd_2022
> ') _n
117. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Deceased") _tab (`deceased_nockd_2017') _tab (`deceased_nockd_2018') _tab (`deceased_nockd_2019') _tab (`deceased_nockd_2020') _tab (`deceased_nockd
> _2021') _tab (`deceased_nockd_2022') _n
118. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Cardiovascular admission") _tab (`cardio_nockd_2017') _tab (`cardio_nockd_2018') _tab (`cardio_nockd_2019') _tab (`cardio_nockd_2020') _tab (`cardio
> _nockd_2021') _tab (`cardio_nockd_2022') _n
119. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
120. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
121. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
122. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
123. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
124. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
125. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
126. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Cardiovascular admission") _tab (`cardio_ckd2_2017') _tab (`cardio_ckd2_2018') _tab (`cardio_ckd2_2019') _tab (`cardio_ckd2_2020') _tab (`cardi
> o_ckd2_2021') _tab (`cardio_ckd2_2022') _n
127. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
128. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
129. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
130. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
131. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
132. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
133. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Cardiovascular admission") _tab (`cardio_ckd3_2017') _tab (`cardio_ckd3_2018') _tab (`cardio_ckd3_2019') _tab (`cardio_ckd3_2020') _tab (`cardi
> o_ckd3_2021') _tab (`cardio_ckd3_2022') _n
134. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
135. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
136. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
137. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
138. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
139. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Cardiovascular admission") _tab (`cardio_ckd4_2017') _tab (`cardio_ckd4_2018') _tab (`cardio_ckd4_2019') _tab (`cardio_ckd4_2020') _tab (`car
> dio_ckd4_2021') _tab (`cardio_ckd4_2022') _n
140. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
141. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
142. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
143. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
144. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Cardiovascular admission") _tab (`cardio_dialysis_2017') _tab (`cardio_dialysis_2018') _tab (`cardio_dialysis_2019') _tab (`cardio_dialysis_2020')
>  _tab (`cardio_dialysis_2021') _tab (`cardio_dialysis_2022') _n
145. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
146. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
147. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
148. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
149. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Cardiovascular admission") _tab (`cardio_kt_2017') _tab (`cardio_kt_2018') _tab (`cardio_kt_2019') _tab (`cardio_kt_2020') _tab (`cardio_kt_2021
> ') _tab (`cardio_kt_2022') _n
150. }
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,610 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,498 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,633 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,600 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,636 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,495 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,609 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,533 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,659 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,521 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,609 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,512 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,566 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,547 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,620 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,591 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,614 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,536 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,596 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,455 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,661 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,609 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,621 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,559 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,587 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,515 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,599 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,603 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,640 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,506 observations deleted)

. 
. forvalues i=1/9 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. drop _merge
  5. merge 1:1 patient_id using ./output/`x'_nockd_complete
  6. local label`i': label region `i'
  7. drop if region!=`i'
  8. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  9. local baseline_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
 11. local none_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 13. local ckd3_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 15. local ckd4_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 17. local dialysis_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 19. local kt_ckd_`x' = round(r(N),5)
 20. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 21. local deceased_ckd_`x' = round(r(N),5)
 22. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1
 23. local cardio_ckd_`x' = round(r(N),5)
 24. 
. **No CKD
. *Number of people without CKD at the beginning of each year
. qui safecount if ckd_group==0
 25. local baseline_nockd_`x' = round(r(N),5)
 26. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==0
 27. local none_nockd_`x' = round(r(N),5)
 28. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==1
 29. local ckd3_nockd_`x' = round(r(N),5)
 30. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==2
 31. local ckd4_nockd_`x' = round(r(N),5)
 32. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==3
 33. local dialysis_nockd_`x' = round(r(N),5)
 34. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==4
 35. local kt_nockd_`x' = round(r(N),5)
 36. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==6
 37. local deceased_nockd_`x' = round(r(N),5)
 38. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==0
 39. local cardio_nockd_`x' = round(r(N),5)
 40. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 41. local baseline_ckd2_`x' = round(r(N),5)
 42. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 43. local none_ckd2_`x' = round(r(N),5)
 44. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 45. local ckd3_ckd2_`x' = round(r(N),5)
 46. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 47. local ckd4_ckd2_`x' = round(r(N),5)
 48. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 49. local dialysis_ckd2_`x' = round(r(N),5)
 50. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 51. local kt_ckd2_`x' = round(r(N),5)
 52. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 53. local deceased_ckd2_`x' = round(r(N),5)
 54. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==1
 55. local cardio_ckd2_`x' = round(r(N),5)
 56. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 57. local baseline_ckd3_`x' = round(r(N),5)
 58. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 59. local none_ckd3_`x' = round(r(N),5)
 60. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 61. local ckd4_ckd3_`x' = round(r(N),5)
 62. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 63. local dialysis_ckd3_`x' = round(r(N),5)
 64. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 65. local kt_ckd3_`x' = round(r(N),5)
 66. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 67. local deceased_ckd3_`x' = round(r(N),5)
 68. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==2
 69. local cardio_ckd3_`x' = round(r(N),5)
 70. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 71. local baseline_ckd4_`x' = round(r(N),5)
 72. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 73. local none_ckd4_`x' = round(r(N),5)
 74. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 75. local dialysis_ckd4_`x' = round(r(N),5)
 76. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 77. local kt_ckd4_`x' = round(r(N),5)
 78. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 79. local deceased_ckd4_`x' = round(r(N),5)
 80. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==3
 81. local cardio_ckd4_`x' = round(r(N),5)
 82. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 83. local baseline_dialysis_`x' = round(r(N),5)
 84. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 85. local none_dialysis_`x' = round(r(N),5)
 86. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 87. local kt_dialysis_`x' = round(r(N),5)
 88. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 89. local deceased_dialysis_`x' = round(r(N),5)
 90. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==4
 91. local cardio_dialysis_`x' = round(r(N),5)
 92. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 93. local baseline_kt_`x' = round(r(N),5)
 94. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 95. local none_kt_`x' = round(r(N),5)
 96. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 97. local dialysis_kt_`x' = round(r(N),5)
 98. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 99. local deceased_kt_`x' = round(r(N),5)
100. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==5
101. local cardio_kt_`x' = round(r(N),5)
102. }
103. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
104. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
105. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
106. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
107. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
108. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
109. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
110. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Cardiovascular admission") _tab (`cardio_ckd_2017') _tab (`cardio_ckd_2018') _tab (`cardio_ckd_2019') _tab (`cardio_ckd_2020') _tab (`cardio_ckd_20
> 21') _tab (`cardio_ckd_2022') _n
111. 
. *No CKD
. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("N/A") _tab (`baseline_nockd_2017') _tab (`baseline_nockd_2018') _tab (`baseline_nockd_2019') _tab (`baseline_nockd_2020') _tab (`baseline_nockd_2021') 
> _tab (`baseline_nockd_2022') _n
112. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("No progression") _tab (`none_nockd_2017') _tab (`none_nockd_2018') _tab (`none_nockd_2019') _tab (`none_nockd_2020') _tab (`none_nockd_2021') _tab (
> `none_nockd_2022') _n
113. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 3") _tab (`ckd3_nockd_2017') _tab (`ckd3_nockd_2018') _tab (`ckd3_nockd_2019') _tab (`ckd3_nockd_2020') _tab (`ckd3_nockd_2021') _tab (`ck
> d3_nockd_2022') _n
114. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 4/5") _tab (`ckd4_nockd_2017') _tab (`ckd4_nockd_2018') _tab (`ckd4_nockd_2019') _tab (`ckd4_nockd_2020') _tab (`ckd4_nockd_2021') _tab (`
> ckd4_nockd_2022') _n
115. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Dialysis") _tab (`dialysis_nockd_2017') _tab (`dialysis_nockd_2018') _tab (`dialysis_nockd_2019') _tab (`dialysis_nockd_2020') _tab (`dialysis_nockd
> _2021') _tab (`dialysis_nockd_2022') _n
116. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Transplant") _tab (`kt_nockd_2017') _tab (`kt_nockd_2018') _tab (`kt_nockd_2019') _tab (`kt_nockd_2020') _tab (`kt_nockd_2021') _tab (`kt_nockd_2022
> ') _n
117. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Deceased") _tab (`deceased_nockd_2017') _tab (`deceased_nockd_2018') _tab (`deceased_nockd_2019') _tab (`deceased_nockd_2020') _tab (`deceased_nockd
> _2021') _tab (`deceased_nockd_2022') _n
118. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Cardiovascular admission") _tab (`cardio_nockd_2017') _tab (`cardio_nockd_2018') _tab (`cardio_nockd_2019') _tab (`cardio_nockd_2020') _tab (`cardio
> _nockd_2021') _tab (`cardio_nockd_2022') _n
119. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
120. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
121. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
122. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
123. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
124. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
125. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
126. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Cardiovascular admission") _tab (`cardio_ckd2_2017') _tab (`cardio_ckd2_2018') _tab (`cardio_ckd2_2019') _tab (`cardio_ckd2_2020') _tab (`cardi
> o_ckd2_2021') _tab (`cardio_ckd2_2022') _n
127. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
128. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
129. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
130. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
131. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
132. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
133. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Cardiovascular admission") _tab (`cardio_ckd3_2017') _tab (`cardio_ckd3_2018') _tab (`cardio_ckd3_2019') _tab (`cardio_ckd3_2020') _tab (`cardi
> o_ckd3_2021') _tab (`cardio_ckd3_2022') _n
134. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
135. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
136. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
137. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
138. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
139. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Cardiovascular admission") _tab (`cardio_ckd4_2017') _tab (`cardio_ckd4_2018') _tab (`cardio_ckd4_2019') _tab (`cardio_ckd4_2020') _tab (`car
> dio_ckd4_2021') _tab (`cardio_ckd4_2022') _n
140. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
141. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
142. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
143. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
144. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Cardiovascular admission") _tab (`cardio_dialysis_2017') _tab (`cardio_dialysis_2018') _tab (`cardio_dialysis_2019') _tab (`cardio_dialysis_2020')
>  _tab (`cardio_dialysis_2021') _tab (`cardio_dialysis_2022') _n
145. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
146. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
147. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
148. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
149. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Cardiovascular admission") _tab (`cardio_kt_2017') _tab (`cardio_kt_2018') _tab (`cardio_kt_2019') _tab (`cardio_kt_2020') _tab (`cardio_kt_2021
> ') _tab (`cardio_kt_2022') _n
150. }
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,822 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,950 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,906 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,957 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,834 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,944 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,823 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,973 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,935 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,974 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,822 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,589 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,508 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,629 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,553 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,625 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,510 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,915 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,838 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,958 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,923 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,943 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,843 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,952 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,829 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,960 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,885 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,923 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,842 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,894 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,826 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,947 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,886 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,958 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,820 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,890 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,832 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,973 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,932 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,972 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,864 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,922 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,820 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,995 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,891 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,945 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,855 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,885 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,798 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,959 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,937 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,943 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(2,826 observations deleted)

. 
. forvalues i=0/1 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. drop _merge
  5. merge 1:1 patient_id using ./output/`x'_nockd_complete
  6. local label`i': label urban `i'
  7. drop if urban!=`i'
  8. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  9. local baseline_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
 11. local none_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 13. local ckd3_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 15. local ckd4_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 17. local dialysis_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 19. local kt_ckd_`x' = round(r(N),5)
 20. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 21. local deceased_ckd_`x' = round(r(N),5)
 22. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1
 23. local cardio_ckd_`x' = round(r(N),5)
 24. 
. **No CKD
. *Number of people without CKD at the beginning of each year
. qui safecount if ckd_group==0
 25. local baseline_nockd_`x' = round(r(N),5)
 26. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==0
 27. local none_nockd_`x' = round(r(N),5)
 28. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==1
 29. local ckd3_nockd_`x' = round(r(N),5)
 30. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==2
 31. local ckd4_nockd_`x' = round(r(N),5)
 32. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==3
 33. local dialysis_nockd_`x' = round(r(N),5)
 34. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==4
 35. local kt_nockd_`x' = round(r(N),5)
 36. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==0 & ckd_progression==6
 37. local deceased_nockd_`x' = round(r(N),5)
 38. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==0
 39. local cardio_nockd_`x' = round(r(N),5)
 40. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 41. local baseline_ckd2_`x' = round(r(N),5)
 42. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 43. local none_ckd2_`x' = round(r(N),5)
 44. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 45. local ckd3_ckd2_`x' = round(r(N),5)
 46. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 47. local ckd4_ckd2_`x' = round(r(N),5)
 48. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 49. local dialysis_ckd2_`x' = round(r(N),5)
 50. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 51. local kt_ckd2_`x' = round(r(N),5)
 52. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 53. local deceased_ckd2_`x' = round(r(N),5)
 54. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==1
 55. local cardio_ckd2_`x' = round(r(N),5)
 56. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 57. local baseline_ckd3_`x' = round(r(N),5)
 58. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 59. local none_ckd3_`x' = round(r(N),5)
 60. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 61. local ckd4_ckd3_`x' = round(r(N),5)
 62. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 63. local dialysis_ckd3_`x' = round(r(N),5)
 64. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 65. local kt_ckd3_`x' = round(r(N),5)
 66. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 67. local deceased_ckd3_`x' = round(r(N),5)
 68. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==2
 69. local cardio_ckd3_`x' = round(r(N),5)
 70. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 71. local baseline_ckd4_`x' = round(r(N),5)
 72. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 73. local none_ckd4_`x' = round(r(N),5)
 74. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 75. local dialysis_ckd4_`x' = round(r(N),5)
 76. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 77. local kt_ckd4_`x' = round(r(N),5)
 78. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 79. local deceased_ckd4_`x' = round(r(N),5)
 80. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==3
 81. local cardio_ckd4_`x' = round(r(N),5)
 82. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 83. local baseline_dialysis_`x' = round(r(N),5)
 84. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 85. local none_dialysis_`x' = round(r(N),5)
 86. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 87. local kt_dialysis_`x' = round(r(N),5)
 88. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 89. local deceased_dialysis_`x' = round(r(N),5)
 90. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==4
 91. local cardio_dialysis_`x' = round(r(N),5)
 92. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 93. local baseline_kt_`x' = round(r(N),5)
 94. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 95. local none_kt_`x' = round(r(N),5)
 96. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 97. local dialysis_kt_`x' = round(r(N),5)
 98. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 99. local deceased_kt_`x' = round(r(N),5)
100. *Total number of people in groupw with cardiovascular admission each year
. qui safecount if cardiovascular==1 & ckd_group==5
101. local cardio_kt_`x' = round(r(N),5)
102. }
103. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
104. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
105. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
106. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
107. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
108. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
109. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
110. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Cardiovascular admission") _tab (`cardio_ckd_2017') _tab (`cardio_ckd_2018') _tab (`cardio_ckd_2019') _tab (`cardio_ckd_2020') _tab (`cardio_ckd_20
> 21') _tab (`cardio_ckd_2022') _n
111. 
. *No CKD
. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("N/A") _tab (`baseline_nockd_2017') _tab (`baseline_nockd_2018') _tab (`baseline_nockd_2019') _tab (`baseline_nockd_2020') _tab (`baseline_nockd_2021') 
> _tab (`baseline_nockd_2022') _n
112. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("No progression") _tab (`none_nockd_2017') _tab (`none_nockd_2018') _tab (`none_nockd_2019') _tab (`none_nockd_2020') _tab (`none_nockd_2021') _tab (
> `none_nockd_2022') _n
113. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 3") _tab (`ckd3_nockd_2017') _tab (`ckd3_nockd_2018') _tab (`ckd3_nockd_2019') _tab (`ckd3_nockd_2020') _tab (`ckd3_nockd_2021') _tab (`ck
> d3_nockd_2022') _n
114. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 4/5") _tab (`ckd4_nockd_2017') _tab (`ckd4_nockd_2018') _tab (`ckd4_nockd_2019') _tab (`ckd4_nockd_2020') _tab (`ckd4_nockd_2021') _tab (`
> ckd4_nockd_2022') _n
115. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Dialysis") _tab (`dialysis_nockd_2017') _tab (`dialysis_nockd_2018') _tab (`dialysis_nockd_2019') _tab (`dialysis_nockd_2020') _tab (`dialysis_nockd
> _2021') _tab (`dialysis_nockd_2022') _n
116. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Transplant") _tab (`kt_nockd_2017') _tab (`kt_nockd_2018') _tab (`kt_nockd_2019') _tab (`kt_nockd_2020') _tab (`kt_nockd_2021') _tab (`kt_nockd_2022
> ') _n
117. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Deceased") _tab (`deceased_nockd_2017') _tab (`deceased_nockd_2018') _tab (`deceased_nockd_2019') _tab (`deceased_nockd_2020') _tab (`deceased_nockd
> _2021') _tab (`deceased_nockd_2022') _n
118. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Cardiovascular admission") _tab (`cardio_nockd_2017') _tab (`cardio_nockd_2018') _tab (`cardio_nockd_2019') _tab (`cardio_nockd_2020') _tab (`cardio
> _nockd_2021') _tab (`cardio_nockd_2022') _n
119. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
120. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
121. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
122. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
123. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
124. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
125. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
126. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Cardiovascular admission") _tab (`cardio_ckd2_2017') _tab (`cardio_ckd2_2018') _tab (`cardio_ckd2_2019') _tab (`cardio_ckd2_2020') _tab (`cardi
> o_ckd2_2021') _tab (`cardio_ckd2_2022') _n
127. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
128. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
129. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
130. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
131. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
132. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
133. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Cardiovascular admission") _tab (`cardio_ckd3_2017') _tab (`cardio_ckd3_2018') _tab (`cardio_ckd3_2019') _tab (`cardio_ckd3_2020') _tab (`cardi
> o_ckd3_2021') _tab (`cardio_ckd3_2022') _n
134. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
135. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
136. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
137. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
138. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
139. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Cardiovascular admission") _tab (`cardio_ckd4_2017') _tab (`cardio_ckd4_2018') _tab (`cardio_ckd4_2019') _tab (`cardio_ckd4_2020') _tab (`car
> dio_ckd4_2021') _tab (`cardio_ckd4_2022') _n
140. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
141. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
142. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
143. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
144. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Cardiovascular admission") _tab (`cardio_dialysis_2017') _tab (`cardio_dialysis_2018') _tab (`cardio_dialysis_2019') _tab (`cardio_dialysis_2020')
>  _tab (`cardio_dialysis_2021') _tab (`cardio_dialysis_2022') _n
145. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
146. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
147. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
148. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
149. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Cardiovascular admission") _tab (`cardio_kt_2017') _tab (`cardio_kt_2018') _tab (`cardio_kt_2019') _tab (`cardio_kt_2020') _tab (`cardio_kt_2021
> ') _tab (`cardio_kt_2022') _n
150. }
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,271 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,234 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,299 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,258 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,322 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,291 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,242
        from master                     2,123  (_merge==1)
        from using                      1,119  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,971 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,137
        from master                     2,049  (_merge==1)
        from using                      1,088  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,903 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,293
        from master                     2,233  (_merge==1)
        from using                      1,060  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,994 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,231
        from master                     2,125  (_merge==1)
        from using                      1,106  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,973 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,280
        from master                     2,139  (_merge==1)
        from using                      1,141  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,958 observations deleted)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,152
        from master                     2,054  (_merge==1)
        from using                      1,098  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,861 observations deleted)

. 
. 
. file close tablecontent

. 
. **Redact counts of 0 from each column in table (adapted from code by Emily Herrett)
. clear

. import delimited ./output/ckd_progression.csv
(encoding automatically selected: ISO-8859-1)
(9 vars, 1,081 obs)

. local columns " "count_2017" "count_2018" "count_2019" "count_2020" "count_2021" "count_2022" "

. foreach col in `columns' {
  2. replace `col'=. if `col'<=5
  3. }
(273 real changes made, 273 to missing)
(280 real changes made, 280 to missing)
(252 real changes made, 252 to missing)
(267 real changes made, 267 to missing)
(290 real changes made, 290 to missing)
(274 real changes made, 274 to missing)

.         
. export delimited "./output/ckd_progression.csv", replace
file ./output/ckd_progression.csv saved

. 
end of do-file

