------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/ckd_progression_v2_dialysis.log
  log type:  text
 opened on:  20 Apr 2023, 10:17:17

. 
. cap file close tablecontent

. file open tablecontent using ./output/ckd_progression_v2_dialysis.csv, write text replace

. 
. **Column headings
. *There are two column headings for each year 2017-2023:
. *Column 1 = the number of people in each CKD group as of the beginning of each year (i.e. in April)
. *Column 2 = the number of people who remain within the same CKD group, progress to another CKD group, or die by the end of the year (i.e. by the subsequent April)
. file write tablecontent _tab _tab ("N_2017") _tab ("April_2018") _tab ("N_2018") _tab ("April_2019") _tab ("N_2019") _tab ("April_2020") _tab ("N_2020") _tab ("April_2021") _tab ("N_2021") _tab ("April_2022") _tab ("N_2022") _tab ("April_2023") _tab 
> ("N_2023") _n(2)

. 
. **Loops through datasets for each year `x' 2017-2023
. local year "2017 2018 2019 2020 2021 2022 2023"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete_v2.dta, clear
  3. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year ckd4_`x'
. qui safecount if ckd_group==3
  4. local baseline_ckd4_`x' = round(r(N),5)
  5. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
  6. local none_ckd4_`x' = round(r(N),5)
  7. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
  8. local dialysis_ckd4_`x' = round(r(N),5)
  9. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 10. local kt_ckd4_`x' = round(r(N),5)
 11. *Number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==5
 12. local unclear_ckd4_`x' = round(r(N),5)
 13. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 14. local deceased_ckd4_`x' = round(r(N),5)
 15. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year dialysis_`x'
. qui safecount if ckd_group==4
 16. local baseline_dialysis_`x' = round(r(N),5)
 17. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 18. local none_dialysis_`x' = round(r(N),5)
 19. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 20. local kt_dialysis_`x' = round(r(N),5)
 21. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 22. local deceased_dialysis_`x' = round(r(N),5)
 23. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year kt_`x'
. qui safecount if ckd_group==5
 24. local baseline_kt_`x' = round(r(N),5)
 25. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 26. local none_kt_`x' = round(r(N),5)
 27. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 28. local dialysis_kt_`x' = round(r(N),5)
 29. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 30. local deceased_kt_`x' = round(r(N),5)
 31. 
. **KRT unclear modality
. *Number of people in group (baseline_unclear_`x') at the beginning of each year unclear_`x'
. qui safecount if ckd_group==6
 32. local baseline_unclear_`x' = round(r(N),5)
 33. *Number of people in group remaining in group by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==0
 34. local none_unclear_`x' = round(r(N),5)
 35. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==3
 36. local dialysis_unclear_`x' = round(r(N),5)
 37. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==4
 38. local kt_unclear_`x' = round(r(N),5)
 39. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==6
 40. local deceased_unclear_`x' = round(r(N),5)
 41. }

. 
. **Populate table with redacted counts
. *CKD stage 4/5 without KRT
. file write tablecontent ("CKD stage 4/5") _tab _tab (`baseline_ckd4_2017') _tab _tab (`baseline_ckd4_2018') _tab _tab (`baseline_ckd4_2019') _tab _tab (`baseline_ckd4_2020') _tab _tab (`baseline_ckd4_2021') _tab _tab (`baseline_ckd4_2022') _tab _tab 
> (`baseline_ckd4_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd4_2017') _tab _tab (`none_ckd4_2018') _tab _tab (`none_ckd4_2019') _tab _tab (`none_ckd4_2020') _tab _tab (`none_ckd4_2021') _tab _tab (`none_ckd4_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd4_2017') _tab _tab (`dialysis_ckd4_2018') _tab _tab (`dialysis_ckd4_2019') _tab _tab (`dialysis_ckd4_2020') _tab _tab (`dialysis_ckd4_2021') _tab _tab (`dialysis_ckd4_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd4_2017') _tab _tab (`kt_ckd4_2018') _tab _tab (`kt_ckd4_2019') _tab _tab (`kt_ckd4_2020') _tab _tab (`kt_ckd4_2021') _tab _tab (`kt_ckd4_2022') _n

. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd4_2017') _tab _tab (`unclear_ckd4_2018') _tab _tab (`unclear_ckd4_2019') _tab _tab (`unclear_ckd4_2020') _tab _tab (`unclear_ckd4_2021') _tab _tab (`unclear_ckd4_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd4_2017') _tab _tab (`deceased_ckd4_2018') _tab _tab (`deceased_ckd4_2019') _tab _tab (`deceased_ckd4_2020') _tab _tab (`deceased_ckd4_2021') _tab _tab (`deceased_ckd4_2022') _n(2)

. 
. *Dialysis
. file write tablecontent ("Dialysis") _tab _tab (`baseline_dialysis_2017') _tab _tab (`baseline_dialysis_2018') _tab _tab (`baseline_dialysis_2019') _tab _tab (`baseline_dialysis_2020') _tab _tab (`baseline_dialysis_2021') _tab _tab (`baseline_dialysi
> s_2022') _tab _tab (`baseline_dialysis_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_dialysis_2017') _tab _tab (`none_dialysis_2018') _tab _tab (`none_dialysis_2019') _tab _tab (`none_dialysis_2020') _tab _tab (`none_dialysis_2021') _tab _tab (`none_dialysis_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_dialysis_2017') _tab _tab (`kt_dialysis_2018') _tab _tab (`kt_dialysis_2019') _tab _tab (`kt_dialysis_2020') _tab _tab (`kt_dialysis_2021') _tab _tab (`kt_dialysis_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_dialysis_2017') _tab _tab (`deceased_dialysis_2018') _tab _tab (`deceased_dialysis_2019') _tab _tab (`deceased_dialysis_2020') _tab _tab (`deceased_dialysis_2021') _tab _tab (`deceased_di
> alysis_2022') _n(2)

. 
. *Kidney Transplant
. file write tablecontent ("Transplant") _tab _tab (`baseline_kt_2017') _tab _tab (`baseline_kt_2018') _tab _tab (`baseline_kt_2019') _tab _tab (`baseline_kt_2020') _tab _tab (`baseline_kt_2021') _tab _tab (`baseline_kt_2022') _tab _tab (`baseline_kt_2
> 023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_kt_2017') _tab _tab (`none_kt_2018') _tab _tab (`none_kt_2019') _tab _tab (`none_kt_2020') _tab _tab (`none_kt_2021') _tab _tab (`none_kt_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_kt_2017') _tab _tab (`dialysis_kt_2018') _tab _tab (`dialysis_kt_2019') _tab _tab (`dialysis_kt_2020') _tab _tab (`dialysis_kt_2021') _tab _tab (`dialysis_kt_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_kt_2017') _tab _tab (`deceased_kt_2018') _tab _tab (`deceased_kt_2019') _tab _tab (`deceased_kt_2020') _tab _tab (`deceased_kt_2021') _tab _tab (`deceased_kt_2022') _n(2)

. 
. *KRT unclear modality
. file write tablecontent ("KRT unclear") _tab _tab (`baseline_unclear_2017') _tab _tab (`baseline_unclear_2018') _tab _tab (`baseline_unclear_2019') _tab _tab (`baseline_unclear_2020') _tab _tab (`baseline_unclear_2021') _tab _tab (`baseline_unclear_2
> 022') _tab _tab (`baseline_unclear_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_unclear_2017') _tab _tab (`none_unclear_2018') _tab _tab (`none_unclear_2019') _tab _tab (`none_unclear_2020') _tab _tab (`none_unclear_2021') _tab _tab (`none_unclear_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_unclear_2017') _tab _tab (`dialysis_unclear_2018') _tab _tab (`dialysis_unclear_2019') _tab _tab (`dialysis_unclear_2020') _tab _tab (`dialysis_unclear_2021') _tab _tab (`dialysis_unclear
> _2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_unclear_2017') _tab _tab (`kt_unclear_2018') _tab _tab (`kt_unclear_2019') _tab _tab (`kt_unclear_2020') _tab _tab (`kt_unclear_2021') _tab _tab (`kt_unclear_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_unclear_2017') _tab _tab (`deceased_unclear_2018') _tab _tab (`deceased_unclear_2019') _tab _tab (`deceased_unclear_2020') _tab _tab (`deceased_unclear_2021') _tab _tab (`deceased_unclear
> _2022')

. 
. file close tablecontent

. 
. **Redact counts of 0 from each column in table (adapted from code by Emily Herrett)
. clear

. import delimited ./output/ckd_progression_v2_dialysis.csv
(encoding automatically selected: ISO-8859-1)
(15 vars, 19 obs)

. local columns " "n_2017" "april_2018" "n_2018" "april_2019" "n_2019" "april_2020" "n_2020" "april_2021" "n_2021" "april_2022" "n_2022" "april_2023" "n_2023" "

. foreach col in `columns' {
  2. replace `col'=. if `col'<=5
  3. }
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(3 real changes made, 3 to missing)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)

.         
. export delimited "./output/ckd_progression_v2_dialysis.csv", replace
file ./output/ckd_progression_v2_dialysis.csv saved

. 
end of do-file

