------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\users\lsh1703468\documents\repo\ckd-healthcare-use\logs/ckd_progression_ethnicity.log
  log type:  text
 opened on:   2 Mar 2023, 11:00:29

. 
. cap file close tablecontent

. file open tablecontent using ./output/ckd_progression_ethnicity.csv, write text replace

. 
. **Column headings
. *There are three column headings for each year 2017-2022:
. *Column 1 = the number of people in each CKD group as of the beginning of each year (i.e. in April)
. *Column 2 = the number of people who remain within the same CKD group, progress to a more advanced CKD group, or die by the end of the year (i.e. by the subsequent April)
. *Column 3 = Column 2 as a percentage of Column 1
. file write tablecontent _tab _tab ("N_2017") _tab ("April_2018") _tab ("N_2018") _tab ("April_2019") _tab ("N_2019") _tab ("April_2020") _tab ("N_2020") _tab ("April_2021") _tab ("N_2021") _tab ("April_2022") _tab ("N_2022") _tab ("April_2023") _n(2)

. 
. **Loops through datasets for each year `x' 2017-2022
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. forvalues ethnicity = 1/6 {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. *CKD stage 3 and above only
. drop if ckd_group==1
  5. drop if ethnicity !=`ethnicity'
  6. **Overall
. qui safecount
  7. local baseline_ckd_`x'`ethnicity' = round(r(N),5)
  8. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  9. local none_ckd_`x'`ethnicity' = round(r(N),5)
 10. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 11. local ckd4_ckd_`x'`ethnicity' = round(r(N),5)
 12. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 13. local dialysis_ckd_`x'`ethnicity' = round(r(N),5)
 14. *Total number of people in group who progress to kidney kt by the end of the year
. qui safecount if ckd_progression==4
 15. local kt_ckd_`x'`ethnicity' = round(r(N),5)
 16. *Total number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_progression==5
 17. local unclear_ckd_`x'`ethnicity' = round(r(N),5)
 18. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 19. local deceased_ckd_`x'`ethnicity' = round(r(N),5)
 20. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x'`ethnicity') at the beginning of each year ckd3_`x'`ethnicity'
. qui safecount if ckd_group==2
 21. local baseline_ckd3_`x'`ethnicity' = round(r(N),5)
 22. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 23. local none_ckd3_`x'`ethnicity' = round(r(N),5)
 24. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 25. local ckd4_ckd3_`x'`ethnicity' = round(r(N),5)
 26. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 27. local dialysis_ckd3_`x'`ethnicity' = round(r(N),5)
 28. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 29. local kt_ckd3_`x'`ethnicity' = round(r(N),5)
 30. *Number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==5
 31. local unclear_ckd3_`x'`ethnicity' = round(r(N),5)
 32. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 33. local deceased_ckd3_`x'`ethnicity' = round(r(N),5)
 34. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x'`ethnicity') at the beginning of each year ckd4_`x'`ethnicity'
. qui safecount if ckd_group==3
 35. local baseline_ckd4_`x'`ethnicity' = round(r(N),5)
 36. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 37. local none_ckd4_`x'`ethnicity' = round(r(N),5)
 38. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 39. local dialysis_ckd4_`x'`ethnicity' = round(r(N),5)
 40. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 41. local kt_ckd4_`x'`ethnicity' = round(r(N),5)
 42. *Number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==5
 43. local unclear_ckd4_`x'`ethnicity' = round(r(N),5)
 44. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 45. local deceased_ckd4_`x'`ethnicity' = round(r(N),5)
 46. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x'`ethnicity') at the beginning of each year dialysis_`x'`ethnicity'
. qui safecount if ckd_group==4
 47. local baseline_dialysis_`x'`ethnicity' = round(r(N),5)
 48. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 49. local none_dialysis_`x'`ethnicity' = round(r(N),5)
 50. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 51. local kt_dialysis_`x'`ethnicity' = round(r(N),5)
 52. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 53. local deceased_dialysis_`x'`ethnicity' = round(r(N),5)
 54. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x'`ethnicity') at the beginning of each year kt_`x'`ethnicity'
. qui safecount if ckd_group==5
 55. local baseline_kt_`x'`ethnicity' = round(r(N),5)
 56. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 57. local none_kt_`x'`ethnicity' = round(r(N),5)
 58. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 59. local dialysis_kt_`x'`ethnicity' = round(r(N),5)
 60. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 61. local deceased_kt_`x'`ethnicity' = round(r(N),5)
 62. 
. **KRT unclear modality
. *Number of people in group (baseline_unclear_`x'`ethnicity') at the beginning of each year unclear_`x'`ethnicity'
. qui safecount if ckd_group==6
 63. local baseline_unclear_`x'`ethnicity' = round(r(N),5)
 64. *Number of people in group remaining in group by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==0
 65. local none_unclear_`x'`ethnicity' = round(r(N),5)
 66. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==3
 67. local dialysis_unclear_`x'`ethnicity' = round(r(N),5)
 68. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==4
 69. local kt_unclear_`x'`ethnicity' = round(r(N),5)
 70. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==6
 71. local deceased_unclear_`x'`ethnicity' = round(r(N),5)
 72. }
 73. }
(1,276 observations deleted)
(330 observations deleted)
(1,276 observations deleted)
(775 observations deleted)
(1,276 observations deleted)
(763 observations deleted)
(1,276 observations deleted)
(778 observations deleted)
(1,276 observations deleted)
(761 observations deleted)
(1,276 observations deleted)
(598 observations deleted)
(1,343 observations deleted)
(306 observations deleted)
(1,343 observations deleted)
(726 observations deleted)
(1,343 observations deleted)
(735 observations deleted)
(1,343 observations deleted)
(736 observations deleted)
(1,343 observations deleted)
(737 observations deleted)
(1,343 observations deleted)
(565 observations deleted)
(1,276 observations deleted)
(369 observations deleted)
(1,276 observations deleted)
(837 observations deleted)
(1,276 observations deleted)
(837 observations deleted)
(1,276 observations deleted)
(834 observations deleted)
(1,276 observations deleted)
(832 observations deleted)
(1,276 observations deleted)
(646 observations deleted)
(1,257 observations deleted)
(326 observations deleted)
(1,257 observations deleted)
(809 observations deleted)
(1,257 observations deleted)
(812 observations deleted)
(1,257 observations deleted)
(811 observations deleted)
(1,257 observations deleted)
(807 observations deleted)
(1,257 observations deleted)
(635 observations deleted)
(1,323 observations deleted)
(309 observations deleted)
(1,323 observations deleted)
(800 observations deleted)
(1,323 observations deleted)
(806 observations deleted)
(1,323 observations deleted)
(803 observations deleted)
(1,323 observations deleted)
(804 observations deleted)
(1,323 observations deleted)
(633 observations deleted)
(1,281 observations deleted)
(311 observations deleted)
(1,281 observations deleted)
(758 observations deleted)
(1,281 observations deleted)
(765 observations deleted)
(1,281 observations deleted)
(766 observations deleted)
(1,281 observations deleted)
(763 observations deleted)
(1,281 observations deleted)
(617 observations deleted)

. **Populate table with redacted counts
. forvalues ethnicity = 1/6 {
  2. local lab0: label ethnicity `ethnicity'
  3. file write tablecontent ("`lab0'") _n(2)
  4. 
. *Overall
. file write tablecontent ("All CKD groups") _tab _tab (`baseline_ckd_2017`ethnicity'') _tab _tab (`baseline_ckd_2018`ethnicity'') _tab _tab (`baseline_ckd_2019`ethnicity'') _tab _tab (`baseline_ckd_2020`ethnicity'') _tab _tab (`baseline_ckd_2021`ethni
> city'') _tab _tab (`baseline_ckd_2022`ethnicity'') _n(2)
  5. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd_2017`ethnicity'') _tab _tab (`none_ckd_2018`ethnicity'') _tab _tab (`none_ckd_2019`ethnicity'') _tab _tab (`none_ckd_2020`ethnicity'') _tab _tab (`none_ckd_2021`ethnicity'') _tab
>  _tab (`none_ckd_2022`ethnicity'') _n
  6. file write tablecontent _tab ("CKD stage 4/5") _tab _tab (`ckd4_ckd_2017`ethnicity'') _tab _tab (`ckd4_ckd_2018`ethnicity'') _tab _tab (`ckd4_ckd_2019`ethnicity'') _tab _tab (`ckd4_ckd_2020`ethnicity'') _tab _tab (`ckd4_ckd_2021`ethnicity'') _tab 
> _tab (`ckd4_ckd_2022`ethnicity'') _n
  7. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd_2017`ethnicity'') _tab _tab (`dialysis_ckd_2018`ethnicity'') _tab _tab (`dialysis_ckd_2019`ethnicity'') _tab _tab (`dialysis_ckd_2020`ethnicity'') _tab _tab (`dialysis_ckd_2021`eth
> nicity'') _tab _tab (`dialysis_ckd_2022`ethnicity'') _n
  8. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd_2017`ethnicity'') _tab _tab (`kt_ckd_2018`ethnicity'') _tab _tab (`kt_ckd_2019`ethnicity'') _tab _tab (`kt_ckd_2020`ethnicity'') _tab _tab (`kt_ckd_2021`ethnicity'') _tab _tab (`kt_ckd
> _2022`ethnicity'') _n
  9. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd_2017`ethnicity'') _tab _tab (`unclear_ckd_2018`ethnicity'') _tab _tab (`unclear_ckd_2019`ethnicity'') _tab _tab (`unclear_ckd_2020`ethnicity'') _tab _tab (`unclear_ckd_2021`ethni
> city'') _tab _tab (`unclear_ckd_2022`ethnicity'') _n
 10. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd_2017`ethnicity'') _tab _tab (`deceased_ckd_2018`ethnicity'') _tab _tab (`deceased_ckd_2019`ethnicity'') _tab _tab (`deceased_ckd_2020`ethnicity'') _tab _tab (`deceased_ckd_2021`eth
> nicity'') _tab _tab (`deceased_ckd_2022`ethnicity'') _n(2)
 11. 
. *CKD stage 3
. file write tablecontent ("CKD stage 3") _tab _tab (`baseline_ckd3_2017`ethnicity'') _tab _tab (`baseline_ckd3_2018`ethnicity'') _tab _tab (`baseline_ckd3_2019`ethnicity'') _tab _tab (`baseline_ckd3_2020`ethnicity'') _tab _tab (`baseline_ckd3_2021`eth
> nicity'') _tab _tab (`baseline_ckd3_2022`ethnicity'') _n(2)
 12. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd3_2017`ethnicity'') _tab _tab (`none_ckd3_2018`ethnicity'') _tab _tab (`none_ckd3_2019`ethnicity'') _tab _tab (`none_ckd3_2020`ethnicity'') _tab _tab (`none_ckd3_2021`ethnicity'')
>  _tab _tab (`none_ckd3_2022`ethnicity'') _n
 13. file write tablecontent _tab ("CKD stage 4/5") _tab _tab (`ckd4_ckd3_2017`ethnicity'') _tab _tab (`ckd4_ckd3_2018`ethnicity'') _tab _tab (`ckd4_ckd3_2019`ethnicity'') _tab _tab (`ckd4_ckd3_2020`ethnicity'') _tab _tab (`ckd4_ckd3_2021`ethnicity'') 
> _tab _tab (`ckd4_ckd3_2022`ethnicity'') _n
 14. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd3_2017`ethnicity'') _tab _tab (`dialysis_ckd3_2018`ethnicity'') _tab _tab (`dialysis_ckd3_2019`ethnicity'') _tab _tab (`dialysis_ckd3_2020`ethnicity'') _tab _tab (`dialysis_ckd3_202
> 1`ethnicity'') _tab _tab (`dialysis_ckd3_2022`ethnicity'') _n
 15. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd3_2017`ethnicity'') _tab _tab (`kt_ckd3_2018`ethnicity'') _tab _tab (`kt_ckd3_2019`ethnicity'') _tab _tab (`kt_ckd3_2020`ethnicity'') _tab _tab (`kt_ckd3_2021`ethnicity'') _tab _tab (`k
> t_ckd3_2022`ethnicity'') _n
 16. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd3_2017`ethnicity'') _tab _tab (`unclear_ckd3_2018`ethnicity'') _tab _tab (`unclear_ckd3_2019`ethnicity'') _tab _tab (`unclear_ckd3_2020`ethnicity'') _tab _tab (`unclear_ckd3_2021`
> ethnicity'') _tab _tab (`unclear_ckd3_2022`ethnicity'') _n
 17. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd3_2017`ethnicity'') _tab _tab (`deceased_ckd3_2018`ethnicity'') _tab _tab (`deceased_ckd3_2019`ethnicity'') _tab _tab (`deceased_ckd3_2020`ethnicity'') _tab _tab (`deceased_ckd3_202
> 1`ethnicity'') _tab _tab (`deceased_ckd3_2022`ethnicity'') _n(2)
 18. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("CKD stage 4/5") _tab _tab (`baseline_ckd4_2017`ethnicity'') _tab _tab (`baseline_ckd4_2018`ethnicity'') _tab _tab (`baseline_ckd4_2019`ethnicity'') _tab _tab (`baseline_ckd4_2020`ethnicity'') _tab _tab (`baseline_ckd4_2021`e
> thnicity'') _tab _tab (`baseline_ckd4_2022`ethnicity'') _n(2)
 19. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd4_2017`ethnicity'') _tab _tab (`none_ckd4_2018`ethnicity'') _tab _tab (`none_ckd4_2019`ethnicity'') _tab _tab (`none_ckd4_2020`ethnicity'') _tab _tab (`none_ckd4_2021`ethnicity'')
>  _tab _tab (`none_ckd4_2022`ethnicity'') _n
 20. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd4_2017`ethnicity'') _tab _tab (`dialysis_ckd4_2018`ethnicity'') _tab _tab (`dialysis_ckd4_2019`ethnicity'') _tab _tab (`dialysis_ckd4_2020`ethnicity'') _tab _tab (`dialysis_ckd4_202
> 1`ethnicity'') _tab _tab (`dialysis_ckd4_2022`ethnicity'') _n
 21. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd4_2017`ethnicity'') _tab _tab (`kt_ckd4_2018`ethnicity'') _tab _tab (`kt_ckd4_2019`ethnicity'') _tab _tab (`kt_ckd4_2020`ethnicity'') _tab _tab (`kt_ckd4_2021`ethnicity'') _tab _tab (`k
> t_ckd4_2022`ethnicity'') _n
 22. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd4_2017`ethnicity'') _tab _tab (`unclear_ckd4_2018`ethnicity'') _tab _tab (`unclear_ckd4_2019`ethnicity'') _tab _tab (`unclear_ckd4_2020`ethnicity'') _tab _tab (`unclear_ckd4_2021`
> ethnicity'') _tab _tab (`unclear_ckd4_2022`ethnicity'') _n
 23. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd4_2017`ethnicity'') _tab _tab (`deceased_ckd4_2018`ethnicity'') _tab _tab (`deceased_ckd4_2019`ethnicity'') _tab _tab (`deceased_ckd4_2020`ethnicity'') _tab _tab (`deceased_ckd4_202
> 1`ethnicity'') _tab _tab (`deceased_ckd4_2022`ethnicity'') _n(2)
 24. 
. *Dialysis
. file write tablecontent ("Dialysis") _tab _tab (`baseline_dialysis_2017`ethnicity'') _tab _tab (`baseline_dialysis_2018`ethnicity'') _tab _tab (`baseline_dialysis_2019`ethnicity'') _tab _tab (`baseline_dialysis_2020`ethnicity'') _tab _tab (`baseline_
> dialysis_2021`ethnicity'') _tab _tab (`baseline_dialysis_2022`ethnicity'') _n(2)
 25. file write tablecontent _tab ("No progression") _tab _tab (`none_dialysis_2017`ethnicity'') _tab _tab (`none_dialysis_2018`ethnicity'') _tab _tab (`none_dialysis_2019`ethnicity'') _tab _tab (`none_dialysis_2020`ethnicity'') _tab _tab (`none_dialys
> is_2021`ethnicity'') _tab _tab (`none_dialysis_2022`ethnicity'') _n
 26. file write tablecontent _tab ("Transplant") _tab _tab (`kt_dialysis_2017`ethnicity'') _tab _tab (`kt_dialysis_2018`ethnicity'') _tab _tab (`kt_dialysis_2019`ethnicity'') _tab _tab (`kt_dialysis_2020`ethnicity'') _tab _tab (`kt_dialysis_2021`ethnic
> ity'') _tab _tab (`kt_dialysis_2022`ethnicity'') _n
 27. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_dialysis_2017`ethnicity'') _tab _tab (`deceased_dialysis_2018`ethnicity'') _tab _tab (`deceased_dialysis_2019`ethnicity'') _tab _tab (`deceased_dialysis_2020`ethnicity'') _tab _tab (`d
> eceased_dialysis_2021`ethnicity'') _tab _tab (`deceased_dialysis_2022`ethnicity'') _n(2)
 28. 
. *Kidney Transplant
. file write tablecontent ("Transplant") _tab _tab (`baseline_kt_2017`ethnicity'') _tab _tab (`baseline_kt_2018`ethnicity'') _tab _tab (`baseline_kt_2019`ethnicity'') _tab _tab (`baseline_kt_2020`ethnicity'') _tab _tab (`baseline_kt_2021`ethnicity'') _
> tab _tab (`baseline_kt_2022`ethnicity'') _n(2)
 29. file write tablecontent _tab ("No progression") _tab _tab (`none_kt_2017`ethnicity'') _tab _tab (`none_kt_2018`ethnicity'') _tab _tab (`none_kt_2019`ethnicity'') _tab _tab (`none_kt_2020`ethnicity'') _tab _tab (`none_kt_2021`ethnicity'') _tab _tab
>  (`none_kt_2022`ethnicity'') _n
 30. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_kt_2017`ethnicity'') _tab _tab (`dialysis_kt_2018`ethnicity'') _tab _tab (`dialysis_kt_2019`ethnicity'') _tab _tab (`dialysis_kt_2020`ethnicity'') _tab _tab (`dialysis_kt_2021`ethnicit
> y'') _tab _tab (`dialysis_kt_2022`ethnicity'') _n
 31. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_kt_2017`ethnicity'') _tab _tab (`deceased_kt_2018`ethnicity'') _tab _tab (`deceased_kt_2019`ethnicity'') _tab _tab (`deceased_kt_2020`ethnicity'') _tab _tab (`deceased_kt_2021`ethnicit
> y'') _tab _tab (`deceased_kt_2022`ethnicity'') _n(2)
 32. 
. *KRT unclear modality
. file write tablecontent ("KRT unclear") _tab _tab (`baseline_unclear_2017`ethnicity'') _tab _tab (`baseline_unclear_2018`ethnicity'') _tab _tab (`baseline_unclear_2019`ethnicity'') _tab _tab (`baseline_unclear_2020`ethnicity'') _tab _tab (`baseline_u
> nclear_2021`ethnicity'') _tab _tab (`baseline_unclear_2022`ethnicity'') _n(2)
 33. file write tablecontent _tab ("No progression") _tab _tab (`none_unclear_2017`ethnicity'') _tab _tab (`none_unclear_2018`ethnicity'') _tab _tab (`none_unclear_2019`ethnicity'') _tab _tab (`none_unclear_2020`ethnicity'') _tab _tab (`none_unclear_20
> 21`ethnicity'') _tab _tab (`none_unclear_2022`ethnicity'') _n
 34. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_unclear_2017`ethnicity'') _tab _tab (`dialysis_unclear_2018`ethnicity'') _tab _tab (`dialysis_unclear_2019`ethnicity'') _tab _tab (`dialysis_unclear_2020`ethnicity'') _tab _tab (`dialy
> sis_unclear_2021`ethnicity'') _tab _tab (`dialysis_unclear_2022`ethnicity'') _n
 35. file write tablecontent _tab ("Transplant") _tab _tab (`kt_unclear_2017`ethnicity'') _tab _tab (`kt_unclear_2018`ethnicity'') _tab _tab (`kt_unclear_2019`ethnicity'') _tab _tab (`kt_unclear_2020`ethnicity'') _tab _tab (`kt_unclear_2021`ethnicity''
> ) _tab _tab (`kt_unclear_2022`ethnicity'') _n
 36. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_unclear_2017`ethnicity'') _tab _tab (`deceased_unclear_2018`ethnicity'') _tab _tab (`deceased_unclear_2019`ethnicity'') _tab _tab (`deceased_unclear_2020`ethnicity'') _tab _tab (`decea
> sed_unclear_2021`ethnicity'') _tab _tab (`deceased_unclear_2022`ethnicity'') _n(2)
 37. }

. 
. file close tablecontent

. 
. **Redact counts of 0 from each column in table (adapted from code by Emily Herrett)
. clear

. import delimited ./output/ckd_progression_ethnicity.csv
(encoding automatically selected: ISO-8859-1)
(14 vars, 204 obs)

. local columns " "n_2017" "april_2018" "n_2018" "april_2019" "n_2019" "april_2020" "n_2020" "april_2021" "n_2021" "april_2022" "n_2022" "april_2023" "

. foreach col in `columns' {
  2. replace `col'=. if `col'<=5
  3. }
(5 real changes made, 5 to missing)
(84 real changes made, 84 to missing)
(8 real changes made, 8 to missing)
(84 real changes made, 84 to missing)
(4 real changes made, 4 to missing)
(79 real changes made, 79 to missing)
(7 real changes made, 7 to missing)
(79 real changes made, 79 to missing)
(6 real changes made, 6 to missing)
(85 real changes made, 85 to missing)
(6 real changes made, 6 to missing)
(83 real changes made, 83 to missing)

.         
. export delimited "./output/ckd_progression_ethnicity.csv", replace
file ./output/ckd_progression_ethnicity.csv saved

. 
end of do-file

. do "C:\Users\lsh1703468\Documents\Repo\ckd-healthcare-use\analysis\ckd_progression_imd.do"

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\users\lsh1703468\documents\repo\ckd-healthcare-use

. cap log close
