------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/ckd_progression.log
  log type:  text
 opened on:   9 Feb 2023, 14:58:17

. 
. cap file close tablecontent

. file open tablecontent using ./output/ckd_progression.csv, write text replace

. 
. **Column headings
. *There are three column headings for each year 2017-2022:
. *Column 1 = the number of people in each CKD group as of the beginning of each year (i.e. in April)
. *Column 2 = the number of people who remain within the same CKD group, progress to a more advanced CKD group, or die by the end of the year (i.e. by the subsequent April)
. *Column 3 = Column 2 as a percentage of Column 1
. file write tablecontent _tab _tab ("N_2017") _tab ("April_2018") _tab ("N_2018") _tab ("April_2019") _tab ("N_2019") _tab ("April_2020") _tab ("N_2020") _tab ("April_2021") _tab ("N_2021") _tab ("April_2022") _tab ("N_2022") _tab ("April_2023") _n(2)

. 
. **Loops through datasets for each year `x' 2017-2022
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete.dta, clear
  3. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  4. local baseline_ckd_`x' = round(r(N),5)
  5. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  6. local none_ckd_`x' = round(r(N),5)
  7. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
  8. local ckd3_ckd_`x' = round(r(N),5)
  9. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 10. local ckd4_ckd_`x' = round(r(N),5)
 11. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 12. local dialysis_ckd_`x' = round(r(N),5)
 13. *Total number of people in group who progress to kidney kt by the end of the year
. qui safecount if ckd_progression==4
 14. local kt_ckd_`x' = round(r(N),5)
 15. *Total number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_progression==5
 16. local unclear_ckd_`x' = round(r(N),5)
 17. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 18. local deceased_ckd_`x' = round(r(N),5)
 19. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year ckd2_`x'
. qui safecount if ckd_group==1
 20. local baseline_ckd2_`x' = round(r(N),5)
 21. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 22. local none_ckd2_`x' = round(r(N),5)
 23. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 24. local ckd3_ckd2_`x' = round(r(N),5)
 25. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 26. local ckd4_ckd2_`x' = round(r(N),5)
 27. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 28. local dialysis_ckd2_`x' = round(r(N),5)
 29. *Number of people in group who progress to kidney kt by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 30. local kt_ckd2_`x' = round(r(N),5)
 31. *Number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==5
 32. local unclear_ckd2_`x' = round(r(N),5)
 33. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 34. local deceased_ckd2_`x' = round(r(N),5)
 35. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year ckd3_`x'
. qui safecount if ckd_group==2
 36. local baseline_ckd3_`x' = round(r(N),5)
 37. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 38. local none_ckd3_`x' = round(r(N),5)
 39. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 40. local ckd4_ckd3_`x' = round(r(N),5)
 41. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 42. local dialysis_ckd3_`x' = round(r(N),5)
 43. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 44. local kt_ckd3_`x' = round(r(N),5)
 45. *Number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==5
 46. local unclear_ckd3_`x' = round(r(N),5)
 47. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 48. local deceased_ckd3_`x' = round(r(N),5)
 49. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year ckd4_`x'
. qui safecount if ckd_group==3
 50. local baseline_ckd4_`x' = round(r(N),5)
 51. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 52. local none_ckd4_`x' = round(r(N),5)
 53. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 54. local dialysis_ckd4_`x' = round(r(N),5)
 55. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 56. local kt_ckd4_`x' = round(r(N),5)
 57. *Number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==5
 58. local unclear_ckd4_`x' = round(r(N),5)
 59. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 60. local deceased_ckd4_`x' = round(r(N),5)
 61. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year dialysis_`x'
. qui safecount if ckd_group==4
 62. local baseline_dialysis_`x' = round(r(N),5)
 63. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 64. local none_dialysis_`x' = round(r(N),5)
 65. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 66. local kt_dialysis_`x' = round(r(N),5)
 67. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 68. local deceased_dialysis_`x' = round(r(N),5)
 69. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year kt_`x'
. qui safecount if ckd_group==5
 70. local baseline_kt_`x' = round(r(N),5)
 71. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 72. local none_kt_`x' = round(r(N),5)
 73. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 74. local dialysis_kt_`x' = round(r(N),5)
 75. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 76. local deceased_kt_`x' = round(r(N),5)
 77. 
. **KRT unclear modality
. *Number of people in group (baseline_unclear_`x') at the beginning of each year unclear_`x'
. qui safecount if ckd_group==6
 78. local baseline_unclear_`x' = round(r(N),5)
 79. *Number of people in group remaining in group by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==0
 80. local none_unclear_`x' = round(r(N),5)
 81. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==3
 82. local dialysis_unclear_`x' = round(r(N),5)
 83. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==4
 84. local kt_unclear_`x' = round(r(N),5)
 85. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==6
 86. local deceased_unclear_`x' = round(r(N),5)
 87. }

. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("All CKD groups") _tab _tab (`baseline_ckd_2017') _tab _tab (`baseline_ckd_2018') _tab _tab (`baseline_ckd_2019') _tab _tab (`baseline_ckd_2020') _tab _tab (`baseline_ckd_2021') _tab _tab (`baseline_ckd_2022') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd_2017') _tab _tab (`none_ckd_2018') _tab _tab (`none_ckd_2019') _tab _tab (`none_ckd_2020') _tab _tab (`none_ckd_2021') _tab _tab (`none_ckd_2022') _n

. file write tablecontent _tab ("CKD stage 3") _tab _tab (`ckd3_ckd_2017') _tab _tab (`ckd3_ckd_2018') _tab _tab (`ckd3_ckd_2019') _tab _tab (`ckd3_ckd_2020') _tab _tab (`ckd3_ckd_2021') _tab _tab (`ckd3_ckd_2022') _n

. file write tablecontent _tab ("CKD stage 4/5") _tab _tab (`ckd4_ckd_2017') _tab _tab (`ckd4_ckd_2018') _tab _tab (`ckd4_ckd_2019') _tab _tab (`ckd4_ckd_2020') _tab _tab (`ckd4_ckd_2021') _tab _tab (`ckd4_ckd_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd_2017') _tab _tab (`dialysis_ckd_2018') _tab _tab (`dialysis_ckd_2019') _tab _tab (`dialysis_ckd_2020') _tab _tab (`dialysis_ckd_2021') _tab _tab (`dialysis_ckd_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd_2017') _tab _tab (`kt_ckd_2018') _tab _tab (`kt_ckd_2019') _tab _tab (`kt_ckd_2020') _tab _tab (`kt_ckd_2021') _tab _tab (`kt_ckd_2022') _n

. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd_2017') _tab _tab (`unclear_ckd_2018') _tab _tab (`unclear_ckd_2019') _tab _tab (`unclear_ckd_2020') _tab _tab (`unclear_ckd_2021') _tab _tab (`unclear_ckd_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd_2017') _tab _tab (`deceased_ckd_2018') _tab _tab (`deceased_ckd_2019') _tab _tab (`deceased_ckd_2020') _tab _tab (`deceased_ckd_2021') _tab _tab (`deceased_ckd_2022') _n(2)

. 
. *eGFR >60 with albuminuria
. file write tablecontent ("Albuminuria") _tab _tab (`baseline_ckd2_2017') _tab _tab (`baseline_ckd2_2018') _tab _tab (`baseline_ckd2_2019') _tab _tab (`baseline_ckd2_2020') _tab _tab (`baseline_ckd2_2021') _tab _tab (`baseline_ckd2_2022') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd2_2017') _tab _tab (`none_ckd2_2018') _tab _tab (`none_ckd2_2019') _tab _tab (`none_ckd2_2020') _tab _tab (`none_ckd2_2021') _tab _tab (`none_ckd2_2022') _n

. file write tablecontent _tab ("CKD stage 3") _tab _tab (`ckd3_ckd2_2017') _tab _tab (`ckd3_ckd2_2018') _tab _tab (`ckd3_ckd2_2019') _tab _tab (`ckd3_ckd2_2020') _tab _tab (`ckd3_ckd2_2021') _tab _tab (`ckd3_ckd2_2022') _n

. file write tablecontent _tab ("CKD stage 4/5") _tab _tab (`ckd4_ckd2_2017') _tab _tab (`ckd4_ckd2_2018') _tab _tab (`ckd4_ckd2_2019') _tab _tab (`ckd4_ckd2_2020') _tab _tab (`ckd4_ckd2_2021') _tab _tab (`ckd4_ckd2_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd2_2017') _tab _tab (`dialysis_ckd2_2018') _tab _tab (`dialysis_ckd2_2019') _tab _tab (`dialysis_ckd2_2020') _tab _tab (`dialysis_ckd2_2021') _tab _tab (`dialysis_ckd2_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd2_2017') _tab _tab (`kt_ckd2_2018') _tab _tab (`kt_ckd2_2019') _tab _tab (`kt_ckd2_2020') _tab _tab (`kt_ckd2_2021') _tab _tab (`kt_ckd2_2022') _n

. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd2_2017') _tab _tab (`unclear_ckd2_2018') _tab _tab (`unclear_ckd2_2019') _tab _tab (`unclear_ckd2_2020') _tab _tab (`unclear_ckd2_2021') _tab _tab (`unclear_ckd2_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd2_2017') _tab _tab (`deceased_ckd2_2018') _tab _tab (`deceased_ckd2_2019') _tab _tab (`deceased_ckd2_2020') _tab _tab (`deceased_ckd2_2021') _tab _tab (`deceased_ckd2_2022') _n(2)

. 
. *CKD stage 3
. file write tablecontent ("CKD stage 3") _tab _tab (`baseline_ckd3_2017') _tab _tab (`baseline_ckd3_2018') _tab _tab (`baseline_ckd3_2019') _tab _tab (`baseline_ckd3_2020') _tab _tab (`baseline_ckd3_2021') _tab _tab (`baseline_ckd3_2022') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd3_2017') _tab _tab (`none_ckd3_2018') _tab _tab (`none_ckd3_2019') _tab _tab (`none_ckd3_2020') _tab _tab (`none_ckd3_2021') _tab _tab (`none_ckd3_2022') _n

. file write tablecontent _tab ("CKD stage 4/5") _tab _tab (`ckd4_ckd3_2017') _tab _tab (`ckd4_ckd3_2018') _tab _tab (`ckd4_ckd3_2019') _tab _tab (`ckd4_ckd3_2020') _tab _tab (`ckd4_ckd3_2021') _tab _tab (`ckd4_ckd3_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd3_2017') _tab _tab (`dialysis_ckd3_2018') _tab _tab (`dialysis_ckd3_2019') _tab _tab (`dialysis_ckd3_2020') _tab _tab (`dialysis_ckd3_2021') _tab _tab (`dialysis_ckd3_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd3_2017') _tab _tab (`kt_ckd3_2018') _tab _tab (`kt_ckd3_2019') _tab _tab (`kt_ckd3_2020') _tab _tab (`kt_ckd3_2021') _tab _tab (`kt_ckd3_2022') _n

. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd3_2017') _tab _tab (`unclear_ckd3_2018') _tab _tab (`unclear_ckd3_2019') _tab _tab (`unclear_ckd3_2020') _tab _tab (`unclear_ckd3_2021') _tab _tab (`unclear_ckd3_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd3_2017') _tab _tab (`deceased_ckd3_2018') _tab _tab (`deceased_ckd3_2019') _tab _tab (`deceased_ckd3_2020') _tab _tab (`deceased_ckd3_2021') _tab _tab (`deceased_ckd3_2022') _n(2)

. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("CKD stage 4/5") _tab _tab (`baseline_ckd4_2017') _tab _tab (`baseline_ckd4_2018') _tab _tab (`baseline_ckd4_2019') _tab _tab (`baseline_ckd4_2020') _tab _tab (`baseline_ckd4_2021') _tab _tab (`baseline_ckd4_2022') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd4_2017') _tab _tab (`none_ckd4_2018') _tab _tab (`none_ckd4_2019') _tab _tab (`none_ckd4_2020') _tab _tab (`none_ckd4_2021') _tab _tab (`none_ckd4_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd4_2017') _tab _tab (`dialysis_ckd4_2018') _tab _tab (`dialysis_ckd4_2019') _tab _tab (`dialysis_ckd4_2020') _tab _tab (`dialysis_ckd4_2021') _tab _tab (`dialysis_ckd4_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd4_2017') _tab _tab (`kt_ckd4_2018') _tab _tab (`kt_ckd4_2019') _tab _tab (`kt_ckd4_2020') _tab _tab (`kt_ckd4_2021') _tab _tab (`kt_ckd4_2022') _n

. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd4_2017') _tab _tab (`unclear_ckd4_2018') _tab _tab (`unclear_ckd4_2019') _tab _tab (`unclear_ckd4_2020') _tab _tab (`unclear_ckd4_2021') _tab _tab (`unclear_ckd4_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd4_2017') _tab _tab (`deceased_ckd4_2018') _tab _tab (`deceased_ckd4_2019') _tab _tab (`deceased_ckd4_2020') _tab _tab (`deceased_ckd4_2021') _tab _tab (`deceased_ckd4_2022') _n(2)

. 
. *Dialysis
. file write tablecontent ("Dialysis") _tab _tab (`baseline_dialysis_2017') _tab _tab (`baseline_dialysis_2018') _tab _tab (`baseline_dialysis_2019') _tab _tab (`baseline_dialysis_2020') _tab _tab (`baseline_dialysis_2021') _tab _tab (`baseline_dialysi
> s_2022') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_dialysis_2017') _tab _tab (`none_dialysis_2018') _tab _tab (`none_dialysis_2019') _tab _tab (`none_dialysis_2020') _tab _tab (`none_dialysis_2021') _tab _tab (`none_dialysis_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_dialysis_2017') _tab _tab (`kt_dialysis_2018') _tab _tab (`kt_dialysis_2019') _tab _tab (`kt_dialysis_2020') _tab _tab (`kt_dialysis_2021') _tab _tab (`kt_dialysis_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_dialysis_2017') _tab _tab (`deceased_dialysis_2018') _tab _tab (`deceased_dialysis_2019') _tab _tab (`deceased_dialysis_2020') _tab _tab (`deceased_dialysis_2021') _tab _tab (`deceased_di
> alysis_2022') _n(2)

. 
. *Kidney Transplant
. file write tablecontent ("Transplant") _tab _tab (`baseline_kt_2017') _tab _tab (`baseline_kt_2018') _tab _tab (`baseline_kt_2019') _tab _tab (`baseline_kt_2020') _tab _tab (`baseline_kt_2021') _tab _tab (`baseline_kt_2022') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_kt_2017') _tab _tab (`none_kt_2018') _tab _tab (`none_kt_2019') _tab _tab (`none_kt_2020') _tab _tab (`none_kt_2021') _tab _tab (`none_kt_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_kt_2017') _tab _tab (`dialysis_kt_2018') _tab _tab (`dialysis_kt_2019') _tab _tab (`dialysis_kt_2020') _tab _tab (`dialysis_kt_2021') _tab _tab (`dialysis_kt_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_kt_2017') _tab _tab (`deceased_kt_2018') _tab _tab (`deceased_kt_2019') _tab _tab (`deceased_kt_2020') _tab _tab (`deceased_kt_2021') _tab _tab (`deceased_kt_2022') _n(2)

. 
. *KRT unclear modality
. file write tablecontent ("KRT unclear") _tab _tab (`baseline_unclear_2017') _tab _tab (`baseline_unclear_2018') _tab _tab (`baseline_unclear_2019') _tab _tab (`baseline_unclear_2020') _tab _tab (`baseline_unclear_2021') _tab _tab (`baseline_unclear_2
> 022') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_unclear_2017') _tab _tab (`none_unclear_2018') _tab _tab (`none_unclear_2019') _tab _tab (`none_unclear_2020') _tab _tab (`none_unclear_2021') _tab _tab (`none_unclear_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_unclear_2017') _tab _tab (`dialysis_unclear_2018') _tab _tab (`dialysis_unclear_2019') _tab _tab (`dialysis_unclear_2020') _tab _tab (`dialysis_unclear_2021') _tab _tab (`dialysis_unclear
> _2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_unclear_2017') _tab _tab (`kt_unclear_2018') _tab _tab (`kt_unclear_2019') _tab _tab (`kt_unclear_2020') _tab _tab (`kt_unclear_2021') _tab _tab (`kt_unclear_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_unclear_2017') _tab _tab (`deceased_unclear_2018') _tab _tab (`deceased_unclear_2019') _tab _tab (`deceased_unclear_2020') _tab _tab (`deceased_unclear_2021') _tab _tab (`deceased_unclear
> _2022')

. 
. file close tablecontent

. 
. **Redact counts of 0 from each column in table (adapted from code by Emily Herrett)
. clear

. import delimited ./output/ckd_progression.csv
(encoding automatically selected: ISO-8859-1)
(14 vars, 42 obs)

. local columns " "n_2017" "april_2018" "n_2018" "april_2019" "n_2019" "april_2020" "n_2020" "april_2021" "n_2021" "april_2022" "n_2022" "april_2023" "

. foreach col in `columns' {
  2. replace `col'=. if `col'==0
  3. }
(0 real changes made)
(3 real changes made, 3 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(0 real changes made)
(2 real changes made, 2 to missing)
(0 real changes made)
(3 real changes made, 3 to missing)

.         
. export delimited "./output/ckd_progression.csv", replace
file ./output/ckd_progression.csv saved

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. save "./output/2017_ckd_complete.dta", replace
file ./output/2017_ckd_complete.dta saved

. 
end of do-file

. browse

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. capture noisily import delimited ./output/2017_ckd.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 20,947 obs)

. tempfile 2017_ckd

. save 2017_ckd, replace
file 2017_ckd.dta saved

. capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
(encoding automatically selected: ISO-8859-1)
(220 vars, 50,000 obs)

. merge 1:1 patient_id using 2017_ckd

    Result                      Number of obs
    -----------------------------------------
    Not matched                        66,793
        from master                    47,923  (_merge==1)
        from using                     18,870  (_merge==2)

    Matched                             2,077  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,793 observations deleted)

. drop _merge

. tempfile 2017_ckd_complete

. save 2017_ckd_complete, replace
file 2017_ckd_complete.dta saved

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10                ///
>                                                 dialysis_baseline_opcs_4                ///
>                                                 dialysis_baseline_date                  ///
>                                                 kt_baseline_primary_care                ///
>                                                 kt_baseline_icd_10                              ///
>                                                 kt_baseline_opcs_4                              ///
>                                                 kidney_transplant_baseline_date {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        190        9.15        9.15
Kidney transplant |        177        8.52       17.67
 Modality unclear |         49        2.36       20.03
          Pre KRT |      1,661       79.97      100.00
------------------+-----------------------------------
            Total |      2,077      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(854 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(1223 changes made to ckd_group)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(190 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(177 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(49 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "Dialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |        584       28.12       28.12
  CKD stage 3 |        368       17.72       45.84
CKD stage 4/5 |         17        0.82       46.65
     Dialysis |        190        9.15       55.80
   Transplant |        177        8.52       64.32
  KRT unclear |         49        2.36       66.68
            . |        692       33.32      100.00
--------------+-----------------------------------
        Total |      2,077      100.00

. gen ckd_group1 = ckd_group
(692 missing values generated)

. tab ckd_group1, sum(baseline_egfr)

            |      Summary of baseline_egfr
 ckd_group1 |        Mean   Std. dev.       Freq.
------------+------------------------------------
          1 |    100.2329   28.047497         584
          2 |   47.910891   7.7418956         368
          3 |    27.07819   2.0225125          17
          4 |   80.461437   35.726087         119
          5 |   84.445152   34.651641         103
          6 |   79.033886   34.869098          32
------------+------------------------------------
      Total |   79.664264   34.553892       1,223

. drop if ckd_group==.
(692 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0        584 |       584 
  CKD stage 3 |         0          0          0        368 |       368 
CKD stage 4/5 |         0          0          0         17 |        17 
     Dialysis |       190          0          0          0 |       190 
   Transplant |         0        177          0          0 |       177 
  KRT unclear |         0          0         49          0 |        49 
--------------+--------------------------------------------+----------
        Total |       190        177         49        969 |     1,385 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10                 ///
>                                                 dialysis_outcome_opcs_4                 ///
>                                                 dialysis_outcome_date                   ///
>                                                 kt_outcome_primary_care                 ///
>                                                 kt_outcome_icd_10                               ///
>                                                 kt_outcome_opcs_4                               ///
>                                                 kidney_transplant_outcome_date  ///
>                                                 died                                                    {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |                    modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit..  Unchanged |     Total
--------------+-------------------------------------------------------+----------
  Albuminuria |        48         32         23          5        476 |       584 
  CKD stage 3 |        38         20         19          6        285 |       368 
CKD stage 4/5 |         2          0          1          0         14 |        17 
     Dialysis |        24         12          9          1        144 |       190 
   Transplant |        22          7          6          2        140 |       177 
  KRT unclear |         0          3          1          2         43 |        49 
--------------+-------------------------------------------------------+----------
        Total |       134         74         59         16      1,102 |     1,385 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 months by the end of year
. gen sex = 1 if male == "Male"
(747 missing values generated)

. replace sex = 0 if male == "Female"
(747 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(601 real changes made, 601 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(601 missing values generated)

. gen min_creatinine_outcome=.
(1,385 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(430 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(354 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(430 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(354 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(518 real changes made)

. gen max_creatinine_outcome=.
(1,385 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(430 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(354 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(784 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(867 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(601 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(784 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(430 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(601 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(784 changes made to egfr_end)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(77 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(4 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(74 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(59 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(16 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(134 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT" 3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,032       74.51       74.51
               CKD 3 |         65        4.69       79.21
     CKD 4/5 pre-KRT |          5        0.36       79.57
            Dialysis |         74        5.34       84.91
   Kidney transplant |         59        4.26       89.17
KRT unclear modality |         16        1.16       90.32
            Deceased |        134        9.68      100.00
---------------------+-----------------------------------
               Total |      1,385      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_days m4_critical_ca
> re_days m5_critical_care_days m6_critical_care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_critical_care_days m3_critical_care_da
> ys m4_emergency_days m5_emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_o
> p_appts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1
> _neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_interactions m7_gp_
> interactions m8_gp_interactions m9_gp_interactions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         177           0         584
  CKD stage |          85           0         368
  CKD stage |          11           0          17
   Dialysis |          35           0         190
  Transplan |          38           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   107.47148   62.790925       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      1,385         359           0        359        359

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         138           0         584
  CKD stage |         105           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          49           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   99.766065   40.797914       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      1,385         361           0        361        361

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         143           0         584
  CKD stage |          62           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          32           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   87.537906   48.830146       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      1,385         302           0        302        302

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         183           0         584
  CKD stage |         117           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          29           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   116.75523   66.306021       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      1,385         372           0        372        372

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         191           0         584
  CKD stage |          81           0         368
  CKD stage |           5           0          17
   Dialysis |          62           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   118.08736   64.249381       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      1,385         401           0        401        401

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         136           0         584
  CKD stage |         105           0         368
  CKD stage |           6           0          17
   Dialysis |          69           0         190
  Transplan |          42           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   100.43466     39.0343       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      1,385         366           0        366        366

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         133           0         584
  CKD stage |         107           0         368
  CKD stage |          11           0          17
   Dialysis |          55           0         190
  Transplan |          41           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   97.890975   39.453204       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      1,385         360           0        360        360

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         123           0         584
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          45           0         190
  Transplan |          35           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |    91.08231   39.514618       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      1,385         314           0        314        314

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         186           0         584
  CKD stage |          88           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          45           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   115.89892   62.997315       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      1,385         382           0        382        382

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         137           0         584
  CKD stage |         120           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   101.61516   43.836202       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      1,385         368           0        368        368

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         167           0         584
  CKD stage |          86           0         368
  CKD stage |           5           0          17
   Dialysis |          63           0         190
  Transplan |          44           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   108.19639   53.130515       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      1,385         382           0        382        382

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         126           0         584
  CKD stage |         102           0         368
  CKD stage |           8           0          17
   Dialysis |          55           0         190
  Transplan |          47           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   93.916245   36.571593       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      1,385         339           0        339        339

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         168           0         584
  CKD stage |          87           0         368
  CKD stage |           9           0          17
   Dialysis |          46           0         190
  Transplan |          23           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   103.38628   59.874461       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      1,385         335           0        335        335

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         123           0         584
  CKD stage |          94           0         368
  CKD stage |          10           0          17
   Dialysis |          49           0         190
  Transplan |          33           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   88.327076   37.433629       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,385         321           0        321        321

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         175           0         584
  CKD stage |         100           0         368
  CKD stage |           6           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   113.71047   57.373516       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,385         388           0        388        388

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         128           0         584
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          41           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   93.675812   38.676305       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,385         335           0        335        335

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         152           0         584
  CKD stage |          94           0         368
  CKD stage |           7           0          17
   Dialysis |          45           0         190
  Transplan |          39           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |    100.6657   49.338619       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,385         347           0        347        347

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         584
  CKD stage |         116           0         368
  CKD stage |           4           0          17
   Dialysis |          72           0         190
  Transplan |          47           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   119.66931   52.238798       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,385         422           0        422        422

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         142           0         584
  CKD stage |         117           0         368
  CKD stage |           5           0          17
   Dialysis |          46           0         190
  Transplan |          42           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   102.84404    45.61559       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         356           0        356        356

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         140           0         584
  CKD stage |         143           0         368
  CKD stage |          13           0          17
   Dialysis |          47           0         190
  Transplan |          56           0         177
  KRT uncle |          29           0          49
------------+------------------------------------
      Total |   111.81805   43.950989       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         428           0        428        428

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         140           0         584
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          34           0         190
  Transplan |          60           0         177
  KRT uncle |          16           0          49
------------+------------------------------------
      Total |   100.62671   43.209331       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         358           0        358        358

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         146           0         584
  CKD stage |          79           0         368
  CKD stage |          16           0          17
   Dialysis |          52           0         190
  Transplan |          67           0         177
  KRT uncle |           7           0          49
------------+------------------------------------
      Total |   98.693141    43.09162       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         367           0        367        367

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         191           0         584
  CKD stage |         141           0         368
  CKD stage |           0           0          17
   Dialysis |          68           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   132.78773   62.164112       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         455           0        455        455

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         135           0         584
  CKD stage |          70           0         368
  CKD stage |           3           0          17
   Dialysis |          53           0         190
  Transplan |          80           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   93.514801   38.106312       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,385         354           0        354        354

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         142           0         584
  CKD stage |          53           0         368
  CKD stage |           7           0          17
   Dialysis |          22           0         190
  Transplan |          69           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |    86.05704   50.210183       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      1,385         298           0        298        298

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         188           0         584
  CKD stage |          65           0         368
  CKD stage |           2           0          17
   Dialysis |          44           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   108.06137   69.371392       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,385         354           0        354        354

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         144           0         584
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          55           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   103.68231   40.700569       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,385         373           0        373        373

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         148           0         584
  CKD stage |         102           0         368
  CKD stage |           3           0          17
   Dialysis |          48           0         190
  Transplan |          49           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   102.67437    45.66408       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,385         358           0        358        358

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         166           0         584
  CKD stage |          66           0         368
  CKD stage |           7           0          17
   Dialysis |          46           0         190
  Transplan |          53           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   100.73718   57.279827       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,385         339           0        339        339

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         584
  CKD stage |         113           0         368
  CKD stage |           3           0          17
   Dialysis |          51           0         190
  Transplan |          61           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   110.46137   45.142758       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,385         401           0        401        401

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         183           0         584
  CKD stage |         111           0         368
  CKD stage |           2           0          17
   Dialysis |          24           0         190
  Transplan |          64           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   118.47148   62.988078       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         393           0        393        393

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         149           0         584
  CKD stage |          86           0         368
  CKD stage |           4           0          17
   Dialysis |          71           0         190
  Transplan |          37           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   100.40794   45.980177       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         353           0        353        353

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         164           0         584
  CKD stage |         131           0         368
  CKD stage |           0           0          17
   Dialysis |          48           0         190
  Transplan |          38           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   115.89603   54.575987       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         395           0        395        395

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         131           0         584
  CKD stage |         102           0         368
  CKD stage |           0           0          17
   Dialysis |          66           0         190
  Transplan |          24           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   94.602166   41.520224       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         327           0        327        327

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         188           0         584
  CKD stage |          91           0         368
  CKD stage |          11           0          17
   Dialysis |          78           0         190
  Transplan |          40           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |         120   61.294336       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         425           0        425        425

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         107           0         584
  CKD stage |          83           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   81.642599   26.727214       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,385         321           0        321        321

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         127           0         584
  CKD stage |         109           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          45           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |    93.41444   40.872936       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      1,385         323           0        323        323

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         162           0         584
  CKD stage |         123           0         368
  CKD stage |           7           0          17
   Dialysis |          57           0         190
  Transplan |          56           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   116.33574   49.020189       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      1,385         413           0        413        413

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         142           0         584
  CKD stage |          92           0         368
  CKD stage |           1           0          17
   Dialysis |          60           0         190
  Transplan |          49           0         177
  KRT uncle |          28           0          49
------------+------------------------------------
      Total |   99.816606   40.218797       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      1,385         372           0        372        372

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         150           0         584
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          51           0         190
  Transplan |          44           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   102.77545   47.339302       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      1,385         348           0        348        348

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         156           0         584
  CKD stage |          91           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          61           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   102.87004    50.19808       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      1,385         360           0        360        360

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         210           0         584
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          53           0         190
  Transplan |          54           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   131.50469   71.477483       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      1,385         434           0        434        434

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         134           0         584
  CKD stage |         106           0         368
  CKD stage |          15           0          17
   Dialysis |          52           0         190
  Transplan |          66           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   101.16245   35.635097       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      1,385         394           0        394        394

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         137           0         584
  CKD stage |         114           0         368
  CKD stage |           6           0          17
   Dialysis |          55           0         190
  Transplan |          50           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   102.20794   40.711857       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      1,385         366           0        366        366

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         135           0         584
  CKD stage |          84           0         368
  CKD stage |           0           0          17
   Dialysis |          71           0         190
  Transplan |          66           0         177
  KRT uncle |          25           0          49
------------+------------------------------------
      Total |   98.302527   34.166841       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      1,385         381           0        381        381

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         176           0         584
  CKD stage |         104           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          55           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   114.95018   58.010573       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         383           0        383        383

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         138           0         584
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   102.39278   38.714106       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         380           0        380        380

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         187           0         584
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          51           0         190
  Transplan |          79           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   124.07798   57.801606       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      1,385         443           0        443        443

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         147           0         584
  CKD stage |          99           0         368
  CKD stage |          14           0          17
   Dialysis |          39           0         190
  Transplan |          28           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   97.424549   50.372718       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      1,385         328           0        328        328

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         149           0         584
  CKD stage |          69           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          32           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   89.773285   53.126899       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,385         297           0        297        297

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         153           0         584
  CKD stage |         113           0         368
  CKD stage |           2           0          17
   Dialysis |          52           0         190
  Transplan |          37           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   106.74368   49.191234       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,385         366           0        366        366

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         167           0         584
  CKD stage |          89           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          44           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   104.95668   57.141856       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,385         355           0        355        355

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         111           0         584
  CKD stage |          98           0         368
  CKD stage |           2           0          17
   Dialysis |          37           0         190
  Transplan |          86           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   89.252708   30.292428       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,385         343           0        343        343

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         133           0         584
  CKD stage |          85           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          30           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   90.092419   41.642906       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,385         322           0        322        322

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         186           0         584
  CKD stage |         122           0         368
  CKD stage |           1           0          17
   Dialysis |          22           0         190
  Transplan |          61           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |    122.4491   64.115247       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         414           0        414        414

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         174           0         584
  CKD stage |          83           0         368
  CKD stage |           7           0          17
   Dialysis |          81           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   113.30686   54.524658       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         406           0        406        406

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         584
  CKD stage |          73           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          56           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   104.12347   60.250752       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         340           0        340        340

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         155           0         584
  CKD stage |          93           0         368
  CKD stage |           4           0          17
   Dialysis |          54           0         190
  Transplan |          38           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   102.73502   49.639391       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         354           0        354        354

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         137           0         584
  CKD stage |          93           0         368
  CKD stage |           0           0          17
   Dialysis |          33           0         190
  Transplan |          46           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   93.485199   43.636603       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         326           0        326        326

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         182           0         584
  CKD stage |         111           0         368
  CKD stage |           6           0          17
   Dialysis |          39           0         190
  Transplan |          36           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   116.71986   63.252621       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,385         387           0        387        387

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         584
  CKD stage |         101           0         368
  CKD stage |           3           0          17
   Dialysis |          36           0         190
  Transplan |          83           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   107.77906   46.466956       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      1,385         389           0        389        389

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         232           0         584
  CKD stage |          92           0         368
  CKD stage |           9           0          17
   Dialysis |          37           0         190
  Transplan |          42           0         177
  KRT uncle |          26           0          49
------------+------------------------------------
      Total |   133.74368   86.605861       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      1,385         438           0        438        438

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         149           0         584
  CKD stage |          75           0         368
  CKD stage |           9           0          17
   Dialysis |          30           0         190
  Transplan |          63           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   95.350903   48.993537       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      1,385         335           0        335        335

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         162           0         584
  CKD stage |         102           0         368
  CKD stage |           5           0          17
   Dialysis |          41           0         190
  Transplan |          50           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   107.69892   52.773876       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      1,385         366           0        366        366

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         122           0         584
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          45           0         190
  Transplan |          50           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   87.842599   35.544583       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      1,385         312           0        312        312

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         584
  CKD stage |         120           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   115.89892   58.327619       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      1,385         387           0        387        387

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         166           0         584
  CKD stage |         132           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          36           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   117.70975   54.617015       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      1,385         403           0        403        403

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         113           0         584
  CKD stage |         100           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          33           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   86.581949   33.316217       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      1,385         318           0        318        318

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         145           0         584
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          63           0         190
  Transplan |          62           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   102.15379   40.318155       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      1,385         379           0        379        379

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         173           0         584
  CKD stage |          89           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   109.57834   58.007622       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         364           0        364        364

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         115           0         584
  CKD stage |          96           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   84.418051   36.029922       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         300           0        300        300

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         584
  CKD stage |          93           0         368
  CKD stage |           9           0          17
   Dialysis |          84           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   116.09531   51.105449       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      1,385         429           0        429        429

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         119           0         584
  CKD stage |          92           0         368
  CKD stage |           0           0          17
   Dialysis |          38           0         190
  Transplan |          63           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   88.488087   33.260489       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      1,385         329           0        329        329

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         149           0         584
  CKD stage |          80           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   97.568231   47.357772       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,385         333           0        333        333

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         221           0         584
  CKD stage |         119           0         368
  CKD stage |           3           0          17
   Dialysis |          46           0         190
  Transplan |          52           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   138.47076   76.392105       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,385         460           0        460        460

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         153           0         584
  CKD stage |          87           0         368
  CKD stage |           8           0          17
   Dialysis |          42           0         190
  Transplan |          49           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   100.35379   48.707727       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,385         356           0        356        356

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         150           0         584
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          42           0         190
  Transplan |          54           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   100.35018   46.424026       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,385         358           0        358        358

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         151           0         584
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          61           0         190
  Transplan |          28           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   100.38267   48.163282       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,385         358           0        358        358

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         141           0         584
  CKD stage |         127           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   103.51191   48.488409       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         354           0        354        354

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         144           0         584
  CKD stage |          94           0         368
  CKD stage |           4           0          17
   Dialysis |          53           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   98.268592    45.01835       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         339           0        339        339

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         584
  CKD stage |          93           0         368
  CKD stage |           3           0          17
   Dialysis |          52           0         190
  Transplan |          35           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   101.60794   50.062837       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         346           0        346        346

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         139           0         584
  CKD stage |          49           0         368
  CKD stage |           7           0          17
   Dialysis |          58           0         190
  Transplan |          33           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   84.279422   47.843849       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         297           0        297        297

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         185           0         584
  CKD stage |          98           0         368
  CKD stage |           5           0          17
   Dialysis |          51           0         190
  Transplan |          21           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   113.78773   66.724856       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         360           0        360        360

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         159           0         584
  CKD stage |          75           0         368
  CKD stage |           1           0          17
   Dialysis |          46           0         190
  Transplan |          46           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   99.456318   53.179402       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,385         335           0        335        335

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(55 real changes made)

. replace ethnicity=2 if ethnicity==3
(50 real changes made)

. replace ethnicity=3 if ethnicity==4
(59 real changes made)

. replace ethnicity=4 if ethnicity==6
(55 real changes made)

. replace ethnicity=6 if ethnicity==.
(349 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,227 missing values generated)

. replace region = 2 if region_string=="East"
(133 real changes made)

. replace region = 3 if region_string=="London"
(274 real changes made)

. replace region = 4 if region_string=="North East"
(149 real changes made)

. replace region = 5 if region_string=="North West"
(144 real changes made)

. replace region = 6 if region_string=="South East"
(128 real changes made)

. replace region = 7 if region_string=="South West"
(133 real changes made)

. replace region = 8 if region_string=="West Midlands"
(151 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(115 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(1,385 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(549 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(836 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. capture noisily import delimited ./output/2017_ckd.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 20,947 obs)

. tempfile 2017_ckd

. save 2017_ckd, replace
file 2017_ckd.dta saved

. capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
(encoding automatically selected: ISO-8859-1)
(220 vars, 50,000 obs)

. merge 1:1 patient_id using 2017_ckd

    Result                      Number of obs
    -----------------------------------------
    Not matched                        66,793
        from master                    47,923  (_merge==1)
        from using                     18,870  (_merge==2)

    Matched                             2,077  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,793 observations deleted)

. drop _merge

. tempfile 2017_ckd_complete

. save 2017_ckd_complete, replace
file 2017_ckd_complete.dta saved

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. 
. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10                ///
>                                                 dialysis_baseline_opcs_4                ///
>                                                 dialysis_baseline_date                  ///
>                                                 kt_baseline_primary_care                ///
>                                                 kt_baseline_icd_10                              ///
>                                                 kt_baseline_opcs_4                              ///
>                                                 kidney_transplant_baseline_date {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        190        9.15        9.15
Kidney transplant |        177        8.52       17.67
 Modality unclear |         49        2.36       20.03
          Pre KRT |      1,661       79.97      100.00
------------------+-----------------------------------
            Total |      2,077      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(854 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(1223 changes made to ckd_group)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(190 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(177 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(49 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "Dialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |        584       28.12       28.12
  CKD stage 3 |        368       17.72       45.84
CKD stage 4/5 |         17        0.82       46.65
     Dialysis |        190        9.15       55.80
   Transplant |        177        8.52       64.32
  KRT unclear |         49        2.36       66.68
            . |        692       33.32      100.00
--------------+-----------------------------------
        Total |      2,077      100.00

. gen ckd_group1 = ckd_group
(692 missing values generated)

. replace ckd_group1 = 7 if ckd_group==.
(692 real changes made)

. label define ckd_group1 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "Dialysis" 5 "Transplant" 6 "KRT unclear" 7 "Unknown"

. label values ckd_group1 ckd_group1

. tab ckd_group1, sum(baseline_egfr)

            |      Summary of baseline_egfr
 ckd_group1 |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |    100.2329   28.047497         584
  CKD stage |   47.910891   7.7418956         368
  CKD stage |    27.07819   2.0225125          17
   Dialysis |   80.461437   35.726087         119
  Transplan |   84.445152   34.651641         103
  KRT uncle |   79.033886   34.869098          32
------------+------------------------------------
      Total |   79.664264   34.553892       1,223

. drop if ckd_group==.
(692 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0        584 |       584 
  CKD stage 3 |         0          0          0        368 |       368 
CKD stage 4/5 |         0          0          0         17 |        17 
     Dialysis |       190          0          0          0 |       190 
   Transplant |         0        177          0          0 |       177 
  KRT unclear |         0          0         49          0 |        49 
--------------+--------------------------------------------+----------
        Total |       190        177         49        969 |     1,385 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10                 ///
>                                                 dialysis_outcome_opcs_4                 ///
>                                                 dialysis_outcome_date                   ///
>                                                 kt_outcome_primary_care                 ///
>                                                 kt_outcome_icd_10                               ///
>                                                 kt_outcome_opcs_4                               ///
>                                                 kidney_transplant_outcome_date  ///
>                                                 died                                                    {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |                    modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit..  Unchanged |     Total
--------------+-------------------------------------------------------+----------
  Albuminuria |        48         32         23          5        476 |       584 
  CKD stage 3 |        38         20         19          6        285 |       368 
CKD stage 4/5 |         2          0          1          0         14 |        17 
     Dialysis |        24         12          9          1        144 |       190 
   Transplant |        22          7          6          2        140 |       177 
  KRT unclear |         0          3          1          2         43 |        49 
--------------+-------------------------------------------------------+----------
        Total |       134         74         59         16      1,102 |     1,385 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 months by the end of year
. gen sex = 1 if male == "Male"
(747 missing values generated)

. replace sex = 0 if male == "Female"
(747 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(601 real changes made, 601 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(601 missing values generated)

. gen min_creatinine_outcome=.
(1,385 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(430 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(354 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(430 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(354 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(518 real changes made)

. gen max_creatinine_outcome=.
(1,385 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(430 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(354 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(784 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(867 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(601 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(784 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(430 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(601 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(784 changes made to egfr_end)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(77 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(4 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(74 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(59 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(16 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(134 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT" 3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,032       74.51       74.51
               CKD 3 |         65        4.69       79.21
     CKD 4/5 pre-KRT |          5        0.36       79.57
            Dialysis |         74        5.34       84.91
   Kidney transplant |         59        4.26       89.17
KRT unclear modality |         16        1.16       90.32
            Deceased |        134        9.68      100.00
---------------------+-----------------------------------
               Total |      1,385      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_days m4_critical_ca
> re_days m5_critical_care_days m6_critical_care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_critical_care_days m3_critical_care_da
> ys m4_emergency_days m5_emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_o
> p_appts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1
> _neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_interactions m7_gp_
> interactions m8_gp_interactions m9_gp_interactions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         177           0         584
  CKD stage |          85           0         368
  CKD stage |          11           0          17
   Dialysis |          35           0         190
  Transplan |          38           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   107.47148   62.790925       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      1,385         359           0        359        359

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         138           0         584
  CKD stage |         105           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          49           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   99.766065   40.797914       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      1,385         361           0        361        361

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         143           0         584
  CKD stage |          62           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          32           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   87.537906   48.830146       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      1,385         302           0        302        302

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         183           0         584
  CKD stage |         117           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          29           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   116.75523   66.306021       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      1,385         372           0        372        372

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         191           0         584
  CKD stage |          81           0         368
  CKD stage |           5           0          17
   Dialysis |          62           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   118.08736   64.249381       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      1,385         401           0        401        401

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         136           0         584
  CKD stage |         105           0         368
  CKD stage |           6           0          17
   Dialysis |          69           0         190
  Transplan |          42           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   100.43466     39.0343       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      1,385         366           0        366        366

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         133           0         584
  CKD stage |         107           0         368
  CKD stage |          11           0          17
   Dialysis |          55           0         190
  Transplan |          41           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   97.890975   39.453204       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      1,385         360           0        360        360

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         123           0         584
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          45           0         190
  Transplan |          35           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |    91.08231   39.514618       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      1,385         314           0        314        314

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         186           0         584
  CKD stage |          88           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          45           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   115.89892   62.997315       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      1,385         382           0        382        382

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         137           0         584
  CKD stage |         120           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   101.61516   43.836202       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      1,385         368           0        368        368

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         167           0         584
  CKD stage |          86           0         368
  CKD stage |           5           0          17
   Dialysis |          63           0         190
  Transplan |          44           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   108.19639   53.130515       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      1,385         382           0        382        382

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         126           0         584
  CKD stage |         102           0         368
  CKD stage |           8           0          17
   Dialysis |          55           0         190
  Transplan |          47           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   93.916245   36.571593       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      1,385         339           0        339        339

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         168           0         584
  CKD stage |          87           0         368
  CKD stage |           9           0          17
   Dialysis |          46           0         190
  Transplan |          23           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   103.38628   59.874461       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      1,385         335           0        335        335

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         123           0         584
  CKD stage |          94           0         368
  CKD stage |          10           0          17
   Dialysis |          49           0         190
  Transplan |          33           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   88.327076   37.433629       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,385         321           0        321        321

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         175           0         584
  CKD stage |         100           0         368
  CKD stage |           6           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   113.71047   57.373516       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,385         388           0        388        388

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         128           0         584
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          41           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   93.675812   38.676305       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,385         335           0        335        335

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         152           0         584
  CKD stage |          94           0         368
  CKD stage |           7           0          17
   Dialysis |          45           0         190
  Transplan |          39           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |    100.6657   49.338619       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,385         347           0        347        347

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         584
  CKD stage |         116           0         368
  CKD stage |           4           0          17
   Dialysis |          72           0         190
  Transplan |          47           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   119.66931   52.238798       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,385         422           0        422        422

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         142           0         584
  CKD stage |         117           0         368
  CKD stage |           5           0          17
   Dialysis |          46           0         190
  Transplan |          42           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   102.84404    45.61559       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         356           0        356        356

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         140           0         584
  CKD stage |         143           0         368
  CKD stage |          13           0          17
   Dialysis |          47           0         190
  Transplan |          56           0         177
  KRT uncle |          29           0          49
------------+------------------------------------
      Total |   111.81805   43.950989       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         428           0        428        428

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         140           0         584
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          34           0         190
  Transplan |          60           0         177
  KRT uncle |          16           0          49
------------+------------------------------------
      Total |   100.62671   43.209331       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         358           0        358        358

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         146           0         584
  CKD stage |          79           0         368
  CKD stage |          16           0          17
   Dialysis |          52           0         190
  Transplan |          67           0         177
  KRT uncle |           7           0          49
------------+------------------------------------
      Total |   98.693141    43.09162       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         367           0        367        367

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         191           0         584
  CKD stage |         141           0         368
  CKD stage |           0           0          17
   Dialysis |          68           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   132.78773   62.164112       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         455           0        455        455

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         135           0         584
  CKD stage |          70           0         368
  CKD stage |           3           0          17
   Dialysis |          53           0         190
  Transplan |          80           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   93.514801   38.106312       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,385         354           0        354        354

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         142           0         584
  CKD stage |          53           0         368
  CKD stage |           7           0          17
   Dialysis |          22           0         190
  Transplan |          69           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |    86.05704   50.210183       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      1,385         298           0        298        298

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         188           0         584
  CKD stage |          65           0         368
  CKD stage |           2           0          17
   Dialysis |          44           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   108.06137   69.371392       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,385         354           0        354        354

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         144           0         584
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          55           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   103.68231   40.700569       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,385         373           0        373        373

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         148           0         584
  CKD stage |         102           0         368
  CKD stage |           3           0          17
   Dialysis |          48           0         190
  Transplan |          49           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   102.67437    45.66408       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,385         358           0        358        358

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         166           0         584
  CKD stage |          66           0         368
  CKD stage |           7           0          17
   Dialysis |          46           0         190
  Transplan |          53           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   100.73718   57.279827       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,385         339           0        339        339

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         584
  CKD stage |         113           0         368
  CKD stage |           3           0          17
   Dialysis |          51           0         190
  Transplan |          61           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   110.46137   45.142758       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,385         401           0        401        401

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         183           0         584
  CKD stage |         111           0         368
  CKD stage |           2           0          17
   Dialysis |          24           0         190
  Transplan |          64           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   118.47148   62.988078       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         393           0        393        393

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         149           0         584
  CKD stage |          86           0         368
  CKD stage |           4           0          17
   Dialysis |          71           0         190
  Transplan |          37           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   100.40794   45.980177       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         353           0        353        353

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         164           0         584
  CKD stage |         131           0         368
  CKD stage |           0           0          17
   Dialysis |          48           0         190
  Transplan |          38           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   115.89603   54.575987       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         395           0        395        395

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         131           0         584
  CKD stage |         102           0         368
  CKD stage |           0           0          17
   Dialysis |          66           0         190
  Transplan |          24           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   94.602166   41.520224       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         327           0        327        327

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         188           0         584
  CKD stage |          91           0         368
  CKD stage |          11           0          17
   Dialysis |          78           0         190
  Transplan |          40           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |         120   61.294336       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         425           0        425        425

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         107           0         584
  CKD stage |          83           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   81.642599   26.727214       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,385         321           0        321        321

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         127           0         584
  CKD stage |         109           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          45           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |    93.41444   40.872936       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      1,385         323           0        323        323

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         162           0         584
  CKD stage |         123           0         368
  CKD stage |           7           0          17
   Dialysis |          57           0         190
  Transplan |          56           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   116.33574   49.020189       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      1,385         413           0        413        413

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         142           0         584
  CKD stage |          92           0         368
  CKD stage |           1           0          17
   Dialysis |          60           0         190
  Transplan |          49           0         177
  KRT uncle |          28           0          49
------------+------------------------------------
      Total |   99.816606   40.218797       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      1,385         372           0        372        372

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         150           0         584
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          51           0         190
  Transplan |          44           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   102.77545   47.339302       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      1,385         348           0        348        348

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         156           0         584
  CKD stage |          91           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          61           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   102.87004    50.19808       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      1,385         360           0        360        360

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         210           0         584
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          53           0         190
  Transplan |          54           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   131.50469   71.477483       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      1,385         434           0        434        434

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         134           0         584
  CKD stage |         106           0         368
  CKD stage |          15           0          17
   Dialysis |          52           0         190
  Transplan |          66           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   101.16245   35.635097       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      1,385         394           0        394        394

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         137           0         584
  CKD stage |         114           0         368
  CKD stage |           6           0          17
   Dialysis |          55           0         190
  Transplan |          50           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   102.20794   40.711857       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      1,385         366           0        366        366

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         135           0         584
  CKD stage |          84           0         368
  CKD stage |           0           0          17
   Dialysis |          71           0         190
  Transplan |          66           0         177
  KRT uncle |          25           0          49
------------+------------------------------------
      Total |   98.302527   34.166841       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      1,385         381           0        381        381

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         176           0         584
  CKD stage |         104           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          55           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   114.95018   58.010573       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         383           0        383        383

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         138           0         584
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   102.39278   38.714106       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         380           0        380        380

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         187           0         584
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          51           0         190
  Transplan |          79           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   124.07798   57.801606       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      1,385         443           0        443        443

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         147           0         584
  CKD stage |          99           0         368
  CKD stage |          14           0          17
   Dialysis |          39           0         190
  Transplan |          28           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   97.424549   50.372718       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      1,385         328           0        328        328

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         149           0         584
  CKD stage |          69           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          32           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   89.773285   53.126899       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,385         297           0        297        297

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         153           0         584
  CKD stage |         113           0         368
  CKD stage |           2           0          17
   Dialysis |          52           0         190
  Transplan |          37           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   106.74368   49.191234       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,385         366           0        366        366

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         167           0         584
  CKD stage |          89           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          44           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   104.95668   57.141856       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,385         355           0        355        355

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         111           0         584
  CKD stage |          98           0         368
  CKD stage |           2           0          17
   Dialysis |          37           0         190
  Transplan |          86           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   89.252708   30.292428       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,385         343           0        343        343

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         133           0         584
  CKD stage |          85           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          30           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   90.092419   41.642906       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,385         322           0        322        322

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         186           0         584
  CKD stage |         122           0         368
  CKD stage |           1           0          17
   Dialysis |          22           0         190
  Transplan |          61           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |    122.4491   64.115247       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         414           0        414        414

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         174           0         584
  CKD stage |          83           0         368
  CKD stage |           7           0          17
   Dialysis |          81           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   113.30686   54.524658       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         406           0        406        406

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         584
  CKD stage |          73           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          56           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   104.12347   60.250752       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         340           0        340        340

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         155           0         584
  CKD stage |          93           0         368
  CKD stage |           4           0          17
   Dialysis |          54           0         190
  Transplan |          38           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   102.73502   49.639391       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         354           0        354        354

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         137           0         584
  CKD stage |          93           0         368
  CKD stage |           0           0          17
   Dialysis |          33           0         190
  Transplan |          46           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   93.485199   43.636603       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         326           0        326        326

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         182           0         584
  CKD stage |         111           0         368
  CKD stage |           6           0          17
   Dialysis |          39           0         190
  Transplan |          36           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   116.71986   63.252621       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,385         387           0        387        387

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         584
  CKD stage |         101           0         368
  CKD stage |           3           0          17
   Dialysis |          36           0         190
  Transplan |          83           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   107.77906   46.466956       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      1,385         389           0        389        389

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         232           0         584
  CKD stage |          92           0         368
  CKD stage |           9           0          17
   Dialysis |          37           0         190
  Transplan |          42           0         177
  KRT uncle |          26           0          49
------------+------------------------------------
      Total |   133.74368   86.605861       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      1,385         438           0        438        438

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         149           0         584
  CKD stage |          75           0         368
  CKD stage |           9           0          17
   Dialysis |          30           0         190
  Transplan |          63           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   95.350903   48.993537       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      1,385         335           0        335        335

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         162           0         584
  CKD stage |         102           0         368
  CKD stage |           5           0          17
   Dialysis |          41           0         190
  Transplan |          50           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   107.69892   52.773876       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      1,385         366           0        366        366

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         122           0         584
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          45           0         190
  Transplan |          50           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   87.842599   35.544583       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      1,385         312           0        312        312

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         584
  CKD stage |         120           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   115.89892   58.327619       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      1,385         387           0        387        387

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         166           0         584
  CKD stage |         132           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          36           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   117.70975   54.617015       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      1,385         403           0        403        403

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         113           0         584
  CKD stage |         100           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          33           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   86.581949   33.316217       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      1,385         318           0        318        318

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         145           0         584
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          63           0         190
  Transplan |          62           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   102.15379   40.318155       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      1,385         379           0        379        379

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         173           0         584
  CKD stage |          89           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   109.57834   58.007622       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         364           0        364        364

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         115           0         584
  CKD stage |          96           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   84.418051   36.029922       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         300           0        300        300

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         172           0         584
  CKD stage |          93           0         368
  CKD stage |           9           0          17
   Dialysis |          84           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   116.09531   51.105449       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      1,385         429           0        429        429

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         119           0         584
  CKD stage |          92           0         368
  CKD stage |           0           0          17
   Dialysis |          38           0         190
  Transplan |          63           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   88.488087   33.260489       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      1,385         329           0        329        329

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         149           0         584
  CKD stage |          80           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   97.568231   47.357772       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      1,385         333           0        333        333

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         221           0         584
  CKD stage |         119           0         368
  CKD stage |           3           0          17
   Dialysis |          46           0         190
  Transplan |          52           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   138.47076   76.392105       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      1,385         460           0        460        460

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         153           0         584
  CKD stage |          87           0         368
  CKD stage |           8           0          17
   Dialysis |          42           0         190
  Transplan |          49           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   100.35379   48.707727       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      1,385         356           0        356        356

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         150           0         584
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          42           0         190
  Transplan |          54           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   100.35018   46.424026       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      1,385         358           0        358        358

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         151           0         584
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          61           0         190
  Transplan |          28           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   100.38267   48.163282       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      1,385         358           0        358        358

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         141           0         584
  CKD stage |         127           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   103.51191   48.488409       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         354           0        354        354

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         144           0         584
  CKD stage |          94           0         368
  CKD stage |           4           0          17
   Dialysis |          53           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   98.268592    45.01835       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         339           0        339        339

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         154           0         584
  CKD stage |          93           0         368
  CKD stage |           3           0          17
   Dialysis |          52           0         190
  Transplan |          35           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   101.60794   50.062837       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         346           0        346        346

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         139           0         584
  CKD stage |          49           0         368
  CKD stage |           7           0          17
   Dialysis |          58           0         190
  Transplan |          33           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   84.279422   47.843849       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      1,385         297           0        297        297

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         185           0         584
  CKD stage |          98           0         368
  CKD stage |           5           0          17
   Dialysis |          51           0         190
  Transplan |          21           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   113.78773   66.724856       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      1,385         360           0        360        360

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         159           0         584
  CKD stage |          75           0         368
  CKD stage |           1           0          17
   Dialysis |          46           0         190
  Transplan |          46           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   99.456318   53.179402       1,385

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      1,385         335           0        335        335

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(55 real changes made)

. replace ethnicity=2 if ethnicity==3
(50 real changes made)

. replace ethnicity=3 if ethnicity==4
(59 real changes made)

. replace ethnicity=4 if ethnicity==6
(55 real changes made)

. replace ethnicity=6 if ethnicity==.
(349 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,227 missing values generated)

. replace region = 2 if region_string=="East"
(133 real changes made)

. replace region = 3 if region_string=="London"
(274 real changes made)

. replace region = 4 if region_string=="North East"
(149 real changes made)

. replace region = 5 if region_string=="North West"
(144 real changes made)

. replace region = 6 if region_string=="South East"
(128 real changes made)

. replace region = 7 if region_string=="South West"
(133 real changes made)

. replace region = 8 if region_string=="West Midlands"
(151 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(115 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(1,385 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(549 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(836 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use

. 
end of do-file

. import delimited ./output/input_2017.csv, delimiter(comma) varnames(1) case(preserve)
no; data in memory would be lost
r(4);

. clear

. import delimited ./output/input_2017.csv, delimiter(comma) varnames(1) case(preserve)
(encoding automatically selected: ISO-8859-1)
(17 vars, 50,000 obs)

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,704 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,974 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,734 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,301        9.83        9.83
           East Midlands |      3,372       10.04       19.87
                  London |      6,733       20.05       39.91
              North East |      3,370       10.03       49.95
              North West |      3,426       10.20       60.15
              South East |      3,325        9.90       70.05
              South West |      3,417       10.17       80.22
           West Midlands |      3,280        9.77       89.98
Yorkshire and The Humber |      3,364       10.02      100.00
-------------------------+-----------------------------------
                   Total |     33,588      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,668        4.97        4.97
          1 |      6,356       18.92       23.89
          2 |      6,463       19.24       43.13
          3 |      6,522       19.42       62.55
          4 |      6,235       18.56       81.11
          5 |      6,344       18.89      100.00
------------+-----------------------------------
      Total |     33,588      100.00

. drop if imd==0
(1,668 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,921 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(813 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(816 real changes made)

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,025 real changes made, 14,025 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,025 missing values generated)

. gen min_baseline_creatinine=.
(31,920 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,324 real changes made)

. gen max_baseline_creatinine=.
(31,920 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,895 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,596 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,025 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,895 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,098 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,647 real changes made)

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14,025 missing values generated)

. recode egfr_status 0=2 60=1
(17895 changes made to egfr_status)

. replace egfr_status = 0 if baseline_egfr==.
(14,025 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s |         0          1 |     Total
-----------+----------------------+----------
   No eGFR |     7,626      6,399 |    14,025 
 eGFR >=60 |     7,355      5,697 |    13,052 
  eGFR <60 |     2,647      2,196 |     4,843 
-----------+----------------------+----------
     Total |    17,628     14,292 |    31,920 

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,920
25%            0              0       Sum of wgt.      31,920

50%            0                      Mean           12.49825
                        Largest       Std. dev.      13.01894
75%       25.039       43.27767
90%     29.27043       44.03526       Variance       169.4929
95%     31.41735       45.25942       Skewness       .2176451
99%     35.28129       45.69954       Kurtosis        1.30211

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,538        5.35        5.35
         <= |      1,615        5.62       10.97
          = |     20,777       72.27       83.23
          > |      1,581        5.50       88.73
         >= |      1,592        5.54       94.27
          ~ |      1,648        5.73      100.00
------------+-----------------------------------
      Total |     28,751      100.00

. tab albuminuria

albuminuria |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     17,628       55.23       55.23
          1 |     14,292       44.77      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,981       46.93       46.93
          1 |     16,939       53.07      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10                                 ///
>                                                 dialysis_opcs_4                                 ///
>                                                 kidney_transplant_primary_care  ///
>                                                 kidney_transplant_icd_10                ///
>                                                 kidney_transplant_opcs_4                {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,353       95.09       95.09
          1 |      1,567        4.91      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(762 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,299       94.92       94.92
          1 |      1,621        5.08      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(738 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,308       94.95       94.95
          1 |      1,612        5.05      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(690 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,330       95.02       95.02
          1 |      1,590        4.98      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(624 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,295       94.91       94.91
          1 |      1,625        5.09      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(593 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,306       94.94       94.94
          1 |      1,614        5.06      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(601 real changes made)

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,973       34.38       34.38
          1 |     20,947       65.62      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. drop if ckd==0
(10,973 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
end of do-file

. clear

. import delimited ./output/input_2017.csv, delimiter(comma) varnames(1) case(preserve)
(encoding automatically selected: ISO-8859-1)
(17 vars, 50,000 obs)

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,704 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,974 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,734 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,301        9.83        9.83
           East Midlands |      3,372       10.04       19.87
                  London |      6,733       20.05       39.91
              North East |      3,370       10.03       49.95
              North West |      3,426       10.20       60.15
              South East |      3,325        9.90       70.05
              South West |      3,417       10.17       80.22
           West Midlands |      3,280        9.77       89.98
Yorkshire and The Humber |      3,364       10.02      100.00
-------------------------+-----------------------------------
                   Total |     33,588      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,668        4.97        4.97
          1 |      6,356       18.92       23.89
          2 |      6,463       19.24       43.13
          3 |      6,522       19.42       62.55
          4 |      6,235       18.56       81.11
          5 |      6,344       18.89      100.00
------------+-----------------------------------
      Total |     33,588      100.00

. drop if imd==0
(1,668 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,921 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(813 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(816 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,025 real changes made, 14,025 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,025 missing values generated)

. gen min_baseline_creatinine=.
(31,920 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,324 real changes made)

. gen max_baseline_creatinine=.
(31,920 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,895 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,596 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,025 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,895 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,098 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,647 real changes made)

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14,025 missing values generated)

. recode egfr_status 0=2 60=1
(17895 changes made to egfr_status)

. replace egfr_status = 0 if baseline_egfr==.
(14,025 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     7,626      6,399 |    14,025 
 eGFR >=60 |     7,355      5,697 |    13,052 
  eGFR <60 |     2,647      2,196 |     4,843 
-----------+----------------------+----------
     Total |    17,628     14,292 |    31,920 

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,920
25%            0              0       Sum of wgt.      31,920

50%            0                      Mean           12.49825
                        Largest       Std. dev.      13.01894
75%       25.039       43.27767
90%     29.27043       44.03526       Variance       169.4929
95%     31.41735       45.25942       Skewness       .2176451
99%     35.28129       45.69954       Kurtosis        1.30211

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,538        5.35        5.35
         <= |      1,615        5.62       10.97
          = |     20,777       72.27       83.23
          > |      1,581        5.50       88.73
         >= |      1,592        5.54       94.27
          ~ |      1,648        5.73      100.00
------------+-----------------------------------
      Total |     28,751      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,628       55.23       55.23
   Albuminuria |     14,292       44.77      100.00
---------------+-----------------------------------
         Total |     31,920      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,981       46.93       46.93
          1 |     16,939       53.07      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10                                 ///
>                                                 dialysis_opcs_4                                 ///
>                                                 kidney_transplant_primary_care  ///
>                                                 kidney_transplant_icd_10                ///
>                                                 kidney_transplant_opcs_4                {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,353       95.09       95.09
          1 |      1,567        4.91      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(762 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,299       94.92       94.92
          1 |      1,621        5.08      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(738 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,308       94.95       94.95
          1 |      1,612        5.05      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(690 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,330       95.02       95.02
          1 |      1,590        4.98      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(624 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,295       94.91       94.91
          1 |      1,625        5.09      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(593 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,306       94.94       94.94
          1 |      1,614        5.06      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(601 real changes made)

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,973       34.38       34.38
          1 |     20,947       65.62      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. drop if ckd==0
(10,973 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. drop albuminuria

. 
end of do-file

. import delimited ./output/input_2017.csv, delimiter(comma) varnames(1) case(preserve), clear
invalid 'clear' 
r(198);

. clear

. import delimited ./output/input_2017.csv, delimiter(comma) varnames(1) case(preserve)
(encoding automatically selected: ISO-8859-1)
(17 vars, 50,000 obs)

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,704 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,974 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,734 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,301        9.83        9.83
           East Midlands |      3,372       10.04       19.87
                  London |      6,733       20.05       39.91
              North East |      3,370       10.03       49.95
              North West |      3,426       10.20       60.15
              South East |      3,325        9.90       70.05
              South West |      3,417       10.17       80.22
           West Midlands |      3,280        9.77       89.98
Yorkshire and The Humber |      3,364       10.02      100.00
-------------------------+-----------------------------------
                   Total |     33,588      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,668        4.97        4.97
          1 |      6,356       18.92       23.89
          2 |      6,463       19.24       43.13
          3 |      6,522       19.42       62.55
          4 |      6,235       18.56       81.11
          5 |      6,344       18.89      100.00
------------+-----------------------------------
      Total |     33,588      100.00

. drop if imd==0
(1,668 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,921 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(813 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(816 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,025 real changes made, 14,025 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,025 missing values generated)

. gen min_baseline_creatinine=.
(31,920 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,324 real changes made)

. gen max_baseline_creatinine=.
(31,920 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,895 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,596 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,025 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,895 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,098 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,647 real changes made)

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14,025 missing values generated)

. recode egfr_status 0=2 60=1
(17895 changes made to egfr_status)

. replace egfr_status = 0 if baseline_egfr==.
(14,025 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     7,626      6,399 |    14,025 
 eGFR >=60 |     7,355      5,697 |    13,052 
  eGFR <60 |     2,647      2,196 |     4,843 
-----------+----------------------+----------
     Total |    17,628     14,292 |    31,920 

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,920
25%            0              0       Sum of wgt.      31,920

50%            0                      Mean           12.49825
                        Largest       Std. dev.      13.01894
75%       25.039       43.27767
90%     29.27043       44.03526       Variance       169.4929
95%     31.41735       45.25942       Skewness       .2176451
99%     35.28129       45.69954       Kurtosis        1.30211

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,538        5.35        5.35
         <= |      1,615        5.62       10.97
          = |     20,777       72.27       83.23
          > |      1,581        5.50       88.73
         >= |      1,592        5.54       94.27
          ~ |      1,648        5.73      100.00
------------+-----------------------------------
      Total |     28,751      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,628       55.23       55.23
   Albuminuria |     14,292       44.77      100.00
---------------+-----------------------------------
         Total |     31,920      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,981       46.93       46.93
          1 |     16,939       53.07      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10                                 ///
>                                                 dialysis_opcs_4                                 ///
>                                                 kidney_transplant_primary_care  ///
>                                                 kidney_transplant_icd_10                ///
>                                                 kidney_transplant_opcs_4                {
  2. tab `krt'
  3. replace ckd = 1 if `krt'==1
  4. drop `krt'
  5. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,353       95.09       95.09
          1 |      1,567        4.91      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(762 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,299       94.92       94.92
          1 |      1,621        5.08      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(738 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,308       94.95       94.95
          1 |      1,612        5.05      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(690 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,330       95.02       95.02
          1 |      1,590        4.98      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(624 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,295       94.91       94.91
          1 |      1,625        5.09      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(593 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,306       94.94       94.94
          1 |      1,614        5.06      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(601 real changes made)

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,973       34.38       34.38
          1 |     20,947       65.62      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. drop if ckd==0
(10,973 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     2,088      6,399 |     8,487 
 eGFR >=60 |     1,920      5,697 |     7,617 
  eGFR <60 |     2,647      2,196 |     4,843 
-----------+----------------------+----------
     Total |     6,655     14,292 |    20,947 

. drop albuminuria

. drop egfr_status

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. clear

. 
end of do-file

. 
. import delimited ./output/input_2017.csv, delimiter(comma) varnames(1) case(preserve)
(encoding automatically selected: ISO-8859-1)
(17 vars, 50,000 obs)

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. **Exclusions
. * Age <18 at index date
. drop if age <18
(10,704 observations deleted)

. 
. * Anyone not registered at one practice for 3 months before index date
. drop if has_follow_up==0
(1,974 observations deleted)

. drop has_follow_up

. 
. * Deceased before index date
. drop if deceased==1
(3,734 observations deleted)

. drop deceased

. 
. * Region
. tab region

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |      3,301        9.83        9.83
           East Midlands |      3,372       10.04       19.87
                  London |      6,733       20.05       39.91
              North East |      3,370       10.03       49.95
              North West |      3,426       10.20       60.15
              South East |      3,325        9.90       70.05
              South West |      3,417       10.17       80.22
           West Midlands |      3,280        9.77       89.98
Yorkshire and The Humber |      3,364       10.02      100.00
-------------------------+-----------------------------------
                   Total |     33,588      100.00

. drop if region==""
(0 observations deleted)

. 
. * IMD
. tab imd

        imd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,668        4.97        4.97
          1 |      6,356       18.92       23.89
          2 |      6,463       19.24       43.13
          3 |      6,522       19.42       62.55
          4 |      6,235       18.56       81.11
          5 |      6,344       18.89      100.00
------------+-----------------------------------
      Total |     33,588      100.00

. drop if imd==0
(1,668 observations deleted)

. drop if imd==.
(0 observations deleted)

. 
. * eGFR>60 without albuminuria
. gen albuminuria = 0

. replace albuminuria = 1 if acr >=3
(15,921 real changes made)

. replace albuminuria = 0 if acr_operator =="<"
(813 real changes made)

. replace albuminuria = 0 if acr_operator =="<="
(816 real changes made)

. label define albuminuria 0 "No albuminuria" 1 "Albuminuria"

. label values albuminuria albuminuria

. assert inlist(sex, "M", "F")

. gen male = (sex=="M")

. drop sex

. label define sexLab 1 "Male" 0 "Female"

. label values male sexLab

. label var male "Sex (0=F 1=M)"

. replace baseline_creatinine = . if !inrange(baseline_creatinine, 20, 3000)
(14,025 real changes made, 14,025 to missing)

. gen mgdl_baseline_creatinine = baseline_creatinine/88.4
(14,025 missing values generated)

. gen min_baseline_creatinine=.
(31,920 missing values generated)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.329  if male==0
(9,098 real changes made)

. replace min_baseline_creatinine = min_baseline_creatinine^-0.411  if male==1
(8,797 real changes made)

. replace min_baseline_creatinine = 1 if min_baseline_creatinine<1
(11,324 real changes made)

. gen max_baseline_creatinine=.
(31,920 missing values generated)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.7 if male==0
(9,098 real changes made)

. replace max_baseline_creatinine = mgdl_baseline_creatinine/0.9 if male==1
(8,797 real changes made)

. replace max_baseline_creatinine = max_baseline_creatinine^-1.209
(17,895 real changes made)

. replace max_baseline_creatinine = 1 if max_baseline_creatinine>1
(20,596 real changes made)

. gen baseline_egfr = min_baseline_creatinine*max_baseline_creatinine*141
(14,025 missing values generated)

. replace baseline_egfr = baseline_egfr*(0.993^age)
(17,895 real changes made)

. replace baseline_egfr = baseline_egfr*1.018 if male==0
(9,098 real changes made)

. drop baseline_creatinine

. drop mgdl_baseline_creatinine

. drop min_baseline_creatinine

. drop max_baseline_creatinine

. gen ckd = albuminuria

. replace ckd = 1 if baseline_egfr <60
(2,647 real changes made)

. sum acr, de

                             acr
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs              31,920
25%            0              0       Sum of wgt.      31,920

50%            0                      Mean           12.49825
                        Largest       Std. dev.      13.01894
75%       25.039       43.27767
90%     29.27043       44.03526       Variance       169.4929
95%     31.41735       45.25942       Skewness       .2176451
99%     35.28129       45.69954       Kurtosis        1.30211

. tab acr_operator

acr_operato |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
          < |      1,538        5.35        5.35
         <= |      1,615        5.62       10.97
          = |     20,777       72.27       83.23
          > |      1,581        5.50       88.73
         >= |      1,592        5.54       94.27
          ~ |      1,648        5.73      100.00
------------+-----------------------------------
      Total |     28,751      100.00

. tab albuminuria

   albuminuria |      Freq.     Percent        Cum.
---------------+-----------------------------------
No albuminuria |     17,628       55.23       55.23
   Albuminuria |     14,292       44.77      100.00
---------------+-----------------------------------
         Total |     31,920      100.00

. tab ckd

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     14,981       46.93       46.93
          1 |     16,939       53.07      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. egen egfr_status = cut(baseline_egfr), at(0, 60, 5000)
(14,025 missing values generated)

. recode egfr_status 0=2 60=1
(17895 changes made to egfr_status)

. replace egfr_status = 0 if baseline_egfr==.
(14,025 real changes made)

. foreach krt of varlist  dialysis_primary_care                   ///
>                                                 dialysis_icd_10                                 ///
>                                                 dialysis_opcs_4                                 ///
>                                                 kidney_transplant_primary_care  ///
>                                                 kidney_transplant_icd_10                ///
>                                                 kidney_transplant_opcs_4                {
  2. tab `krt'
  3. replace egfr_status=3 if `krt'==1
  4. replace ckd = 1 if `krt'==1
  5. drop `krt'
  6. }

dialysis_pr |
 imary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,353       95.09       95.09
          1 |      1,567        4.91      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(1,567 real changes made)
(762 real changes made)

dialysis_ic |
       d_10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,299       94.92       94.92
          1 |      1,621        5.08      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(1,554 real changes made)
(738 real changes made)

dialysis_op |
       cs_4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,308       94.95       94.95
          1 |      1,612        5.05      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(1,471 real changes made)
(690 real changes made)

kidney_tran |
splant_prim |
   ary_care |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,330       95.02       95.02
          1 |      1,590        4.98      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(1,351 real changes made)
(624 real changes made)

kidney_tran |
splant_icd_ |
         10 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,295       94.91       94.91
          1 |      1,625        5.09      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(1,318 real changes made)
(593 real changes made)

kidney_tran |
splant_opcs |
         _4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     30,306       94.94       94.94
          1 |      1,614        5.06      100.00
------------+-----------------------------------
      Total |     31,920      100.00
(1,262 real changes made)
(601 real changes made)

. label define egfr_status 0 "No eGFR" 1 "eGFR >=60" 2 "eGFR <60" 3 "KRT"

. label values egfr_status egfr_status

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |     5,538      4,697 |    10,235 
 eGFR >=60 |     5,435      4,182 |     9,617 
  eGFR <60 |     1,955      1,590 |     3,545 
       KRT |     4,700      3,823 |     8,523 
-----------+----------------------+----------
     Total |    17,628     14,292 |    31,920 

. tab ckd, m

        ckd |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     10,973       34.38       34.38
          1 |     20,947       65.62      100.00
------------+-----------------------------------
      Total |     31,920      100.00

. drop if ckd==0
(10,973 observations deleted)

. drop ckd

. drop acr

. drop acr_operator

. tab egfr_status albuminuria

egfr_statu |      albuminuria
         s | No albumi  Albuminur |     Total
-----------+----------------------+----------
   No eGFR |         0      4,697 |     4,697 
 eGFR >=60 |         0      4,182 |     4,182 
  eGFR <60 |     1,955      1,590 |     3,545 
       KRT |     4,700      3,823 |     8,523 
-----------+----------------------+----------
     Total |     6,655     14,292 |    20,947 

. drop albuminuria

. drop egfr_status

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. capture noisily import delimited ./output/2017_ckd.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 20,947 obs)

. tempfile 2017_ckd

. save 2017_ckd, replace
file 2017_ckd.dta saved

. capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
(encoding automatically selected: ISO-8859-1)
(220 vars, 50,000 obs)

. merge 1:1 patient_id using 2017_ckd

    Result                      Number of obs
    -----------------------------------------
    Not matched                        66,793
        from master                    47,923  (_merge==1)
        from using                     18,870  (_merge==2)

    Matched                             2,077  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,793 observations deleted)

. drop _merge

. tempfile 2017_ckd_complete

. save 2017_ckd_complete, replace
file 2017_ckd_complete.dta saved

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. *CKD stage classification
. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10                ///
>                                                 dialysis_baseline_opcs_4                ///
>                                                 dialysis_baseline_date                  ///
>                                                 kt_baseline_primary_care                ///
>                                                 kt_baseline_icd_10                              ///
>                                                 kt_baseline_opcs_4                              ///
>                                                 kidney_transplant_baseline_date {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        190        9.15        9.15
Kidney transplant |        177        8.52       17.67
 Modality unclear |         49        2.36       20.03
          Pre KRT |      1,661       79.97      100.00
------------------+-----------------------------------
            Total |      2,077      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(854 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(1223 changes made to ckd_group)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(190 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(177 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(49 real changes made)

. replace ckd_group = 1 if ckd_group==.
(692 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "Dialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,276       61.43       61.43
  CKD stage 3 |        368       17.72       79.15
CKD stage 4/5 |         17        0.82       79.97
     Dialysis |        190        9.15       89.12
   Transplant |        177        8.52       97.64
  KRT unclear |         49        2.36      100.00
--------------+-----------------------------------
        Total |      2,077      100.00

. gen ckd_group1 = ckd_group

. replace ckd_group1 = 7 if ckd_group==.
(0 real changes made)

. label define ckd_group1 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "Dialysis" 5 "Transplant" 6 "KRT unclear" 7 "Unknown"

. label values ckd_group1 ckd_group1

. tab ckd_group1, sum(baseline_egfr)

            |      Summary of baseline_egfr
 ckd_group1 |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |    100.2329   28.047497         584
  CKD stage |   47.910891   7.7418956         368
  CKD stage |    27.07819   2.0225125          17
   Dialysis |   80.461437   35.726087         119
  Transplan |   84.445152   34.651641         103
  KRT uncle |   79.033886   34.869098          32
------------+------------------------------------
      Total |   79.664264   34.553892       1,223

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,276 |     1,276 
  CKD stage 3 |         0          0          0        368 |       368 
CKD stage 4/5 |         0          0          0         17 |        17 
     Dialysis |       190          0          0          0 |       190 
   Transplant |         0        177          0          0 |       177 
  KRT unclear |         0          0         49          0 |        49 
--------------+--------------------------------------------+----------
        Total |       190        177         49      1,661 |     2,077 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10                 ///
>                                                 dialysis_outcome_opcs_4                 ///
>                                                 dialysis_outcome_date                   ///
>                                                 kt_outcome_primary_care                 ///
>                                                 kt_outcome_icd_10                               ///
>                                                 kt_outcome_opcs_4                               ///
>                                                 kidney_transplant_outcome_date  ///
>                                                 died                                                    {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |                    modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit..  Unchanged |     Total
--------------+-------------------------------------------------------+----------
  Albuminuria |       114         66         39         11      1,046 |     1,276 
  CKD stage 3 |        38         20         19          6        285 |       368 
CKD stage 4/5 |         2          0          1          0         14 |        17 
     Dialysis |        24         12          9          1        144 |       190 
   Transplant |        22          7          6          2        140 |       177 
  KRT unclear |         0          3          1          2         43 |        49 
--------------+-------------------------------------------------------+----------
        Total |       200        108         75         22      1,672 |     2,077 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 months by the end of year
. gen sex = 1 if male == "Male"
(1,100 missing values generated)

. replace sex = 0 if male == "Female"
(1,100 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(890 real changes made, 890 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(890 missing values generated)

. gen min_creatinine_outcome=.
(2,077 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(641 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(546 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(641 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(546 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(778 real changes made)

. gen max_creatinine_outcome=.
(2,077 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(641 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(546 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,187 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,299 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(890 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,187 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(641 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(890 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(1187 changes made to egfr_end)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(182 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(8 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(108 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(75 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(22 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(200 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT" 3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,515       72.94       72.94
               CKD 3 |        148        7.13       80.07
     CKD 4/5 pre-KRT |          9        0.43       80.50
            Dialysis |        108        5.20       85.70
   Kidney transplant |         75        3.61       89.31
KRT unclear modality |         22        1.06       90.37
            Deceased |        200        9.63      100.00
---------------------+-----------------------------------
               Total |      2,077      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_days m4_critical_ca
> re_days m5_critical_care_days m6_critical_care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_critical_care_days m3_critical_care_da
> ys m4_emergency_days m5_emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_o
> p_appts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1
> _neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_interactions m7_gp_
> interactions m8_gp_interactions m9_gp_interactions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,276
  CKD stage |          85           0         368
  CKD stage |          11           0          17
   Dialysis |          35           0         190
  Transplan |          38           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   256.57776   159.21159       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,077         564           0        564        564

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,276
  CKD stage |         105           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          49           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   205.27106   107.57239       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,077         512           0        512        512

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,276
  CKD stage |          62           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          32           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   217.21329   135.15857       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,077         483           0        483        483

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,276
  CKD stage |         117           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          29           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   251.25181   147.58703       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,077         555           0        555        555

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,276
  CKD stage |          81           0         368
  CKD stage |           5           0          17
   Dialysis |          62           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   244.97593   143.26796       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,077         568           0        568        568

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,276
  CKD stage |         105           0         368
  CKD stage |           6           0          17
   Dialysis |          69           0         190
  Transplan |          42           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   201.36447   102.50836       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,077         511           0        511        511

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,276
  CKD stage |         107           0         368
  CKD stage |          11           0          17
   Dialysis |          55           0         190
  Transplan |          41           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |    212.1844   112.82138       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,077         527           0        527        527

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          45           0         190
  Transplan |          35           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   223.35725   125.46172       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,077         512           0        512        512

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,276
  CKD stage |          88           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          45           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   258.43813    154.2957       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,077         576           0        576        576

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,276
  CKD stage |         120           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   204.94222   105.56389       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,077         517           0        517        517

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,276
  CKD stage |          86           0         368
  CKD stage |           5           0          17
   Dialysis |          63           0         190
  Transplan |          44           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   251.27203   148.03995       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,077         583           0        583        583

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,276
  CKD stage |         102           0         368
  CKD stage |           8           0          17
   Dialysis |          55           0         190
  Transplan |          47           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   216.41695   117.29742       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,077         521           0        521        521

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,276
  CKD stage |          87           0         368
  CKD stage |           9           0          17
   Dialysis |          46           0         190
  Transplan |          23           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   203.55031   118.24193       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,077         463           0        463        463

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,276
  CKD stage |          94           0         368
  CKD stage |          10           0          17
   Dialysis |          49           0         190
  Transplan |          33           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   213.53346   120.71519       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         506           0        506        506

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,276
  CKD stage |         100           0         368
  CKD stage |           6           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   243.48435   139.57995       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         566           0        566        566

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,276
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          41           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   211.39384   114.98271       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         508           0        508        508

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,276
  CKD stage |          94           0         368
  CKD stage |           7           0          17
   Dialysis |          45           0         190
  Transplan |          39           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   198.24844   108.57666       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         478           0        478        478

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,276
  CKD stage |         116           0         368
  CKD stage |           4           0          17
   Dialysis |          72           0         190
  Transplan |          47           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   225.57053   116.27687       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         566           0        566        566

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,276
  CKD stage |         117           0         368
  CKD stage |           5           0          17
   Dialysis |          46           0         190
  Transplan |          42           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   220.94319   118.94459       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         527           0        527        527

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,276
  CKD stage |         143           0         368
  CKD stage |          13           0          17
   Dialysis |          47           0         190
  Transplan |          56           0         177
  KRT uncle |          29           0          49
------------+------------------------------------
      Total |   205.37313    95.27957       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         565           0        565        565

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,276
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          34           0         190
  Transplan |          60           0         177
  KRT uncle |          16           0          49
------------+------------------------------------
      Total |   197.91045   102.27393       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         495           0        495        495

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |          79           0         368
  CKD stage |          16           0          17
   Dialysis |          52           0         190
  Transplan |          67           0         177
  KRT uncle |           7           0          49
------------+------------------------------------
      Total |   221.96533   125.62209       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         542           0        542        542

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,276
  CKD stage |         141           0         368
  CKD stage |           0           0          17
   Dialysis |          68           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   266.45113   142.84813       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         641           0        641        641

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |          70           0         368
  CKD stage |           3           0          17
   Dialysis |          53           0         190
  Transplan |          80           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   232.04911   134.24611       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         557           0        557        557

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,276
  CKD stage |          53           0         368
  CKD stage |           7           0          17
   Dialysis |          22           0         190
  Transplan |          69           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   204.22003   126.59437       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,077         460           0        460        460

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,276
  CKD stage |          65           0         368
  CKD stage |           2           0          17
   Dialysis |          44           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |    251.4208   160.11233       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         544           0        544        544

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,276
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          55           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   236.91286   130.09105       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         568           0        568        568

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,276
  CKD stage |         102           0         368
  CKD stage |           3           0          17
   Dialysis |          48           0         190
  Transplan |          49           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   239.41647   136.00083       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         556           0        556        556

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,276
  CKD stage |          66           0         368
  CKD stage |           7           0          17
   Dialysis |          46           0         190
  Transplan |          53           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   225.07703   136.67069       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         506           0        506        506

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,276
  CKD stage |         113           0         368
  CKD stage |           3           0          17
   Dialysis |          51           0         190
  Transplan |          61           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   236.16418   126.51232       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         582           0        582        582

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,276
  CKD stage |         111           0         368
  CKD stage |           2           0          17
   Dialysis |          24           0         190
  Transplan |          64           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   241.33799   136.93673       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         558           0        558        558

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,276
  CKD stage |          86           0         368
  CKD stage |           4           0          17
   Dialysis |          71           0         190
  Transplan |          37           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   209.97833   116.04004       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         505           0        505        505

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,276
  CKD stage |         131           0         368
  CKD stage |           0           0          17
   Dialysis |          48           0         190
  Transplan |          38           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   249.26336   136.67091       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         586           0        586        586

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |         102           0         368
  CKD stage |           0           0          17
   Dialysis |          66           0         190
  Transplan |          24           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   216.69716   119.91405       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         506           0        506        506

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,276
  CKD stage |          91           0         368
  CKD stage |          11           0          17
   Dialysis |          78           0         190
  Transplan |          40           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   226.82138   124.97191       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         562           0        562        562

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         259           0       1,276
  CKD stage |          83           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   183.47183   96.203796       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         473           0        473        473

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,276
  CKD stage |         109           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          45           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   247.13288   143.21306       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,077         555           0        555        555

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,276
  CKD stage |         123           0         368
  CKD stage |           7           0          17
   Dialysis |          57           0         190
  Transplan |          56           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   232.91719   121.22351       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,077         578           0        578        578

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |          92           0         368
  CKD stage |           1           0          17
   Dialysis |          60           0         190
  Transplan |          49           0         177
  KRT uncle |          28           0          49
------------+------------------------------------
      Total |    234.2831   131.74745       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,077         568           0        568        568

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,276
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          51           0         190
  Transplan |          44           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   241.37891   138.61265       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,077         548           0        548        548

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,276
  CKD stage |          91           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          61           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   230.53972   133.03408       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,077         539           0        539        539

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,276
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          53           0         190
  Transplan |          54           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   262.09629   150.21495       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,077         604           0        604        604

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,276
  CKD stage |         106           0         368
  CKD stage |          15           0          17
   Dialysis |          52           0         190
  Transplan |          66           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   228.21473   120.99981       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,077         583           0        583        583

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,276
  CKD stage |         114           0         368
  CKD stage |           6           0          17
   Dialysis |          55           0         190
  Transplan |          50           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   231.75445   124.85204       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,077         558           0        558        558

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,276
  CKD stage |          84           0         368
  CKD stage |           0           0          17
   Dialysis |          71           0         190
  Transplan |          66           0         177
  KRT uncle |          25           0          49
------------+------------------------------------
      Total |   221.72605   119.53245       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,077         562           0        562        562

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,276
  CKD stage |         104           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          55           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   238.50072    134.7942       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         551           0        551        551

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,276
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   233.43958   125.95504       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         574           0        574        574

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,276
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          51           0         190
  Transplan |          79           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   266.68272   150.37554       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,077         641           0        641        641

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,276
  CKD stage |          99           0         368
  CKD stage |          14           0          17
   Dialysis |          39           0         190
  Transplan |          28           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |    228.2104   134.15356       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,077         514           0        514        514

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,276
  CKD stage |          69           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          32           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |    204.7299   126.02128       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         452           0        452        452

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,276
  CKD stage |         113           0         368
  CKD stage |           2           0          17
   Dialysis |          52           0         190
  Transplan |          37           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |    219.8363   118.78639       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         525           0        525        525

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,276
  CKD stage |          89           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          44           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   232.52431   138.05195       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         529           0        529        529

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,276
  CKD stage |          98           0         368
  CKD stage |           2           0          17
   Dialysis |          37           0         190
  Transplan |          86           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   209.53828   109.64571       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         527           0        527        527

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,276
  CKD stage |          85           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          30           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   198.38325   111.78332       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         475           0        475        475

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         406           0       1,276
  CKD stage |         122           0         368
  CKD stage |           1           0          17
   Dialysis |          22           0         190
  Transplan |          61           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   278.77901   163.00795       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         634           0        634        634

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         404           0       1,276
  CKD stage |          83           0         368
  CKD stage |           7           0          17
   Dialysis |          81           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   274.82812   163.65495       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         636           0        636        636

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,276
  CKD stage |          73           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          56           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   208.44632   122.62651       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         473           0        473        473

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,276
  CKD stage |          93           0         368
  CKD stage |           4           0          17
   Dialysis |          54           0         190
  Transplan |          38           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |    271.2778   164.72353       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         600           0        600        600

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |          93           0         368
  CKD stage |           0           0          17
   Dialysis |          33           0         190
  Transplan |          46           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   221.02311   127.58838       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         510           0        510        510

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,276
  CKD stage |         111           0         368
  CKD stage |           6           0          17
   Dialysis |          39           0         190
  Transplan |          36           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   259.49591   152.82508       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         584           0        584        584

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,276
  CKD stage |         101           0         368
  CKD stage |           3           0          17
   Dialysis |          36           0         190
  Transplan |          83           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   214.71642   113.23504       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,077         538           0        538        538

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         416           0       1,276
  CKD stage |          92           0         368
  CKD stage |           9           0          17
   Dialysis |          37           0         190
  Transplan |          42           0         177
  KRT uncle |          26           0          49
------------+------------------------------------
      Total |   279.51998   173.18017       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,077         622           0        622        622

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          75           0         368
  CKD stage |           9           0          17
   Dialysis |          30           0         190
  Transplan |          63           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   212.13529    124.3569       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,077         496           0        496        496

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,276
  CKD stage |         102           0         368
  CKD stage |           5           0          17
   Dialysis |          41           0         190
  Transplan |          50           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   238.83052   136.84838       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,077         550           0        550        550

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,276
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          45           0         190
  Transplan |          50           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   215.33462   121.90486       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,077         501           0        501        501

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,276
  CKD stage |         120           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   210.15503   110.49998       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,077         510           0        510        510

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |         132           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          36           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   239.46654   127.78152       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,077         575           0        575        575

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,276
  CKD stage |         100           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          33           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   213.33847   117.43574       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,077         510           0        510        510

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          63           0         190
  Transplan |          62           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   217.79634   117.21887       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,077         544           0        544        544

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,276
  CKD stage |          89           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   225.31825   129.48012       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         518           0        518        518

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,276
  CKD stage |          96           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   217.47665   124.77424       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         500           0        500        500

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,276
  CKD stage |          93           0         368
  CKD stage |           9           0          17
   Dialysis |          84           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   242.23207   133.09688       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,077         604           0        604        604

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,276
  CKD stage |          92           0         368
  CKD stage |           0           0          17
   Dialysis |          38           0         190
  Transplan |          63           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   244.86856   142.56209       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,077         567           0        567        567

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,276
  CKD stage |          80           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   232.04429   137.05132       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         524           0        524        524

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,276
  CKD stage |         119           0         368
  CKD stage |           3           0          17
   Dialysis |          46           0         190
  Transplan |          52           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   271.63505   155.09021       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         632           0        632        632

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         278           0       1,276
  CKD stage |          87           0         368
  CKD stage |           8           0          17
   Dialysis |          42           0         190
  Transplan |          49           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   194.68753   106.28184       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         481           0        481        481

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          42           0         190
  Transplan |          54           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |    232.3895   134.21641       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         546           0        546        546

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          61           0         190
  Transplan |          28           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   214.92826   121.26743       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         517           0        517        517

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,276
  CKD stage |         127           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   217.36928   115.77388       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         519           0        519        519

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,276
  CKD stage |          94           0         368
  CKD stage |           4           0          17
   Dialysis |          53           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   199.51372   108.21324       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         479           0        479        479

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,276
  CKD stage |          93           0         368
  CKD stage |           3           0          17
   Dialysis |          52           0         190
  Transplan |          35           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   215.51613   121.92795       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         503           0        503        503

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,276
  CKD stage |          49           0         368
  CKD stage |           7           0          17
   Dialysis |          58           0         190
  Transplan |          33           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   196.50602   120.84431       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         450           0        450        450

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,276
  CKD stage |          98           0         368
  CKD stage |           5           0          17
   Dialysis |          51           0         190
  Transplan |          21           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   224.13674   130.53229       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         501           0        501        501

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,276
  CKD stage |          75           0         368
  CKD stage |           1           0          17
   Dialysis |          46           0         190
  Transplan |          46           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   221.89071     132.043       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         502           0        502        502

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(81 real changes made)

. replace ethnicity=2 if ethnicity==3
(76 real changes made)

. replace ethnicity=3 if ethnicity==4
(82 real changes made)

. replace ethnicity=4 if ethnicity==6
(81 real changes made)

. replace ethnicity=6 if ethnicity==.
(524 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,841 missing values generated)

. replace region = 2 if region_string=="East"
(193 real changes made)

. replace region = 3 if region_string=="London"
(413 real changes made)

. replace region = 4 if region_string=="North East"
(223 real changes made)

. replace region = 5 if region_string=="North West"
(207 real changes made)

. replace region = 6 if region_string=="South East"
(199 real changes made)

. replace region = 7 if region_string=="South West"
(205 real changes made)

. replace region = 8 if region_string=="West Midlands"
(221 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(180 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,077 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(829 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,248 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. capture noisily import delimited ./output/2017_ckd.csv, clear
(encoding automatically selected: ISO-8859-1)
(7 vars, 20,947 obs)

. tempfile 2017_ckd

. save 2017_ckd, replace
file 2017_ckd.dta saved

. capture noisily import delimited ./output/input_2017_ckd_complete.csv, clear
(encoding automatically selected: ISO-8859-1)
(220 vars, 50,000 obs)

. merge 1:1 patient_id using 2017_ckd

    Result                      Number of obs
    -----------------------------------------
    Not matched                        66,793
        from master                    47,923  (_merge==1)
        from using                     18,870  (_merge==2)

    Matched                             2,077  (_merge==3)
    -----------------------------------------

. keep if _merge==3
(66,793 observations deleted)

. drop _merge

. tempfile 2017_ckd_complete

. save 2017_ckd_complete, replace
file 2017_ckd_complete.dta saved

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD4d60_000000.tmp"

. foreach var of varlist  dialysis_baseline_primary_care  ///
>                                                 dialysis_baseline_icd_10                ///
>                                                 dialysis_baseline_opcs_4                ///
>                                                 dialysis_baseline_date                  ///
>                                                 kt_baseline_primary_care                ///
>                                                 kt_baseline_icd_10                              ///
>                                                 kt_baseline_opcs_4                              ///
>                                                 kidney_transplant_baseline_date {
  2.         drop `var'
  3.         }

. tab modality_baseline, m

modality_baseline |      Freq.     Percent        Cum.
------------------+-----------------------------------
         Dialysis |        190        9.15        9.15
Kidney transplant |        177        8.52       17.67
 Modality unclear |         49        2.36       20.03
          Pre KRT |      1,661       79.97      100.00
------------------+-----------------------------------
            Total |      2,077      100.00

. egen ckd_group = cut(baseline_egfr), at(0, 30, 60, 5000)
(854 missing values generated)

. recode ckd_group 0=3 30=2 60=1
(1223 changes made to ckd_group)

. replace ckd_group = 4 if modality_baseline=="Dialysis"
(190 real changes made)

. replace ckd_group = 5 if modality_baseline=="Kidney transplant"
(177 real changes made)

. replace ckd_group = 6 if modality_baseline=="Modality unclear"
(49 real changes made)

. *ckd_group==. are those with albuminuria without available eGFR measurement or code for KRT
. replace ckd_group = 1 if ckd_group==.
(692 real changes made)

. label define ckd_group 1 "Albuminuria" 2 "CKD stage 3" 3 "CKD stage 4/5" 4 "Dialysis" 5 "Transplant" 6 "KRT unclear"

. label values ckd_group ckd_group

. label var ckd_group "CKD group"

. tab ckd_group, m

    CKD group |      Freq.     Percent        Cum.
--------------+-----------------------------------
  Albuminuria |      1,276       61.43       61.43
  CKD stage 3 |        368       17.72       79.15
CKD stage 4/5 |         17        0.82       79.97
     Dialysis |        190        9.15       89.12
   Transplant |        177        8.52       97.64
  KRT unclear |         49        2.36      100.00
--------------+-----------------------------------
        Total |      2,077      100.00

. drop if ckd_group==.
(0 observations deleted)

. tab ckd_group modality_baseline

              |              modality_baseline
    CKD group |  Dialysis  Kidney ..  Modalit..    Pre KRT |     Total
--------------+--------------------------------------------+----------
  Albuminuria |         0          0          0      1,276 |     1,276 
  CKD stage 3 |         0          0          0        368 |       368 
CKD stage 4/5 |         0          0          0         17 |        17 
     Dialysis |       190          0          0          0 |       190 
   Transplant |         0        177          0          0 |       177 
  KRT unclear |         0          0         49          0 |        49 
--------------+--------------------------------------------+----------
        Total |       190        177         49      1,661 |     2,077 

. 
. *Dialysis & kidney transplant outcome classification
. foreach var of varlist  dialysis_outcome_primary_care   ///
>                                                 dialysis_outcome_icd_10                 ///
>                                                 dialysis_outcome_opcs_4                 ///
>                                                 dialysis_outcome_date                   ///
>                                                 kt_outcome_primary_care                 ///
>                                                 kt_outcome_icd_10                               ///
>                                                 kt_outcome_opcs_4                               ///
>                                                 kidney_transplant_outcome_date  ///
>                                                 died                                                    {
  2.         drop `var'
  3.         }

. tab ckd_group modality_outcome, m

              |                    modality_outcome
    CKD group |  Deceased   Dialysis  Kidney ..  Modalit..  Unchanged |     Total
--------------+-------------------------------------------------------+----------
  Albuminuria |       114         66         39         11      1,046 |     1,276 
  CKD stage 3 |        38         20         19          6        285 |       368 
CKD stage 4/5 |         2          0          1          0         14 |        17 
     Dialysis |        24         12          9          1        144 |       190 
   Transplant |        22          7          6          2        140 |       177 
  KRT unclear |         0          3          1          2         43 |        49 
--------------+-------------------------------------------------------+----------
        Total |       200        108         75         22      1,672 |     2,077 

. 
. *eGFR outcome classification based on updated mean eGFR over previous 18 months by the end of year
. gen sex = 1 if male == "Male"
(1,100 missing values generated)

. replace sex = 0 if male == "Female"
(1,100 real changes made)

. label define sex 0"Female" 1"Male"

. label values sex sex

. replace creatinine_outcome = . if !inrange(creatinine_outcome, 20, 3000)
(890 real changes made, 890 to missing)

. gen mgdl_creatinine_outcome = creatinine_outcome/88.4
(890 missing values generated)

. gen min_creatinine_outcome=.
(2,077 missing values generated)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(641 real changes made)

. replace min_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(546 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.329  if sex==0
(641 real changes made)

. replace min_creatinine_outcome = min_creatinine_outcome^-0.411  if sex==1
(546 real changes made)

. replace min_creatinine_outcome = 1 if min_creatinine_outcome<1
(778 real changes made)

. gen max_creatinine_outcome=.
(2,077 missing values generated)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.7 if sex==0
(641 real changes made)

. replace max_creatinine_outcome = mgdl_creatinine_outcome/0.9 if sex==1
(546 real changes made)

. replace max_creatinine_outcome = max_creatinine_outcome^-1.209
(1,187 real changes made)

. replace max_creatinine_outcome = 1 if max_creatinine_outcome>1
(1,299 real changes made)

. gen egfr_outcome = min_creatinine_outcome*max_creatinine_outcome*141
(890 missing values generated)

. replace egfr_outcome = egfr_outcome*(0.993^age)
(1,187 real changes made)

. replace egfr_outcome = egfr_outcome*1.018 if sex==0
(641 real changes made)

. drop creatinine_outcome

. drop mgdl_creatinine_outcome

. drop min_creatinine_outcome

. drop max_creatinine_outcome

. egen egfr_end = cut(egfr_outcome), at(0, 30, 60, 5000)
(890 missing values generated)

. drop egfr_outcome

. recode egfr_end 0=3 30=2 60=1
(1187 changes made to egfr_end)

. label define egfr_end 1 "â‰¥60" 2 "30-59" 3 "<30"

. label values egfr_end egfr_end

. label var egfr_end "Final eGFR"

. gen ckd_progression = 0

. replace ckd_progression = 1 if egfr_end==2 & ckd_group==1
(182 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==1
(8 real changes made)

. replace ckd_progression = 2 if egfr_end==3 & ckd_group==2
(2 real changes made)

. replace ckd_progression = 3 if modality_outcome=="Dialysis"
(108 real changes made)

. replace ckd_progression = 4 if modality_outcome=="Kidney transplant"
(75 real changes made)

. replace ckd_progression = 5 if modality_outcome=="Modality unclear"
(22 real changes made)

. replace ckd_progression = 6 if modality_outcome=="Deceased"
(200 real changes made)

. label define ckd_progression 0 "No progression" 1 "CKD 3" 2 "CKD 4/5 pre-KRT" 3 "Dialysis" 4 "Kidney transplant" 5 "KRT unclear modality" 6 "Deceased"

. label values ckd_progression ckd_progression

. label var ckd_progression "CKD progression"

. tab ckd_progression, m

     CKD progression |      Freq.     Percent        Cum.
---------------------+-----------------------------------
      No progression |      1,515       72.94       72.94
               CKD 3 |        148        7.13       80.07
     CKD 4/5 pre-KRT |          9        0.43       80.50
            Dialysis |        108        5.20       85.70
   Kidney transplant |         75        3.61       89.31
KRT unclear modality |         22        1.06       90.37
            Deceased |        200        9.63      100.00
---------------------+-----------------------------------
               Total |      2,077      100.00

. 
. *Totals for non-binary healthcare resource outcomes
. foreach aggregate of varlist m4_hospital_days m5_hospital_days m6_hospital_days m7_hospital_days m8_hospital_days m9_hospital_days m10_hospital_days m11_hospital_days m12_hospital_days m1_hospital_days m2_hospital_days m3_hospital_days m4_critical_ca
> re_days m5_critical_care_days m6_critical_care_days m7_critical_care_days m8_critical_care_days m9_critical_care_days m10_critical_care_days m11_critical_care_days m12_critical_care_days m1_critical_care_days m2_critical_care_days m3_critical_care_da
> ys m4_emergency_days m5_emergency_days m6_emergency_days m7_emergency_days m8_emergency_days m9_emergency_days m10_emergency_days m11_emergency_days m12_emergency_days m1_emergency_days m2_emergency_days m3_emergency_days m4_op_appts m5_op_appts m6_o
> p_appts m7_op_appts m8_op_appts m9_op_appts m10_op_appts m11_op_appts m12_op_appts m1_op_appts m2_op_appts m3_op_appts m4_neph_appts m5_neph_appts m6_neph_appts m7_neph_appts m8_neph_appts m9_neph_appts m10_neph_appts m11_neph_appts m12_neph_appts m1
> _neph_appts m2_neph_appts m3_neph_appts m4_tx_appts m5_tx_appts m6_tx_appts m7_tx_appts m8_tx_appts m9_tx_appts m10_tx_appts m11_tx_appts m12_tx_appts m1_tx_appts m2_tx_appts m3_tx_appts m4_gp_interactions m5_gp_interactions m6_gp_interactions m7_gp_
> interactions m8_gp_interactions m9_gp_interactions m10_gp_interactions m11_gp_interactions m12_gp_interactions m1_gp_interactions m2_gp_interactions m3_gp_interactions {
  2. bysort ckd_group: egen total_`aggregate' = total(`aggregate')
  3. egen overall_`aggregate' = total(`aggregate')
  4. tab ckd_group, sum(total_`aggregate')
  5. sum overall_`aggregate'
  6. }

            |  Summary of total_m4_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         382           0       1,276
  CKD stage |          85           0         368
  CKD stage |          11           0          17
   Dialysis |          35           0         190
  Transplan |          38           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   256.57776   159.21159       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m4~s |      2,077         564           0        564        564

            |  Summary of total_m5_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         289           0       1,276
  CKD stage |         105           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          49           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   205.27106   107.57239       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5~s |      2,077         512           0        512        512

            |  Summary of total_m6_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         324           0       1,276
  CKD stage |          62           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          32           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   217.21329   135.15857       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6~s |      2,077         483           0        483        483

            |  Summary of total_m7_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         366           0       1,276
  CKD stage |         117           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          29           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   251.25181   147.58703       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7~s |      2,077         555           0        555        555

            |  Summary of total_m8_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         358           0       1,276
  CKD stage |          81           0         368
  CKD stage |           5           0          17
   Dialysis |          62           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   244.97593   143.26796       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8~s |      2,077         568           0        568        568

            |  Summary of total_m9_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         281           0       1,276
  CKD stage |         105           0         368
  CKD stage |           6           0          17
   Dialysis |          69           0         190
  Transplan |          42           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   201.36447   102.50836       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9~s |      2,077         511           0        511        511

            | Summary of total_m10_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         300           0       1,276
  CKD stage |         107           0         368
  CKD stage |          11           0          17
   Dialysis |          55           0         190
  Transplan |          41           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |    212.1844   112.82138       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1~s |      2,077         527           0        527        527

            | Summary of total_m11_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          45           0         190
  Transplan |          35           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   223.35725   125.46172       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_hospit~s |      2,077         512           0        512        512

            | Summary of total_m12_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,276
  CKD stage |          88           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          45           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   258.43813    154.2957       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_hospit~s |      2,077         576           0        576        576

            |  Summary of total_m1_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,276
  CKD stage |         120           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   204.94222   105.56389       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1_~ |      2,077         517           0        517        517

            |  Summary of total_m2_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         368           0       1,276
  CKD stage |          86           0         368
  CKD stage |           5           0          17
   Dialysis |          63           0         190
  Transplan |          44           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   251.27203   148.03995       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2~s |      2,077         583           0        583        583

            |  Summary of total_m3_hospital_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,276
  CKD stage |         102           0         368
  CKD stage |           8           0          17
   Dialysis |          55           0         190
  Transplan |          47           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   216.41695   117.29742       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3~s |      2,077         521           0        521        521

            |             Summary of
            |     total_m4_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         296           0       1,276
  CKD stage |          87           0         368
  CKD stage |           9           0          17
   Dialysis |          46           0         190
  Transplan |          23           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   203.55031   118.24193       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overa~e_days |      2,077         463           0        463        463

            |             Summary of
            |     total_m5_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         308           0       1,276
  CKD stage |          94           0         368
  CKD stage |          10           0          17
   Dialysis |          49           0         190
  Transplan |          33           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   213.53346   120.71519       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         506           0        506        506

            |             Summary of
            |     total_m6_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         353           0       1,276
  CKD stage |         100           0         368
  CKD stage |           6           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   243.48435   139.57995       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         566           0        566        566

            |             Summary of
            |     total_m7_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,276
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          41           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   211.39384   114.98271       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         508           0        508        508

            |             Summary of
            |     total_m8_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         283           0       1,276
  CKD stage |          94           0         368
  CKD stage |           7           0          17
   Dialysis |          45           0         190
  Transplan |          39           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   198.24844   108.57666       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         478           0        478        478

            |             Summary of
            |     total_m9_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,276
  CKD stage |         116           0         368
  CKD stage |           4           0          17
   Dialysis |          72           0         190
  Transplan |          47           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   225.57053   116.27687       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         566           0        566        566

            |             Summary of
            |    total_m10_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         313           0       1,276
  CKD stage |         117           0         368
  CKD stage |           5           0          17
   Dialysis |          46           0         190
  Transplan |          42           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   220.94319   118.94459       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         527           0        527        527

            |             Summary of
            |    total_m11_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,276
  CKD stage |         143           0         368
  CKD stage |          13           0          17
   Dialysis |          47           0         190
  Transplan |          56           0         177
  KRT uncle |          29           0          49
------------+------------------------------------
      Total |   205.37313    95.27957       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         565           0        565        565

            |             Summary of
            |    total_m12_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         277           0       1,276
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          34           0         190
  Transplan |          60           0         177
  KRT uncle |          16           0          49
------------+------------------------------------
      Total |   197.91045   102.27393       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         495           0        495        495

            |             Summary of
            |     total_m1_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |          79           0         368
  CKD stage |          16           0          17
   Dialysis |          52           0         190
  Transplan |          67           0         177
  KRT uncle |           7           0          49
------------+------------------------------------
      Total |   221.96533   125.62209       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         542           0        542        542

            |             Summary of
            |     total_m2_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         377           0       1,276
  CKD stage |         141           0         368
  CKD stage |           0           0          17
   Dialysis |          68           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   266.45113   142.84813       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         641           0        641        641

            |             Summary of
            |     total_m3_critical_care_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |          70           0         368
  CKD stage |           3           0          17
   Dialysis |          53           0         190
  Transplan |          80           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   232.04911   134.24611       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         557           0        557        557

            | Summary of total_m4_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,276
  CKD stage |          53           0         368
  CKD stage |           7           0          17
   Dialysis |          22           0         190
  Transplan |          69           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   204.22003   126.59437       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overa~y_days |      2,077         460           0        460        460

            | Summary of total_m5_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         378           0       1,276
  CKD stage |          65           0         368
  CKD stage |           2           0          17
   Dialysis |          44           0         190
  Transplan |          38           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |    251.4208   160.11233       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         544           0        544        544

            | Summary of total_m6_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         339           0       1,276
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          55           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   236.91286   130.09105       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         568           0        568        568

            | Summary of total_m7_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,276
  CKD stage |         102           0         368
  CKD stage |           3           0          17
   Dialysis |          48           0         190
  Transplan |          49           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   239.41647   136.00083       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         556           0        556        556

            | Summary of total_m8_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,276
  CKD stage |          66           0         368
  CKD stage |           7           0          17
   Dialysis |          46           0         190
  Transplan |          53           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |   225.07703   136.67069       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         506           0        506        506

            | Summary of total_m9_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,276
  CKD stage |         113           0         368
  CKD stage |           3           0          17
   Dialysis |          51           0         190
  Transplan |          61           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   236.16418   126.51232       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         582           0        582        582

            | Summary of total_m10_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         348           0       1,276
  CKD stage |         111           0         368
  CKD stage |           2           0          17
   Dialysis |          24           0         190
  Transplan |          64           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   241.33799   136.93673       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         558           0        558        558

            | Summary of total_m11_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         301           0       1,276
  CKD stage |          86           0         368
  CKD stage |           4           0          17
   Dialysis |          71           0         190
  Transplan |          37           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   209.97833   116.04004       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         505           0        505        505

            | Summary of total_m12_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         355           0       1,276
  CKD stage |         131           0         368
  CKD stage |           0           0          17
   Dialysis |          48           0         190
  Transplan |          38           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   249.26336   136.67091       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         586           0        586        586

            | Summary of total_m1_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |         102           0         368
  CKD stage |           0           0          17
   Dialysis |          66           0         190
  Transplan |          24           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   216.69716   119.91405       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         506           0        506        506

            | Summary of total_m2_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         325           0       1,276
  CKD stage |          91           0         368
  CKD stage |          11           0          17
   Dialysis |          78           0         190
  Transplan |          40           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   226.82138   124.97191       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         562           0        562        562

            | Summary of total_m3_emergency_days
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         259           0       1,276
  CKD stage |          83           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   183.47183   96.203796       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         473           0        473        473

            |    Summary of total_m4_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         359           0       1,276
  CKD stage |         109           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          45           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   247.13288   143.21306       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ts |      2,077         555           0        555        555

            |    Summary of total_m5_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,276
  CKD stage |         123           0         368
  CKD stage |           7           0          17
   Dialysis |          57           0         190
  Transplan |          56           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   232.91719   121.22351       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~5_op_appts |      2,077         578           0        578        578

            |    Summary of total_m6_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |          92           0         368
  CKD stage |           1           0          17
   Dialysis |          60           0         190
  Transplan |          49           0         177
  KRT uncle |          28           0          49
------------+------------------------------------
      Total |    234.2831   131.74745       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~6_op_appts |      2,077         568           0        568        568

            |    Summary of total_m7_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         350           0       1,276
  CKD stage |         101           0         368
  CKD stage |           0           0          17
   Dialysis |          51           0         190
  Transplan |          44           0         177
  KRT uncle |           2           0          49
------------+------------------------------------
      Total |   241.37891   138.61265       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~7_op_appts |      2,077         548           0        548        548

            |    Summary of total_m8_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         335           0       1,276
  CKD stage |          91           0         368
  CKD stage |           8           0          17
   Dialysis |          34           0         190
  Transplan |          61           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   230.53972   133.03408       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~8_op_appts |      2,077         539           0        539        539

            |    Summary of total_m9_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         380           0       1,276
  CKD stage |         107           0         368
  CKD stage |           0           0          17
   Dialysis |          53           0         190
  Transplan |          54           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |   262.09629   150.21495       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~9_op_appts |      2,077         604           0        604        604

            |    Summary of total_m10_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         323           0       1,276
  CKD stage |         106           0         368
  CKD stage |          15           0          17
   Dialysis |          52           0         190
  Transplan |          66           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   228.21473   120.99981       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~0_op_appts |      2,077         583           0        583        583

            |    Summary of total_m11_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         329           0       1,276
  CKD stage |         114           0         368
  CKD stage |           6           0          17
   Dialysis |          55           0         190
  Transplan |          50           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   231.75445   124.85204       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_op_appts |      2,077         558           0        558        558

            |    Summary of total_m12_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         316           0       1,276
  CKD stage |          84           0         368
  CKD stage |           0           0          17
   Dialysis |          71           0         190
  Transplan |          66           0         177
  KRT uncle |          25           0          49
------------+------------------------------------
      Total |   221.72605   119.53245       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_op_appts |      2,077         562           0        562        562

            |    Summary of total_m1_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         344           0       1,276
  CKD stage |         104           0         368
  CKD stage |           0           0          17
   Dialysis |          43           0         190
  Transplan |          55           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   238.50072    134.7942       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         551           0        551        551

            |    Summary of total_m2_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         332           0       1,276
  CKD stage |         108           0         368
  CKD stage |           0           0          17
   Dialysis |          64           0         190
  Transplan |          46           0         177
  KRT uncle |          24           0          49
------------+------------------------------------
      Total |   233.43958   125.95504       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         574           0        574        574

            |    Summary of total_m3_op_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         385           0       1,276
  CKD stage |         103           0         368
  CKD stage |           2           0          17
   Dialysis |          51           0         190
  Transplan |          79           0         177
  KRT uncle |          21           0          49
------------+------------------------------------
      Total |   266.68272   150.37554       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~3_op_appts |      2,077         641           0        641        641

            |   Summary of total_m4_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         333           0       1,276
  CKD stage |          99           0         368
  CKD stage |          14           0          17
   Dialysis |          39           0         190
  Transplan |          28           0         177
  KRT uncle |           1           0          49
------------+------------------------------------
      Total |    228.2104   134.15356       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
over~h_appts |      2,077         514           0        514        514

            |   Summary of total_m5_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         304           0       1,276
  CKD stage |          69           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          32           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |    204.7299   126.02128       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         452           0        452        452

            |   Summary of total_m6_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         312           0       1,276
  CKD stage |         113           0         368
  CKD stage |           2           0          17
   Dialysis |          52           0         190
  Transplan |          37           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |    219.8363   118.78639       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         525           0        525        525

            |   Summary of total_m7_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         341           0       1,276
  CKD stage |          89           0         368
  CKD stage |           6           0          17
   Dialysis |          34           0         190
  Transplan |          44           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   232.52431   138.05195       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         529           0        529        529

            |   Summary of total_m8_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,276
  CKD stage |          98           0         368
  CKD stage |           2           0          17
   Dialysis |          37           0         190
  Transplan |          86           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   209.53828   109.64571       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         527           0        527        527

            |   Summary of total_m9_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         286           0       1,276
  CKD stage |          85           0         368
  CKD stage |           5           0          17
   Dialysis |          50           0         190
  Transplan |          30           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   198.38325   111.78332       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         475           0        475        475

            |   Summary of total_m10_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         406           0       1,276
  CKD stage |         122           0         368
  CKD stage |           1           0          17
   Dialysis |          22           0         190
  Transplan |          61           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   278.77901   163.00795       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         634           0        634        634

            |   Summary of total_m11_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         404           0       1,276
  CKD stage |          83           0         368
  CKD stage |           7           0          17
   Dialysis |          81           0         190
  Transplan |          49           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   274.82812   163.65495       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         636           0        636        636

            |   Summary of total_m12_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,276
  CKD stage |          73           0         368
  CKD stage |           0           0          17
   Dialysis |          36           0         190
  Transplan |          56           0         177
  KRT uncle |           3           0          49
------------+------------------------------------
      Total |   208.44632   122.62651       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         473           0        473        473

            |   Summary of total_m1_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         401           0       1,276
  CKD stage |          93           0         368
  CKD stage |           4           0          17
   Dialysis |          54           0         190
  Transplan |          38           0         177
  KRT uncle |          10           0          49
------------+------------------------------------
      Total |    271.2778   164.72353       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         600           0        600        600

            |   Summary of total_m2_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         321           0       1,276
  CKD stage |          93           0         368
  CKD stage |           0           0          17
   Dialysis |          33           0         190
  Transplan |          46           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   221.02311   127.58838       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         510           0        510        510

            |   Summary of total_m3_neph_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         379           0       1,276
  CKD stage |         111           0         368
  CKD stage |           6           0          17
   Dialysis |          39           0         190
  Transplan |          36           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   259.49591   152.82508       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         584           0        584        584

            |    Summary of total_m4_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         303           0       1,276
  CKD stage |         101           0         368
  CKD stage |           3           0          17
   Dialysis |          36           0         190
  Transplan |          83           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   214.71642   113.23504       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
over~x_appts |      2,077         538           0        538        538

            |    Summary of total_m5_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         416           0       1,276
  CKD stage |          92           0         368
  CKD stage |           9           0          17
   Dialysis |          37           0         190
  Transplan |          42           0         177
  KRT uncle |          26           0          49
------------+------------------------------------
      Total |   279.51998   173.18017       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~5_tx_appts |      2,077         622           0        622        622

            |    Summary of total_m6_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          75           0         368
  CKD stage |           9           0          17
   Dialysis |          30           0         190
  Transplan |          63           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   212.13529    124.3569       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~6_tx_appts |      2,077         496           0        496        496

            |    Summary of total_m7_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         346           0       1,276
  CKD stage |         102           0         368
  CKD stage |           5           0          17
   Dialysis |          41           0         190
  Transplan |          50           0         177
  KRT uncle |           6           0          49
------------+------------------------------------
      Total |   238.83052   136.84838       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~7_tx_appts |      2,077         550           0        550        550

            |    Summary of total_m8_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,276
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          45           0         190
  Transplan |          50           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   215.33462   121.90486       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~8_tx_appts |      2,077         501           0        501        501

            |    Summary of total_m9_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         295           0       1,276
  CKD stage |         120           0         368
  CKD stage |           4           0          17
   Dialysis |          29           0         190
  Transplan |          57           0         177
  KRT uncle |           5           0          49
------------+------------------------------------
      Total |   210.15503   110.49998       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~9_tx_appts |      2,077         510           0        510        510

            |    Summary of total_m10_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |         132           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          36           0         177
  KRT uncle |          14           0          49
------------+------------------------------------
      Total |   239.46654   127.78152       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~0_tx_appts |      2,077         575           0        575        575

            |    Summary of total_m11_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         305           0       1,276
  CKD stage |         100           0         368
  CKD stage |           0           0          17
   Dialysis |          55           0         190
  Transplan |          33           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   213.33847   117.43574       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~1_tx_appts |      2,077         510           0        510        510

            |    Summary of total_m12_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          63           0         190
  Transplan |          62           0         177
  KRT uncle |          13           0          49
------------+------------------------------------
      Total |   217.79634   117.21887       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~2_tx_appts |      2,077         544           0        544        544

            |    Summary of total_m1_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         327           0       1,276
  CKD stage |          89           0         368
  CKD stage |           5           0          17
   Dialysis |          56           0         190
  Transplan |          41           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   225.31825   129.48012       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         518           0        518        518

            |    Summary of total_m2_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         315           0       1,276
  CKD stage |          96           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          15           0          49
------------+------------------------------------
      Total |   217.47665   124.77424       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         500           0        500        500

            |    Summary of total_m3_tx_appts
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         347           0       1,276
  CKD stage |          93           0         368
  CKD stage |           9           0          17
   Dialysis |          84           0         190
  Transplan |          51           0         177
  KRT uncle |          20           0          49
------------+------------------------------------
      Total |   242.23207   133.09688       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
o~3_tx_appts |      2,077         604           0        604        604

            | Summary of total_m4_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         357           0       1,276
  CKD stage |          92           0         368
  CKD stage |           0           0          17
   Dialysis |          38           0         190
  Transplan |          63           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   244.86856   142.56209       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m~ns |      2,077         567           0        567        567

            | Summary of total_m5_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         340           0       1,276
  CKD stage |          80           0         368
  CKD stage |           0           0          17
   Dialysis |          60           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   232.04429   137.05132       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m5.. |      2,077         524           0        524        524

            | Summary of total_m6_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         393           0       1,276
  CKD stage |         119           0         368
  CKD stage |           3           0          17
   Dialysis |          46           0         190
  Transplan |          52           0         177
  KRT uncle |          19           0          49
------------+------------------------------------
      Total |   271.63505   155.09021       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m6.. |      2,077         632           0        632        632

            | Summary of total_m7_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         278           0       1,276
  CKD stage |          87           0         368
  CKD stage |           8           0          17
   Dialysis |          42           0         190
  Transplan |          49           0         177
  KRT uncle |          17           0          49
------------+------------------------------------
      Total |   194.68753   106.28184       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m7.. |      2,077         481           0        481        481

            | Summary of total_m8_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         338           0       1,276
  CKD stage |          89           0         368
  CKD stage |           1           0          17
   Dialysis |          42           0         190
  Transplan |          54           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |    232.3895   134.21641       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m8.. |      2,077         546           0        546        546

            | Summary of total_m9_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         310           0       1,276
  CKD stage |          90           0         368
  CKD stage |           6           0          17
   Dialysis |          61           0         190
  Transplan |          28           0         177
  KRT uncle |          22           0          49
------------+------------------------------------
      Total |   214.92826   121.26743       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m9.. |      2,077         517           0        517        517

            |             Summary of
            |      total_m10_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         306           0       1,276
  CKD stage |         127           0         368
  CKD stage |           0           0          17
   Dialysis |          46           0         190
  Transplan |          28           0         177
  KRT uncle |          12           0          49
------------+------------------------------------
      Total |   217.36928   115.77388       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         519           0        519        519

            |             Summary of
            |      total_m11_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         284           0       1,276
  CKD stage |          94           0         368
  CKD stage |           4           0          17
   Dialysis |          53           0         190
  Transplan |          40           0         177
  KRT uncle |           4           0          49
------------+------------------------------------
      Total |   199.51372   108.21324       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         479           0        479        479

            |             Summary of
            |      total_m12_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         311           0       1,276
  CKD stage |          93           0         368
  CKD stage |           3           0          17
   Dialysis |          52           0         190
  Transplan |          35           0         177
  KRT uncle |           9           0          49
------------+------------------------------------
      Total |   215.51613   121.92795       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         503           0        503        503

            | Summary of total_m1_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         292           0       1,276
  CKD stage |          49           0         368
  CKD stage |           7           0          17
   Dialysis |          58           0         190
  Transplan |          33           0         177
  KRT uncle |          11           0          49
------------+------------------------------------
      Total |   196.50602   120.84431       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m1.. |      2,077         450           0        450        450

            | Summary of total_m2_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,276
  CKD stage |          98           0         368
  CKD stage |           5           0          17
   Dialysis |          51           0         190
  Transplan |          21           0         177
  KRT uncle |           0           0          49
------------+------------------------------------
      Total |   224.13674   130.53229       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m2.. |      2,077         501           0        501        501

            | Summary of total_m3_gp_interactions
  CKD group |        Mean   Std. dev.       Freq.
------------+------------------------------------
  Albuminur |         326           0       1,276
  CKD stage |          75           0         368
  CKD stage |           1           0          17
   Dialysis |          46           0         190
  Transplan |          46           0         177
  KRT uncle |           8           0          49
------------+------------------------------------
      Total |   221.89071     132.043       2,077

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
overall_m3.. |      2,077         502           0        502        502

. 
. **Potential effect modifiers
. * Ethnicity
. * 1 = White ethnicities (white British, white Irish, with other)
. * 2 = Mixed ethnicities (white & black Caribbean, white & black African, white & Asian, other mixed ethnicities)
. * 3 = South Asian ethnicities (Indian, Pakistani, Bangladeshi, other South Asian)
. * 4 = Black ethnicities (black Caribbean, black African, other black)
. * 5 = Other ethnicities (Chinese, all other ethnicities)
. * . = Unknown ethnicity
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. replace ethnicity=6 if ethnicity==2
(81 real changes made)

. replace ethnicity=2 if ethnicity==3
(76 real changes made)

. replace ethnicity=3 if ethnicity==4
(82 real changes made)

. replace ethnicity=4 if ethnicity==6
(81 real changes made)

. replace ethnicity=6 if ethnicity==.
(524 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "South Asian"                         ///                                             
>                                                 3 "Black"                                       ///
>                                                 4 "Mixed"                                       ///
>                                                 5 "Other"                                       ///
>                                                 6 "Unknown"     

. label values ethnicity ethnicity

. 
. * Index of multiple deprivation
. * Ordered 1-5 from most deprived to least deprived
. label define imd 1 "1 Most deprived" 2 "2" 3 "3" 4 "4" 5 "5 Least deprived"

. label values imd imd

. 
. * Region
. rename region region_string

. gen region = 1 if region_string=="East Midlands"
(1,841 missing values generated)

. replace region = 2 if region_string=="East"
(193 real changes made)

. replace region = 3 if region_string=="London"
(413 real changes made)

. replace region = 4 if region_string=="North East"
(223 real changes made)

. replace region = 5 if region_string=="North West"
(207 real changes made)

. replace region = 6 if region_string=="South East"
(199 real changes made)

. replace region = 7 if region_string=="South West"
(205 real changes made)

. replace region = 8 if region_string=="West Midlands"
(221 real changes made)

. replace region = 9 if region_string=="Yorkshire and The Humber"
(180 real changes made)

. label define region     1 "East Midlands"                                       ///
>                                                 2 "East"                                                        ///
>                                                 3 "London"                                                      ///
>                                                 4 "North East"                                          ///
>                                                 5 "North West"                                          ///
>                                                 6 "South East"                                          ///
>                                                 7 "South West"                                          ///
>                                                 8 "West Midlands"                                       ///
>                                                 9 "Yorkshire and The Humber"            

. label values region region

. label var region "Region"

. 
. * Urban/rural
. replace rural_urban=. if rural_urban<1|rural_urban>8
(0 real changes made)

. label define rural_urban 1 "Urban major conurbation"                                            ///
>                                                  2 "Urban minor conurbation"                                            ///
>                                                  3 "Urban city and town"                                                        ///
>                                                  4 "Urban city and town in a sparse setting"            ///
>                                                  5 "Rural town and fringe"                                                      ///
>                                                  6 "Rural town and fringe in a sparse setting"          ///
>                                                  7 "Rural village and dispersed"                                        ///
>                                                  8 "Rural village and dispersed in a sparse setting"

. label values rural_urban rural_urban

. * Urban (binary)
. * Urban = 1-4 + missing, Rural = 5-8
. generate urban=.
(2,077 missing values generated)

. replace urban=1 if rural_urban<=4|rural_urban==.
(829 real changes made)

. replace urban=0 if rural_urban>4 & rural_urban!=.
(1,248 real changes made)

. label var urban "Urban/rural"

. label define urban 0 "Rural" 1 "Urban"

. label values urban urban

. drop rural_urban

. 
end of do-file

