-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/ckd_progression.log
  log type:  text
 opened on:  30 Aug 2023, 15:06:35

. 
. cap file close tablecontent

. file open tablecontent using ./output/ckd_progression.csv, write text replace

. 
. file write tablecontent ("stratum") _tab ("start_status") _tab ("end_status") _tab ("count_2017") _tab ("count_2018") _tab ("count_2019") _tab ("count_2020") _tab ("count_2021") _tab ("count_2022") _n

. 
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete.dta, clear
  3. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  4. local baseline_ckd_`x' = round(r(N),5)
  5. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  6. local none_ckd_`x' = round(r(N),5)
  7. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
  8. local ckd3_ckd_`x' = round(r(N),5)
  9. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 10. local ckd4_ckd_`x' = round(r(N),5)
 11. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 12. local dialysis_ckd_`x' = round(r(N),5)
 13. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 14. local kt_ckd_`x' = round(r(N),5)
 15. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 16. local deceased_ckd_`x' = round(r(N),5)
 17. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 18. local baseline_ckd2_`x' = round(r(N),5)
 19. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 20. local none_ckd2_`x' = round(r(N),5)
 21. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 22. local ckd3_ckd2_`x' = round(r(N),5)
 23. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 24. local ckd4_ckd2_`x' = round(r(N),5)
 25. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 26. local dialysis_ckd2_`x' = round(r(N),5)
 27. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 28. local kt_ckd2_`x' = round(r(N),5)
 29. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 30. local deceased_ckd2_`x' = round(r(N),5)
 31. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 32. local baseline_ckd3_`x' = round(r(N),5)
 33. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 34. local none_ckd3_`x' = round(r(N),5)
 35. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 36. local ckd4_ckd3_`x' = round(r(N),5)
 37. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 38. local dialysis_ckd3_`x' = round(r(N),5)
 39. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 40. local kt_ckd3_`x' = round(r(N),5)
 41. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 42. local deceased_ckd3_`x' = round(r(N),5)
 43. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 44. local baseline_ckd4_`x' = round(r(N),5)
 45. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 46. local none_ckd4_`x' = round(r(N),5)
 47. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 48. local dialysis_ckd4_`x' = round(r(N),5)
 49. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 50. local kt_ckd4_`x' = round(r(N),5)
 51. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 52. local deceased_ckd4_`x' = round(r(N),5)
 53. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 54. local baseline_dialysis_`x' = round(r(N),5)
 55. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 56. local none_dialysis_`x' = round(r(N),5)
 57. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 58. local kt_dialysis_`x' = round(r(N),5)
 59. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 60. local deceased_dialysis_`x' = round(r(N),5)
 61. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 62. local baseline_kt_`x' = round(r(N),5)
 63. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 64. local none_kt_`x' = round(r(N),5)
 65. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 66. local dialysis_kt_`x' = round(r(N),5)
 67. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 68. local deceased_kt_`x' = round(r(N),5)
 69. }

. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("All") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`baseline_
> ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _tab (`dial
> ysis_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _tab (`dece
> ased_ckd_2022') _n

. 
. *eGFR >60 with albuminuria
. file write tablecontent ("All") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') _tab (`
> baseline_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (`none_ckd2
> _2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ckd3_ckd2_20
> 22') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`ckd4_ckd2_
> 2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2_2021') _t
> ab (`dialysis_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022') _n

. file write tablecontent ("All") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2_2021') _t
> ab (`deceased_ckd2_2022') _n

. 
. *CKD stage 3
. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') _tab (`
> baseline_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (`none_ckd3
> _2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`ckd4_ckd3_
> 2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3_2021') _t
> ab (`dialysis_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3_2021') _t
> ab (`deceased_ckd3_2022') _n

. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021') _tab 
> (`baseline_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab (`none_ck
> d4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ckd4_2021') 
> _tab (`dialysis_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_2022') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ckd4_2021') 
> _tab (`deceased_ckd4_2022') _n

. 
. *Dialysis
. file write tablecontent ("All") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline_dialys
> is_2021') _tab (`baseline_dialysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialysis_2021')
>  _tab (`none_dialysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _tab (`kt_dia
> lysis_2022') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`deceased_d
> ialysis_2021') _tab (`deceased_dialysis_2022') _n

. 
. *Kidney Transplant
. file write tablecontent ("All") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`baseline_kt
> _2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _tab (`dialys
> is_kt_2022') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _tab (`deceas
> ed_kt_2022') _n

. 
. 
. forvalues i=1/6 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. local label`i': label ethnicity `i'
  5. drop if ethnicity!=`i'
  6. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  7. local baseline_ckd_`x' = round(r(N),5)
  8. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  9. local none_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 11. local ckd3_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 13. local ckd4_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 15. local dialysis_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 17. local kt_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 19. local deceased_ckd_`x' = round(r(N),5)
 20. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 21. local baseline_ckd2_`x' = round(r(N),5)
 22. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 23. local none_ckd2_`x' = round(r(N),5)
 24. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 25. local ckd3_ckd2_`x' = round(r(N),5)
 26. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 27. local ckd4_ckd2_`x' = round(r(N),5)
 28. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 29. local dialysis_ckd2_`x' = round(r(N),5)
 30. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 31. local kt_ckd2_`x' = round(r(N),5)
 32. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 33. local deceased_ckd2_`x' = round(r(N),5)
 34. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 35. local baseline_ckd3_`x' = round(r(N),5)
 36. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 37. local none_ckd3_`x' = round(r(N),5)
 38. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 39. local ckd4_ckd3_`x' = round(r(N),5)
 40. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 41. local dialysis_ckd3_`x' = round(r(N),5)
 42. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 43. local kt_ckd3_`x' = round(r(N),5)
 44. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 45. local deceased_ckd3_`x' = round(r(N),5)
 46. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 47. local baseline_ckd4_`x' = round(r(N),5)
 48. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 49. local none_ckd4_`x' = round(r(N),5)
 50. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 51. local dialysis_ckd4_`x' = round(r(N),5)
 52. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 53. local kt_ckd4_`x' = round(r(N),5)
 54. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 55. local deceased_ckd4_`x' = round(r(N),5)
 56. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 57. local baseline_dialysis_`x' = round(r(N),5)
 58. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 59. local none_dialysis_`x' = round(r(N),5)
 60. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 61. local kt_dialysis_`x' = round(r(N),5)
 62. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 63. local deceased_dialysis_`x' = round(r(N),5)
 64. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 65. local baseline_kt_`x' = round(r(N),5)
 66. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 67. local none_kt_`x' = round(r(N),5)
 68. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 69. local dialysis_kt_`x' = round(r(N),5)
 70. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 71. local deceased_kt_`x' = round(r(N),5)
 72. }
 73. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
 74. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
 75. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
 76. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
 77. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
 78. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
 79. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
 80. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
 81. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
 82. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
 83. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
 84. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
 85. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
 86. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
 87. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
 88. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
 89. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
 90. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
 91. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
 92. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
 93. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
 94. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
 95. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
 96. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
 97. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
 98. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
 99. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
100. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
101. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
102. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
103. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
104. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
105. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
106. }
(816 observations deleted)
(816 observations deleted)
(832 observations deleted)
(830 observations deleted)
(887 observations deleted)
(845 observations deleted)
(2,010 observations deleted)
(2,027 observations deleted)
(1,983 observations deleted)
(2,053 observations deleted)
(2,075 observations deleted)
(1,991 observations deleted)
(2,015 observations deleted)
(2,026 observations deleted)
(1,986 observations deleted)
(2,047 observations deleted)
(2,066 observations deleted)
(1,994 observations deleted)
(2,006 observations deleted)
(2,020 observations deleted)
(1,962 observations deleted)
(2,064 observations deleted)
(2,049 observations deleted)
(1,987 observations deleted)
(2,004 observations deleted)
(2,005 observations deleted)
(1,978 observations deleted)
(2,069 observations deleted)
(2,064 observations deleted)
(2,007 observations deleted)
(1,539 observations deleted)
(1,571 observations deleted)
(1,529 observations deleted)
(1,587 observations deleted)
(1,579 observations deleted)
(1,541 observations deleted)

. 
. forvalues i=1/5 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. local label`i': label imd `i'
  5. drop if imd!=`i'
  6. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  7. local baseline_ckd_`x' = round(r(N),5)
  8. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  9. local none_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 11. local ckd3_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 13. local ckd4_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 15. local dialysis_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 17. local kt_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 19. local deceased_ckd_`x' = round(r(N),5)
 20. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 21. local baseline_ckd2_`x' = round(r(N),5)
 22. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 23. local none_ckd2_`x' = round(r(N),5)
 24. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 25. local ckd3_ckd2_`x' = round(r(N),5)
 26. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 27. local ckd4_ckd2_`x' = round(r(N),5)
 28. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 29. local dialysis_ckd2_`x' = round(r(N),5)
 30. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 31. local kt_ckd2_`x' = round(r(N),5)
 32. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 33. local deceased_ckd2_`x' = round(r(N),5)
 34. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 35. local baseline_ckd3_`x' = round(r(N),5)
 36. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 37. local none_ckd3_`x' = round(r(N),5)
 38. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 39. local ckd4_ckd3_`x' = round(r(N),5)
 40. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 41. local dialysis_ckd3_`x' = round(r(N),5)
 42. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 43. local kt_ckd3_`x' = round(r(N),5)
 44. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 45. local deceased_ckd3_`x' = round(r(N),5)
 46. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 47. local baseline_ckd4_`x' = round(r(N),5)
 48. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 49. local none_ckd4_`x' = round(r(N),5)
 50. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 51. local dialysis_ckd4_`x' = round(r(N),5)
 52. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 53. local kt_ckd4_`x' = round(r(N),5)
 54. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 55. local deceased_ckd4_`x' = round(r(N),5)
 56. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 57. local baseline_dialysis_`x' = round(r(N),5)
 58. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 59. local none_dialysis_`x' = round(r(N),5)
 60. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 61. local kt_dialysis_`x' = round(r(N),5)
 62. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 63. local deceased_dialysis_`x' = round(r(N),5)
 64. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 65. local baseline_kt_`x' = round(r(N),5)
 66. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 67. local none_kt_`x' = round(r(N),5)
 68. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 69. local dialysis_kt_`x' = round(r(N),5)
 70. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 71. local deceased_kt_`x' = round(r(N),5)
 72. }
 73. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
 74. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
 75. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
 76. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
 77. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
 78. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
 79. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
 80. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
 81. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
 82. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
 83. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
 84. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
 85. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
 86. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
 87. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
 88. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
 89. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
 90. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
 91. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
 92. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
 93. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
 94. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
 95. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
 96. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
 97. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
 98. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
 99. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
100. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
101. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
102. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
103. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
104. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
105. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
106. }
(1,659 observations deleted)
(1,674 observations deleted)
(1,632 observations deleted)
(1,688 observations deleted)
(1,692 observations deleted)
(1,672 observations deleted)
(1,659 observations deleted)
(1,672 observations deleted)
(1,670 observations deleted)
(1,685 observations deleted)
(1,724 observations deleted)
(1,655 observations deleted)
(1,665 observations deleted)
(1,659 observations deleted)
(1,664 observations deleted)
(1,719 observations deleted)
(1,729 observations deleted)
(1,648 observations deleted)
(1,678 observations deleted)
(1,712 observations deleted)
(1,624 observations deleted)
(1,728 observations deleted)
(1,714 observations deleted)
(1,647 observations deleted)
(1,651 observations deleted)
(1,655 observations deleted)
(1,626 observations deleted)
(1,700 observations deleted)
(1,717 observations deleted)
(1,670 observations deleted)

. 
. forvalues i=1/9 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. local label`i': label region `i'
  5. drop if region!=`i'
  6. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  7. local baseline_ckd_`x' = round(r(N),5)
  8. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  9. local none_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 11. local ckd3_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 13. local ckd4_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 15. local dialysis_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 17. local kt_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 19. local deceased_ckd_`x' = round(r(N),5)
 20. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 21. local baseline_ckd2_`x' = round(r(N),5)
 22. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 23. local none_ckd2_`x' = round(r(N),5)
 24. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 25. local ckd3_ckd2_`x' = round(r(N),5)
 26. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 27. local ckd4_ckd2_`x' = round(r(N),5)
 28. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 29. local dialysis_ckd2_`x' = round(r(N),5)
 30. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 31. local kt_ckd2_`x' = round(r(N),5)
 32. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 33. local deceased_ckd2_`x' = round(r(N),5)
 34. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 35. local baseline_ckd3_`x' = round(r(N),5)
 36. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 37. local none_ckd3_`x' = round(r(N),5)
 38. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 39. local ckd4_ckd3_`x' = round(r(N),5)
 40. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 41. local dialysis_ckd3_`x' = round(r(N),5)
 42. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 43. local kt_ckd3_`x' = round(r(N),5)
 44. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 45. local deceased_ckd3_`x' = round(r(N),5)
 46. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 47. local baseline_ckd4_`x' = round(r(N),5)
 48. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 49. local none_ckd4_`x' = round(r(N),5)
 50. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 51. local dialysis_ckd4_`x' = round(r(N),5)
 52. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 53. local kt_ckd4_`x' = round(r(N),5)
 54. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 55. local deceased_ckd4_`x' = round(r(N),5)
 56. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 57. local baseline_dialysis_`x' = round(r(N),5)
 58. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 59. local none_dialysis_`x' = round(r(N),5)
 60. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 61. local kt_dialysis_`x' = round(r(N),5)
 62. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 63. local deceased_dialysis_`x' = round(r(N),5)
 64. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 65. local baseline_kt_`x' = round(r(N),5)
 66. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 67. local none_kt_`x' = round(r(N),5)
 68. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 69. local dialysis_kt_`x' = round(r(N),5)
 70. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 71. local deceased_kt_`x' = round(r(N),5)
 72. }
 73. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
 74. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
 75. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
 76. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
 77. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
 78. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
 79. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
 80. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
 81. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
 82. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
 83. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
 84. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
 85. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
 86. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
 87. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
 88. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
 89. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
 90. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
 91. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
 92. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
 93. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
 94. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
 95. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
 96. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
 97. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
 98. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
 99. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
100. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
101. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
102. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
103. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
104. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
105. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
106. }
(1,877 observations deleted)
(1,908 observations deleted)
(1,843 observations deleted)
(1,930 observations deleted)
(1,931 observations deleted)
(1,861 observations deleted)
(1,895 observations deleted)
(1,882 observations deleted)
(1,849 observations deleted)
(1,923 observations deleted)
(1,929 observations deleted)
(1,862 observations deleted)
(1,639 observations deleted)
(1,668 observations deleted)
(1,629 observations deleted)
(1,685 observations deleted)
(1,706 observations deleted)
(1,647 observations deleted)
(1,881 observations deleted)
(1,880 observations deleted)
(1,833 observations deleted)
(1,920 observations deleted)
(1,908 observations deleted)
(1,874 observations deleted)
(1,876 observations deleted)
(1,873 observations deleted)
(1,845 observations deleted)
(1,933 observations deleted)
(1,938 observations deleted)
(1,885 observations deleted)
(1,869 observations deleted)
(1,886 observations deleted)
(1,859 observations deleted)
(1,930 observations deleted)
(1,934 observations deleted)
(1,860 observations deleted)
(1,859 observations deleted)
(1,899 observations deleted)
(1,871 observations deleted)
(1,918 observations deleted)
(1,947 observations deleted)
(1,849 observations deleted)
(1,857 observations deleted)
(1,890 observations deleted)
(1,853 observations deleted)
(1,908 observations deleted)
(1,929 observations deleted)
(1,893 observations deleted)
(1,871 observations deleted)
(1,858 observations deleted)
(1,850 observations deleted)
(1,893 observations deleted)
(1,930 observations deleted)
(1,853 observations deleted)

. 
. forvalues i=0/1 {
  2. foreach x of local year {
  3. use ./output/`x'_ckd_complete.dta, clear
  4. local label`i': label urban `i'
  5. drop if urban!=`i'
  6. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  7. local baseline_ckd_`x' = round(r(N),5)
  8. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  9. local none_ckd_`x' = round(r(N),5)
 10. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
 11. local ckd3_ckd_`x' = round(r(N),5)
 12. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 13. local ckd4_ckd_`x' = round(r(N),5)
 14. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 15. local dialysis_ckd_`x' = round(r(N),5)
 16. *Total number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_progression==4
 17. local kt_ckd_`x' = round(r(N),5)
 18. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 19. local deceased_ckd_`x' = round(r(N),5)
 20. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui safecount if ckd_group==1
 21. local baseline_ckd2_`x' = round(r(N),5)
 22. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 23. local none_ckd2_`x' = round(r(N),5)
 24. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 25. local ckd3_ckd2_`x' = round(r(N),5)
 26. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 27. local ckd4_ckd2_`x' = round(r(N),5)
 28. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 29. local dialysis_ckd2_`x' = round(r(N),5)
 30. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 31. local kt_ckd2_`x' = round(r(N),5)
 32. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 33. local deceased_ckd2_`x' = round(r(N),5)
 34. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui safecount if ckd_group==2
 35. local baseline_ckd3_`x' = round(r(N),5)
 36. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 37. local none_ckd3_`x' = round(r(N),5)
 38. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 39. local ckd4_ckd3_`x' = round(r(N),5)
 40. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 41. local dialysis_ckd3_`x' = round(r(N),5)
 42. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 43. local kt_ckd3_`x' = round(r(N),5)
 44. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 45. local deceased_ckd3_`x' = round(r(N),5)
 46. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui safecount if ckd_group==3
 47. local baseline_ckd4_`x' = round(r(N),5)
 48. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 49. local none_ckd4_`x' = round(r(N),5)
 50. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 51. local dialysis_ckd4_`x' = round(r(N),5)
 52. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 53. local kt_ckd4_`x' = round(r(N),5)
 54. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 55. local deceased_ckd4_`x' = round(r(N),5)
 56. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui safecount if ckd_group==4
 57. local baseline_dialysis_`x' = round(r(N),5)
 58. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 59. local none_dialysis_`x' = round(r(N),5)
 60. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 61. local kt_dialysis_`x' = round(r(N),5)
 62. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 63. local deceased_dialysis_`x' = round(r(N),5)
 64. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui safecount if ckd_group==5
 65. local baseline_kt_`x' = round(r(N),5)
 66. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 67. local none_kt_`x' = round(r(N),5)
 68. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 69. local dialysis_kt_`x' = round(r(N),5)
 70. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 71. local deceased_kt_`x' = round(r(N),5)
 72. }
 73. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab (`baseline_ckd_2017') _tab (`baseline_ckd_2018') _tab (`baseline_ckd_2019') _tab (`baseline_ckd_2020') _tab (`baseline_ckd_2021') _tab (`ba
> seline_ckd_2022') _n
 74. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab (`none_ckd_2017') _tab (`none_ckd_2018') _tab (`none_ckd_2019') _tab (`none_ckd_2020') _tab (`none_ckd_2021') _tab (`none_ckd
> _2022') _n
 75. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab (`ckd3_ckd_2017') _tab (`ckd3_ckd_2018') _tab (`ckd3_ckd_2019') _tab (`ckd3_ckd_2020') _tab (`ckd3_ckd_2021') _tab (`ckd3_ckd_20
> 22') _n
 76. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab (`ckd4_ckd_2017') _tab (`ckd4_ckd_2018') _tab (`ckd4_ckd_2019') _tab (`ckd4_ckd_2020') _tab (`ckd4_ckd_2021') _tab (`ckd4_ckd_
> 2022') _n
 77. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab (`dialysis_ckd_2017') _tab (`dialysis_ckd_2018') _tab (`dialysis_ckd_2019') _tab (`dialysis_ckd_2020') _tab (`dialysis_ckd_2021') _
> tab (`dialysis_ckd_2022') _n
 78. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab (`kt_ckd_2017') _tab (`kt_ckd_2018') _tab (`kt_ckd_2019') _tab (`kt_ckd_2020') _tab (`kt_ckd_2021') _tab (`kt_ckd_2022') _n
 79. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab (`deceased_ckd_2017') _tab (`deceased_ckd_2018') _tab (`deceased_ckd_2019') _tab (`deceased_ckd_2020') _tab (`deceased_ckd_2021') _
> tab (`deceased_ckd_2022') _n
 80. 
. *eGFR >60 with albuminuria
. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("N/A") _tab (`baseline_ckd2_2017') _tab (`baseline_ckd2_2018') _tab (`baseline_ckd2_2019') _tab (`baseline_ckd2_2020') _tab (`baseline_ckd2_2021') 
> _tab (`baseline_ckd2_2022') _n
 81. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("No progression") _tab (`none_ckd2_2017') _tab (`none_ckd2_2018') _tab (`none_ckd2_2019') _tab (`none_ckd2_2020') _tab (`none_ckd2_2021') _tab (
> `none_ckd2_2022') _n
 82. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 3") _tab (`ckd3_ckd2_2017') _tab (`ckd3_ckd2_2018') _tab (`ckd3_ckd2_2019') _tab (`ckd3_ckd2_2020') _tab (`ckd3_ckd2_2021') _tab (`ck
> d3_ckd2_2022') _n
 83. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("CKD stage 4/5") _tab (`ckd4_ckd2_2017') _tab (`ckd4_ckd2_2018') _tab (`ckd4_ckd2_2019') _tab (`ckd4_ckd2_2020') _tab (`ckd4_ckd2_2021') _tab (`
> ckd4_ckd2_2022') _n
 84. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Dialysis") _tab (`dialysis_ckd2_2017') _tab (`dialysis_ckd2_2018') _tab (`dialysis_ckd2_2019') _tab (`dialysis_ckd2_2020') _tab (`dialysis_ckd2
> _2021') _tab (`dialysis_ckd2_2022') _n
 85. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Transplant") _tab (`kt_ckd2_2017') _tab (`kt_ckd2_2018') _tab (`kt_ckd2_2019') _tab (`kt_ckd2_2020') _tab (`kt_ckd2_2021') _tab (`kt_ckd2_2022'
> ) _n
 86. file write tablecontent ("`label`i''") _tab ("Albuminuria") _tab ("Deceased") _tab (`deceased_ckd2_2017') _tab (`deceased_ckd2_2018') _tab (`deceased_ckd2_2019') _tab (`deceased_ckd2_2020') _tab (`deceased_ckd2
> _2021') _tab (`deceased_ckd2_2022') _n
 87. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab (`baseline_ckd3_2017') _tab (`baseline_ckd3_2018') _tab (`baseline_ckd3_2019') _tab (`baseline_ckd3_2020') _tab (`baseline_ckd3_2021') 
> _tab (`baseline_ckd3_2022') _n
 88. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab (`none_ckd3_2017') _tab (`none_ckd3_2018') _tab (`none_ckd3_2019') _tab (`none_ckd3_2020') _tab (`none_ckd3_2021') _tab (
> `none_ckd3_2022') _n
 89. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab (`ckd4_ckd3_2017') _tab (`ckd4_ckd3_2018') _tab (`ckd4_ckd3_2019') _tab (`ckd4_ckd3_2020') _tab (`ckd4_ckd3_2021') _tab (`
> ckd4_ckd3_2022') _n
 90. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab (`dialysis_ckd3_2017') _tab (`dialysis_ckd3_2018') _tab (`dialysis_ckd3_2019') _tab (`dialysis_ckd3_2020') _tab (`dialysis_ckd3
> _2021') _tab (`dialysis_ckd3_2022') _n
 91. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Transplant") _tab (`kt_ckd3_2017') _tab (`kt_ckd3_2018') _tab (`kt_ckd3_2019') _tab (`kt_ckd3_2020') _tab (`kt_ckd3_2021') _tab (`kt_ckd3_2022'
> ) _n
 92. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab (`deceased_ckd3_2017') _tab (`deceased_ckd3_2018') _tab (`deceased_ckd3_2019') _tab (`deceased_ckd3_2020') _tab (`deceased_ckd3
> _2021') _tab (`deceased_ckd3_2022') _n
 93. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab (`baseline_ckd4_2017') _tab (`baseline_ckd4_2018') _tab (`baseline_ckd4_2019') _tab (`baseline_ckd4_2020') _tab (`baseline_ckd4_2021'
> ) _tab (`baseline_ckd4_2022') _n
 94. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab (`none_ckd4_2017') _tab (`none_ckd4_2018') _tab (`none_ckd4_2019') _tab (`none_ckd4_2020') _tab (`none_ckd4_2021') _tab
>  (`none_ckd4_2022') _n
 95. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab (`dialysis_ckd4_2017') _tab (`dialysis_ckd4_2018') _tab (`dialysis_ckd4_2019') _tab (`dialysis_ckd4_2020') _tab (`dialysis_ck
> d4_2021') _tab (`dialysis_ckd4_2022') _n
 96. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab (`kt_ckd4_2017') _tab (`kt_ckd4_2018') _tab (`kt_ckd4_2019') _tab (`kt_ckd4_2020') _tab (`kt_ckd4_2021') _tab (`kt_ckd4_202
> 2') _n
 97. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab (`deceased_ckd4_2017') _tab (`deceased_ckd4_2018') _tab (`deceased_ckd4_2019') _tab (`deceased_ckd4_2020') _tab (`deceased_ck
> d4_2021') _tab (`deceased_ckd4_2022') _n
 98. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab (`baseline_dialysis_2017') _tab (`baseline_dialysis_2018') _tab (`baseline_dialysis_2019') _tab (`baseline_dialysis_2020') _tab (`baseline
> _dialysis_2021') _tab (`baseline_dialysis_2022') _n
 99. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab (`none_dialysis_2017') _tab (`none_dialysis_2018') _tab (`none_dialysis_2019') _tab (`none_dialysis_2020') _tab (`none_dialy
> sis_2021') _tab (`none_dialysis_2022') _n
100. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab (`kt_dialysis_2017') _tab (`kt_dialysis_2018') _tab (`kt_dialysis_2019') _tab (`kt_dialysis_2020') _tab (`kt_dialysis_2021') _ta
> b (`kt_dialysis_2022') _n
101. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab (`deceased_dialysis_2017') _tab (`deceased_dialysis_2018') _tab (`deceased_dialysis_2019') _tab (`deceased_dialysis_2020') _tab (`
> deceased_dialysis_2021') _tab (`deceased_dialysis_2022') _n
102. 
. *Kidney Transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab (`baseline_kt_2017') _tab (`baseline_kt_2018') _tab (`baseline_kt_2019') _tab (`baseline_kt_2020') _tab (`baseline_kt_2021') _tab (`base
> line_kt_2022') _n
103. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab (`none_kt_2017') _tab (`none_kt_2018') _tab (`none_kt_2019') _tab (`none_kt_2020') _tab (`none_kt_2021') _tab (`none_kt_20
> 22') _n
104. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab (`dialysis_kt_2017') _tab (`dialysis_kt_2018') _tab (`dialysis_kt_2019') _tab (`dialysis_kt_2020') _tab (`dialysis_kt_2021') _ta
> b (`dialysis_kt_2022') _n
105. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab (`deceased_kt_2017') _tab (`deceased_kt_2018') _tab (`deceased_kt_2019') _tab (`deceased_kt_2020') _tab (`deceased_kt_2021') _ta
> b (`deceased_kt_2022') _n
106. }
(822 observations deleted)
(861 observations deleted)
(835 observations deleted)
(823 observations deleted)
(855 observations deleted)
(814 observations deleted)
(1,256 observations deleted)
(1,232 observations deleted)
(1,219 observations deleted)
(1,307 observations deleted)
(1,289 observations deleted)
(1,259 observations deleted)

. 
. 
. file close tablecontent

. 
. **Redact counts of 0 from each column in table (adapted from code by Emily Herrett)
. clear

. import delimited ./output/ckd_progression.csv
(encoding automatically selected: ISO-8859-1)
(9 vars, 759 obs)

. local columns " "count_2017" "count_2018" "count_2019" "count_2020" "count_2021" "count_2022" "

. foreach col in `columns' {
  2. replace `col'=. if `col'<=5
  3. }
(176 real changes made, 176 to missing)
(180 real changes made, 180 to missing)
(176 real changes made, 176 to missing)
(161 real changes made, 161 to missing)
(147 real changes made, 147 to missing)
(160 real changes made, 160 to missing)

.         
. export delimited "./output/ckd_progression.csv", replace
file ./output/ckd_progression.csv saved

. 
end of do-file

. cd ..\ ..\
invalid syntax
r(198);

. cd ..\..\
C:\Users\lsh1703468\Documents

. cd repos
C:\Users\lsh1703468\Documents\repos

. use ./output/analysis_2017.dta, clear

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD58cc_000000.tmp"

. stset exit_date_esrd, fail(esrd_date) origin(index_date_esrd) id(unique) scale(365.25)

Survival-time data settings

           ID variable: unique
         Failure event: esrd_date!=0 & esrd_date<.
Observed time interval: (exit_date_esrd[_n-1], exit_date_esrd]
     Exit on or before: failure
     Time for analysis: (time-origin)/365.25
                Origin: time index_date_esrd

--------------------------------------------------------------------------
     25,703  total observations
          0  exclusions
--------------------------------------------------------------------------
     25,703  observations remaining, representing
     25,703  subjects
      2,596  failures in single-failure-per-subject data
 43,458.272  total analysis time at risk and under observation
                                                At risk from t =         0
                                     Earliest observed entry t =         0
                                          Last observed exit t =  2.847365

. 
end of do-file

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD58cc_000000.tmp"

. qui stcox i.severity##i.agegroup i.sex i.ethnicity i.imd i.urban i.stp i.bmi i.smoking i.ckd_stage i.aki_baseline i.cardiovascular i.diabetes i.hypertension i.immunosuppressed i.non_haem_cancer i.gp_consults i.adm
> issions
variable severity not found
r(111);

end of do-file

r(111);

. browse

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD58cc_000000.tmp"

. qui stcox i.covid_severity##i.agegroup i.sex i.ethnicity i.imd i.urban i.stp i.bmi i.smoking i.ckd_stage i.aki_baseline i.cardiovascular i.diabetes i.hypertension i.immunosuppressed i.non_haem_cancer i.gp_consults
>  i.admissions

. est store a

. qui stcox i.covid_severity i.agegroup i.sex i.ethnicity i.imd i.urban i.stp i.bmi i.smoking i.ckd_stage i.aki_baseline i.cardiovascular i.diabetes i.hypertension i.immunosuppressed i.non_haem_cancer i.gp_consults 
> i.admissions

. est store b

. 
end of do-file

. lrtest b a

Likelihood-ratio test
Assumption: b nested within a

LR chi2(10) =   7.84
Prob > chi2 = 0.6446

. stcox i.covid_severity i.sex i.ethnicity i.imd i.urban i.stp i.bmi i.smoking i.ckd_stage i.aki_baseline i.cardiovascular i.diabetes i.hypertension i.immunosuppressed i.non_haem_cancer i.gp_consults i.admissions, v
> ce(cluster practice_id)

        Failure _d: esrd_date
  Analysis time _t: (exit_date_esrd-origin)/365.25
            Origin: time index_date_esrd
       ID variable: unique

Iteration 0:   log pseudolikelihood = -2282.7329
Iteration 1:   log pseudolikelihood = -2242.4404
Iteration 2:   log pseudolikelihood = -2241.0722
Iteration 3:   log pseudolikelihood = -2241.0546
Iteration 4:   log pseudolikelihood = -2241.0546
Refining estimates:
Iteration 0:   log pseudolikelihood = -2241.0546

Cox regression with Breslow method for ties

No. of subjects =      3,084                          Number of obs =    3,084
No. of failures =        300
Time at risk    = 5,200.2108
                                                      Wald chi2(34) = 13057.66
Log pseudolikelihood = -2241.0546                     Prob > chi2   =   0.0000

                                            (Std. err. adjusted for 35 clusters in practice_id)
-----------------------------------------------------------------------------------------------
                              |               Robust
                           _t | Haz. ratio   std. err.      z    P>|z|     [95% conf. interval]
------------------------------+----------------------------------------------------------------
               covid_severity |
      Non-hospitalised COVID  |   .8557077   .0898962    -1.48   0.138     .6964704    1.051352
          Hospitalised COVID  |   1.593966    .509645     1.46   0.145     .8517672    2.982888
         Critical care COVID  |   .5678035   .1780251    -1.81   0.071     .3071273    1.049731
                              |
                          sex |
                        Male  |   .8840482   .1265527    -0.86   0.389     .6677675    1.170379
                              |
                    ethnicity |
                 South Asian  |    1.09187    .199613     0.48   0.631     .7630558    1.562376
                       Black  |   1.046111   .1920447     0.25   0.806     .7299864    1.499137
                       Mixed  |   1.196732   .1579111     1.36   0.173     .9240152    1.549939
                       Other  |   1.299619   .3655916     0.93   0.352     .7488025    2.255614
                              |
                          imd |
                           2  |   1.043773   .1466559     0.30   0.760     .7925154     1.37469
                           3  |   .8079016   .0779781    -2.21   0.027     .6686534    .9761484
                           4  |   1.069213   .1319597     0.54   0.588     .8394815    1.361813
            5 Least deprived  |   .8403072   .0948851    -1.54   0.123     .6734771    1.048464
                              |
                        urban |
                       Urban  |   .9926776   .1007596    -0.07   0.942     .8135961    1.211177
                              |
                          stp |
                           2  |   1.019928   .3512042     0.06   0.954     .5193554    2.002968
                           3  |   .9440863   .2690414    -0.20   0.840     .5400577    1.650377
                           4  |   .9654937    .341286    -0.10   0.921     .4829074    1.930346
                           5  |    .307353   .1407762    -2.58   0.010     .1252458    .7542434
                           6  |    1.88997   .4853045     2.48   0.013     1.142574    3.126263
                           7  |   .7171133   .2640124    -0.90   0.366     .3485054    1.475591
                           8  |   1.672901   .5322484     1.62   0.106     .8967115    3.120955
                           9  |   1.813305   .4372742     2.47   0.014     1.130331    2.908949
                          10  |   1.151734   .3741742     0.43   0.664     .6092768    2.177157
                          11  |   .9927403   .3948972    -0.02   0.985       .45524    2.164865
                          12  |    .488455   .2068105    -1.69   0.091     .2130238    1.120008
                          13  |   .9873461   .3149388    -0.04   0.968     .5283933    1.844937
                          14  |   1.330791   .3750577     1.01   0.311     .7659762    2.312089
                          15  |   .8518639   .2672404    -0.51   0.609     .4606144    1.575444
                          16  |   1.294083   .4348365     0.77   0.443     .6697956    2.500242
                          17  |   1.093265   .3172828     0.31   0.759     .6190037     1.93089
                          18  |   .6891351   .2574292    -1.00   0.319     .3313863    1.433092
                          19  |   1.442407   .4248731     1.24   0.214     .8097656     2.56931
                          20  |    1.40808    .363214     1.33   0.185     .8492982    2.334504
                          21  |   1.127283   .3461236     0.39   0.696     .6175588    2.057728
                          22  |   .7055386   .2196072    -1.12   0.262     .3833313    1.298576
                          23  |   .8368164   .2939731    -0.51   0.612     .4203428     1.66593
                          24  |    .802243    .328825    -0.54   0.591      .359264    1.791423
                          25  |     1.0248   .2620937     0.10   0.924     .6207878    1.691745
                          26  |   .8436575    .269168    -0.53   0.594     .4514309    1.576671
                          27  |   1.162472   .3531958     0.50   0.620     .6408557    2.108649
                          28  |   .3889894   .1936143    -1.90   0.058     .1466437    1.031839
                          29  |   1.834923    .413944     2.69   0.007     1.179217    2.855237
                          30  |   1.505569    .467339     1.32   0.187     .8193737    2.766429
                          31  |   1.014393   .3762963     0.04   0.969     .4902833    2.098774
                              |
                          bmi |
          Normal (18.5-24.9)  |   1.223087   .2494218     0.99   0.323     .8201126    1.824069
        Overweight (25-29.9)  |   1.092366   .1783217     0.54   0.588     .7932587    1.504254
           Obese I (30-34.9)  |    1.69528   .3158397     2.83   0.005     1.176679    2.442446
          Obese II (35-39.9)  |   1.364562   .2742108     1.55   0.122     .9203289    2.023222
             Obese III (40+)  |   1.924413     .36509     3.45   0.001     1.326822    2.791155
                              |
                      smoking |
       Current/former smoker  |   .9832126   .1092138    -0.15   0.879     .7908556    1.222356
                              |
                    ckd_stage |
                      CKD 3A  |   .5619353   .0931649    -3.48   0.001     .4060347    .7776955
                      CKD 3B  |   .6829222   .2146419    -1.21   0.225     .3688411    1.264454
                       CKD 4  |   .8538831   .8414406    -0.16   0.873     .1237657    5.891103
No baseline eGFR measurement  |   .8136372   .1026537    -1.63   0.102      .635386    1.041895
                              |
               1.aki_baseline |    1.42238   .1459667     3.43   0.001     1.163226    1.739271
             1.cardiovascular |   1.027663   .1251646     0.22   0.823     .8094279    1.304737
                   1.diabetes |   .9843424   .1706297    -0.09   0.927     .7008025    1.382601
               1.hypertension |   1.155975   .1107692     1.51   0.130     .9580397    1.394804
           1.immunosuppressed |    .510668   .0892333    -3.85   0.000     .3625776     .719244
            1.non_haem_cancer |   .7201467    .567653    -0.42   0.677     .1536259    3.375806
                              |
                  gp_consults |
                         1-2  |   1.012107   .1720591     0.07   0.944     .7253064    1.412315
                         3-9  |   1.315553   .1092084     3.30   0.001     1.118014    1.547995
                          >9  |   1.243763   .2845526     0.95   0.340     .7943217    1.947505
                              |
                   admissions |
                           1  |   .9998124   .0954149    -0.00   0.998     .8292508    1.205455
                          >1  |   .7484029    .067508    -3.21   0.001     .6271258    .8931332
-----------------------------------------------------------------------------------------------

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD58cc_000000.tmp"

. matrix table = r(table)

. 
end of do-file

. matrix list table

table[9,81]
                  0b.            1.            2.            3.           0b.            1.           1b.            2.            3.            4.            5.           1b.            2.            3.
        covid_seve~y  covid_seve~y  covid_seve~y  covid_seve~y           sex           sex     ethnicity     ethnicity     ethnicity     ethnicity     ethnicity           imd           imd           imd
     b             1     .85570772     1.5939657     .56780354             1     .88404824             1       1.09187     1.0461115     1.1967318      1.299619             1     1.0437733     .80790157
    se             .     .08989619     .50964497     .17802511             .     .12655271             .     .19961303      .1920447     .15791107      .3655916             .     .14665589     .07797809
     z             .    -1.4832871     1.4581655    -1.8051685             .    -.86093242             .     .48076218     .24556086     1.3610585     .93162037             .     .30491564    -2.2100767
pvalue             .     .13799814     .14479492     .07104831             .     .38927526             .     .63068553     .80602219     .17349521     .35153275             .      .7604304     .02709984
    ll             .     .69647038     .85176722     .30712726             .     .66776754             .     .76305581     .72998639     .92401521      .7488025             .     .79251535     .66865343
    ul             .     1.0513522     2.9828885     1.0497305             .     1.1703793             .     1.5623759     1.4991365     1.5499386      2.255614             .     1.3746897     .97614836
    df             .             .             .             .             .             .             .             .             .             .             .             .             .             .
  crit      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964
 eform             1             1             1             1             1             1             1             1             1             1             1             1             1             1

                   4.            5.           0b.            1.           1b.            2.            3.            4.            5.            6.            7.            8.            9.           10.
                 imd           imd         urban         urban           stp           stp           stp           stp           stp           stp           stp           stp           stp           stp
     b     1.0692133     .84030721             1     .99267756             1     1.0199276     .94408635     .96549374     .30735297       1.88997     .71711331     1.6729006     1.8133054      1.151734
    se     .13195973      .0948851             .     .10075957             .     .35120424     .26904141       .341286     .14077624     .48530447     .26401239     .53224837     .43727421     .37417419
     z     .54224996    -1.5408441             .    -.07240567             .     .05730238    -.20190389    -.09934176    -2.5757347     2.4790234    -.90319825     1.6173015     2.4679964     .43483455
pvalue     .58764632     .12335474             .     .94227907             .     .95430432     .83999186     .92086692     .01000274     .01317427     .36642068     .10581321     .01358717     .66368252
    ll      .8394815     .67347711             .     .81359609             .     .51935537     .54005774     .48290739     .12524585     1.1425739     .34850537     .89671145     1.1303313     .60927684
    ul     1.3618134     1.0484636             .     1.2111768             .     2.0029682     1.6503773     1.9303456     .75424336     3.1262631     1.4755913     3.1209554     2.9089493     2.1771567
    df             .             .             .             .             .             .             .             .             .             .             .             .             .             .
  crit      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964
 eform             1             1             1             1             1             1             1             1             1             1             1             1             1             1

                  11.           12.           13.           14.           15.           16.           17.           18.           19.           20.           21.           22.           23.           24.
                 stp           stp           stp           stp           stp           stp           stp           stp           stp           stp           stp           stp           stp           stp
     b     .99274025     .48845503     .98734606     1.3307912      .8518639     1.2940831     1.0932649     .68913512     1.4424072     1.4080804     1.1272834     .70553865     .83681645     .80224296
    se     .39489718     .20681051     .31493879     .37505766     .26724045     .43483648     .31728276     .25742924     .42487314     .36321399     .34612362     .21960723     .29397313     .32882499
     z      -.018317    -1.6922829    -.03992375     1.0139909    -.51106809     .76722574     .30724907    -.99669081     1.2436019     1.3267208     .39020907      -1.12058    -.50711877    -.53757849
pvalue     .98538597     .09059206     .96815392      .3105871     .60930338     .44294731      .7586538     .31891461      .2136461     .18460104     .69638196      .2624667     .61207148     .59086808
    ll     .45524002     .21302384     .52839332     .76597622     .46061445      .6697956     .61900372     .33138632     .80976561      .8492982     .61755875      .3833313     .42034278     .35926398
    ul     2.1648651     1.1200076     1.8449367      2.312089     1.5754436     2.5002419     1.9308901     1.4330924     2.5693096     2.3345043     2.0577279     1.2985759     1.6659303      1.791423
    df             .             .             .             .             .             .             .             .             .             .             .             .             .             .
  crit      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964
 eform             1             1             1             1             1             1             1             1             1             1             1             1             1             1

                  25.           26.           27.           28.           29.           30.           31.           1b.            2.            3.            4.            5.            6.           0b.
                 stp           stp           stp           stp           stp           stp           stp           bmi           bmi           bmi           bmi           bmi           bmi       smoking
     b     1.0247997      .8436575     1.1624715     .38898939      1.834923     1.5055695     1.0143933             1      1.223087     1.0923658     1.6952804     1.3645621     1.9244134             1
    se     .26209373       .269168     .35319575     .19361428     .41394399     .46733901     .37629634             .     .24942175     .17832172     .31583975      .2742108     .36508999             .
     z     .09578513    -.53286086     .49549917    -1.8969935     2.6907092     1.3181773     .03852374             .     .98749532     .54118974     2.8332426     1.5468089     3.4505513             .
pvalue     .92369123      .5941299     .62024781     .05782879     .00713003     .18744431      .9692701             .     .32339987     .58837681     .00460784     .12190933     .00055944             .
    ll     .62078781     .45143086     .64085574     .14664374     1.1792166     .81937373     .49028333             .     .82011259     .79325875     1.1766795     .92032894     1.3268221             .
    ul     1.6917445      1.576671     2.1086494     1.0318391     2.8552368     2.7664291     2.0987735             .     1.8240689     1.5042544     2.4424457      2.023222     2.7911554             .
    df             .             .             .             .             .             .             .             .             .             .             .             .             .             .
  crit      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964
 eform             1             1             1             1             1             1             1             1             1             1             1             1             1             1

                   1.           1b.            2.            3.            4.            6.           0b.            1.           0b.            1.           0b.            1.           0b.            1.
             smoking     ckd_stage     ckd_stage     ckd_stage     ckd_stage     ckd_stage  aki_baseline  aki_baseline  cardiovasc~r  cardiovasc~r      diabetes      diabetes  hypertension  hypertension
     b     .98321258             1     .56193534     .68292219     .85388307     .81363718             1     1.4223804             1     1.0276626             1     .98434238             1     1.1559748
    se      .1092138             .     .09316493     .21464187     .84144065     .10265375             .     .14596673             .     .12516456             .      .1706297             .     .11076922
     z    -.15241408             .    -3.4764349    -1.2134119    -.16029679    -1.6346713             .     3.4333159             .     .22403902             .    -.09104156             .     1.5126183
pvalue     .87886036             .     .00050813     .22497237     .87264729     .10211798             .     .00059625             .     .82272694             .     .92745957             .     .13037663
    ll     .79085563             .     .40603466     .36884109     .12376567     .63538605             .     1.1632264             .     .80942785             .     .70080249             .     .95803966
    ul     1.2223558             .     .77769549     1.2644544     5.8911028     1.0418949             .     1.7392712             .      1.304737             .     1.3826006             .     1.3948042
    df             .             .             .             .             .             .             .             .             .             .             .             .             .             .
  crit      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964
 eform             1             1             1             1             1             1             1             1             1             1             1             1             1             1

                  0b.            1.           0b.            1.           0b.            1.            2.            3.           0b.            1.            2.
        immunosupp~d  immunosupp~d  non_haem_c~r  non_haem_c~r   gp_consults   gp_consults   gp_consults   gp_consults    admissions    admissions    admissions
     b             1     .51066796             1     .72014671             1     1.0121072     1.3155531     1.2437625             1     .99981236     .74840286
    se             .     .08923334             .     .56765298             .     .17205908      .1092084     .28455257             .     .09541493     .06750804
     z             .    -3.8459514             .    -.41649459             .     .07079057     3.3037739     .95348186             .    -.00196644    -3.2129137
pvalue             .     .00012009             .     .67704813             .     .94356444     .00095393     .34034598             .     .99843101     .00131396
    ll             .     .36257758             .     .15362592             .      .7253064     1.1180142     .79432174             .     .82925084      .6271258
    ul             .     .71924403             .     3.3758058             .     1.4123147     1.5479945     1.9475046             .     1.2054552     .89313316
    df             .             .             .             .             .             .             .             .             .             .             .
  crit      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964      1.959964
 eform             1             1             1             1             1             1             1             1             1             1             1

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD58cc_000000.tmp"

. clear

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\Users\lsh1703468\Documents\repos

. cap log close
