------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/ckd_progression.log
  log type:  text
 opened on:  26 Apr 2024, 15:56:20

. 
. cap file close tablecontent

. file open tablecontent using ./output/ckd_progression.csv, write text replace

. 
. file write tablecontent ("stratum") _tab ("start_status") _tab ("end_status") _tab ("count_2017") _tab ("count_2018") _tab ("count_2019") _tab ("count_2020") _tab ("count_2021") _tab ("count_2022") _n

. 
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete.dta, clear
  3. drop _merge
  4. merge 1:1 patient_id using ./output/`x'_nockd_complete
  5. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *r(table)[1,1] rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui total weight
  6. local baseline_ckd_`x' = r(table)[1,1]
  7. *Total number of people in group who do not progress by the end of the year
. qui total weight if ckd_progression==0
  8. local none_ckd_`x' = r(table)[1,1]
  9. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui total weight if ckd_progression==1
 10. local ckd3_ckd_`x' = r(table)[1,1]
 11. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui total weight if ckd_progression==2
 12. local ckd4_ckd_`x' = r(table)[1,1]
 13. *Total number of people in group who progress to dialysis by the end of the year
. qui total weight if ckd_progression==3
 14. local dialysis_ckd_`x' = r(table)[1,1]
 15. *Total number of people in group who progress to kidney transplant by the end of the year
. qui total weight if ckd_progression==4
 16. local kt_ckd_`x' = r(table)[1,1]
 17. *Total number of people in group who die by the end of the year
. qui total weight if ckd_progression==6
 18. local deceased_ckd_`x' = r(table)[1,1]
 19. *Total number of people in groupw with cardiovascular admission each year
. qui total weight if cardiovascular==1
 20. local cardio_ckd_`x' = r(table)[1,1]
 21. 
. **No CKD
. *Number of people without CKD at the beginning of each year
. qui total weight if ckd_group==0
 22. local baseline_nockd_`x' = r(table)[1,1]
 23. *Number of people in group who do not progress by the end of the year
. qui total weight if ckd_group==0 & ckd_progression==0
 24. local none_nockd_`x' = r(table)[1,1]
 25. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui total weight if ckd_group==0 & ckd_progression==1
 26. local ckd3_nockd_`x' = r(table)[1,1]
 27. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui total weight if ckd_group==0 & ckd_progression==2
 28. local ckd4_nockd_`x' = r(table)[1,1]
 29. *Number of people in group who progress to dialysis by the end of the year
. qui total weight if ckd_group==0 & ckd_progression==3
 30. local dialysis_nockd_`x' = r(table)[1,1]
 31. *Number of people in group who progress to kidney transplant by the end of the year
. qui total weight if ckd_group==0 & ckd_progression==4
 32. local kt_nockd_`x' = r(table)[1,1]
 33. *Number of people in group who die by the end of the year
. qui total weight if ckd_group==0 & ckd_progression==6
 34. local deceased_nockd_`x' = r(table)[1,1]
 35. *Total number of people in groupw with cardiovascular admission each year
. qui total weight if cardiovascular==1 & ckd_group==0
 36. local cardio_nockd_`x' = r(table)[1,1]
 37. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year
. qui total weight if ckd_group==1
 38. local baseline_ckd2_`x' = r(table)[1,1]
 39. *Number of people in group who do not progress by the end of the year
. qui total weight if ckd_group==1 & ckd_progression==0
 40. local none_ckd2_`x' = r(table)[1,1]
 41. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui total weight if ckd_group==1 & ckd_progression==1
 42. local ckd3_ckd2_`x' = r(table)[1,1]
 43. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui total weight if ckd_group==1 & ckd_progression==2
 44. local ckd4_ckd2_`x' = r(table)[1,1]
 45. *Number of people in group who progress to dialysis by the end of the year
. qui total weight if ckd_group==1 & ckd_progression==3
 46. local dialysis_ckd2_`x' = r(table)[1,1]
 47. *Number of people in group who progress to kidney transplant by the end of the year
. qui total weight if ckd_group==1 & ckd_progression==4
 48. local kt_ckd2_`x' = r(table)[1,1]
 49. *Number of people in group who die by the end of the year
. qui total weight if ckd_group==1 & ckd_progression==6
 50. local deceased_ckd2_`x' = r(table)[1,1]
 51. *Total number of people in groupw with cardiovascular admission each year
. qui total weight if cardiovascular==1 & ckd_group==1
 52. local cardio_ckd2_`x' = r(table)[1,1]
 53. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year
. qui total weight if ckd_group==2
 54. local baseline_ckd3_`x' = r(table)[1,1]
 55. *Number of people in group who do not progress by the end of the year
. qui total weight if ckd_group==2 & ckd_progression==0
 56. local none_ckd3_`x' = r(table)[1,1]
 57. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui total weight if ckd_group==2 & ckd_progression==2
 58. local ckd4_ckd3_`x' = r(table)[1,1]
 59. *Number of people in group who progress to dialysis by the end of the year
. qui total weight if ckd_group==2 & ckd_progression==3
 60. local dialysis_ckd3_`x' = r(table)[1,1]
 61. *Number of people in group who progress to kidney transplant by the end of the year
. qui total weight if ckd_group==2 & ckd_progression==4
 62. local kt_ckd3_`x' = r(table)[1,1]
 63. *Number of people in group who die by the end of the year
. qui total weight if ckd_group==2 & ckd_progression==6
 64. local deceased_ckd3_`x' = r(table)[1,1]
 65. *Total number of people in groupw with cardiovascular admission each year
. qui total weight if cardiovascular==1 & ckd_group==2
 66. local cardio_ckd3_`x' = r(table)[1,1]
 67. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year
. qui total weight if ckd_group==3
 68. local baseline_ckd4_`x' = r(table)[1,1]
 69. *Number of people in group who do not progress by the end of the year
. qui total weight if ckd_group==3 & ckd_progression==0
 70. local none_ckd4_`x' = r(table)[1,1]
 71. *Number of people in group who progress to dialysis by the end of the year
. qui total weight if ckd_group==3 & ckd_progression==3
 72. local dialysis_ckd4_`x' = r(table)[1,1]
 73. *Number of people in group who progress to kidney transplant by the end of the year
. qui total weight if ckd_group==3 & ckd_progression==4
 74. local kt_ckd4_`x' = r(table)[1,1]
 75. *Number of people in group who die by the end of the year
. qui total weight if ckd_group==3 & ckd_progression==6
 76. local deceased_ckd4_`x' = r(table)[1,1]
 77. *Total number of people in groupw with cardiovascular admission each year
. qui total weight if cardiovascular==1 & ckd_group==3
 78. local cardio_ckd4_`x' = r(table)[1,1]
 79. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year
. qui total weight if ckd_group==4
 80. local baseline_dialysis_`x' = r(table)[1,1]
 81. *Number of people in group remaining on dialysis by the end of the year
. qui total weight if ckd_group==4 & ckd_progression==0
 82. local none_dialysis_`x' = r(table)[1,1]
 83. *Number of people in group with kidney transplant by the end of the year
. qui total weight if ckd_group==4 & ckd_progression==4
 84. local kt_dialysis_`x' = r(table)[1,1]
 85. *Number of people in group who die by the end of the year
. qui total weight if ckd_group==4 & ckd_progression==6
 86. local deceased_dialysis_`x' = r(table)[1,1]
 87. *Total number of people in groupw with cardiovascular admission each year
. qui total weight if cardiovascular==1 & ckd_group==4
 88. local cardio_dialysis_`x' = r(table)[1,1]
 89. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year
. qui total weight if ckd_group==5
 90. local baseline_kt_`x' = r(table)[1,1]
 91. *Number of people in group remaining with kidney transplant by the end of the year
. qui total weight if ckd_group==5 & ckd_progression==0
 92. local none_kt_`x' = r(table)[1,1]
 93. *Number of people in group on dialysis by the end of the year
. qui total weight if ckd_group==5 & ckd_progression==3
 94. local dialysis_kt_`x' = r(table)[1,1]
 95. *Number of people in group who die by the end of the year
. qui total weight if ckd_group==5 & ckd_progression==6
 96. local deceased_kt_`x' = r(table)[1,1]
 97. *Total number of people in groupw with cardiovascular admission each year
. qui total weight if cardiovascular==1 & ckd_group==5
 98. local cardio_kt_`x' = r(table)[1,1]
 99. }
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,260
        from master                     2,163  (_merge==1)
        from using                      1,097  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
no observations
r(2000);

end of do-file

r(2000);

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD3fa8_000000.tmp"

. qui total weight

. local baseline_ckd_`x' = r(table)[1,1]

. 
end of do-file

. di `baseline_ckd_2017'


. browse

. qui total weight

. local baseline_ckd_2017 = r(table)[1,1]

. di `baseline_ckd_2017'
237.23125

. di %10.2f `baseline_ckd_2017'
    237.23

