-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/ckd_progression_v3.log
  log type:  text
 opened on:  21 Apr 2023, 09:37:56

. 
. cap file close tablecontent

. file open tablecontent using ./output/ckd_progression_v3.csv, write text replace

. 
. **Column headings
. *There are three column headings for each year 2017-2022:
. *Column 1 = the number of people in each CKD group as of the beginning of each year (i.e. in April)
. *Column 2 = the number of people who remain within the same CKD group, progress to a more advanced CKD group, or die by the end of the year (i.e. by the subsequent April)
. *Column 3 = Column 2 as a percentage of Column 1
. file write tablecontent _tab _tab ("N_2017") _tab ("April_2018") _tab ("N_2018") _tab ("April_2019") _tab ("N_2019") _tab ("April_2020") _tab ("N_2020") _tab ("April_2021") _tab ("N_2021") _tab ("April_2022") _tab
>  ("N_2022") _tab ("April_2023") _tab ("N_2023") _n(2)

. 
. **Loops through datasets for each year `x' 2017-2023
. local year "2017 2018 2019 2020 2021 2022 2023"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete_v3.dta, clear
  3. 
. **Disclosure minimisation
. *safecount provides a count with any counts <=5 returned at "<=5"
. *round(r(N),5) rounds counts to the nearest 5 with any counts <=5 returned as "."
. 
. **Overall
. qui safecount
  4. local baseline_ckd_`x' = round(r(N),5)
  5. *Total number of people in group who do not progress by the end of the year
. qui safecount if ckd_progression==0
  6. local none_ckd_`x' = round(r(N),5)
  7. *Total number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_progression==1
  8. local ckd3_ckd_`x' = round(r(N),5)
  9. *Total number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_progression==2
 10. local ckd4_ckd_`x' = round(r(N),5)
 11. *Total number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_progression==3
 12. local dialysis_ckd_`x' = round(r(N),5)
 13. *Total number of people in group who progress to kidney kt by the end of the year
. qui safecount if ckd_progression==4
 14. local kt_ckd_`x' = round(r(N),5)
 15. *Total number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_progression==5
 16. local unclear_ckd_`x' = round(r(N),5)
 17. *Total number of people in group who die by the end of the year
. qui safecount if ckd_progression==6
 18. local deceased_ckd_`x' = round(r(N),5)
 19. 
. **eGFR >60 with albuminuria
. *Number of people in group (baseline_ckd2_`x') at the beginning of each year ckd2_`x'
. qui safecount if ckd_group==1
 20. local baseline_ckd2_`x' = round(r(N),5)
 21. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==0
 22. local none_ckd2_`x' = round(r(N),5)
 23. *Number of people in group who progress to CKD stage 3 by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==1
 24. local ckd3_ckd2_`x' = round(r(N),5)
 25. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==2
 26. local ckd4_ckd2_`x' = round(r(N),5)
 27. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==3
 28. local dialysis_ckd2_`x' = round(r(N),5)
 29. *Number of people in group who progress to kidney kt by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==4
 30. local kt_ckd2_`x' = round(r(N),5)
 31. *Number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==5
 32. local unclear_ckd2_`x' = round(r(N),5)
 33. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==1 & ckd_progression==6
 34. local deceased_ckd2_`x' = round(r(N),5)
 35. 
. **CKD stage 3
. *Number of people in group (baseline_ckd3_`x') at the beginning of each year ckd3_`x'
. qui safecount if ckd_group==2
 36. local baseline_ckd3_`x' = round(r(N),5)
 37. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==0
 38. local none_ckd3_`x' = round(r(N),5)
 39. *Number of people in group who progress to CKD stage 4/5 (without KRT) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==2
 40. local ckd4_ckd3_`x' = round(r(N),5)
 41. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==3
 42. local dialysis_ckd3_`x' = round(r(N),5)
 43. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==4
 44. local kt_ckd3_`x' = round(r(N),5)
 45. *Number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==5
 46. local unclear_ckd3_`x' = round(r(N),5)
 47. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==2 & ckd_progression==6
 48. local deceased_ckd3_`x' = round(r(N),5)
 49. 
. **CKD stage 4/5 without KRT
. *Number of people in group (baseline_ckd4_`x') at the beginning of each year ckd4_`x'
. qui safecount if ckd_group==3
 50. local baseline_ckd4_`x' = round(r(N),5)
 51. *Number of people in group who do not progress by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==0
 52. local none_ckd4_`x' = round(r(N),5)
 53. *Number of people in group who progress to dialysis by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==3
 54. local dialysis_ckd4_`x' = round(r(N),5)
 55. *Number of people in group who progress to kidney transplant by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==4
 56. local kt_ckd4_`x' = round(r(N),5)
 57. *Number of people in group who progress to KRT (unclear modality) by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==5
 58. local unclear_ckd4_`x' = round(r(N),5)
 59. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==3 & ckd_progression==6
 60. local deceased_ckd4_`x' = round(r(N),5)
 61. 
. **Dialysis
. *Number of people in group (baseline_dialysis_`x') at the beginning of each year dialysis_`x'
. qui safecount if ckd_group==4
 62. local baseline_dialysis_`x' = round(r(N),5)
 63. *Number of people in group remaining on dialysis by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==0
 64. local none_dialysis_`x' = round(r(N),5)
 65. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==4
 66. local kt_dialysis_`x' = round(r(N),5)
 67. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==4 & ckd_progression==6
 68. local deceased_dialysis_`x' = round(r(N),5)
 69. 
. **Kidney transplant
. *Number of people in group (baseline_kt_`x') at the beginning of each year kt_`x'
. qui safecount if ckd_group==5
 70. local baseline_kt_`x' = round(r(N),5)
 71. *Number of people in group remaining with kidney transplant by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==0
 72. local none_kt_`x' = round(r(N),5)
 73. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==3
 74. local dialysis_kt_`x' = round(r(N),5)
 75. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==5 & ckd_progression==6
 76. local deceased_kt_`x' = round(r(N),5)
 77. 
. **KRT unclear modality
. *Number of people in group (baseline_unclear_`x') at the beginning of each year unclear_`x'
. qui safecount if ckd_group==6
 78. local baseline_unclear_`x' = round(r(N),5)
 79. *Number of people in group remaining in group by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==0
 80. local none_unclear_`x' = round(r(N),5)
 81. *Number of people in group on dialysis by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==3
 82. local dialysis_unclear_`x' = round(r(N),5)
 83. *Number of people in group with kidney transplant by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==4
 84. local kt_unclear_`x' = round(r(N),5)
 85. *Number of people in group who die by the end of the year
. qui safecount if ckd_group==6 & ckd_progression==6
 86. local deceased_unclear_`x' = round(r(N),5)
 87. }

. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("All CKD groups") _tab _tab (`baseline_ckd_2017') _tab _tab (`baseline_ckd_2018') _tab _tab (`baseline_ckd_2019') _tab _tab (`baseline_ckd_2020') _tab _tab (`baseline_ckd_2021') _tab _tab 
> (`baseline_ckd_2022') _tab _tab (`baseline_ckd_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd_2017') _tab _tab (`none_ckd_2018') _tab _tab (`none_ckd_2019') _tab _tab (`none_ckd_2020') _tab _tab (`none_ckd_2021') _tab _tab (`none_ckd_2022
> ') _n

. file write tablecontent _tab ("CKD stage 3") _tab _tab (`ckd3_ckd_2017') _tab _tab (`ckd3_ckd_2018') _tab _tab (`ckd3_ckd_2019') _tab _tab (`ckd3_ckd_2020') _tab _tab (`ckd3_ckd_2021') _tab _tab (`ckd3_ckd_2022') 
> _n

. file write tablecontent _tab ("CKD stage 4/5") _tab _tab (`ckd4_ckd_2017') _tab _tab (`ckd4_ckd_2018') _tab _tab (`ckd4_ckd_2019') _tab _tab (`ckd4_ckd_2020') _tab _tab (`ckd4_ckd_2021') _tab _tab (`ckd4_ckd_2022'
> ) _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd_2017') _tab _tab (`dialysis_ckd_2018') _tab _tab (`dialysis_ckd_2019') _tab _tab (`dialysis_ckd_2020') _tab _tab (`dialysis_ckd_2021') _tab _tab (
> `dialysis_ckd_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd_2017') _tab _tab (`kt_ckd_2018') _tab _tab (`kt_ckd_2019') _tab _tab (`kt_ckd_2020') _tab _tab (`kt_ckd_2021') _tab _tab (`kt_ckd_2022') _n

. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd_2017') _tab _tab (`unclear_ckd_2018') _tab _tab (`unclear_ckd_2019') _tab _tab (`unclear_ckd_2020') _tab _tab (`unclear_ckd_2021') _tab _tab (`u
> nclear_ckd_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd_2017') _tab _tab (`deceased_ckd_2018') _tab _tab (`deceased_ckd_2019') _tab _tab (`deceased_ckd_2020') _tab _tab (`deceased_ckd_2021') _tab _tab (
> `deceased_ckd_2022') _n(2)

. 
. *eGFR >60 with albuminuria
. file write tablecontent ("Albuminuria") _tab _tab (`baseline_ckd2_2017') _tab _tab (`baseline_ckd2_2018') _tab _tab (`baseline_ckd2_2019') _tab _tab (`baseline_ckd2_2020') _tab _tab (`baseline_ckd2_2021') _tab _ta
> b (`baseline_ckd2_2022') _tab _tab (`baseline_ckd2_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd2_2017') _tab _tab (`none_ckd2_2018') _tab _tab (`none_ckd2_2019') _tab _tab (`none_ckd2_2020') _tab _tab (`none_ckd2_2021') _tab _tab (`none_ckd
> 2_2022') _n

. file write tablecontent _tab ("CKD stage 3") _tab _tab (`ckd3_ckd2_2017') _tab _tab (`ckd3_ckd2_2018') _tab _tab (`ckd3_ckd2_2019') _tab _tab (`ckd3_ckd2_2020') _tab _tab (`ckd3_ckd2_2021') _tab _tab (`ckd3_ckd2_2
> 022') _n

. file write tablecontent _tab ("CKD stage 4/5") _tab _tab (`ckd4_ckd2_2017') _tab _tab (`ckd4_ckd2_2018') _tab _tab (`ckd4_ckd2_2019') _tab _tab (`ckd4_ckd2_2020') _tab _tab (`ckd4_ckd2_2021') _tab _tab (`ckd4_ckd2
> _2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd2_2017') _tab _tab (`dialysis_ckd2_2018') _tab _tab (`dialysis_ckd2_2019') _tab _tab (`dialysis_ckd2_2020') _tab _tab (`dialysis_ckd2_2021') _tab _
> tab (`dialysis_ckd2_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd2_2017') _tab _tab (`kt_ckd2_2018') _tab _tab (`kt_ckd2_2019') _tab _tab (`kt_ckd2_2020') _tab _tab (`kt_ckd2_2021') _tab _tab (`kt_ckd2_2022') _n

. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd2_2017') _tab _tab (`unclear_ckd2_2018') _tab _tab (`unclear_ckd2_2019') _tab _tab (`unclear_ckd2_2020') _tab _tab (`unclear_ckd2_2021') _tab _ta
> b (`unclear_ckd2_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd2_2017') _tab _tab (`deceased_ckd2_2018') _tab _tab (`deceased_ckd2_2019') _tab _tab (`deceased_ckd2_2020') _tab _tab (`deceased_ckd2_2021') _tab _
> tab (`deceased_ckd2_2022') _n(2)

. 
. *CKD stage 3
. file write tablecontent ("CKD stage 3") _tab _tab (`baseline_ckd3_2017') _tab _tab (`baseline_ckd3_2018') _tab _tab (`baseline_ckd3_2019') _tab _tab (`baseline_ckd3_2020') _tab _tab (`baseline_ckd3_2021') _tab _ta
> b (`baseline_ckd3_2022') _tab _tab (`baseline_ckd3_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd3_2017') _tab _tab (`none_ckd3_2018') _tab _tab (`none_ckd3_2019') _tab _tab (`none_ckd3_2020') _tab _tab (`none_ckd3_2021') _tab _tab (`none_ckd
> 3_2022') _n

. file write tablecontent _tab ("CKD stage 4/5") _tab _tab (`ckd4_ckd3_2017') _tab _tab (`ckd4_ckd3_2018') _tab _tab (`ckd4_ckd3_2019') _tab _tab (`ckd4_ckd3_2020') _tab _tab (`ckd4_ckd3_2021') _tab _tab (`ckd4_ckd3
> _2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd3_2017') _tab _tab (`dialysis_ckd3_2018') _tab _tab (`dialysis_ckd3_2019') _tab _tab (`dialysis_ckd3_2020') _tab _tab (`dialysis_ckd3_2021') _tab _
> tab (`dialysis_ckd3_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd3_2017') _tab _tab (`kt_ckd3_2018') _tab _tab (`kt_ckd3_2019') _tab _tab (`kt_ckd3_2020') _tab _tab (`kt_ckd3_2021') _tab _tab (`kt_ckd3_2022') _n

. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd3_2017') _tab _tab (`unclear_ckd3_2018') _tab _tab (`unclear_ckd3_2019') _tab _tab (`unclear_ckd3_2020') _tab _tab (`unclear_ckd3_2021') _tab _ta
> b (`unclear_ckd3_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd3_2017') _tab _tab (`deceased_ckd3_2018') _tab _tab (`deceased_ckd3_2019') _tab _tab (`deceased_ckd3_2020') _tab _tab (`deceased_ckd3_2021') _tab _
> tab (`deceased_ckd3_2022') _n(2)

. 
. *CKD stage 4/5 without KRT
. file write tablecontent ("CKD stage 4/5") _tab _tab (`baseline_ckd4_2017') _tab _tab (`baseline_ckd4_2018') _tab _tab (`baseline_ckd4_2019') _tab _tab (`baseline_ckd4_2020') _tab _tab (`baseline_ckd4_2021') _tab _
> tab (`baseline_ckd4_2022') _tab _tab (`baseline_ckd4_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_ckd4_2017') _tab _tab (`none_ckd4_2018') _tab _tab (`none_ckd4_2019') _tab _tab (`none_ckd4_2020') _tab _tab (`none_ckd4_2021') _tab _tab (`none_ckd
> 4_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_ckd4_2017') _tab _tab (`dialysis_ckd4_2018') _tab _tab (`dialysis_ckd4_2019') _tab _tab (`dialysis_ckd4_2020') _tab _tab (`dialysis_ckd4_2021') _tab _
> tab (`dialysis_ckd4_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_ckd4_2017') _tab _tab (`kt_ckd4_2018') _tab _tab (`kt_ckd4_2019') _tab _tab (`kt_ckd4_2020') _tab _tab (`kt_ckd4_2021') _tab _tab (`kt_ckd4_2022') _n

. file write tablecontent _tab ("KRT unclear") _tab _tab (`unclear_ckd4_2017') _tab _tab (`unclear_ckd4_2018') _tab _tab (`unclear_ckd4_2019') _tab _tab (`unclear_ckd4_2020') _tab _tab (`unclear_ckd4_2021') _tab _ta
> b (`unclear_ckd4_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_ckd4_2017') _tab _tab (`deceased_ckd4_2018') _tab _tab (`deceased_ckd4_2019') _tab _tab (`deceased_ckd4_2020') _tab _tab (`deceased_ckd4_2021') _tab _
> tab (`deceased_ckd4_2022') _n(2)

. 
. *Dialysis
. file write tablecontent ("Dialysis") _tab _tab (`baseline_dialysis_2017') _tab _tab (`baseline_dialysis_2018') _tab _tab (`baseline_dialysis_2019') _tab _tab (`baseline_dialysis_2020') _tab _tab (`baseline_dialysi
> s_2021') _tab _tab (`baseline_dialysis_2022') _tab _tab (`baseline_dialysis_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_dialysis_2017') _tab _tab (`none_dialysis_2018') _tab _tab (`none_dialysis_2019') _tab _tab (`none_dialysis_2020') _tab _tab (`none_dialysis_2021') 
> _tab _tab (`none_dialysis_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_dialysis_2017') _tab _tab (`kt_dialysis_2018') _tab _tab (`kt_dialysis_2019') _tab _tab (`kt_dialysis_2020') _tab _tab (`kt_dialysis_2021') _tab _tab (`kt
> _dialysis_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_dialysis_2017') _tab _tab (`deceased_dialysis_2018') _tab _tab (`deceased_dialysis_2019') _tab _tab (`deceased_dialysis_2020') _tab _tab (`deceased_di
> alysis_2021') _tab _tab (`deceased_dialysis_2022') _n(2)

. 
. *Kidney Transplant
. file write tablecontent ("Transplant") _tab _tab (`baseline_kt_2017') _tab _tab (`baseline_kt_2018') _tab _tab (`baseline_kt_2019') _tab _tab (`baseline_kt_2020') _tab _tab (`baseline_kt_2021') _tab _tab (`baselin
> e_kt_2022') _tab _tab (`baseline_kt_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_kt_2017') _tab _tab (`none_kt_2018') _tab _tab (`none_kt_2019') _tab _tab (`none_kt_2020') _tab _tab (`none_kt_2021') _tab _tab (`none_kt_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_kt_2017') _tab _tab (`dialysis_kt_2018') _tab _tab (`dialysis_kt_2019') _tab _tab (`dialysis_kt_2020') _tab _tab (`dialysis_kt_2021') _tab _tab (`dial
> ysis_kt_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_kt_2017') _tab _tab (`deceased_kt_2018') _tab _tab (`deceased_kt_2019') _tab _tab (`deceased_kt_2020') _tab _tab (`deceased_kt_2021') _tab _tab (`dece
> ased_kt_2022') _n(2)

. 
. *KRT unclear modality
. file write tablecontent ("KRT unclear") _tab _tab (`baseline_unclear_2017') _tab _tab (`baseline_unclear_2018') _tab _tab (`baseline_unclear_2019') _tab _tab (`baseline_unclear_2020') _tab _tab (`baseline_unclear_
> 2021') _tab _tab (`baseline_unclear_2022') _tab _tab (`baseline_unclear_2023') _n(2)

. file write tablecontent _tab ("No progression") _tab _tab (`none_unclear_2017') _tab _tab (`none_unclear_2018') _tab _tab (`none_unclear_2019') _tab _tab (`none_unclear_2020') _tab _tab (`none_unclear_2021') _tab 
> _tab (`none_unclear_2022') _n

. file write tablecontent _tab ("Dialysis") _tab _tab (`dialysis_unclear_2017') _tab _tab (`dialysis_unclear_2018') _tab _tab (`dialysis_unclear_2019') _tab _tab (`dialysis_unclear_2020') _tab _tab (`dialysis_unclea
> r_2021') _tab _tab (`dialysis_unclear_2022') _n

. file write tablecontent _tab ("Transplant") _tab _tab (`kt_unclear_2017') _tab _tab (`kt_unclear_2018') _tab _tab (`kt_unclear_2019') _tab _tab (`kt_unclear_2020') _tab _tab (`kt_unclear_2021') _tab _tab (`kt_uncl
> ear_2022') _n

. file write tablecontent _tab ("Deceased") _tab _tab (`deceased_unclear_2017') _tab _tab (`deceased_unclear_2018') _tab _tab (`deceased_unclear_2019') _tab _tab (`deceased_unclear_2020') _tab _tab (`deceased_unclea
> r_2021') _tab _tab (`deceased_unclear_2022')

. 
. file close tablecontent

. 
. **Redact counts of 0 from each column in table (adapted from code by Emily Herrett)
. clear

. import delimited ./output/ckd_progression_v3.csv
(encoding automatically selected: ISO-8859-1)
(15 vars, 42 obs)

. local columns " "n_2017" "april_2018" "n_2018" "april_2019" "n_2019" "april_2020" "n_2020" "april_2021" "n_2021" "april_2022" "n_2022" "april_2023" "n_2023" "

. foreach col in `columns' {
  2. replace `col'=. if `col'<=5
  3. }
(0 real changes made)
(6 real changes made, 6 to missing)
(0 real changes made)
(5 real changes made, 5 to missing)
(0 real changes made)
(4 real changes made, 4 to missing)
(0 real changes made)
(5 real changes made, 5 to missing)
(0 real changes made)
(3 real changes made, 3 to missing)
(0 real changes made)
(6 real changes made, 6 to missing)
(0 real changes made)

.         
. export delimited "./output/ckd_progression_v3.csv", replace
file ./output/ckd_progression_v3.csv saved

. 
end of do-file

