------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\ckd-healthcare-use\logs/healthcare_needs.log
  log type:  text
 opened on:  24 Dec 2022, 11:54:29

. 
. 
. 
. 
. 
. 
. /*******************************************************************************
> ********************************************************************************
> ********************************************************************************
> #SECTION A - DATA AS N(%)
> ********************************************************************************
> ********************************************************************************
> *******************************************************************************/
. 
. 
. 
. /*******************************************************************************
> #A1. Open dataset and set up column headers in output file
> *******************************************************************************/
. use ./output/2017_ckd_complete.dta, clear 

. 
. * create excel file
. putexcel set "results/${filename}.xlsx", sheet(Table 1) replace
Note: File will be replaced when the first putexcel command is issued.

. 
. * set row count variable
. local rowcount=1

. 
. * Table title
. putexcel A`rowcount'="Healthcare needs by CKD group 2017/2018 to 2021/2022", bold
file results/healthcare_needs.xlsx saved

. local ++rowcount // increment row couter variable

. 
. * set up column headers
. putexcel (D`rowcount':H`rowcount'), merge hcenter vcenter
file results/healthcare_needs.xlsx saved

. putexcel (I`rowcount':M`rowcount'), merge hcenter vcenter
file results/healthcare_needs.xlsx saved

. putexcel (N`rowcount':R`rowcount'), merge hcenter vcenter
file results/healthcare_needs.xlsx saved

. putexcel (S`rowcount':W`rowcount'), merge hcenter vcenter
file results/healthcare_needs.xlsx saved

. putexcel (X`rowcount':AB`rowcount'), merge hcenter vcenter
file results/healthcare_needs.xlsx saved

. putexcel D`rowcount'="2017-2018", border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel D`rowcount', border(left, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel E`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel F`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel G`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel H`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel H`rowcount', border(right, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel I`rowcount'="2018-2019", bold hcenter border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel I`rowcount', border(left, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel J`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel K`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel L`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel M`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel M`rowcount', border(right, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel N`rowcount'="2019-2020", bold hcenter border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel N`rowcount', border(left, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel O`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel P`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel Q`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel R`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel R`rowcount', border(right, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel S`rowcount'="2020-2021", bold hcenter border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel S`rowcount', border(left, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel T`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel U`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel V`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel W`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel W`rowcount', border(right, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel X`rowcount'="2021-2022", bold hcenter border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel X`rowcount', border(left, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel Y`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel Z`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel AA`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel AB`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel AB`rowcount', border(right, thin, black)
file results/healthcare_needs.xlsx saved

. 
. local ++rowcount

. putexcel (A`rowcount':C`rowcount'), merge hcenter vcenter
file results/healthcare_needs.xlsx saved

. putexcel D`rowcount'="April 2017", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel E`rowcount'="July 2017", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel F`rowcount'="October 2017", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel G`rowcount'="January 2018", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel H`rowcount'="April 2018", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel I`rowcount'="April 2018", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel J`rowcount'="July 2018", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel K`rowcount'="October 2018", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel L`rowcount'="January 2019", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel M`rowcount'="April 2019", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel N`rowcount'="April 2019", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel O`rowcount'="July 2019", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel P`rowcount'="October 2019", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel Q`rowcount'="January 2020", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel R`rowcount'="April 2020", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel S`rowcount'="April 2020", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel T`rowcount'="July 2020", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel U`rowcount'="October 2020", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel V`rowcount'="January 2021", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel W`rowcount'="April 2021", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel X`rowcount'="April 2021", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel Y`rowcount'="July 2021", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel Z`rowcount'="October 2021", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel AA`rowcount'="January 2022", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel AB`rowcount'="April 2022", bold hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. 
. local ++rowcount

. putexcel (A`rowcount':A14), merge hcenter vcenter
file results/healthcare_needs.xlsx saved

. putexcel A`rowcount'="eGFR >60 with proteinuria", bold hcenter vcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel (B`rowcount':C`rowcount'), merge
file results/healthcare_needs.xlsx saved

. putexcel B`rowcount'="Number at April of each year", bold txtwrap border(top, thin, black) fpattern(solid, lightgray)
file results/healthcare_needs.xlsx saved

. putexcel B`rowcount', border (left, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel C`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel C`rowcount', border(right, thin, black)
file results/healthcare_needs.xlsx saved

. unique patient_id if ckd_group==3
Number of unique values of patient_id is  17
Number of records is  17

. local n = string(`r(unique)', "%12.0gc")

. putexcel D`rowcount'="`n'", hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel (E`rowcount':H`rowcount'), merge fpattern(solid, lightgray)
file results/healthcare_needs.xlsx saved

. putexcel E`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel F`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel G`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel H`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. use ./output/2018_ckd_complete.dta, clear 

. unique patient_id if ckd_group==3
Number of unique values of patient_id is  21
Number of records is  21

. local n = string(`r(unique)', "%12.0gc")

. putexcel I`rowcount'="`n'", hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel (J`rowcount':M`rowcount'), merge fpattern(solid, lightgray)
file results/healthcare_needs.xlsx saved

. putexcel J`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel K`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel L`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel M`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. use ./output/2019_ckd_complete.dta, clear 

. unique patient_id if ckd_group==3
Number of unique values of patient_id is  17
Number of records is  17

. local n = string(`r(unique)', "%12.0gc")

. putexcel N`rowcount'="`n'", hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel (O`rowcount':R`rowcount'), merge fpattern(solid, lightgray)
file results/healthcare_needs.xlsx saved

. putexcel O`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel P`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel Q`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel R`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. use ./output/2020_ckd_complete.dta, clear 

. unique patient_id if ckd_group==3
Number of unique values of patient_id is  19
Number of records is  19

. local n = string(`r(unique)', "%12.0gc")

. putexcel S`rowcount'="`n'", hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel (T`rowcount':W`rowcount'), merge fpattern(solid, lightgray)
file results/healthcare_needs.xlsx saved

. putexcel T`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel U`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel V`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel W`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. use ./output/2021_ckd_complete.dta, clear 

. unique patient_id if ckd_group==3
Number of unique values of patient_id is  16
Number of records is  16

. local n = string(`r(unique)', "%12.0gc")

. putexcel X`rowcount'="`n'", hcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel (Y`rowcount':AB`rowcount'), merge fpattern(solid, lightgray)
file results/healthcare_needs.xlsx saved

. putexcel Y`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel Z`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel AA`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel AB`rowcount', border(top, thin, black)
file results/healthcare_needs.xlsx saved

. 
. local ++rowcount

. putexcel (B`rowcount':B14), merge hcenter vcenter
file results/healthcare_needs.xlsx saved

. putexcel B`rowcount'="Healthcare needs by quarter", hcenter vcenter border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel C`rowcount'="Inpatient days (days per patient)", left border(all, thin, black)
file results/healthcare_needs.xlsx saved

. putexcel (D`rowcount':D14), merge fpattern(solid, lightgray)
file results/healthcare_needs.xlsx saved

. 
end of do-file

. use ./output/2017_ckd_complete.dta

. do "C:\Users\LSH170~1\AppData\Local\Temp\STD3cec_000000.tmp"

. foreach outcome of varlist      q1_hospital_days                        ///
>                                                         q2_hospital_days                        ///
>                                                         q3_hospital_days                        ///
>                                                         q4_hospital_days                        ///
>                                                         q1_critical_care_days           ///
>                                                         q2_critical_care_days           ///
>                                                         q3_critical_care_days           ///
>                                                         q4_critical_care_days           ///
>                                                         q1_emergency_days                       ///
>                                                         q2_emergency_days                       ///
>                                                         q3_emergency_days                       ///
>                                                         q4_emergency_days                       ///
>                                                         q1_outpatient_appointments      ///
>                                                         q2_outpatient_appointments      ///
>                                                         q3_outpatient_appointments      ///
>                                                         q4_outpatient_appointments      ///
>                                                         q1_nephrology_appointments      ///
>                                                         q2_nephrology_appointments      ///
>                                                         q3_nephrology_appointments      ///
>                                                         q4_nephrology_appointments      ///
>                                                         q1_transplant_appointments      ///
>                                                         q2_transplant_appointments      ///
>                                                         q3_transplant_appointments      ///
>                                                         q4_transplant_appointments      ///
>                                                         q1_gp_interactions                      ///
>                                                         q2_gp_interactions                      ///
>                                                         q3_gp_interactions                      ///
>                                                         q4_gp_interactions                      ///
>                                                         q1_blood_pressure                       ///
>                                                         q2_blood_pressure                       ///
>                                                         q3_blood_pressure                       ///
>                                                         q4_blood_pressure                       ///
>                                                         q1_albuminuria                          ///
>                                                         q2_albuminuria                          ///
>                                                         q3_albuminuria                          ///
>                                                         q4_albuminuria                          ///
>                                                         q1_creatinine                           ///
>                                                         q2_creatinine                           ///
>                                                         q3_creatinine                           ///
>                                                         q4_creatinine {
  2. total `outcome', over(ckd_group)
  3. }

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
               c.q1_hospital_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        166   23.87673      119.1593    212.8407
                                     CKD 3  |        109   18.65719      72.39883    145.6012
CKD 4/5 without kidney replacement therapy  |          0  (omitted)
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          5   3.516877     -1.899311    11.89931
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
               c.q2_hospital_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        227   28.72807      170.6421    283.3579
                                     CKD 3  |        105   19.74918      66.25659    143.7434
CKD 4/5 without kidney replacement therapy  |          3          3     -2.885317    8.885317
                                  Dialysis  |         10   6.859943     -3.457647    23.45765
                         Kidney transplant  |          5   4.071725     -2.987798     12.9878
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
               c.q3_hospital_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        216   27.61059      161.8343    270.1657
                                     CKD 3  |        114   20.16952      74.43199     153.568
CKD 4/5 without kidney replacement therapy  |          8   5.477226      -2.74507    18.74507
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          0  (omitted)
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
               c.q4_hospital_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        226   28.58077       169.931     282.069
                                     CKD 3  |        136   22.34121      92.17162    179.8284
CKD 4/5 without kidney replacement therapy  |          5        3.5     -1.866203     11.8662
                                  Dialysis  |          5          5     -4.808862    14.80886
                         Kidney transplant  |          7   4.173853      -1.18815    15.18815
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
          c.q1_critical_care_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        175   26.44627      123.1184    226.8816
                                     CKD 3  |        137   22.61785      92.62893    181.3711
CKD 4/5 without kidney replacement therapy  |          0  (omitted)
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          3          3     -2.885317    8.885317
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
          c.q2_critical_care_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        195   28.07526      139.9227    250.0773
                                     CKD 3  |        118   20.66031      77.46917    158.5308
CKD 4/5 without kidney replacement therapy  |          0  (omitted)
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          6   4.376973     -2.586625    14.58663
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
          c.q3_critical_care_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        212   29.60809      153.9157    270.0843
                                     CKD 3  |        125   23.33299      79.22598     170.774
CKD 4/5 without kidney replacement therapy  |          4   2.738613     -1.372535    9.372535
                                  Dialysis  |          6          6     -5.770634    17.77063
                         Kidney transplant  |         14   7.960428     -1.616549    29.61655
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
          c.q4_critical_care_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        179   26.48828       127.036     230.964
                                     CKD 3  |        114   19.35821       76.0236    151.9764
CKD 4/5 without kidney replacement therapy  |          3          3     -2.885317    8.885317
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          8   5.311358     -2.419676    18.41968
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
              c.q1_emergency_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        198   27.34389      144.3575    251.6425
                                     CKD 3  |         97   19.16956       59.3937    134.6063
CKD 4/5 without kidney replacement therapy  |          6   4.358899     -2.551168    14.55117
                                  Dialysis  |          3   2.182821     -1.282197    7.282197
                         Kidney transplant  |          4          4      -3.84709    11.84709
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
              c.q2_emergency_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        240    30.3446      180.4708    299.5292
                                     CKD 3  |        118   21.09236       76.6216    159.3784
CKD 4/5 without kidney replacement therapy  |          7   5.267827     -3.334277    17.33428
                                  Dialysis  |         12    6.97896     -1.691131    25.69113
                         Kidney transplant  |          5          5     -4.808862    14.80886
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
              c.q3_emergency_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        228   29.62763      169.8773    286.1227
                                     CKD 3  |        115   19.21546      77.30365    152.6964
CKD 4/5 without kidney replacement therapy  |         10   5.841661     -1.460009    21.46001
                                  Dialysis  |          1          1     -.9617724    2.961772
                         Kidney transplant  |          5          5     -4.808862    14.80886
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
              c.q4_emergency_days@ckd_group |
                 eGFR ≥60 with albuminuria  |        205   26.81619      152.3927    257.6073
                                     CKD 3  |        131    22.5618      86.73889    175.2611
CKD 4/5 without kidney replacement therapy  |          5        3.5     -1.866203     11.8662
                                  Dialysis  |         14   8.917926     -3.494942    31.49494
                         Kidney transplant  |          2          2     -1.923545    5.923545
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q1_outpatient_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        191    26.9459      138.1383    243.8617
                                     CKD 3  |        115   21.29356      73.22689    156.7731
CKD 4/5 without kidney replacement therapy  |          0  (omitted)
                                  Dialysis  |          4   2.743977     -1.383059    9.383059
                         Kidney transplant  |          4   2.752989     -1.400737    9.400737
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q2_outpatient_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        170   24.17494      122.5743    217.4257
                                     CKD 3  |        131   23.04522      85.79052    176.2095
CKD 4/5 without kidney replacement therapy  |          0  (omitted)
                                  Dialysis  |          2          2     -1.923545    5.923545
                         Kidney transplant  |          4   3.111946     -2.104931    10.10493
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q3_outpatient_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        224    30.6618      163.8485    284.1515
                                     CKD 3  |        161   25.77693      110.4315    211.5685
CKD 4/5 without kidney replacement therapy  |          7   4.138236     -1.118278    15.11828
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          0  (omitted)
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q4_outpatient_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        248   31.81203       185.592     310.408
                                     CKD 3  |        123   20.37697      83.02503     162.975
CKD 4/5 without kidney replacement therapy  |          3   2.179449     -1.275584    7.275584
                                  Dialysis  |         10    5.08747      .0195415    19.98046
                         Kidney transplant  |          5   4.071725     -2.987798     12.9878
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q1_nephrology_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        165   24.72986      116.4856    213.5144
                                     CKD 3  |        107   20.37569      67.02753    146.9725
CKD 4/5 without kidney replacement therapy  |          5          5     -4.808862    14.80886
                                  Dialysis  |          5   3.506297     -1.878556    11.87856
                         Kidney transplant  |          6   4.129483     -2.101106    14.10111
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q2_nephrology_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        186   26.93416      133.1613    238.8387
                                     CKD 3  |        143   22.93403      98.00865    187.9913
CKD 4/5 without kidney replacement therapy  |          3   2.179449     -1.275584    7.275584
                                  Dialysis  |          4          4      -3.84709    11.84709
                         Kidney transplant  |          3   2.188487     -1.293313    7.293313
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q3_nephrology_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        154   22.42404      110.0091    197.9909
                                     CKD 3  |        107   19.21118      69.31205     144.688
CKD 4/5 without kidney replacement therapy  |          3          3     -2.885317    8.885317
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          7   4.173853      -1.18815    15.18815
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q4_nephrology_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        221   29.23552      163.6466    278.3534
                                     CKD 3  |        134   21.68487      91.45921    176.5408
CKD 4/5 without kidney replacement therapy  |          3          3     -2.885317    8.885317
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          0  (omitted)
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q1_transplant_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        180   25.41866      130.1344    229.8656
                                     CKD 3  |        131   21.04499      89.71451    172.2855
CKD 4/5 without kidney replacement therapy  |          3   3.921097     -4.692299     10.6923
                                  Dialysis  |          2          2     -1.923545    5.923545
                         Kidney transplant  |          4   2.752989     -1.400737    9.400737
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q2_transplant_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        203   27.78849      148.4853    257.5147
                                     CKD 3  |        112   19.94408      72.87426    151.1257
CKD 4/5 without kidney replacement therapy  |          5        3.5     -1.866203     11.8662
                                  Dialysis  |          3          3     -2.885317    8.885317
                         Kidney transplant  |          8   5.311358     -2.419676    18.41968
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q3_transplant_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        205   27.37053      151.3053    258.6947
                                     CKD 3  |        129   20.24707      89.27986    168.7201
CKD 4/5 without kidney replacement therapy  |          1          1     -.9617724    2.961772
                                  Dialysis  |         16   8.345481     -.3719348    32.37193
                         Kidney transplant  |          3   2.188487     -1.293313    7.293313
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
     c.q4_transplant_appointments@ckd_group |
                 eGFR ≥60 with albuminuria  |        216   28.88659      159.3311    272.6689
                                     CKD 3  |        102   19.34781      64.04401     139.956
CKD 4/5 without kidney replacement therapy  |          0  (omitted)
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |         14   8.220642     -2.127028    30.12703
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
             c.q1_gp_interactions@ckd_group |
                 eGFR ≥60 with albuminuria  |       3000   91.18066      2821.124    3178.876
                                     CKD 3  |       1638   70.15496      1500.372    1775.628
CKD 4/5 without kidney replacement therapy  |         86   10.45825      65.48329    106.5167
                                  Dialysis  |         66   14.84033      36.88666    95.11334
                         Kidney transplant  |         63   11.72267      40.00278    85.99722
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
             c.q2_gp_interactions@ckd_group |
                 eGFR ≥60 with albuminuria  |       2696   86.41878      2526.466    2865.534
                                     CKD 3  |       1686   70.79059      1547.125    1824.875
CKD 4/5 without kidney replacement therapy  |         75   13.91043      47.71091    102.2891
                                  Dialysis  |         51   12.79016      25.90861    76.09139
                         Kidney transplant  |         82   14.50227      53.54985    110.4501
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
             c.q3_gp_interactions@ckd_group |
                 eGFR ≥60 with albuminuria  |       2729   86.41933      2559.465    2898.535
                                     CKD 3  |       1803   71.50425      1662.725    1943.275
CKD 4/5 without kidney replacement therapy  |         43   11.58123      20.28025    65.71975
                                  Dialysis  |         56   12.59318      31.29504    80.70496
                         Kidney transplant  |         71   15.18136      41.21763    100.7824
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
             c.q4_gp_interactions@ckd_group |
                 eGFR ≥60 with albuminuria  |       2897   90.82888      2718.814    3075.186
                                     CKD 3  |       1631   72.22727      1489.307    1772.693
CKD 4/5 without kidney replacement therapy  |         64   12.66886      39.14658    88.85342
                                  Dialysis  |         88    16.9011       54.8439    121.1561
                         Kidney transplant  |         76   12.78157      50.92548    101.0745
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
              c.q1_blood_pressure@ckd_group |
                 eGFR ≥60 with albuminuria  |        253   13.14548      227.2116    278.7884
                                     CKD 3  |        146   10.00887      126.3649    165.6351
CKD 4/5 without kidney replacement therapy  |          9    2.12132      4.838452    13.16155
                                  Dialysis  |          5   1.955385       1.16398     8.83602
                         Kidney transplant  |          7   2.188487      2.706687    11.29331
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
              c.q2_blood_pressure@ckd_group |
                 eGFR ≥60 with albuminuria  |        251   13.11751      225.2664    276.7336
                                     CKD 3  |        150   10.08084      130.2237    169.7763
CKD 4/5 without kidney replacement therapy  |          7    2.09165      2.896659    11.10334
                                  Dialysis  |          5   1.955385       1.16398     8.83602
                         Kidney transplant  |          7   2.188487      2.706687    11.29331
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
              c.q3_blood_pressure@ckd_group |
                 eGFR ≥60 with albuminuria  |        261   13.25298      235.0007    286.9993
                                     CKD 3  |        133   9.746794       113.879     152.121
CKD 4/5 without kidney replacement therapy  |          4   1.802776      .4633645    7.536635
                                  Dialysis  |          6   2.057983      1.962706    10.03729
                         Kidney transplant  |          8   2.247806      3.590316    12.40968
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
              c.q4_blood_pressure@ckd_group |
                 eGFR ≥60 with albuminuria  |        235   12.87751      209.7373    260.2627
                                     CKD 3  |        136   9.811205      116.7526    155.2474
CKD 4/5 without kidney replacement therapy  |          5   1.936492      1.201044    8.798956
                                  Dialysis  |          4    1.81497      .4394411    7.560559
                         Kidney transplant  |          9   2.282658      4.521945    13.47805
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
                 c.q1_albuminuria@ckd_group |
                 eGFR ≥60 with albuminuria  |         47    6.65436      33.94566    60.05434
                                     CKD 3  |         18   4.163852       9.83147    26.16853
CKD 4/5 without kidney replacement therapy  |          2   1.369306     -.6862675    4.686267
                                  Dialysis  |          1          1     -.9617724    2.961772
                         Kidney transplant  |          0  (omitted)
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
                 c.q2_albuminuria@ckd_group |
                 eGFR ≥60 with albuminuria  |         26   5.018206      16.15542    35.84458
                                     CKD 3  |         23   4.680252      13.81841    32.18159
CKD 4/5 without kidney replacement therapy  |          0  (omitted)
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          0  (omitted)
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
                 c.q3_albuminuria@ckd_group |
                 eGFR ≥60 with albuminuria  |         33   5.627761      21.95961    44.04039
                                     CKD 3  |         29   5.219428      18.76067    39.23933
CKD 4/5 without kidney replacement therapy  |          0  (omitted)
                                  Dialysis  |          1          1     -.9617724    2.961772
                         Kidney transplant  |          1          1     -.9617724    2.961772
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
                 c.q4_albuminuria@ckd_group |
                 eGFR ≥60 with albuminuria  |         38   6.019256      26.19159    49.80841
                                     CKD 3  |         17   4.051081      9.052702     24.9473
CKD 4/5 without kidney replacement therapy  |          1          1     -.9617724    2.961772
                                  Dialysis  |          0  (omitted)
                         Kidney transplant  |          1          1     -.9617724    2.961772
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
                  c.q1_creatinine@ckd_group |
                 eGFR ≥60 with albuminuria  |        166    11.4694      143.4996    188.5004
                                     CKD 3  |         88   8.451543         71.42      104.58
CKD 4/5 without kidney replacement therapy  |          4   1.802776      .4633645    7.536635
                                  Dialysis  |          2   1.371989     -.6915295    4.691529
                         Kidney transplant  |          4   1.835326      .3995084    7.600492
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
                  c.q2_creatinine@ckd_group |
                 eGFR ≥60 with albuminuria  |        140   10.74812      118.9146    161.0854
                                     CKD 3  |         94   8.664752      77.00173    110.9983
CKD 4/5 without kidney replacement therapy  |          1          1     -.9617724    2.961772
                                  Dialysis  |          2   1.371989     -.6915295    4.691529
                         Kidney transplant  |          6    2.10263      1.875119    10.12488
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
                  c.q3_creatinine@ckd_group |
                 eGFR ≥60 with albuminuria  |        177   11.73947      153.9698    200.0302
                                     CKD 3  |         92   8.595277      75.13802     108.862
CKD 4/5 without kidney replacement therapy  |          3   1.620185     -.1784345    6.178435
                                  Dialysis  |          1          1     -.9617724    2.961772
                         Kidney transplant  |          2   1.376494     -.7003687    4.700369
---------------------------------------------------------------------------------------------

Total estimation                                                        Number of obs = 1,314

---------------------------------------------------------------------------------------------
                                            |      Total   Std. err.     [95% conf. interval]
--------------------------------------------+------------------------------------------------
                  c.q4_creatinine@ckd_group |
                 eGFR ≥60 with albuminuria  |        167   11.49476      144.4499    189.5501
                                     CKD 3  |         97    8.76608      79.80295    114.1971
CKD 4/5 without kidney replacement therapy  |          2   1.369306     -.6862675    4.686267
                                  Dialysis  |          3   1.626978     -.1917614    6.191761
                         Kidney transplant  |          2   1.376494     -.7003687    4.700369
---------------------------------------------------------------------------------------------

. tab ckd_group ckd_progression

                      |                    CKD progression
            CKD group | No progre      CKD 3  CKD 4/5 w   Dialysis  Kidney tr |     Total
----------------------+-------------------------------------------------------+----------
eGFR ≥60 with albumin |       651        121          6          8         10 |       796 
                CKD 3 |       455          0          2          5          1 |       463 
CKD 4/5 without kidne |        17          0          0          0          0 |        17 
             Dialysis |        18          0          0          0          0 |        18 
    Kidney transplant |        20          0          0          0          0 |        20 
----------------------+-------------------------------------------------------+----------
                Total |     1,161        121          8         13         11 |     1,314 

. 
end of do-file

. cd ..
C:\Users\lsh1703468\Documents

. cd repos
C:\Users\lsh1703468\Documents\repos

. do "C:\Users\lsh1703468\Documents\Repos\analysis\analysis_2017.do"

. sysdir set PLUS ./analysis/adofiles

. sysdir set PERSONAL ./analysis/adofiles

. pwd
C:\Users\lsh1703468\Documents\repos

. 
. cap log close
