-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/healthcare_use_dialysis.log
  log type:  text
 opened on:  20 Aug 2023, 23:43:35

. cap file close tablecontent

. **Creates output file for each year (`dataset')
. file open tablecontent using ./output/healthcare_use_dialysis.csv, write text replace

. **Column headings
. file write tablecontent ("Date") _tab ("stratum") _tab ("ip") _tab ("icu") _tab ("ed") _tab ("avf") _tab ("pd") _tab ("opd") _tab ("neph") _tab ("tx") _tab ("gp") _n

. 
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. file write tablecontent ("01/04/`x'") _tab ("all") _tab
  3. use ./output/`x'_ckd_complete.dta, clear
  4. drop if ckd_group!=4
  5. foreach aggregate of varlist hospital_days critical_care_days emergency_days op_appts neph_appts tx_appts gp_interactions {
  6. qui su total_`aggregate'
  7. local `x'_`aggregate' = r(mean)
  8. }
  9. foreach binary of varlist fistula_formation pd_insertion {
 10. qui safecount if `binary'==1
 11. local `x'_`binary' = round(r(N),5)
 12. }
 13. file write tablecontent (``x'_hospital_days') _tab (``x'_critical_care_days') _tab (``x'_emergency_days') _tab (``x'_fistula_formation') _tab (``x'_pd_insertion') _tab (``x'_op_appts') _tab (``x'_neph_app
> ts') _tab (``x'_tx_appts') _tab (``x'_gp_interactions') _n
 14. }
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)

. 
. forvalues i=1/6 {
  2. local label`i': label ethnicity `i'
  3. foreach x of local year {
  4. file write tablecontent ("01/04/`x'") _tab ("`label`i''") _tab
  5. use ./output/`x'_ckd_complete.dta, clear
  6. drop if ckd_group!=4
  7. foreach aggregate of varlist hospital_days critical_care_days emergency_days op_appts neph_appts tx_appts gp_interactions {
  8. qui su ethnicity_`aggregate' if ethnicity==`i'
  9. local `x'_`aggregate' = r(mean)
 10. }
 11. foreach binary of varlist fistula_formation pd_insertion {
 12. qui safecount if `binary'==1 & ethnicity==`i'
 13. local `x'_`binary' = round(r(N),5)
 14. }
 15. file write tablecontent (``x'_hospital_days') _tab (``x'_critical_care_days') _tab (``x'_emergency_days') _tab (``x'_fistula_formation') _tab (``x'_pd_insertion') _tab (``x'_op_appts') _tab (``x'_neph_app
> ts') _tab (``x'_tx_appts') _tab (``x'_gp_interactions') _n
 16. }
 17. }
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)

. 
. forvalues i=1/5 {
  2. local label`i': label imd `i'
  3. foreach x of local year {
  4. file write tablecontent ("01/04/`x'") _tab ("`label`i''") _tab
  5. use ./output/`x'_ckd_complete.dta, clear
  6. drop if ckd_group!=4
  7. foreach aggregate of varlist hospital_days critical_care_days emergency_days op_appts neph_appts tx_appts gp_interactions {
  8. qui su imd_`aggregate' if imd==`i'
  9. local `x'_`aggregate' = r(mean)
 10. }
 11. foreach binary of varlist fistula_formation pd_insertion {
 12. qui safecount if `binary'==1 & imd==`i'
 13. local `x'_`binary' = round(r(N),5)
 14. }
 15. file write tablecontent (``x'_hospital_days') _tab (``x'_critical_care_days') _tab (``x'_emergency_days') _tab (``x'_fistula_formation') _tab (``x'_pd_insertion') _tab (``x'_op_appts') _tab (``x'_neph_app
> ts') _tab (``x'_tx_appts') _tab (``x'_gp_interactions') _n
 16. }
 17. }
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)

. 
. forvalues i=1/9 {
  2. local label`i': label region `i'
  3. foreach x of local year {
  4. file write tablecontent ("01/04/`x'") _tab ("`label`i''") _tab
  5. use ./output/`x'_ckd_complete.dta, clear
  6. drop if ckd_group!=4
  7. foreach aggregate of varlist hospital_days critical_care_days emergency_days op_appts neph_appts tx_appts gp_interactions {
  8. qui su region_`aggregate' if region==`i'
  9. local `x'_`aggregate' = r(mean)
 10. }
 11. foreach binary of varlist fistula_formation pd_insertion {
 12. qui safecount if `binary'==1 & region==`i'
 13. local `x'_`binary' = round(r(N),5)
 14. }
 15. file write tablecontent (``x'_hospital_days') _tab (``x'_critical_care_days') _tab (``x'_emergency_days') _tab (``x'_fistula_formation') _tab (``x'_pd_insertion') _tab (``x'_op_appts') _tab (``x'_neph_app
> ts') _tab (``x'_tx_appts') _tab (``x'_gp_interactions') _n
 16. }
 17. }
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)

. 
. forvalues i=0/1 {
  2. local label`i': label urban `i'
  3. foreach x of local year {
  4. file write tablecontent ("01/04/`x'") _tab ("`label`i''") _tab
  5. use ./output/`x'_ckd_complete.dta, clear
  6. drop if ckd_group!=4
  7. foreach aggregate of varlist hospital_days critical_care_days emergency_days op_appts neph_appts tx_appts gp_interactions {
  8. qui su urban_`aggregate' if urban==`i'
  9. local `x'_`aggregate' = r(mean)
 10. }
 11. foreach binary of varlist fistula_formation pd_insertion {
 12. qui safecount if `binary'==1 & urban==`i'
 13. local `x'_`binary' = round(r(N),5)
 14. }
 15. file write tablecontent (``x'_hospital_days') _tab (``x'_critical_care_days') _tab (``x'_emergency_days') _tab (``x'_fistula_formation') _tab (``x'_pd_insertion') _tab (``x'_op_appts') _tab (``x'_neph_app
> ts') _tab (``x'_tx_appts') _tab (``x'_gp_interactions') _n
 16. }
 17. }
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)
(1,998 observations deleted)
(2,017 observations deleted)
(1,976 observations deleted)
(2,049 observations deleted)
(2,061 observations deleted)
(2,007 observations deleted)

. 
. 
. file close tablecontent

. 
. import delimited ./output/healthcare_use_dialysis.csv, clear
(encoding automatically selected: ISO-8859-1)
(11 vars, 138 obs)

. local columns ""ip" "icu" "ed" "avf" "pd" "opd" "neph" "tx" "gp""

. foreach col of local columns {
  2.     replace `col' = . if `col' <= 5
  3. }
(0 real changes made)
(3 real changes made, 3 to missing)
(3 real changes made, 3 to missing)
(98 real changes made, 98 to missing)
(102 real changes made, 102 to missing)
(0 real changes made)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)
(1 real change made, 1 to missing)

. 
. 
. export delimited "./output/healthcare_use_dialysis.csv", replace
file ./output/healthcare_use_dialysis.csv saved

. 
end of do-file

