-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\Repo\ckd-healthcare-use\logs/relative_costs_transplant.log
  log type:  text
 opened on:  13 Sep 2023, 13:39:12

. cap file close tablecontent

. **Creates output file for each year (`dataset')
. file open tablecontent using ./output/relative_costs_transplant.csv, write text replace
(file ./output/relative_costs_transplant.csv not found)

. **Column headings
. file write tablecontent ("Date") _tab ("stratum") _tab ("apcs") _tab ("ec") _tab ("opa") _n

. 
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. file write tablecontent ("01/04/`x'") _tab ("all") _tab
  3. use ./output/`x'_ckd_complete.dta, clear
  4. drop if ckd_group!=5
  5. qui safecount
  6. local denom = round(r(N),5)
  7. foreach cost of varlist apcs_cost ec_cost opa_cost {
  8. qui su total_`cost'
  9. local `x'_`cost' = (r(mean))/`denom'
 10. }
 11. file write tablecontent %9.2f (``x'_apcs_cost') _tab %9.2f (``x'_ec_cost') _tab %9.2f (``x'_opa_cost') _n
 12. }
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)

. 
. forvalues i=1/6 {
  2. local label`i': label ethnicity `i'
  3. foreach x of local year {
  4. file write tablecontent ("01/04/`x'") _tab ("`label`i''") _tab
  5. use ./output/`x'_ckd_complete.dta, clear
  6. drop if ckd_group!=5
  7. qui safecount if ethnicity==`i'
  8. local denom = round(r(N),5)
  9. foreach cost of varlist apcs_cost ec_cost opa_cost {
 10. qui su ethnicity_`cost'_ckd if ethnicity==`i'
 11. local `x'_`cost' = (r(mean))/`denom'
 12. }
 13. file write tablecontent %9.2f (``x'_apcs_cost') _tab %9.2f (``x'_ec_cost') _tab %9.2f (``x'_opa_cost') _n
 14. }
 15. }
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)

. 
. forvalues i=1/5 {
  2. local label`i': label imd `i'
  3. foreach x of local year {
  4. file write tablecontent ("01/04/`x'") _tab ("`label`i''") _tab
  5. use ./output/`x'_ckd_complete.dta, clear
  6. drop if ckd_group!=5
  7. qui safecount if imd==`i'
  8. local denom = round(r(N),5)
  9. foreach cost of varlist apcs_cost ec_cost opa_cost {
 10. qui su imd_`cost'_ckd if imd==`i'
 11. local `x'_`cost' = (r(mean))/`denom'
 12. }
 13. file write tablecontent %9.2f (``x'_apcs_cost') _tab %9.2f (``x'_ec_cost') _tab %9.2f (``x'_opa_cost') _n
 14. }
 15. }
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)

. 
. forvalues i=1/9 {
  2. local label`i': label region `i'
  3. foreach x of local year {
  4. file write tablecontent ("01/04/`x'") _tab ("`label`i''") _tab
  5. use ./output/`x'_ckd_complete.dta, clear
  6. drop if ckd_group!=5
  7. qui safecount if region==`i'
  8. local denom = round(r(N),5)
  9. foreach cost of varlist apcs_cost ec_cost opa_cost {
 10. qui su region_`cost'_ckd if region==`i'
 11. local `x'_`cost' = (r(mean))/`denom'
 12. }
 13. file write tablecontent %9.2f (``x'_apcs_cost') _tab %9.2f (``x'_ec_cost') _tab %9.2f (``x'_opa_cost') _n
 14. }
 15. }
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)

. 
. forvalues i=0/1 {
  2. local label`i': label urban `i'
  3. foreach x of local year {
  4. file write tablecontent ("01/04/`x'") _tab ("`label`i''") _tab
  5. use ./output/`x'_ckd_complete.dta, clear
  6. drop if ckd_group!=5
  7. qui safecount if urban==`i'
  8. local denom = round(r(N),5)
  9. foreach cost of varlist apcs_cost ec_cost opa_cost {
 10. qui su urban_`cost'_ckd if urban==`i'
 11. local `x'_`cost' = (r(mean))/`denom'
 12. }
 13. file write tablecontent %9.2f (``x'_apcs_cost') _tab %9.2f (``x'_ec_cost') _tab %9.2f (``x'_opa_cost') _n
 14. }
 15. }
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)
(1,804 observations deleted)
(1,819 observations deleted)
(1,826 observations deleted)
(1,864 observations deleted)
(1,812 observations deleted)
(1,808 observations deleted)

. 
. file close tablecontent

. 
end of do-file

. exit, clear
