-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\lsh1703468\Documents\repo\ckd-healthcare-use\logs/weighted_ckd_progression.log
  log type:  text
 opened on:  15 Jun 2024, 16:32:51

. 
. cap file close tablecontent

. file open tablecontent using ./output/weighted_ckd_progression.csv, write text replace
(file ./output/weighted_ckd_progression.csv not found)

. 
. file write tablecontent ("stratum") _tab ("start_status") _tab ("end_status") _tab ("2017") _tab ("2017_ll") _tab ("2017_ul") _tab ("2018") _tab ("2018_ll") _tab ("2018_ul")  _tab ("2019") _tab ("2019_ll") _
> tab ("2019_ul") _tab ("2020") _tab ("2020_ll") _tab ("2020_ul") _tab ("2021") _tab ("2021_ll") _tab ("2021_ul") _tab ("2022") _tab ("2022_ll") _tab ("2022_ul") _n

. 
. local year "2017 2018 2019 2020 2021 2022"

. foreach x of local year {
  2. use ./output/`x'_ckd_complete.dta, clear
  3. drop _merge
  4. merge 1:1 patient_id using ./output/`x'_nockd_complete
  5. 
. replace ckd_group = 0 if ckd_group==1
  6. 
. **Overall
. total weight
  7. local baseline_ckd_`x' = r(table)[1,1]
  8. local multiplier = 100000/`baseline_ckd_`x''
  9. total weight
 10. local baseline_ckd_`x' = r(table)[1,1] * `multiplier'
 11. local baseline_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 12. local baseline_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 13. 
. total weight if ckd_progression==0
 14. local none_ckd_`x' = r(table)[1,1] * `multiplier'
 15. local none_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 16. local none_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 17. 
. total weight if ckd_progression==1
 18. local ckd3_ckd_`x' = r(table)[1,1] * `multiplier'
 19. local ckd3_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 20. local ckd3_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 21. 
. total weight if ckd_progression==2
 22. local ckd4_ckd_`x' = r(table)[1,1] * `multiplier'
 23. local ckd4_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 24. local ckd4_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 25. 
. total weight if ckd_progression==3
 26. local dialysis_ckd_`x' = r(table)[1,1] * `multiplier'
 27. local dialysis_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 28. local dialysis_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 29. 
. total weight if ckd_progression==4
 30. local kt_ckd_`x' = r(table)[1,1] * `multiplier'
 31. local kt_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 32. local kt_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 33. 
. total weight if ckd_progression==6
 34. local deceased_ckd_`x' = r(table)[1,1] * `multiplier'
 35. local deceased_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 36. local deceased_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 37. 
. total weight if cardiovascular==1
 38. local cardio_ckd_`x' = r(table)[1,1] * `multiplier'
 39. local cardio_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 40. local cardio_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 41. 
. **No CKD
. total weight if ckd_group==0
 42. local baseline_nockd_`x' = r(table)[1,1]
 43. local multiplier = 100000/`baseline_nockd_`x''
 44. total weight if ckd_group==0
 45. local baseline_nockd_`x' = r(table)[1,1] * `multiplier'
 46. local baseline_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 47. local baseline_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 48. 
. total weight if ckd_group==0 & ckd_progression==0
 49. local none_nockd_`x' = r(table)[1,1] * `multiplier'
 50. local none_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 51. local none_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 52. 
. total weight if ckd_group==0 & ckd_progression==1
 53. local ckd3_nockd_`x' = r(table)[1,1] * `multiplier'
 54. local ckd3_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 55. local ckd3_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 56. 
. total weight if ckd_group==0 & ckd_progression==2
 57. local ckd4_nockd_`x' = r(table)[1,1] * `multiplier'
 58. local ckd4_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 59. local ckd4_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 60. 
. total weight if ckd_group==0 & ckd_progression==3
 61. local dialysis_nockd_`x' = r(table)[1,1] * `multiplier'
 62. local dialysis_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 63. local dialysis_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 64. 
. total weight if ckd_group==0 & ckd_progression==4
 65. local kt_nockd_`x' = r(table)[1,1] * `multiplier'
 66. local kt_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 67. local kt_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 68. 
. total weight if ckd_group==0 & ckd_progression==6
 69. local deceased_nockd_`x' = r(table)[1,1] * `multiplier'
 70. local deceased_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 71. local deceased_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 72. 
. total weight if cardiovascular==1 & ckd_group==0
 73. local cardio_nockd_`x' = r(table)[1,1] * `multiplier'
 74. local cardio_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 75. local cardio_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 76. 
. **CKD stage 3
. total weight if ckd_group==2
 77. local baseline_ckd3_`x' = r(table)[1,1]
 78. local multiplier = 100000/`baseline_ckd3_`x''
 79. total weight if ckd_group==2
 80. local baseline_ckd3_`x' = r(table)[1,1] * `multiplier'
 81. local baseline_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 82. local baseline_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 83. 
. total weight if ckd_group==2 & ckd_progression==0
 84. local none_ckd3_`x' = r(table)[1,1] * `multiplier'
 85. local none_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 86. local none_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 87. 
. total weight if ckd_group==2 & ckd_progression==2
 88. local ckd4_ckd3_`x' = r(table)[1,1] * `multiplier'
 89. local ckd4_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 90. local ckd4_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 91. 
. total weight if ckd_group==2 & ckd_progression==3
 92. local dialysis_ckd3_`x' = r(table)[1,1] * `multiplier'
 93. local dialysis_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 94. local dialysis_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 95. 
. total weight if ckd_group==2 & ckd_progression==4
 96. local kt_ckd3_`x' = r(table)[1,1] * `multiplier'
 97. local kt_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 98. local kt_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 99. 
. total weight if ckd_group==2 & ckd_progression==6
100. local deceased_ckd3_`x' = r(table)[1,1] * `multiplier'
101. local deceased_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
102. local deceased_ckd3_`x'_ul = r(table)[6,1] * `multiplier' 
103. 
. total weight if cardiovascular==1 & ckd_group==2
104. local cardio_ckd3_`x' = r(table)[1,1] * `multiplier'
105. local cardio_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
106. local cardio_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
107. 
. **CKD stage 4/5
. total weight if ckd_group==3
108. local baseline_ckd4_`x' = r(table)[1,1]
109. local multiplier = 100000/`baseline_ckd4_`x''
110. total weight if ckd_group==3
111. local baseline_ckd4_`x' = r(table)[1,1] * `multiplier'
112. local baseline_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
113. local baseline_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
114. 
. total weight if ckd_group==3 & ckd_progression==0
115. local none_ckd4_`x' = r(table)[1,1] * `multiplier'
116. local none_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
117. local none_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
118. 
. total weight if ckd_group==3 & ckd_progression==3
119. local dialysis_ckd4_`x' = r(table)[1,1] * `multiplier'
120. local dialysis_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
121. local dialysis_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
122. 
. total weight if ckd_group==3 & ckd_progression==4
123. local kt_ckd4_`x' = r(table)[1,1] * `multiplier'
124. local kt_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
125. local kt_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
126. 
. total weight if ckd_group==3 & ckd_progression==6
127. local deceased_ckd4_`x' = r(table)[1,1] * `multiplier'
128. local deceased_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
129. local deceased_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
130. 
. total weight if cardiovascular==1 & ckd_group==3
131. local cardio_ckd4_`x' = r(table)[1,1] * `multiplier'
132. local cardio_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
133. local cardio_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
134. 
. **Dialysis
. total weight if ckd_group==4
135. local baseline_dialysis_`x' = r(table)[1,1]
136. local multiplier = 100000/`baseline_dialysis_`x''
137. total weight if ckd_group==4
138. local baseline_dialysis_`x' = r(table)[1,1] * `multiplier'
139. local baseline_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
140. local baseline_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
141. 
. total weight if ckd_group==4 & ckd_progression==0
142. local none_dialysis_`x' = r(table)[1,1] * `multiplier'
143. local none_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
144. local none_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
145. 
. total weight if ckd_group==4 & ckd_progression==4
146. local kt_dialysis_`x' = r(table)[1,1] * `multiplier'
147. local kt_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
148. local kt_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
149. 
. total weight if ckd_group==4 & ckd_progression==6
150. local deceased_dialysis_`x' = r(table)[1,1] * `multiplier'
151. local deceased_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
152. local deceased_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
153. 
. total weight if cardiovascular==1 & ckd_group==4
154. local cardio_dialysis_`x' = r(table)[1,1] * `multiplier'
155. local cardio_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
156. local cardio_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
157. 
. **Kidney transplant
. total weight if ckd_group==5
158. local baseline_kt_`x' = r(table)[1,1]
159. local multiplier = 100000/`baseline_kt_`x''
160. total weight if ckd_group==5
161. local baseline_kt_`x' = r(table)[1,1] * `multiplier'
162. local baseline_kt_`x'_ll = r(table)[5,1] * `multiplier'
163. local baseline_kt_`x'_ul = r(table)[6,1] * `multiplier'
164. 
. total weight if ckd_group==5 & ckd_progression==0
165. local none_kt_`x' = r(table)[1,1] * `multiplier'
166. local none_kt_`x'_ll = r(table)[5,1] * `multiplier'
167. local none_kt_`x'_ul = r(table)[6,1] * `multiplier'
168. 
. total weight if ckd_group==5 & ckd_progression==3
169. local dialysis_kt_`x' = r(table)[1,1] * `multiplier'
170. local dialysis_kt_`x'_ll = r(table)[5,1] * `multiplier'
171. local dialysis_kt_`x'_ul = r(table)[6,1] * `multiplier'
172. 
. total weight if ckd_group==5 & ckd_progression==6
173. local deceased_kt_`x' = r(table)[1,1] * `multiplier'
174. local deceased_kt_`x'_ll = r(table)[5,1] * `multiplier'
175. local deceased_kt_`x'_ul = r(table)[6,1] * `multiplier'
176. 
. total weight if cardiovascular==1 & ckd_group==5
177. local cardio_kt_`x' = r(table)[1,1] * `multiplier'
178. local cardio_kt_`x'_ll = r(table)[5,1] * `multiplier'
179. local cardio_kt_`x'_ul = r(table)[6,1] * `multiplier'
180. }
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,125
        from master                     2,125  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             1,084  (_merge==3)
    -----------------------------------------
(1,296 real changes made)

Total estimation                         Number of obs = 3,209

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   233.6897   1.007379      231.7146    235.6649
--------------------------------------------------------------

Total estimation                         Number of obs = 3,209

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   233.6897   1.007379      231.7146    235.6649
--------------------------------------------------------------

Total estimation                         Number of obs = 2,413

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    176.214    .861859      174.5239    177.9041
--------------------------------------------------------------

Total estimation                           Number of obs = 271

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   19.43739   .3134907       18.8202    20.05459
--------------------------------------------------------------

Total estimation                            Number of obs = 15

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .966541   .0859467      .7822036    1.150878
--------------------------------------------------------------

Total estimation                           Number of obs = 118

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   8.965288   .1779225      8.612922    9.317654
--------------------------------------------------------------

Total estimation                           Number of obs = 128

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   9.194535   .2086175      8.781719    9.607351
--------------------------------------------------------------

Total estimation                           Number of obs = 253

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   18.19079   .2871916      17.62518    18.75639
--------------------------------------------------------------

Total estimation                           Number of obs = 166

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    11.8141   .2635577      11.29372    12.33448
--------------------------------------------------------------

Total estimation                         Number of obs = 2,380

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   174.8695   .8420155      173.2184    176.5207
--------------------------------------------------------------

Total estimation                         Number of obs = 2,380

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   174.8695   .8420155      173.2184    176.5207
--------------------------------------------------------------

Total estimation                         Number of obs = 1,764

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   130.4347   .7030405      129.0558    131.8135
--------------------------------------------------------------

Total estimation                           Number of obs = 271

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   19.43739   .3134907       18.8202    20.05459
--------------------------------------------------------------

Total estimation                            Number of obs = 12

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .79306   .0830408      .6102885    .9758315
--------------------------------------------------------------

Total estimation                            Number of obs = 73

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.563804   .1352763      5.294136    5.833473
--------------------------------------------------------------

Total estimation                            Number of obs = 80

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.879792   .1487885      5.583636    6.175948
--------------------------------------------------------------

Total estimation                           Number of obs = 172

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   12.28126   .2457573      11.79615    12.76637
--------------------------------------------------------------

Total estimation                           Number of obs = 124

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    8.93678   .2103921      8.520322    9.353238
--------------------------------------------------------------

Total estimation                           Number of obs = 386

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   27.39773   .3702883      26.66969    28.12577
--------------------------------------------------------------

Total estimation                           Number of obs = 386

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   27.39773   .3702883      26.66969    28.12577
--------------------------------------------------------------

Total estimation                           Number of obs = 305

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.68894   .3274923       21.0445    22.33338
--------------------------------------------------------------

Total estimation                             Number of obs = 3

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .173481    .024783      .0668484    .2801136
--------------------------------------------------------------

Total estimation                            Number of obs = 18

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.307311   .0859168      1.126042     1.48858
--------------------------------------------------------------

Total estimation                            Number of obs = 21

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.418834   .0958244      1.218948     1.61872
--------------------------------------------------------------

Total estimation                            Number of obs = 37

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   2.654269   .1146537      2.421741    2.886797
--------------------------------------------------------------

Total estimation                            Number of obs = 21

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.573727    .095825       1.37384    1.773614
--------------------------------------------------------------

Total estimation                            Number of obs = 15

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .700123    .102959      .4792979    .9209481
--------------------------------------------------------------

Total estimation                            Number of obs = 15

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .700123    .102959      .4792979    .9209481
--------------------------------------------------------------

Total estimation                            Number of obs = 11

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |      .4399   .0823833      .2563386    .6234614
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .061958          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .030979          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 2

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .167286    .006196      .0885584    .2460136
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .018587          .             .           .
--------------------------------------------------------------

Total estimation                           Number of obs = 106

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   7.855005   .1830209      7.492108    8.217902
--------------------------------------------------------------

Total estimation                           Number of obs = 106

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   7.855005   .1830209      7.492108    8.217902
--------------------------------------------------------------

Total estimation                            Number of obs = 84

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   6.182146   .1631668      5.857614    6.506678
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .266418   .0642893      .0618208    .4710152
--------------------------------------------------------------

Total estimation                            Number of obs = 16

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.232959   .0572118      1.111015    1.354903
--------------------------------------------------------------

Total estimation                             Number of obs = 5

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .346964   .0531177      .1994858    .4944422
--------------------------------------------------------------

Total estimation                           Number of obs = 284

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   20.07431   .3186791      19.44703    20.70159
--------------------------------------------------------------

Total estimation                           Number of obs = 284

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   20.07431   .3186791      19.44703    20.70159
--------------------------------------------------------------

Total estimation                           Number of obs = 217

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    15.0991   .2898257      14.52785    15.67035
--------------------------------------------------------------

Total estimation                            Number of obs = 22

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.703839   .0770183      1.543671    1.864007
--------------------------------------------------------------

Total estimation                            Number of obs = 22

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.586119   .0578063      1.465904    1.706334
--------------------------------------------------------------

Total estimation                            Number of obs = 13

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .789341   .0998705      .5717419     1.00694
--------------------------------------------------------------
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,126
        from master                     2,077  (_merge==1)
        from using                      1,049  (_merge==2)

    Matched                                 0  (_merge==3)
    -----------------------------------------
(1,289 real changes made)

Total estimation                         Number of obs = 3,126

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   226.8484   1.018576      224.8512    228.8455
--------------------------------------------------------------

Total estimation                         Number of obs = 3,126

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   226.8484   1.018576      224.8512    228.8455
--------------------------------------------------------------

Total estimation                         Number of obs = 2,346

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   171.2661   .8771375       169.546    172.9861
--------------------------------------------------------------

Total estimation                           Number of obs = 289

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   20.02599   .3484892      19.34008    20.71189
--------------------------------------------------------------

Total estimation                            Number of obs = 14

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .768276    .083762      .5873193    .9492327
--------------------------------------------------------------

Total estimation                           Number of obs = 129

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   9.705064   .1632824      9.381982    10.02815
--------------------------------------------------------------

Total estimation                            Number of obs = 89

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   6.234188   .1703406      5.895672    6.572704
--------------------------------------------------------------

Total estimation                           Number of obs = 251

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    18.2701   .2713479      17.73568    18.80452
--------------------------------------------------------------

Total estimation                           Number of obs = 191

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   13.36924   .2873063      12.80252    13.93596
--------------------------------------------------------------

Total estimation                         Number of obs = 2,338

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     170.96   .8671478      169.2595    172.6604
--------------------------------------------------------------

Total estimation                         Number of obs = 2,338

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     170.96   .8671478      169.2595    172.6604
--------------------------------------------------------------

Total estimation                         Number of obs = 1,728

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   127.2612   .7373773      125.8149    128.7074
--------------------------------------------------------------

Total estimation                           Number of obs = 289

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   20.02599   .3484892      19.34008    20.71189
--------------------------------------------------------------

Total estimation                            Number of obs = 11

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .650556   .0683782         .4982     .802912
--------------------------------------------------------------

Total estimation                            Number of obs = 74

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    5.49813   .1333194      5.232425    5.763835
--------------------------------------------------------------

Total estimation                            Number of obs = 58

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   4.224279   .1267121      3.970542    4.478016
--------------------------------------------------------------

Total estimation                           Number of obs = 172

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   12.88225   .1996133      12.48823    13.27628
--------------------------------------------------------------

Total estimation                           Number of obs = 141

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   10.06194   .2404967      9.586462    10.53741
--------------------------------------------------------------

Total estimation                           Number of obs = 370

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   25.98757   .3742886      25.25157    26.72358
--------------------------------------------------------------

Total estimation                           Number of obs = 370

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   25.98757   .3742886      25.25157    26.72358
--------------------------------------------------------------

Total estimation                           Number of obs = 298

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.12512   .3317923      20.47216    21.77808
--------------------------------------------------------------

Total estimation                             Number of obs = 3

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .11772    .044679     -.0745183    .3099583
--------------------------------------------------------------

Total estimation                            Number of obs = 24

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.778189   .0797959      1.613119    1.943259
--------------------------------------------------------------

Total estimation                            Number of obs = 16

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.102849   .0619577      .9707892    1.234909
--------------------------------------------------------------

Total estimation                            Number of obs = 28

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.776951    .120554      1.529595    2.024307
--------------------------------------------------------------

Total estimation                            Number of obs = 27

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.964062   .0882098      1.782744     2.14538
--------------------------------------------------------------

Total estimation                            Number of obs = 16

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.040892   .0882036      .8528905    1.228894
--------------------------------------------------------------

Total estimation                            Number of obs = 16

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.040892   .0882036      .8528905    1.228894
--------------------------------------------------------------

Total estimation                             Number of obs = 6

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .377944   .0646855      .2116646    .5442234
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .297397   .0335567      .1906046    .4041894
--------------------------------------------------------------

Total estimation                             Number of obs = 2

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .099132          0             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .266419   .0529367      .0979507    .4348873
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .223049   .0335567      .1162566    .3298414
--------------------------------------------------------------

Total estimation                            Number of obs = 67

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   4.659223   .1781526       4.30353    5.014916
--------------------------------------------------------------

Total estimation                            Number of obs = 67

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   4.659223   .1781526       4.30353    5.014916
--------------------------------------------------------------

Total estimation                            Number of obs = 53

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   3.537787   .1706254      3.195402    3.880172
--------------------------------------------------------------

Total estimation                             Number of obs = 2

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .16109    .012392      .0036347    .3185453
--------------------------------------------------------------

Total estimation                             Number of obs = 6

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .48327   .0166256      .4405325    .5260075
--------------------------------------------------------------

Total estimation                             Number of obs = 5

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .306071   .0665465      .1213084    .4908336
--------------------------------------------------------------

Total estimation                           Number of obs = 297

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.35435   .3040705      20.75594    21.95277
--------------------------------------------------------------

Total estimation                           Number of obs = 297

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.35435   .3040705      20.75594    21.95277
--------------------------------------------------------------

Total estimation                           Number of obs = 230

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    16.6815   .2631965       16.1629     17.2001
--------------------------------------------------------------

Total estimation                            Number of obs = 19

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.499378   .0334929      1.429012    1.569744
--------------------------------------------------------------

Total estimation                            Number of obs = 37

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   2.526635   .1129058      2.297651    2.755619
--------------------------------------------------------------

Total estimation                            Number of obs = 13

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .727384   .0948097      .5208115    .9339565
--------------------------------------------------------------
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,138
        from master                     2,138  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             1,101  (_merge==3)
    -----------------------------------------
(1,316 real changes made)

Total estimation                         Number of obs = 3,239

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   235.6885   1.010953      233.7063    237.6707
--------------------------------------------------------------

Total estimation                         Number of obs = 3,239

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   235.6885   1.010953      233.7063    237.6707
--------------------------------------------------------------

Total estimation                         Number of obs = 2,446

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   178.8695   .8713048       177.161    180.5781
--------------------------------------------------------------

Total estimation                           Number of obs = 264

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   18.84135   .2789054      18.29218    19.39052
--------------------------------------------------------------

Total estimation                            Number of obs = 12

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .63197   .0917464      .4300375    .8339025
--------------------------------------------------------------

Total estimation                           Number of obs = 146

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   10.62452   .2022274      10.22482    11.02421
--------------------------------------------------------------

Total estimation                           Number of obs = 109

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   7.535304   .2269105      7.085528     7.98508
--------------------------------------------------------------

Total estimation                           Number of obs = 255

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    18.6468   .2801904      18.09501     19.1986
--------------------------------------------------------------

Total estimation                           Number of obs = 155

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   11.32959   .2258061      10.88352    11.77567
--------------------------------------------------------------

Total estimation                         Number of obs = 2,417

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   177.2499   .8459372      175.5911    178.9088
--------------------------------------------------------------

Total estimation                         Number of obs = 2,417

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   177.2499   .8459372      175.5911    178.9088
--------------------------------------------------------------

Total estimation                         Number of obs = 1,787

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   131.6243   .7224506      130.2073    133.0412
--------------------------------------------------------------

Total estimation                           Number of obs = 264

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   18.84135   .2789054      18.29218    19.39052
--------------------------------------------------------------

Total estimation                             Number of obs = 8

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .39653   .0853389      .1947356    .5983244
--------------------------------------------------------------

Total estimation                           Number of obs = 108

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   7.947942   .1674779      7.615937    8.279948
--------------------------------------------------------------

Total estimation                            Number of obs = 65

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   4.515483   .1765177      4.162848    4.868118
--------------------------------------------------------------

Total estimation                           Number of obs = 180

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   13.53405   .2096347      13.12037    13.94772
--------------------------------------------------------------

Total estimation                           Number of obs = 113

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   8.293662   .1915509      7.914129    8.673196
--------------------------------------------------------------

Total estimation                           Number of obs = 430

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   30.19822    .397697      29.41655     30.9799
--------------------------------------------------------------

Total estimation                           Number of obs = 430

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   30.19822    .397697      29.41655     30.9799
--------------------------------------------------------------

Total estimation                           Number of obs = 341

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    24.2193   .3450041      23.54069    24.89791
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .23544   .0385268      .1128306    .3580495
--------------------------------------------------------------

Total estimation                            Number of obs = 20

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.356874   .0864491      1.175934    1.537814
--------------------------------------------------------------

Total estimation                            Number of obs = 25

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.697643    .105994      1.478882    1.916404
--------------------------------------------------------------

Total estimation                            Number of obs = 38

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   2.540269   .1373232      2.262026    2.818512
--------------------------------------------------------------

Total estimation                            Number of obs = 18

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.338289   .0584313       1.21501    1.461568
--------------------------------------------------------------

Total estimation                            Number of obs = 11

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .656753    .062513      .5174653    .7960407
--------------------------------------------------------------

Total estimation                            Number of obs = 11

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .656753    .062513      .5174653    .7960407
--------------------------------------------------------------

Total estimation                             Number of obs = 7

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .458488   .0508406      .3340855    .5828905
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .049566          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .049566          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 2

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .099133    .037175     -.3732202    .5714862
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .049566          .             .           .
--------------------------------------------------------------

Total estimation                            Number of obs = 72

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    5.25278    .155466       4.94279     5.56277
--------------------------------------------------------------

Total estimation                            Number of obs = 72

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    5.25278    .155466       4.94279     5.56277
--------------------------------------------------------------

Total estimation                            Number of obs = 57

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   4.116475   .1429547      3.830102    4.402848
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .080545          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 8

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .560098   .0569168      .4255112    .6946848
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .080545          .             .           .
--------------------------------------------------------------

Total estimation                           Number of obs = 270

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   19.54147    .316475      18.91839    20.16455
--------------------------------------------------------------

Total estimation                           Number of obs = 270

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   19.54147    .316475      18.91839    20.16455
--------------------------------------------------------------

Total estimation                           Number of obs = 223

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   16.29984   .2807699      15.74653    16.85316
--------------------------------------------------------------

Total estimation                             Number of obs = 9

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .607186   .0612569      .4659274    .7484446
--------------------------------------------------------------

Total estimation                            Number of obs = 23

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.609664   .0954704      1.411671    1.807657
--------------------------------------------------------------

Total estimation                            Number of obs = 19

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.332092   .1026622      1.116407    1.547777
--------------------------------------------------------------
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,086
        from master                     2,086  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             1,077  (_merge==3)
    -----------------------------------------
(1,253 real changes made)

Total estimation                         Number of obs = 3,163

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   230.4184   1.008543       228.441    232.3959
--------------------------------------------------------------

Total estimation                         Number of obs = 3,163

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   230.4184   1.008543       228.441    232.3959
--------------------------------------------------------------

Total estimation                         Number of obs = 2,425

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   177.5969    .865364         175.9    179.2939
--------------------------------------------------------------

Total estimation                           Number of obs = 285

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   20.18585   .3310387      19.53424    20.83745
--------------------------------------------------------------

Total estimation                            Number of obs = 13

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .718711   .0786972      .5472445    .8901775
--------------------------------------------------------------

Total estimation                           Number of obs = 119

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   8.791812   .1764582      8.442377    9.141247
--------------------------------------------------------------

Total estimation                            Number of obs = 96

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   6.866155    .197772      6.473528    7.258782
--------------------------------------------------------------

Total estimation                           Number of obs = 219

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   15.77568   .2783935        15.227    16.32437
--------------------------------------------------------------

Total estimation                           Number of obs = 162

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   12.09292   .2042595      11.68954    12.49629
--------------------------------------------------------------

Total estimation                         Number of obs = 2,330

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   171.6614   .8326183      170.0286    173.2941
--------------------------------------------------------------

Total estimation                         Number of obs = 2,330

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   171.6614   .8326183      170.0286    173.2941
--------------------------------------------------------------

Total estimation                         Number of obs = 1,750

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   129.7866   .6988886      128.4159    131.1573
--------------------------------------------------------------

Total estimation                           Number of obs = 285

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   20.18585   .3310387      19.53424    20.83745
--------------------------------------------------------------

Total estimation                             Number of obs = 9

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .483271   .0616472      .3411123    .6254297
--------------------------------------------------------------

Total estimation                            Number of obs = 73

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.408914   .1399012      5.130026    5.687802
--------------------------------------------------------------

Total estimation                            Number of obs = 71

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.256493   .1478708      4.961574    5.551412
--------------------------------------------------------------

Total estimation                           Number of obs = 138

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   10.23046   .2122564      9.810742    10.65019
--------------------------------------------------------------

Total estimation                           Number of obs = 122

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   9.199489   .1590977      8.884513    9.514465
--------------------------------------------------------------

Total estimation                           Number of obs = 407

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   28.56007    .408109      27.75779    29.36234
--------------------------------------------------------------

Total estimation                           Number of obs = 407

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   28.56007    .408109      27.75779    29.36234
--------------------------------------------------------------

Total estimation                           Number of obs = 332

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   23.28126   .3702679      22.55289    24.00964
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .23544   .0549534      .0605536    .4103264
--------------------------------------------------------------

Total estimation                            Number of obs = 20

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     1.4684   .0790257      1.302997    1.633803
--------------------------------------------------------------

Total estimation                            Number of obs = 11

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .799256   .0724134      .6379089    .9606031
--------------------------------------------------------------

Total estimation                            Number of obs = 39

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   2.688967   .1255922      2.434719    2.943215
--------------------------------------------------------------

Total estimation                            Number of obs = 24

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.741013   .1086973      1.516155    1.965871
--------------------------------------------------------------

Total estimation                            Number of obs = 16

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .743494   .0931707      .5449053    .9420827
--------------------------------------------------------------

Total estimation                            Number of obs = 16

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .743494   .0931707      .5449053    .9420827
--------------------------------------------------------------

Total estimation                            Number of obs = 11

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .51425   .0742979      .3487041    .6797959
--------------------------------------------------------------

Total estimation                             Number of obs = 2

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .11772    .055762     -.5908034    .8262434
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .018587          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 2

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .092937    .030979     -.3006885    .4865625
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .018587          .             .           .
--------------------------------------------------------------

Total estimation                            Number of obs = 78

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.618331   .1622035      5.295343    5.941319
--------------------------------------------------------------

Total estimation                            Number of obs = 78

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.618331   .1622035      5.295343    5.941319
--------------------------------------------------------------

Total estimation                            Number of obs = 60

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   4.395283   .1381497      4.118846     4.67172
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .225526   .0632336      .0242885    .4267635
--------------------------------------------------------------

Total estimation                             Number of obs = 7

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .458488   .0481252      .3407299    .5762462
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .297398    .017524      .2416288    .3531672
--------------------------------------------------------------

Total estimation                           Number of obs = 297

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.37667   .3089113      20.76873    21.98461
--------------------------------------------------------------

Total estimation                           Number of obs = 297

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.37667   .3089113      20.76873    21.98461
--------------------------------------------------------------

Total estimation                           Number of obs = 239

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   17.30356   .2737973      16.76419    17.84294
--------------------------------------------------------------

Total estimation                            Number of obs = 17

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.276331   .0563184      1.156941    1.395721
--------------------------------------------------------------

Total estimation                            Number of obs = 32

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   2.230479    .110475      2.005164    2.455794
--------------------------------------------------------------

Total estimation                             Number of obs = 9

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .67534   .0388165       .585829     .764851
--------------------------------------------------------------
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,144
        from master                     2,144  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             1,129  (_merge==3)
    -----------------------------------------
(1,304 real changes made)

Total estimation                         Number of obs = 3,273

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   238.4233   1.021034      236.4214    240.4252
--------------------------------------------------------------

Total estimation                         Number of obs = 3,273

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   238.4233   1.021034      236.4214    240.4252
--------------------------------------------------------------

Total estimation                         Number of obs = 2,453

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   178.8732    .889336      177.1293    180.6172
--------------------------------------------------------------

Total estimation                           Number of obs = 295

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.15114   .3109682      20.53913    21.76315
--------------------------------------------------------------

Total estimation                            Number of obs = 10

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .662949   .0530976      .5428338    .7830642
--------------------------------------------------------------

Total estimation                           Number of obs = 141

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   10.11647   .2291913      9.663344    10.56959
--------------------------------------------------------------

Total estimation                           Number of obs = 124

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   9.040877    .178638      8.687274     9.39448
--------------------------------------------------------------

Total estimation                           Number of obs = 246

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   18.27506   .2597925      17.76334    18.78677
--------------------------------------------------------------

Total estimation                           Number of obs = 175

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   12.89712   .2187236      12.46543    13.32881
--------------------------------------------------------------

Total estimation                         Number of obs = 2,433

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    178.447   .8621978      176.7563    180.1377
--------------------------------------------------------------

Total estimation                         Number of obs = 2,433

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    178.447   .8621978      176.7563    180.1377
--------------------------------------------------------------

Total estimation                         Number of obs = 1,819

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   133.7011   .7468841      132.2362    135.1659
--------------------------------------------------------------

Total estimation                           Number of obs = 295

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.15114   .3109682      20.53913    21.76315
--------------------------------------------------------------

Total estimation                             Number of obs = 8

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .557621   .0359752      .4725531    .6426889
--------------------------------------------------------------

Total estimation                            Number of obs = 90

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   6.504327   .1771469       6.15234    6.856314
--------------------------------------------------------------

Total estimation                            Number of obs = 76

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.636916   .1287984      5.380336    5.893496
--------------------------------------------------------------

Total estimation                           Number of obs = 143

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   10.74099    .198269      10.34905    11.13293
--------------------------------------------------------------

Total estimation                           Number of obs = 131

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   9.765779   .1828332      9.404065    10.12749
--------------------------------------------------------------

Total estimation                           Number of obs = 413

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   29.17591   .3930208      28.40334    29.94849
--------------------------------------------------------------

Total estimation                           Number of obs = 413

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   29.17591   .3930208      28.40334    29.94849
--------------------------------------------------------------

Total estimation                           Number of obs = 318

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   22.39773   .3463315      21.71633    23.07913
--------------------------------------------------------------

Total estimation                             Number of obs = 2

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .105328     .04337     -.4457401    .6563961
--------------------------------------------------------------

Total estimation                            Number of obs = 20

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.350683    .113321      1.113499    1.587867
--------------------------------------------------------------

Total estimation                            Number of obs = 21

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.493182    .083079      1.319882    1.666482
--------------------------------------------------------------

Total estimation                            Number of obs = 51

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   3.760837   .1171512      3.525532    3.996142
--------------------------------------------------------------

Total estimation                            Number of obs = 21

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.425028   .0795379      1.259115    1.590941
--------------------------------------------------------------

Total estimation                            Number of obs = 19

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.152415   .0971987      .9482082    1.356622
--------------------------------------------------------------

Total estimation                            Number of obs = 19

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.152415   .0971987      .9482082    1.356622
--------------------------------------------------------------

Total estimation                            Number of obs = 14

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .755885   .0825544       .577537     .934233
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .086741          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .086741          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 3

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .223048   .0107309      .1768766    .2692194
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .012392          .             .           .
--------------------------------------------------------------

Total estimation                            Number of obs = 82

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   6.035921   .1641202      5.709373    6.362469
--------------------------------------------------------------

Total estimation                            Number of obs = 82

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   6.035921   .1641202      5.709373    6.362469
--------------------------------------------------------------

Total estimation                            Number of obs = 57

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   4.121428   .1524853      3.815963    4.426893
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .303593   .0211625      .2362445    .3709415
--------------------------------------------------------------

Total estimation                             Number of obs = 9

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .638164   .0492747      .5245364    .7517916
--------------------------------------------------------------

Total estimation                             Number of obs = 7

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .485747   .0497571      .3639958    .6074982
--------------------------------------------------------------

Total estimation                           Number of obs = 286

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   20.74097   .3029792      20.14461    21.33733
--------------------------------------------------------------

Total estimation                           Number of obs = 286

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   20.74097   .3029792      20.14461    21.33733
--------------------------------------------------------------

Total estimation                           Number of obs = 212

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   15.50307   .2594185      14.99168    16.01445
--------------------------------------------------------------

Total estimation                            Number of obs = 14

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .966541   .0697588      .8158362    1.117246
--------------------------------------------------------------

Total estimation                            Number of obs = 38

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   2.738532    .109988      2.515675    2.961389
--------------------------------------------------------------

Total estimation                            Number of obs = 13

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.034694   .0286174       .972342    1.097046
--------------------------------------------------------------
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,089
        from master                     2,089  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             1,090  (_merge==3)
    -----------------------------------------
(1,258 real changes made)

Total estimation                         Number of obs = 3,179

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   233.4332   .9784503      231.5148    235.3517
--------------------------------------------------------------

Total estimation                         Number of obs = 3,179

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   233.4332   .9784503      231.5148    235.3517
--------------------------------------------------------------

Total estimation                         Number of obs = 2,406

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   177.0802   .8373872      175.4381    178.7223
--------------------------------------------------------------

Total estimation                           Number of obs = 305

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    22.2069   .3108837      21.59515    22.81866
--------------------------------------------------------------

Total estimation                            Number of obs = 10

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     .54523   .0985277      .3223449    .7681151
--------------------------------------------------------------

Total estimation                           Number of obs = 124

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   8.661691   .2428136      8.181056    9.142326
--------------------------------------------------------------

Total estimation                            Number of obs = 94

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   7.157358   .1425087      6.874364    7.440352
--------------------------------------------------------------

Total estimation                           Number of obs = 221

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   16.31348   .2543893      15.81213    16.81483
--------------------------------------------------------------

Total estimation                           Number of obs = 163

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   12.26888   .1987485      11.87641    12.66135
--------------------------------------------------------------

Total estimation                         Number of obs = 2,348

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   173.9327   .8046652      172.3548    175.5107
--------------------------------------------------------------

Total estimation                         Number of obs = 2,348

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   173.9327   .8046652      172.3548    175.5107
--------------------------------------------------------------

Total estimation                         Number of obs = 1,734

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   129.1026   .6734913      127.7816    130.4235
--------------------------------------------------------------

Total estimation                           Number of obs = 305

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    22.2069   .3108837      21.59515    22.81866
--------------------------------------------------------------

Total estimation                             Number of obs = 6

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .377943   .0708053      .1959322    .5599538
--------------------------------------------------------------

Total estimation                            Number of obs = 86

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   6.034682   .1978332      5.641337    6.428027
--------------------------------------------------------------

Total estimation                            Number of obs = 62

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   4.757113   .1102245      4.536706     4.97752
--------------------------------------------------------------

Total estimation                           Number of obs = 146

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   10.78437    .196519      10.39596    11.17278
--------------------------------------------------------------

Total estimation                           Number of obs = 125

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   9.598497   .1561285      9.289475    9.907519
--------------------------------------------------------------

Total estimation                           Number of obs = 410

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   28.46711   .4100684      27.66101    29.27322
--------------------------------------------------------------

Total estimation                           Number of obs = 410

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   28.46711   .4100684      27.66101    29.27322
--------------------------------------------------------------

Total estimation                           Number of obs = 336

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   23.31594   .3694071      22.58929    24.04259
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .167287   .0681531     -.0496065    .3841805
--------------------------------------------------------------

Total estimation                            Number of obs = 16

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.140022   .0735184      .9833212    1.296723
--------------------------------------------------------------

Total estimation                            Number of obs = 13

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .888475   .0748026      .7254942    1.051456
--------------------------------------------------------------

Total estimation                            Number of obs = 32

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   2.242872   .1185841      2.001018    2.484726
--------------------------------------------------------------

Total estimation                            Number of obs = 18

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.152416   .0883398      .9660353    1.338797
--------------------------------------------------------------

Total estimation                             Number of obs = 7

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .439901     .06237      .2872872    .5925148
--------------------------------------------------------------

Total estimation                             Number of obs = 7

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .439901     .06237      .2872872    .5925148
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .223048   .0581221      .0380776    .4080184
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .068154          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .086741          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .061958          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 2

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .148699    .024783     -.1661989    .4635969
--------------------------------------------------------------

Total estimation                            Number of obs = 77

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.940512   .1360332      5.669578    6.211446
--------------------------------------------------------------

Total estimation                            Number of obs = 77

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.940512   .1360332      5.669578    6.211446
--------------------------------------------------------------

Total estimation                            Number of obs = 60

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    4.57744   .1174955      4.342332    4.812548
--------------------------------------------------------------

Total estimation                             Number of obs = 6

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .501858    .012698      .4692167    .5344993
--------------------------------------------------------------

Total estimation                             Number of obs = 6

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .433705   .0669607      .2615771    .6058329
--------------------------------------------------------------

Total estimation                             Number of obs = 4

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .322181    .024783      .2433104    .4010516
--------------------------------------------------------------

Total estimation                           Number of obs = 294

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.31966   .3201453      20.68958    21.94974
--------------------------------------------------------------

Total estimation                           Number of obs = 294

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   21.31966   .3201453      20.68958    21.94974
--------------------------------------------------------------

Total estimation                           Number of obs = 237

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   17.11025   .2851496      16.54849    17.67201
--------------------------------------------------------------

Total estimation                            Number of obs = 15

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .904583   .1123568      .6636017    1.145564
--------------------------------------------------------------

Total estimation                            Number of obs = 29

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   2.294914   .0631993      2.165456    2.424372
--------------------------------------------------------------

Total estimation                            Number of obs = 11

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .824038   .0605795      .6890585    .9590175
--------------------------------------------------------------

. 
. **Populate table with redacted counts
. *Overall
. file write tablecontent ("All") _tab ("Overall") _tab ("N/A") _tab %10.2f (`baseline_ckd_2017') _tab %10.2f (`baseline_ckd_2017_ll') _tab %10.2f (`baseline_ckd_2017_ul') _tab %10.2f (`baseline_ckd_2018') _ta
> b %10.2f (`baseline_ckd_2018_ll') _tab %10.2f (`baseline_ckd_2018_ul') _tab %10.2f (`baseline_ckd_2019') _tab %10.2f (`baseline_ckd_2019_ll') _tab %10.2f (`baseline_ckd_2019_ul') _tab %10.2f (`baseline_ckd_2
> 020') _tab %10.2f (`baseline_ckd_2020_ll') _tab %10.2f (`baseline_ckd_2020_ul') _tab %10.2f (`baseline_ckd_2021') _tab %10.2f (`baseline_ckd_2021_ll') _tab %10.2f (`baseline_ckd_2021_ul') _tab %10.2f (`basel
> ine_ckd_2022') _tab %10.2f (`baseline_ckd_2022_ll') _tab %10.2f (`baseline_ckd_2022_ul') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("No progression") _tab %10.2f (`none_ckd_2017') _tab %10.2f (`none_ckd_2017_ll') _tab %10.2f (`none_ckd_2017_ul') _tab %10.2f (`none_ckd_2018') _tab %10
> .2f (`none_ckd_2018_ll') _tab %10.2f (`none_ckd_2018_ul') _tab %10.2f (`none_ckd_2019') _tab %10.2f (`none_ckd_2019_ll') _tab %10.2f (`none_ckd_2019_ul') _tab %10.2f (`none_ckd_2020') _tab %10.2f (`none_ckd_
> 2020_ll') _tab %10.2f (`none_ckd_2020_ul') _tab %10.2f (`none_ckd_2021') _tab %10.2f (`none_ckd_2021_ll') _tab %10.2f (`none_ckd_2021_ul') _tab %10.2f (`none_ckd_2022') _tab %10.2f (`none_ckd_2022_ll') _tab 
> %10.2f (`none_ckd_2022_ul') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("CKD stage 3") _tab %10.2f (`ckd3_ckd_2017') _tab %10.2f (`ckd3_ckd_2017_ll') _tab %10.2f (`ckd3_ckd_2017_ul') _tab %10.2f (`ckd3_ckd_2018') _tab %10.2f
>  (`ckd3_ckd_2018_ll') _tab %10.2f (`ckd3_ckd_2018_ul') _tab %10.2f (`ckd3_ckd_2019') _tab %10.2f (`ckd3_ckd_2019_ll') _tab %10.2f (`ckd3_ckd_2019_ul') _tab %10.2f (`ckd3_ckd_2020') _tab %10.2f (`ckd3_ckd_202
> 0_ll') _tab %10.2f (`ckd3_ckd_2020_ul') _tab %10.2f (`ckd3_ckd_2021') _tab %10.2f (`ckd3_ckd_2021_ll') _tab %10.2f (`ckd3_ckd_2021_ul') _tab %10.2f (`ckd3_ckd_2022') _tab %10.2f (`ckd3_ckd_2022_ll') _tab %10
> .2f (`ckd3_ckd_2022_ul') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("CKD stage 4/5") _tab %10.2f (`ckd4_ckd_2017') _tab %10.2f (`ckd4_ckd_2017_ll') _tab %10.2f (`ckd4_ckd_2017_ul') _tab %10.2f (`ckd4_ckd_2018') _tab %10.
> 2f (`ckd4_ckd_2018_ll') _tab %10.2f (`ckd4_ckd_2018_ul') _tab %10.2f (`ckd4_ckd_2019') _tab %10.2f (`ckd4_ckd_2019_ll') _tab %10.2f (`ckd4_ckd_2019_ul') _tab %10.2f (`ckd4_ckd_2020') _tab %10.2f (`ckd4_ckd_2
> 020_ll') _tab %10.2f (`ckd4_ckd_2020_ul') _tab %10.2f (`ckd4_ckd_2021') _tab %10.2f (`ckd4_ckd_2021_ll') _tab %10.2f (`ckd4_ckd_2021_ul') _tab %10.2f (`ckd4_ckd_2022') _tab %10.2f (`ckd4_ckd_2022_ll') _tab %
> 10.2f (`ckd4_ckd_2022_ul') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Dialysis") _tab %10.2f (`dialysis_ckd_2017') _tab %10.2f (`dialysis_ckd_2017_ll') _tab %10.2f (`dialysis_ckd_2017_ul') _tab %10.2f (`dialysis_ckd_2018'
> ) _tab %10.2f (`dialysis_ckd_2018_ll') _tab %10.2f (`dialysis_ckd_2018_ul') _tab %10.2f (`dialysis_ckd_2019') _tab %10.2f (`dialysis_ckd_2019_ll') _tab %10.2f (`dialysis_ckd_2019_ul') _tab %10.2f (`dialysis_
> ckd_2020') _tab %10.2f (`dialysis_ckd_2020_ll') _tab %10.2f (`dialysis_ckd_2020_ul') _tab %10.2f (`dialysis_ckd_2021') _tab %10.2f (`dialysis_ckd_2021_ll') _tab %10.2f (`dialysis_ckd_2021_ul') _tab %10.2f (`
> dialysis_ckd_2022') _tab %10.2f (`dialysis_ckd_2022_ll') _tab %10.2f (`dialysis_ckd_2022_ul') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Transplant") _tab %10.2f (`kt_ckd_2017') _tab %10.2f (`kt_ckd_2017_ll') _tab %10.2f (`kt_ckd_2017_ul') _tab %10.2f (`kt_ckd_2018') _tab %10.2f (`kt_ckd
> _2018_ll') _tab %10.2f (`kt_ckd_2018_ul') _tab %10.2f (`kt_ckd_2019') _tab %10.2f (`kt_ckd_2019_ll') _tab %10.2f (`kt_ckd_2019_ul') _tab %10.2f (`kt_ckd_2020') _tab %10.2f (`kt_ckd_2020_ll') _tab %10.2f (`kt
> _ckd_2020_ul') _tab %10.2f (`kt_ckd_2021') _tab %10.2f (`kt_ckd_2021_ll') _tab %10.2f (`kt_ckd_2021_ul') _tab %10.2f (`kt_ckd_2022') _tab %10.2f (`kt_ckd_2022_ll') _tab %10.2f (`kt_ckd_2022_ul') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Deceased") _tab %10.2f (`deceased_ckd_2017') _tab %10.2f (`deceased_ckd_2017_ll') _tab %10.2f (`deceased_ckd_2017_ul') _tab %10.2f (`deceased_ckd_2018'
> ) _tab %10.2f (`deceased_ckd_2018_ll') _tab %10.2f (`deceased_ckd_2018_ul') _tab %10.2f (`deceased_ckd_2019') _tab %10.2f (`deceased_ckd_2019_ll') _tab %10.2f (`deceased_ckd_2019_ul') _tab %10.2f (`deceased_
> ckd_2020') _tab %10.2f (`deceased_ckd_2020_ll') _tab %10.2f (`deceased_ckd_2020_ul') _tab %10.2f (`deceased_ckd_2021') _tab %10.2f (`deceased_ckd_2021_ll') _tab %10.2f (`deceased_ckd_2021_ul') _tab %10.2f (`
> deceased_ckd_2022') _tab %10.2f (`deceased_ckd_2022_ll') _tab %10.2f (`deceased_ckd_2022_ul') _n

. file write tablecontent ("All") _tab ("Overall") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_ckd_2017') _tab %10.2f (`cardio_ckd_2017_ll') _tab %10.2f (`cardio_ckd_2017_ul') _tab %10.2f (`cardio_c
> kd_2018') _tab %10.2f (`cardio_ckd_2018_ll') _tab %10.2f (`cardio_ckd_2018_ul') _tab %10.2f (`cardio_ckd_2019') _tab %10.2f (`cardio_ckd_2019_ll') _tab %10.2f (`cardio_ckd_2019_ul') _tab %10.2f (`cardio_ckd_
> 2020') _tab %10.2f (`cardio_ckd_2020_ll') _tab %10.2f (`cardio_ckd_2020_ul') _tab %10.2f (`cardio_ckd_2021') _tab %10.2f (`cardio_ckd_2021_ll') _tab %10.2f (`cardio_ckd_2021_ul') _tab %10.2f (`cardio_ckd_202
> 2') _tab %10.2f (`cardio_ckd_2022_ll') _tab %10.2f (`cardio_ckd_2022_ul') _n

. 
. *No CKD
. file write tablecontent ("All") _tab ("No CKD") _tab ("N/A") _tab %10.2f (`baseline_nockd_2017') _tab %10.2f (`baseline_nockd_2017_ll') _tab %10.2f (`baseline_nockd_2017_ul') _tab %10.2f (`baseline_nockd_201
> 8') _tab %10.2f (`baseline_nockd_2018_ll') _tab %10.2f (`baseline_nockd_2018_ul') _tab %10.2f (`baseline_nockd_2019') _tab %10.2f (`baseline_nockd_2019_ll') _tab %10.2f (`baseline_nockd_2019_ul') _tab %10.2f
>  (`baseline_nockd_2020') _tab %10.2f (`baseline_nockd_2020_ll') _tab %10.2f (`baseline_nockd_2020_ul') _tab %10.2f (`baseline_nockd_2021') _tab %10.2f (`baseline_nockd_2021_ll') _tab %10.2f (`baseline_nockd_
> 2021_ul') _tab %10.2f (`baseline_nockd_2022') _tab %10.2f (`baseline_nockd_2022_ll') _tab %10.2f (`baseline_nockd_2022_ul') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("No progression") _tab %10.2f (`none_nockd_2017') _tab %10.2f (`none_nockd_2017_ll') _tab %10.2f (`none_nockd_2017_ul') _tab %10.2f (`none_nockd_2018') _
> tab %10.2f (`none_nockd_2018_ll') _tab %10.2f (`none_nockd_2018_ul') _tab %10.2f (`none_nockd_2019') _tab %10.2f (`none_nockd_2019_ll') _tab %10.2f (`none_nockd_2019_ul') _tab %10.2f (`none_nockd_2020') _tab
>  %10.2f (`none_nockd_2020_ll') _tab %10.2f (`none_nockd_2020_ul') _tab %10.2f (`none_nockd_2021') _tab %10.2f (`none_nockd_2021_ll') _tab %10.2f (`none_nockd_2021_ul') _tab %10.2f (`none_nockd_2022') _tab %1
> 0.2f (`none_nockd_2022_ll') _tab %10.2f (`none_nockd_2022_ul') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("CKD stage 3") _tab %10.2f (`ckd3_nockd_2017') _tab %10.2f (`ckd3_nockd_2017_ll') _tab %10.2f (`ckd3_nockd_2017_ul') _tab %10.2f (`ckd3_nockd_2018') _tab
>  %10.2f (`ckd3_nockd_2018_ll') _tab %10.2f (`ckd3_nockd_2018_ul') _tab %10.2f (`ckd3_nockd_2019') _tab %10.2f (`ckd3_nockd_2019_ll') _tab %10.2f (`ckd3_nockd_2019_ul') _tab %10.2f (`ckd3_nockd_2020') _tab %1
> 0.2f (`ckd3_nockd_2020_ll') _tab %10.2f (`ckd3_nockd_2020_ul') _tab %10.2f (`ckd3_nockd_2021') _tab %10.2f (`ckd3_nockd_2021_ll') _tab %10.2f (`ckd3_nockd_2021_ul') _tab %10.2f (`ckd3_nockd_2022') _tab %10.2
> f (`ckd3_nockd_2022_ll') _tab %10.2f (`ckd3_nockd_2022_ul') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("CKD stage 4/5") _tab %10.2f (`ckd4_nockd_2017') _tab %10.2f (`ckd4_nockd_2017_ll') _tab %10.2f (`ckd4_nockd_2017_ul') _tab %10.2f (`ckd4_nockd_2018') _t
> ab %10.2f (`ckd4_nockd_2018_ll') _tab %10.2f (`ckd4_nockd_2018_ul') _tab %10.2f (`ckd4_nockd_2019') _tab %10.2f (`ckd4_nockd_2019_ll') _tab %10.2f (`ckd4_nockd_2019_ul') _tab %10.2f (`ckd4_nockd_2020') _tab 
> %10.2f (`ckd4_nockd_2020_ll') _tab %10.2f (`ckd4_nockd_2020_ul') _tab %10.2f (`ckd4_nockd_2021') _tab %10.2f (`ckd4_nockd_2021_ll') _tab %10.2f (`ckd4_nockd_2021_ul') _tab %10.2f (`ckd4_nockd_2022') _tab %10
> .2f (`ckd4_nockd_2022_ll') _tab %10.2f (`ckd4_nockd_2022_ul') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("Dialysis") _tab %10.2f (`dialysis_nockd_2017') _tab %10.2f (`dialysis_nockd_2017_ll') _tab %10.2f (`dialysis_nockd_2017_ul') _tab %10.2f (`dialysis_nock
> d_2018') _tab %10.2f (`dialysis_nockd_2018_ll') _tab %10.2f (`dialysis_nockd_2018_ul') _tab %10.2f (`dialysis_nockd_2019') _tab %10.2f (`dialysis_nockd_2019_ll') _tab %10.2f (`dialysis_nockd_2019_ul') _tab %
> 10.2f (`dialysis_nockd_2020') _tab %10.2f (`dialysis_nockd_2020_ll') _tab %10.2f (`dialysis_nockd_2020_ul') _tab %10.2f (`dialysis_nockd_2021') _tab %10.2f (`dialysis_nockd_2021_ll') _tab %10.2f (`dialysis_n
> ockd_2021_ul') _tab %10.2f (`dialysis_nockd_2022') _tab %10.2f (`dialysis_nockd_2022_ll') _tab %10.2f (`dialysis_nockd_2022_ul') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("Transplant") _tab %10.2f (`kt_nockd_2017') _tab %10.2f (`kt_nockd_2017_ll') _tab %10.2f (`kt_nockd_2017_ul') _tab %10.2f (`kt_nockd_2018') _tab %10.2f (
> `kt_nockd_2018_ll') _tab %10.2f (`kt_nockd_2018_ul') _tab %10.2f (`kt_nockd_2019') _tab %10.2f (`kt_nockd_2019_ll') _tab %10.2f (`kt_nockd_2019_ul') _tab %10.2f (`kt_nockd_2020') _tab %10.2f (`kt_nockd_2020_
> ll') _tab %10.2f (`kt_nockd_2020_ul') _tab %10.2f (`kt_nockd_2021') _tab %10.2f (`kt_nockd_2021_ll') _tab %10.2f (`kt_nockd_2021_ul') _tab %10.2f (`kt_nockd_2022') _tab %10.2f (`kt_nockd_2022_ll') _tab %10.2
> f (`kt_nockd_2022_ul') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("Deceased") _tab %10.2f (`deceased_nockd_2017') _tab %10.2f (`deceased_nockd_2017_ll') _tab %10.2f (`deceased_nockd_2017_ul') _tab %10.2f (`deceased_nock
> d_2018') _tab %10.2f (`deceased_nockd_2018_ll') _tab %10.2f (`deceased_nockd_2018_ul') _tab %10.2f (`deceased_nockd_2019') _tab %10.2f (`deceased_nockd_2019_ll') _tab %10.2f (`deceased_nockd_2019_ul') _tab %
> 10.2f (`deceased_nockd_2020') _tab %10.2f (`deceased_nockd_2020_ll') _tab %10.2f (`deceased_nockd_2020_ul') _tab %10.2f (`deceased_nockd_2021') _tab %10.2f (`deceased_nockd_2021_ll') _tab %10.2f (`deceased_n
> ockd_2021_ul') _tab %10.2f (`deceased_nockd_2022') _tab %10.2f (`deceased_nockd_2022_ll') _tab %10.2f (`deceased_nockd_2022_ul') _n

. file write tablecontent ("All") _tab ("No CKD") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_nockd_2017') _tab %10.2f (`cardio_nockd_2017_ll') _tab %10.2f (`cardio_nockd_2017_ul') _tab %10.2f (`car
> dio_nockd_2018') _tab %10.2f (`cardio_nockd_2018_ll') _tab %10.2f (`cardio_nockd_2018_ul') _tab %10.2f (`cardio_nockd_2019') _tab %10.2f (`cardio_nockd_2019_ll') _tab %10.2f (`cardio_nockd_2019_ul') _tab %10
> .2f (`cardio_nockd_2020') _tab %10.2f (`cardio_nockd_2020_ll') _tab %10.2f (`cardio_nockd_2020_ul') _tab %10.2f (`cardio_nockd_2021') _tab %10.2f (`cardio_nockd_2021_ll') _tab %10.2f (`cardio_nockd_2021_ul')
>  _tab %10.2f (`cardio_nockd_2022') _tab %10.2f (`cardio_nockd_2022_ll') _tab %10.2f (`cardio_nockd_2022_ul') _n

. 
. *CKD stage 3
. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("N/A") _tab %10.2f (`baseline_ckd3_2017') _tab %10.2f (`baseline_ckd3_2017_ll') _tab %10.2f (`baseline_ckd3_2017_ul') _tab %10.2f (`baseline_ckd3_20
> 18') _tab %10.2f (`baseline_ckd3_2018_ll') _tab %10.2f (`baseline_ckd3_2018_ul') _tab %10.2f (`baseline_ckd3_2019') _tab %10.2f (`baseline_ckd3_2019_ll') _tab %10.2f (`baseline_ckd3_2019_ul') _tab %10.2f (`b
> aseline_ckd3_2020') _tab %10.2f (`baseline_ckd3_2020_ll') _tab %10.2f (`baseline_ckd3_2020_ul') _tab %10.2f (`baseline_ckd3_2021') _tab %10.2f (`baseline_ckd3_2021_ll') _tab %10.2f (`baseline_ckd3_2021_ul') 
> _tab %10.2f (`baseline_ckd3_2022') _tab %10.2f (`baseline_ckd3_2022_ll') _tab %10.2f (`baseline_ckd3_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("No progression") _tab %10.2f (`none_ckd3_2017') _tab %10.2f (`none_ckd3_2017_ll') _tab %10.2f (`none_ckd3_2017_ul') _tab %10.2f (`none_ckd3_2018') 
> _tab %10.2f (`none_ckd3_2018_ll') _tab %10.2f (`none_ckd3_2018_ul') _tab %10.2f (`none_ckd3_2019') _tab %10.2f (`none_ckd3_2019_ll') _tab %10.2f (`none_ckd3_2019_ul') _tab %10.2f (`none_ckd3_2020') _tab %10.
> 2f (`none_ckd3_2020_ll') _tab %10.2f (`none_ckd3_2020_ul') _tab %10.2f (`none_ckd3_2021') _tab %10.2f (`none_ckd3_2021_ll') _tab %10.2f (`none_ckd3_2021_ul') _tab %10.2f (`none_ckd3_2022') _tab %10.2f (`none
> _ckd3_2022_ll') _tab %10.2f (`none_ckd3_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab %10.2f (`ckd4_ckd3_2017') _tab %10.2f (`ckd4_ckd3_2017_ll') _tab %10.2f (`ckd4_ckd3_2017_ul') _tab %10.2f (`ckd4_ckd3_2018') _
> tab %10.2f (`ckd4_ckd3_2018_ll') _tab %10.2f (`ckd4_ckd3_2018_ul') _tab %10.2f (`ckd4_ckd3_2019') _tab %10.2f (`ckd4_ckd3_2019_ll') _tab %10.2f (`ckd4_ckd3_2019_ul') _tab %10.2f (`ckd4_ckd3_2020') _tab %10.2
> f (`ckd4_ckd3_2020_ll') _tab %10.2f (`ckd4_ckd3_2020_ul') _tab %10.2f (`ckd4_ckd3_2021') _tab %10.2f (`ckd4_ckd3_2021_ll') _tab %10.2f (`ckd4_ckd3_2021_ul') _tab %10.2f (`ckd4_ckd3_2022') _tab %10.2f (`ckd4_
> ckd3_2022_ll') _tab %10.2f (`ckd4_ckd3_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Dialysis") _tab %10.2f (`dialysis_ckd3_2017') _tab %10.2f (`dialysis_ckd3_2017_ll') _tab %10.2f (`dialysis_ckd3_2017_ul') _tab %10.2f (`dialysis_ck
> d3_2018') _tab %10.2f (`dialysis_ckd3_2018_ll') _tab %10.2f (`dialysis_ckd3_2018_ul') _tab %10.2f (`dialysis_ckd3_2019') _tab %10.2f (`dialysis_ckd3_2019_ll') _tab %10.2f (`dialysis_ckd3_2019_ul') _tab %10.2
> f (`dialysis_ckd3_2020') _tab %10.2f (`dialysis_ckd3_2020_ll') _tab %10.2f (`dialysis_ckd3_2020_ul') _tab %10.2f (`dialysis_ckd3_2021') _tab %10.2f (`dialysis_ckd3_2021_ll') _tab %10.2f (`dialysis_ckd3_2021_
> ul') _tab %10.2f (`dialysis_ckd3_2022') _tab %10.2f (`dialysis_ckd3_2022_ll') _tab %10.2f (`dialysis_ckd3_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Transplant") _tab %10.2f (`kt_ckd3_2017') _tab %10.2f (`kt_ckd3_2017_ll') _tab %10.2f (`kt_ckd3_2017_ul') _tab %10.2f (`kt_ckd3_2018') _tab %10.2f 
> (`kt_ckd3_2018_ll') _tab %10.2f (`kt_ckd3_2018_ul') _tab %10.2f (`kt_ckd3_2019') _tab %10.2f (`kt_ckd3_2019_ll') _tab %10.2f (`kt_ckd3_2019_ul') _tab %10.2f (`kt_ckd3_2020') _tab %10.2f (`kt_ckd3_2020_ll') _
> tab %10.2f (`kt_ckd3_2020_ul') _tab %10.2f (`kt_ckd3_2021') _tab %10.2f (`kt_ckd3_2021_ll') _tab %10.2f (`kt_ckd3_2021_ul') _tab %10.2f (`kt_ckd3_2022') _tab %10.2f (`kt_ckd3_2022_ll') _tab %10.2f (`kt_ckd3_
> 2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Deceased") _tab %10.2f (`deceased_ckd3_2017') _tab %10.2f (`deceased_ckd3_2017_ll') _tab %10.2f (`deceased_ckd3_2017_ul') _tab %10.2f (`deceased_ck
> d3_2018') _tab %10.2f (`deceased_ckd3_2018_ll') _tab %10.2f (`deceased_ckd3_2018_ul') _tab %10.2f (`deceased_ckd3_2019') _tab %10.2f (`deceased_ckd3_2019_ll') _tab %10.2f (`deceased_ckd3_2019_ul') _tab %10.2
> f (`deceased_ckd3_2020') _tab %10.2f (`deceased_ckd3_2020_ll') _tab %10.2f (`deceased_ckd3_2020_ul') _tab %10.2f (`deceased_ckd3_2021') _tab %10.2f (`deceased_ckd3_2021_ll') _tab %10.2f (`deceased_ckd3_2021_
> ul') _tab %10.2f (`deceased_ckd3_2022') _tab %10.2f (`deceased_ckd3_2022_ll') _tab %10.2f (`deceased_ckd3_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 3") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_ckd3_2017') _tab %10.2f (`cardio_ckd3_2017_ll') _tab %10.2f (`cardio_ckd3_2017_ul') _tab %10.2f (`c
> ardio_ckd3_2018') _tab %10.2f (`cardio_ckd3_2018_ll') _tab %10.2f (`cardio_ckd3_2018_ul') _tab %10.2f (`cardio_ckd3_2019') _tab %10.2f (`cardio_ckd3_2019_ll') _tab %10.2f (`cardio_ckd3_2019_ul') _tab %10.2f 
> (`cardio_ckd3_2020') _tab %10.2f (`cardio_ckd3_2020_ll') _tab %10.2f (`cardio_ckd3_2020_ul') _tab %10.2f (`cardio_ckd3_2021') _tab %10.2f (`cardio_ckd3_2021_ll') _tab %10.2f (`cardio_ckd3_2021_ul') _tab %10.
> 2f (`cardio_ckd3_2022') _tab %10.2f (`cardio_ckd3_2022_ll') _tab %10.2f (`cardio_ckd3_2022_ul') _n

. 
. *CKD stage 4/5 without RRT
. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("N/A") _tab %10.2f (`baseline_ckd4_2017') _tab %10.2f (`baseline_ckd4_2017_ll') _tab %10.2f (`baseline_ckd4_2017_ul') _tab %10.2f (`baseline_ckd4_
> 2018') _tab %10.2f (`baseline_ckd4_2018_ll') _tab %10.2f (`baseline_ckd4_2018_ul') _tab %10.2f (`baseline_ckd4_2019') _tab %10.2f (`baseline_ckd4_2019_ll') _tab %10.2f (`baseline_ckd4_2019_ul') _tab %10.2f (
> `baseline_ckd4_2020') _tab %10.2f (`baseline_ckd4_2020_ll') _tab %10.2f (`baseline_ckd4_2020_ul') _tab %10.2f (`baseline_ckd4_2021') _tab %10.2f (`baseline_ckd4_2021_ll') _tab %10.2f (`baseline_ckd4_2021_ul'
> ) _tab %10.2f (`baseline_ckd4_2022') _tab %10.2f (`baseline_ckd4_2022_ll') _tab %10.2f (`baseline_ckd4_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("No progression") _tab %10.2f (`none_ckd4_2017') _tab %10.2f (`none_ckd4_2017_ll') _tab %10.2f (`none_ckd4_2017_ul') _tab %10.2f (`none_ckd4_2018'
> ) _tab %10.2f (`none_ckd4_2018_ll') _tab %10.2f (`none_ckd4_2018_ul') _tab %10.2f (`none_ckd4_2019') _tab %10.2f (`none_ckd4_2019_ll') _tab %10.2f (`none_ckd4_2019_ul') _tab %10.2f (`none_ckd4_2020') _tab %1
> 0.2f (`none_ckd4_2020_ll') _tab %10.2f (`none_ckd4_2020_ul') _tab %10.2f (`none_ckd4_2021') _tab %10.2f (`none_ckd4_2021_ll') _tab %10.2f (`none_ckd4_2021_ul') _tab %10.2f (`none_ckd4_2022') _tab %10.2f (`no
> ne_ckd4_2022_ll') _tab %10.2f (`none_ckd4_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab %10.2f (`dialysis_ckd4_2017') _tab %10.2f (`dialysis_ckd4_2017_ll') _tab %10.2f (`dialysis_ckd4_2017_ul') _tab %10.2f (`dialysis_
> ckd4_2018') _tab %10.2f (`dialysis_ckd4_2018_ll') _tab %10.2f (`dialysis_ckd4_2018_ul') _tab %10.2f (`dialysis_ckd4_2019') _tab %10.2f (`dialysis_ckd4_2019_ll') _tab %10.2f (`dialysis_ckd4_2019_ul') _tab %10
> .2f (`dialysis_ckd4_2020') _tab %10.2f (`dialysis_ckd4_2020_ll') _tab %10.2f (`dialysis_ckd4_2020_ul') _tab %10.2f (`dialysis_ckd4_2021') _tab %10.2f (`dialysis_ckd4_2021_ll') _tab %10.2f (`dialysis_ckd4_202
> 1_ul') _tab %10.2f (`dialysis_ckd4_2022') _tab %10.2f (`dialysis_ckd4_2022_ll') _tab %10.2f (`dialysis_ckd4_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Transplant") _tab %10.2f (`kt_ckd4_2017') _tab %10.2f (`kt_ckd4_2017_ll') _tab %10.2f (`kt_ckd4_2017_ul') _tab %10.2f (`kt_ckd4_2018') _tab %10.2
> f (`kt_ckd4_2018_ll') _tab %10.2f (`kt_ckd4_2018_ul') _tab %10.2f (`kt_ckd4_2019') _tab %10.2f (`kt_ckd4_2019_ll') _tab %10.2f (`kt_ckd4_2019_ul') _tab %10.2f (`kt_ckd4_2020') _tab %10.2f (`kt_ckd4_2020_ll')
>  _tab %10.2f (`kt_ckd4_2020_ul') _tab %10.2f (`kt_ckd4_2021') _tab %10.2f (`kt_ckd4_2021_ll') _tab %10.2f (`kt_ckd4_2021_ul') _tab %10.2f (`kt_ckd4_2022') _tab %10.2f (`kt_ckd4_2022_ll') _tab %10.2f (`kt_ckd
> 4_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Deceased") _tab %10.2f (`deceased_ckd4_2017') _tab %10.2f (`deceased_ckd4_2017_ll') _tab %10.2f (`deceased_ckd4_2017_ul') _tab %10.2f (`deceased_
> ckd4_2018') _tab %10.2f (`deceased_ckd4_2018_ll') _tab %10.2f (`deceased_ckd4_2018_ul') _tab %10.2f (`deceased_ckd4_2019') _tab %10.2f (`deceased_ckd4_2019_ll') _tab %10.2f (`deceased_ckd4_2019_ul') _tab %10
> .2f (`deceased_ckd4_2020') _tab %10.2f (`deceased_ckd4_2020_ll') _tab %10.2f (`deceased_ckd4_2020_ul') _tab %10.2f (`deceased_ckd4_2021') _tab %10.2f (`deceased_ckd4_2021_ll') _tab %10.2f (`deceased_ckd4_202
> 1_ul') _tab %10.2f (`deceased_ckd4_2022') _tab %10.2f (`deceased_ckd4_2022_ll') _tab %10.2f (`deceased_ckd4_2022_ul') _n

. file write tablecontent ("All") _tab ("CKD stage 4/5") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_ckd4_2017') _tab %10.2f (`cardio_ckd4_2017_ll') _tab %10.2f (`cardio_ckd4_2017_ul') _tab %10.2f (
> `cardio_ckd4_2018') _tab %10.2f (`cardio_ckd4_2018_ll') _tab %10.2f (`cardio_ckd4_2018_ul') _tab %10.2f (`cardio_ckd4_2019') _tab %10.2f (`cardio_ckd4_2019_ll') _tab %10.2f (`cardio_ckd4_2019_ul') _tab %10.2
> f (`cardio_ckd4_2020') _tab %10.2f (`cardio_ckd4_2020_ll') _tab %10.2f (`cardio_ckd4_2020_ul') _tab %10.2f (`cardio_ckd4_2021') _tab %10.2f (`cardio_ckd4_2021_ll') _tab %10.2f (`cardio_ckd4_2021_ul') _tab %1
> 0.2f (`cardio_ckd4_2022') _tab %10.2f (`cardio_ckd4_2022_ll') _tab %10.2f (`cardio_ckd4_2022_ul') _n

. 
. *Dialysis
. file write tablecontent ("All") _tab ("Dialysis") _tab ("N/A") _tab %10.2f (`baseline_dialysis_2017') _tab %10.2f (`baseline_dialysis_2017_ll') _tab %10.2f (`baseline_dialysis_2017_ul') _tab %10.2f (`baselin
> e_dialysis_2018') _tab %10.2f (`baseline_dialysis_2018_ll') _tab %10.2f (`baseline_dialysis_2018_ul') _tab %10.2f (`baseline_dialysis_2019') _tab %10.2f (`baseline_dialysis_2019_ll') _tab %10.2f (`baseline_d
> ialysis_2019_ul') _tab %10.2f (`baseline_dialysis_2020') _tab %10.2f (`baseline_dialysis_2020_ll') _tab %10.2f (`baseline_dialysis_2020_ul') _tab %10.2f (`baseline_dialysis_2021') _tab %10.2f (`baseline_dial
> ysis_2021_ll') _tab %10.2f (`baseline_dialysis_2021_ul') _tab %10.2f (`baseline_dialysis_2022') _tab %10.2f (`baseline_dialysis_2022_ll') _tab %10.2f (`baseline_dialysis_2022_ul') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("No progression") _tab %10.2f (`none_dialysis_2017') _tab %10.2f (`none_dialysis_2017_ll') _tab %10.2f (`none_dialysis_2017_ul') _tab %10.2f (`none_dia
> lysis_2018') _tab %10.2f (`none_dialysis_2018_ll') _tab %10.2f (`none_dialysis_2018_ul') _tab %10.2f (`none_dialysis_2019') _tab %10.2f (`none_dialysis_2019_ll') _tab %10.2f (`none_dialysis_2019_ul') _tab %1
> 0.2f (`none_dialysis_2020') _tab %10.2f (`none_dialysis_2020_ll') _tab %10.2f (`none_dialysis_2020_ul') _tab %10.2f (`none_dialysis_2021') _tab %10.2f (`none_dialysis_2021_ll') _tab %10.2f (`none_dialysis_20
> 21_ul') _tab %10.2f (`none_dialysis_2022') _tab %10.2f (`none_dialysis_2022_ll') _tab %10.2f (`none_dialysis_2022_ul') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Transplant") _tab %10.2f (`kt_dialysis_2017') _tab %10.2f (`kt_dialysis_2017_ll') _tab %10.2f (`kt_dialysis_2017_ul') _tab %10.2f (`kt_dialysis_2018')
>  _tab %10.2f (`kt_dialysis_2018_ll') _tab %10.2f (`kt_dialysis_2018_ul') _tab %10.2f (`kt_dialysis_2019') _tab %10.2f (`kt_dialysis_2019_ll') _tab %10.2f (`kt_dialysis_2019_ul') _tab %10.2f (`kt_dialysis_202
> 0') _tab %10.2f (`kt_dialysis_2020_ll') _tab %10.2f (`kt_dialysis_2020_ul') _tab %10.2f (`kt_dialysis_2021') _tab %10.2f (`kt_dialysis_2021_ll') _tab %10.2f (`kt_dialysis_2021_ul') _tab %10.2f (`kt_dialysis_
> 2022') _tab %10.2f (`kt_dialysis_2022_ll') _tab %10.2f (`kt_dialysis_2022_ul') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Deceased") _tab %10.2f (`deceased_dialysis_2017') _tab %10.2f (`deceased_dialysis_2017_ll') _tab %10.2f (`deceased_dialysis_2017_ul') _tab %10.2f (`de
> ceased_dialysis_2018') _tab %10.2f (`deceased_dialysis_2018_ll') _tab %10.2f (`deceased_dialysis_2018_ul') _tab %10.2f (`deceased_dialysis_2019') _tab %10.2f (`deceased_dialysis_2019_ll') _tab %10.2f (`decea
> sed_dialysis_2019_ul') _tab %10.2f (`deceased_dialysis_2020') _tab %10.2f (`deceased_dialysis_2020_ll') _tab %10.2f (`deceased_dialysis_2020_ul') _tab %10.2f (`deceased_dialysis_2021') _tab %10.2f (`deceased
> _dialysis_2021_ll') _tab %10.2f (`deceased_dialysis_2021_ul') _tab %10.2f (`deceased_dialysis_2022') _tab %10.2f (`deceased_dialysis_2022_ll') _tab %10.2f (`deceased_dialysis_2022_ul') _n

. file write tablecontent ("All") _tab ("Dialysis") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_dialysis_2017') _tab %10.2f (`cardio_dialysis_2017_ll') _tab %10.2f (`cardio_dialysis_2017_ul') _tab %
> 10.2f (`cardio_dialysis_2018') _tab %10.2f (`cardio_dialysis_2018_ll') _tab %10.2f (`cardio_dialysis_2018_ul') _tab %10.2f (`cardio_dialysis_2019') _tab %10.2f (`cardio_dialysis_2019_ll') _tab %10.2f (`cardi
> o_dialysis_2019_ul') _tab %10.2f (`cardio_dialysis_2020') _tab %10.2f (`cardio_dialysis_2020_ll') _tab %10.2f (`cardio_dialysis_2020_ul') _tab %10.2f (`cardio_dialysis_2021') _tab %10.2f (`cardio_dialysis_20
> 21_ll') _tab %10.2f (`cardio_dialysis_2021_ul') _tab %10.2f (`cardio_dialysis_2022') _tab %10.2f (`cardio_dialysis_2022_ll') _tab %10.2f (`cardio_dialysis_2022_ul') _n

. 
. *Kidney transplant
. file write tablecontent ("All") _tab ("Transplant") _tab ("N/A") _tab %10.2f (`baseline_kt_2017') _tab %10.2f (`baseline_kt_2017_ll') _tab %10.2f (`baseline_kt_2017_ul') _tab %10.2f (`baseline_kt_2018') _tab
>  %10.2f (`baseline_kt_2018_ll') _tab %10.2f (`baseline_kt_2018_ul') _tab %10.2f (`baseline_kt_2019') _tab %10.2f (`baseline_kt_2019_ll') _tab %10.2f (`baseline_kt_2019_ul') _tab %10.2f (`baseline_kt_2020') _
> tab %10.2f (`baseline_kt_2020_ll') _tab %10.2f (`baseline_kt_2020_ul') _tab %10.2f (`baseline_kt_2021') _tab %10.2f (`baseline_kt_2021_ll') _tab %10.2f (`baseline_kt_2021_ul') _tab %10.2f (`baseline_kt_2022'
> ) _tab %10.2f (`baseline_kt_2022_ll') _tab %10.2f (`baseline_kt_2022_ul') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("No progression") _tab %10.2f (`none_kt_2017') _tab %10.2f (`none_kt_2017_ll') _tab %10.2f (`none_kt_2017_ul') _tab %10.2f (`none_kt_2018') _tab %10.
> 2f (`none_kt_2018_ll') _tab %10.2f (`none_kt_2018_ul') _tab %10.2f (`none_kt_2019') _tab %10.2f (`none_kt_2019_ll') _tab %10.2f (`none_kt_2019_ul') _tab %10.2f (`none_kt_2020') _tab %10.2f (`none_kt_2020_ll'
> ) _tab %10.2f (`none_kt_2020_ul') _tab %10.2f (`none_kt_2021') _tab %10.2f (`none_kt_2021_ll') _tab %10.2f (`none_kt_2021_ul') _tab %10.2f (`none_kt_2022') _tab %10.2f (`none_kt_2022_ll') _tab %10.2f (`none_
> kt_2022_ul') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Dialysis") _tab %10.2f (`dialysis_kt_2017') _tab %10.2f (`dialysis_kt_2017_ll') _tab %10.2f (`dialysis_kt_2017_ul') _tab %10.2f (`dialysis_kt_2018')
>  _tab %10.2f (`dialysis_kt_2018_ll') _tab %10.2f (`dialysis_kt_2018_ul') _tab %10.2f (`dialysis_kt_2019') _tab %10.2f (`dialysis_kt_2019_ll') _tab %10.2f (`dialysis_kt_2019_ul') _tab %10.2f (`dialysis_kt_202
> 0') _tab %10.2f (`dialysis_kt_2020_ll') _tab %10.2f (`dialysis_kt_2020_ul') _tab %10.2f (`dialysis_kt_2021') _tab %10.2f (`dialysis_kt_2021_ll') _tab %10.2f (`dialysis_kt_2021_ul') _tab %10.2f (`dialysis_kt_
> 2022') _tab %10.2f (`dialysis_kt_2022_ll') _tab %10.2f (`dialysis_kt_2022_ul') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Deceased") _tab %10.2f (`deceased_kt_2017') _tab %10.2f (`deceased_kt_2017_ll') _tab %10.2f (`deceased_kt_2017_ul') _tab %10.2f (`deceased_kt_2018')
>  _tab %10.2f (`deceased_kt_2018_ll') _tab %10.2f (`deceased_kt_2018_ul') _tab %10.2f (`deceased_kt_2019') _tab %10.2f (`deceased_kt_2019_ll') _tab %10.2f (`deceased_kt_2019_ul') _tab %10.2f (`deceased_kt_202
> 0') _tab %10.2f (`deceased_kt_2020_ll') _tab %10.2f (`deceased_kt_2020_ul') _tab %10.2f (`deceased_kt_2021') _tab %10.2f (`deceased_kt_2021_ll') _tab %10.2f (`deceased_kt_2021_ul') _tab %10.2f (`deceased_kt_
> 2022') _tab %10.2f (`deceased_kt_2022_ll') _tab %10.2f (`deceased_kt_2022_ul') _n

. file write tablecontent ("All") _tab ("Transplant") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_kt_2017') _tab %10.2f (`cardio_kt_2017_ll') _tab %10.2f (`cardio_kt_2017_ul') _tab %10.2f (`cardio_k
> t_2018') _tab %10.2f (`cardio_kt_2018_ll') _tab %10.2f (`cardio_kt_2018_ul') _tab %10.2f (`cardio_kt_2019') _tab %10.2f (`cardio_kt_2019_ll') _tab %10.2f (`cardio_kt_2019_ul') _tab %10.2f (`cardio_kt_2020') 
> _tab %10.2f (`cardio_kt_2020_ll') _tab %10.2f (`cardio_kt_2020_ul') _tab %10.2f (`cardio_kt_2021') _tab %10.2f (`cardio_kt_2021_ll') _tab %10.2f (`cardio_kt_2021_ul') _tab %10.2f (`cardio_kt_2022') _tab %10.
> 2f (`cardio_kt_2022_ll') _tab %10.2f (`cardio_kt_2022_ul') _n

. 
. forvalues i=1/2 {
  2. local label`i': label ethnicity `i'
  3. foreach x of local year {
  4. use ./output/`x'_ckd_complete.dta, clear
  5. drop _merge
  6. merge 1:1 patient_id using ./output/`x'_nockd_complete
  7. drop if ethnicity!=`i'
  8. 
. replace ckd_group = 0 if ckd_group==1
  9. 
. **Overall
. total weight
 10. local baseline_ckd_`x' = r(table)[1,1]
 11. local multiplier = 100000/`baseline_ckd_`x''
 12. total weight
 13. local baseline_ckd_`x' = r(table)[1,1] * `multiplier'
 14. local baseline_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 15. local baseline_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 16. 
. total weight if ckd_progression==0
 17. local none_ckd_`x' = r(table)[1,1] * `multiplier'
 18. local none_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 19. local none_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 20. 
. total weight if ckd_progression==1
 21. local ckd3_ckd_`x' = r(table)[1,1] * `multiplier'
 22. local ckd3_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 23. local ckd3_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 24. 
. total weight if ckd_progression==2
 25. local ckd4_ckd_`x' = r(table)[1,1] * `multiplier'
 26. local ckd4_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 27. local ckd4_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 28. 
. total weight if ckd_progression==3
 29. local dialysis_ckd_`x' = r(table)[1,1] * `multiplier'
 30. local dialysis_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 31. local dialysis_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 32. 
. total weight if ckd_progression==4
 33. local kt_ckd_`x' = r(table)[1,1] * `multiplier'
 34. local kt_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 35. local kt_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 36. 
. total weight if ckd_progression==6
 37. local deceased_ckd_`x' = r(table)[1,1] * `multiplier'
 38. local deceased_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 39. local deceased_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 40. 
. total weight if cardiovascular==1
 41. local cardio_ckd_`x' = r(table)[1,1] * `multiplier'
 42. local cardio_ckd_`x'_ll = r(table)[5,1] * `multiplier'
 43. local cardio_ckd_`x'_ul = r(table)[6,1] * `multiplier'
 44. 
. **No CKD
. total weight if ckd_group==0
 45. local baseline_nockd_`x' = r(table)[1,1]
 46. local multiplier = 100000/`baseline_nockd_`x''
 47. total weight if ckd_group==0
 48. local baseline_nockd_`x' = r(table)[1,1] * `multiplier'
 49. local baseline_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 50. local baseline_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 51. 
. total weight if ckd_group==0 & ckd_progression==0
 52. local none_nockd_`x' = r(table)[1,1] * `multiplier'
 53. local none_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 54. local none_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 55. 
. total weight if ckd_group==0 & ckd_progression==1
 56. local ckd3_nockd_`x' = r(table)[1,1] * `multiplier'
 57. local ckd3_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 58. local ckd3_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 59. 
. total weight if ckd_group==0 & ckd_progression==2
 60. local ckd4_nockd_`x' = r(table)[1,1] * `multiplier'
 61. local ckd4_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 62. local ckd4_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 63. 
. total weight if ckd_group==0 & ckd_progression==3
 64. local dialysis_nockd_`x' = r(table)[1,1] * `multiplier'
 65. local dialysis_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 66. local dialysis_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 67. 
. total weight if ckd_group==0 & ckd_progression==6
 68. local deceased_nockd_`x' = r(table)[1,1] * `multiplier'
 69. local deceased_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 70. local deceased_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 71. 
. total weight if cardiovascular==1 & ckd_group==0
 72. local cardio_nockd_`x' = r(table)[1,1] * `multiplier'
 73. local cardio_nockd_`x'_ll = r(table)[5,1] * `multiplier'
 74. local cardio_nockd_`x'_ul = r(table)[6,1] * `multiplier'
 75. 
. **CKD stage 3
. total weight if ckd_group==2
 76. local baseline_ckd3_`x' = r(table)[1,1]
 77. local multiplier = 100000/`baseline_ckd3_`x''
 78. total weight if ckd_group==2
 79. local baseline_ckd3_`x' = r(table)[1,1] * `multiplier'
 80. local baseline_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 81. local baseline_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 82. 
. total weight if ckd_group==2 & ckd_progression==0
 83. local none_ckd3_`x' = r(table)[1,1] * `multiplier'
 84. local none_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 85. local none_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 86. 
. total weight if ckd_group==2 & ckd_progression==2
 87. local ckd4_ckd3_`x' = r(table)[1,1] * `multiplier'
 88. local ckd4_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 89. local ckd4_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 90. 
. total weight if ckd_group==2 & ckd_progression==3
 91. local dialysis_ckd3_`x' = r(table)[1,1] * `multiplier'
 92. local dialysis_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 93. local dialysis_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 94. 
. total weight if ckd_group==2 & ckd_progression==6
 95. local deceased_ckd3_`x' = r(table)[1,1] * `multiplier'
 96. local deceased_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
 97. local deceased_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
 98. 
. total weight if cardiovascular==1 & ckd_group==2
 99. local cardio_ckd3_`x' = r(table)[1,1] * `multiplier'
100. local cardio_ckd3_`x'_ll = r(table)[5,1] * `multiplier'
101. local cardio_ckd3_`x'_ul = r(table)[6,1] * `multiplier'
102. 
. **CKD stage 4/5
. total weight if ckd_group==3
103. local baseline_ckd4_`x' = r(table)[1,1]
104. local multiplier = 100000/`baseline_ckd4_`x''
105. total weight if ckd_group==3
106. local baseline_ckd4_`x' = r(table)[1,1] * `multiplier'
107. local baseline_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
108. local baseline_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
109. 
. total weight if ckd_group==3 & ckd_progression==0
110. local none_ckd4_`x' = r(table)[1,1] * `multiplier'
111. local none_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
112. local none_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
113. 
. total weight if ckd_group==3 & ckd_progression==3
114. local dialysis_ckd4_`x' = r(table)[1,1] * `multiplier'
115. local dialysis_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
116. local dialysis_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
117. 
. total weight if ckd_group==3 & ckd_progression==4
118. local kt_ckd4_`x' = r(table)[1,1] * `multiplier'
119. local kt_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
120. local kt_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
121. 
. total weight if ckd_group==3 & ckd_progression==6
122. local deceased_ckd4_`x' = r(table)[1,1] * `multiplier'
123. local deceased_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
124. local deceased_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
125. 
. total weight if cardiovascular==1 & ckd_group==3
126. local cardio_ckd4_`x' = r(table)[1,1] * `multiplier'
127. local cardio_ckd4_`x'_ll = r(table)[5,1] * `multiplier'
128. local cardio_ckd4_`x'_ul = r(table)[6,1] * `multiplier'
129. 
. **Dialysis
. total weight if ckd_group==4
130. local baseline_dialysis_`x' = r(table)[1,1]
131. local multiplier = 100000/`baseline_dialysis_`x''
132. total weight if ckd_group==4
133. local baseline_dialysis_`x' = r(table)[1,1] * `multiplier'
134. local baseline_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
135. local baseline_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
136. 
. total weight if ckd_group==4 & ckd_progression==0
137. local none_dialysis_`x' = r(table)[1,1] * `multiplier'
138. local none_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
139. local none_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
140. 
. total weight if ckd_group==4 & ckd_progression==4
141. local kt_dialysis_`x' = r(table)[1,1] * `multiplier'
142. local kt_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
143. local kt_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
144. 
. total weight if ckd_group==4 & ckd_progression==6
145. local deceased_dialysis_`x' = r(table)[1,1] * `multiplier'
146. local deceased_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
147. local deceased_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
148. 
. total weight if cardiovascular==1 & ckd_group==4
149. local cardio_dialysis_`x' = r(table)[1,1] * `multiplier'
150. local cardio_dialysis_`x'_ll = r(table)[5,1] * `multiplier'
151. local cardio_dialysis_`x'_ul = r(table)[6,1] * `multiplier'
152. 
. **Kidney transplant
. total weight if ckd_group==5
153. local baseline_kt_`x' = r(table)[1,1]
154. local multiplier = 100000/`baseline_kt_`x''
155. total weight if ckd_group==5
156. local baseline_kt_`x' = r(table)[1,1] * `multiplier'
157. local baseline_kt_`x'_ll = r(table)[5,1] * `multiplier'
158. local baseline_kt_`x'_ul = r(table)[6,1] * `multiplier'
159. 
. total weight if ckd_group==5 & ckd_progression==0
160. local none_kt_`x' = r(table)[1,1] * `multiplier'
161. local none_kt_`x'_ll = r(table)[5,1] * `multiplier'
162. local none_kt_`x'_ul = r(table)[6,1] * `multiplier'
163. 
. total weight if ckd_group==5 & ckd_progression==3
164. local dialysis_kt_`x' = r(table)[1,1] * `multiplier'
165. local dialysis_kt_`x'_ll = r(table)[5,1] * `multiplier'
166. local dialysis_kt_`x'_ul = r(table)[6,1] * `multiplier'
167. 
. total weight if ckd_group==5 & ckd_progression==6
168. local deceased_kt_`x' = r(table)[1,1] * `multiplier'
169. local deceased_kt_`x'_ll = r(table)[5,1] * `multiplier'
170. local deceased_kt_`x'_ul = r(table)[6,1] * `multiplier'
171. 
. total weight if cardiovascular==1 & ckd_group==5
172. local cardio_kt_`x' = r(table)[1,1] * `multiplier'
173. local cardio_kt_`x'_ll = r(table)[5,1] * `multiplier'
174. local cardio_kt_`x'_ul = r(table)[6,1] * `multiplier'
175. }
176. 
. *Overall
. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("N/A") _tab %10.2f (`baseline_ckd_2017') _tab %10.2f (`baseline_ckd_2017_ll') _tab %10.2f (`baseline_ckd_2017_ul') _tab %10.2f (`baseline_ckd_201
> 8') _tab %10.2f (`baseline_ckd_2018_ll') _tab %10.2f (`baseline_ckd_2018_ul') _tab %10.2f (`baseline_ckd_2019') _tab %10.2f (`baseline_ckd_2019_ll') _tab %10.2f (`baseline_ckd_2019_ul') _tab %10.2f (`baselin
> e_ckd_2020') _tab %10.2f (`baseline_ckd_2020_ll') _tab %10.2f (`baseline_ckd_2020_ul') _tab %10.2f (`baseline_ckd_2021') _tab %10.2f (`baseline_ckd_2021_ll') _tab %10.2f (`baseline_ckd_2021_ul') _tab %10.2f 
> (`baseline_ckd_2022') _tab %10.2f (`baseline_ckd_2022_ll') _tab %10.2f (`baseline_ckd_2022_ul') _n
177. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("No progression") _tab %10.2f (`none_ckd_2017') _tab %10.2f (`none_ckd_2017_ll') _tab %10.2f (`none_ckd_2017_ul') _tab %10.2f (`none_ckd_2018'
> ) _tab %10.2f (`none_ckd_2018_ll') _tab %10.2f (`none_ckd_2018_ul') _tab %10.2f (`none_ckd_2019') _tab %10.2f (`none_ckd_2019_ll') _tab %10.2f (`none_ckd_2019_ul') _tab %10.2f (`none_ckd_2020') _tab %10.2f (
> `none_ckd_2020_ll') _tab %10.2f (`none_ckd_2020_ul') _tab %10.2f (`none_ckd_2021') _tab %10.2f (`none_ckd_2021_ll') _tab %10.2f (`none_ckd_2021_ul') _tab %10.2f (`none_ckd_2022') _tab %10.2f (`none_ckd_2022_
> ll') _tab %10.2f (`none_ckd_2022_ul') _n
178. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 3") _tab %10.2f (`ckd3_ckd_2017') _tab %10.2f (`ckd3_ckd_2017_ll') _tab %10.2f (`ckd3_ckd_2017_ul') _tab %10.2f (`ckd3_ckd_2018') _
> tab %10.2f (`ckd3_ckd_2018_ll') _tab %10.2f (`ckd3_ckd_2018_ul') _tab %10.2f (`ckd3_ckd_2019') _tab %10.2f (`ckd3_ckd_2019_ll') _tab %10.2f (`ckd3_ckd_2019_ul') _tab %10.2f (`ckd3_ckd_2020') _tab %10.2f (`ck
> d3_ckd_2020_ll') _tab %10.2f (`ckd3_ckd_2020_ul') _tab %10.2f (`ckd3_ckd_2021') _tab %10.2f (`ckd3_ckd_2021_ll') _tab %10.2f (`ckd3_ckd_2021_ul') _tab %10.2f (`ckd3_ckd_2022') _tab %10.2f (`ckd3_ckd_2022_ll'
> ) _tab %10.2f (`ckd3_ckd_2022_ul') _n
179. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("CKD stage 4/5") _tab %10.2f (`ckd4_ckd_2017') _tab %10.2f (`ckd4_ckd_2017_ll') _tab %10.2f (`ckd4_ckd_2017_ul') _tab %10.2f (`ckd4_ckd_2018')
>  _tab %10.2f (`ckd4_ckd_2018_ll') _tab %10.2f (`ckd4_ckd_2018_ul') _tab %10.2f (`ckd4_ckd_2019') _tab %10.2f (`ckd4_ckd_2019_ll') _tab %10.2f (`ckd4_ckd_2019_ul') _tab %10.2f (`ckd4_ckd_2020') _tab %10.2f (`
> ckd4_ckd_2020_ll') _tab %10.2f (`ckd4_ckd_2020_ul') _tab %10.2f (`ckd4_ckd_2021') _tab %10.2f (`ckd4_ckd_2021_ll') _tab %10.2f (`ckd4_ckd_2021_ul') _tab %10.2f (`ckd4_ckd_2022') _tab %10.2f (`ckd4_ckd_2022_l
> l') _tab %10.2f (`ckd4_ckd_2022_ul') _n
180. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Dialysis") _tab %10.2f (`dialysis_ckd_2017') _tab %10.2f (`dialysis_ckd_2017_ll') _tab %10.2f (`dialysis_ckd_2017_ul') _tab %10.2f (`dialysis
> _ckd_2018') _tab %10.2f (`dialysis_ckd_2018_ll') _tab %10.2f (`dialysis_ckd_2018_ul') _tab %10.2f (`dialysis_ckd_2019') _tab %10.2f (`dialysis_ckd_2019_ll') _tab %10.2f (`dialysis_ckd_2019_ul') _tab %10.2f (
> `dialysis_ckd_2020') _tab %10.2f (`dialysis_ckd_2020_ll') _tab %10.2f (`dialysis_ckd_2020_ul') _tab %10.2f (`dialysis_ckd_2021') _tab %10.2f (`dialysis_ckd_2021_ll') _tab %10.2f (`dialysis_ckd_2021_ul') _tab
>  %10.2f (`dialysis_ckd_2022') _tab %10.2f (`dialysis_ckd_2022_ll') _tab %10.2f (`dialysis_ckd_2022_ul') _n
181. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Transplant") _tab %10.2f (`kt_ckd_2017') _tab %10.2f (`kt_ckd_2017_ll') _tab %10.2f (`kt_ckd_2017_ul') _tab %10.2f (`kt_ckd_2018') _tab %10.2
> f (`kt_ckd_2018_ll') _tab %10.2f (`kt_ckd_2018_ul') _tab %10.2f (`kt_ckd_2019') _tab %10.2f (`kt_ckd_2019_ll') _tab %10.2f (`kt_ckd_2019_ul') _tab %10.2f (`kt_ckd_2020') _tab %10.2f (`kt_ckd_2020_ll') _tab %
> 10.2f (`kt_ckd_2020_ul') _tab %10.2f (`kt_ckd_2021') _tab %10.2f (`kt_ckd_2021_ll') _tab %10.2f (`kt_ckd_2021_ul') _tab %10.2f (`kt_ckd_2022') _tab %10.2f (`kt_ckd_2022_ll') _tab %10.2f (`kt_ckd_2022_ul') _n
182. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Deceased") _tab %10.2f (`deceased_ckd_2017') _tab %10.2f (`deceased_ckd_2017_ll') _tab %10.2f (`deceased_ckd_2017_ul') _tab %10.2f (`deceased
> _ckd_2018') _tab %10.2f (`deceased_ckd_2018_ll') _tab %10.2f (`deceased_ckd_2018_ul') _tab %10.2f (`deceased_ckd_2019') _tab %10.2f (`deceased_ckd_2019_ll') _tab %10.2f (`deceased_ckd_2019_ul') _tab %10.2f (
> `deceased_ckd_2020') _tab %10.2f (`deceased_ckd_2020_ll') _tab %10.2f (`deceased_ckd_2020_ul') _tab %10.2f (`deceased_ckd_2021') _tab %10.2f (`deceased_ckd_2021_ll') _tab %10.2f (`deceased_ckd_2021_ul') _tab
>  %10.2f (`deceased_ckd_2022') _tab %10.2f (`deceased_ckd_2022_ll') _tab %10.2f (`deceased_ckd_2022_ul') _n
183. file write tablecontent ("`label`i''") _tab ("Overall") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_ckd_2017') _tab %10.2f (`cardio_ckd_2017_ll') _tab %10.2f (`cardio_ckd_2017_ul') _tab %10.2f 
> (`cardio_ckd_2018') _tab %10.2f (`cardio_ckd_2018_ll') _tab %10.2f (`cardio_ckd_2018_ul') _tab %10.2f (`cardio_ckd_2019') _tab %10.2f (`cardio_ckd_2019_ll') _tab %10.2f (`cardio_ckd_2019_ul') _tab %10.2f (`c
> ardio_ckd_2020') _tab %10.2f (`cardio_ckd_2020_ll') _tab %10.2f (`cardio_ckd_2020_ul') _tab %10.2f (`cardio_ckd_2021') _tab %10.2f (`cardio_ckd_2021_ll') _tab %10.2f (`cardio_ckd_2021_ul') _tab %10.2f (`card
> io_ckd_2022') _tab %10.2f (`cardio_ckd_2022_ll') _tab %10.2f (`cardio_ckd_2022_ul') _n
184. 
. *No CKD
. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("N/A") _tab %10.2f (`baseline_nockd_2017') _tab %10.2f (`baseline_nockd_2017_ll') _tab %10.2f (`baseline_nockd_2017_ul') _tab %10.2f (`baseline_no
> ckd_2018') _tab %10.2f (`baseline_nockd_2018_ll') _tab %10.2f (`baseline_nockd_2018_ul') _tab %10.2f (`baseline_nockd_2019') _tab %10.2f (`baseline_nockd_2019_ll') _tab %10.2f (`baseline_nockd_2019_ul') _tab
>  %10.2f (`baseline_nockd_2020') _tab %10.2f (`baseline_nockd_2020_ll') _tab %10.2f (`baseline_nockd_2020_ul') _tab %10.2f (`baseline_nockd_2021') _tab %10.2f (`baseline_nockd_2021_ll') _tab %10.2f (`baseline
> _nockd_2021_ul') _tab %10.2f (`baseline_nockd_2022') _tab %10.2f (`baseline_nockd_2022_ll') _tab %10.2f (`baseline_nockd_2022_ul') _n
185. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("No progression") _tab %10.2f (`none_nockd_2017') _tab %10.2f (`none_nockd_2017_ll') _tab %10.2f (`none_nockd_2017_ul') _tab %10.2f (`none_nock
> d_2018') _tab %10.2f (`none_nockd_2018_ll') _tab %10.2f (`none_nockd_2018_ul') _tab %10.2f (`none_nockd_2019') _tab %10.2f (`none_nockd_2019_ll') _tab %10.2f (`none_nockd_2019_ul') _tab %10.2f (`none_nockd_2
> 020') _tab %10.2f (`none_nockd_2020_ll') _tab %10.2f (`none_nockd_2020_ul') _tab %10.2f (`none_nockd_2021') _tab %10.2f (`none_nockd_2021_ll') _tab %10.2f (`none_nockd_2021_ul') _tab %10.2f (`none_nockd_2022
> ') _tab %10.2f (`none_nockd_2022_ll') _tab %10.2f (`none_nockd_2022_ul') _n
186. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 3") _tab %10.2f (`ckd3_nockd_2017') _tab %10.2f (`ckd3_nockd_2017_ll') _tab %10.2f (`ckd3_nockd_2017_ul') _tab %10.2f (`ckd3_nockd_2
> 018') _tab %10.2f (`ckd3_nockd_2018_ll') _tab %10.2f (`ckd3_nockd_2018_ul') _tab %10.2f (`ckd3_nockd_2019') _tab %10.2f (`ckd3_nockd_2019_ll') _tab %10.2f (`ckd3_nockd_2019_ul') _tab %10.2f (`ckd3_nockd_2020
> ') _tab %10.2f (`ckd3_nockd_2020_ll') _tab %10.2f (`ckd3_nockd_2020_ul') _tab %10.2f (`ckd3_nockd_2021') _tab %10.2f (`ckd3_nockd_2021_ll') _tab %10.2f (`ckd3_nockd_2021_ul') _tab %10.2f (`ckd3_nockd_2022') 
> _tab %10.2f (`ckd3_nockd_2022_ll') _tab %10.2f (`ckd3_nockd_2022_ul') _n
187. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("CKD stage 4/5") _tab %10.2f (`ckd4_nockd_2017') _tab %10.2f (`ckd4_nockd_2017_ll') _tab %10.2f (`ckd4_nockd_2017_ul') _tab %10.2f (`ckd4_nockd
> _2018') _tab %10.2f (`ckd4_nockd_2018_ll') _tab %10.2f (`ckd4_nockd_2018_ul') _tab %10.2f (`ckd4_nockd_2019') _tab %10.2f (`ckd4_nockd_2019_ll') _tab %10.2f (`ckd4_nockd_2019_ul') _tab %10.2f (`ckd4_nockd_20
> 20') _tab %10.2f (`ckd4_nockd_2020_ll') _tab %10.2f (`ckd4_nockd_2020_ul') _tab %10.2f (`ckd4_nockd_2021') _tab %10.2f (`ckd4_nockd_2021_ll') _tab %10.2f (`ckd4_nockd_2021_ul') _tab %10.2f (`ckd4_nockd_2022'
> ) _tab %10.2f (`ckd4_nockd_2022_ll') _tab %10.2f (`ckd4_nockd_2022_ul') _n
188. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Dialysis") _tab %10.2f (`dialysis_nockd_2017') _tab %10.2f (`dialysis_nockd_2017_ll') _tab %10.2f (`dialysis_nockd_2017_ul') _tab %10.2f (`dia
> lysis_nockd_2018') _tab %10.2f (`dialysis_nockd_2018_ll') _tab %10.2f (`dialysis_nockd_2018_ul') _tab %10.2f (`dialysis_nockd_2019') _tab %10.2f (`dialysis_nockd_2019_ll') _tab %10.2f (`dialysis_nockd_2019_u
> l') _tab %10.2f (`dialysis_nockd_2020') _tab %10.2f (`dialysis_nockd_2020_ll') _tab %10.2f (`dialysis_nockd_2020_ul') _tab %10.2f (`dialysis_nockd_2021') _tab %10.2f (`dialysis_nockd_2021_ll') _tab %10.2f (`
> dialysis_nockd_2021_ul') _tab %10.2f (`dialysis_nockd_2022') _tab %10.2f (`dialysis_nockd_2022_ll') _tab %10.2f (`dialysis_nockd_2022_ul') _n
189. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Deceased") _tab %10.2f (`deceased_nockd_2017') _tab %10.2f (`deceased_nockd_2017_ll') _tab %10.2f (`deceased_nockd_2017_ul') _tab %10.2f (`dec
> eased_nockd_2018') _tab %10.2f (`deceased_nockd_2018_ll') _tab %10.2f (`deceased_nockd_2018_ul') _tab %10.2f (`deceased_nockd_2019') _tab %10.2f (`deceased_nockd_2019_ll') _tab %10.2f (`deceased_nockd_2019_u
> l') _tab %10.2f (`deceased_nockd_2020') _tab %10.2f (`deceased_nockd_2020_ll') _tab %10.2f (`deceased_nockd_2020_ul') _tab %10.2f (`deceased_nockd_2021') _tab %10.2f (`deceased_nockd_2021_ll') _tab %10.2f (`
> deceased_nockd_2021_ul') _tab %10.2f (`deceased_nockd_2022') _tab %10.2f (`deceased_nockd_2022_ll') _tab %10.2f (`deceased_nockd_2022_ul') _n
190. file write tablecontent ("`label`i''") _tab ("No CKD") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_nockd_2017') _tab %10.2f (`cardio_nockd_2017_ll') _tab %10.2f (`cardio_nockd_2017_ul') _tab %1
> 0.2f (`cardio_nockd_2018') _tab %10.2f (`cardio_nockd_2018_ll') _tab %10.2f (`cardio_nockd_2018_ul') _tab %10.2f (`cardio_nockd_2019') _tab %10.2f (`cardio_nockd_2019_ll') _tab %10.2f (`cardio_nockd_2019_ul'
> ) _tab %10.2f (`cardio_nockd_2020') _tab %10.2f (`cardio_nockd_2020_ll') _tab %10.2f (`cardio_nockd_2020_ul') _tab %10.2f (`cardio_nockd_2021') _tab %10.2f (`cardio_nockd_2021_ll') _tab %10.2f (`cardio_nockd
> _2021_ul') _tab %10.2f (`cardio_nockd_2022') _tab %10.2f (`cardio_nockd_2022_ll') _tab %10.2f (`cardio_nockd_2022_ul') _n
191. 
. *CKD stage 3
. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("N/A") _tab %10.2f (`baseline_ckd3_2017') _tab %10.2f (`baseline_ckd3_2017_ll') _tab %10.2f (`baseline_ckd3_2017_ul') _tab %10.2f (`baseline_
> ckd3_2018') _tab %10.2f (`baseline_ckd3_2018_ll') _tab %10.2f (`baseline_ckd3_2018_ul') _tab %10.2f (`baseline_ckd3_2019') _tab %10.2f (`baseline_ckd3_2019_ll') _tab %10.2f (`baseline_ckd3_2019_ul') _tab %10
> .2f (`baseline_ckd3_2020') _tab %10.2f (`baseline_ckd3_2020_ll') _tab %10.2f (`baseline_ckd3_2020_ul') _tab %10.2f (`baseline_ckd3_2021') _tab %10.2f (`baseline_ckd3_2021_ll') _tab %10.2f (`baseline_ckd3_202
> 1_ul') _tab %10.2f (`baseline_ckd3_2022') _tab %10.2f (`baseline_ckd3_2022_ll') _tab %10.2f (`baseline_ckd3_2022_ul') _n
192. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("No progression") _tab %10.2f (`none_ckd3_2017') _tab %10.2f (`none_ckd3_2017_ll') _tab %10.2f (`none_ckd3_2017_ul') _tab %10.2f (`none_ck
> d3_2018') _tab %10.2f (`none_ckd3_2018_ll') _tab %10.2f (`none_ckd3_2018_ul') _tab %10.2f (`none_ckd3_2019') _tab %10.2f (`none_ckd3_2019_ll') _tab %10.2f (`none_ckd3_2019_ul') _tab %10.2f (`none_ckd3_2020')
>  _tab %10.2f (`none_ckd3_2020_ll') _tab %10.2f (`none_ckd3_2020_ul') _tab %10.2f (`none_ckd3_2021') _tab %10.2f (`none_ckd3_2021_ll') _tab %10.2f (`none_ckd3_2021_ul') _tab %10.2f (`none_ckd3_2022') _tab %10
> .2f (`none_ckd3_2022_ll') _tab %10.2f (`none_ckd3_2022_ul') _n
193. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("CKD stage 4/5") _tab %10.2f (`ckd4_ckd3_2017') _tab %10.2f (`ckd4_ckd3_2017_ll') _tab %10.2f (`ckd4_ckd3_2017_ul') _tab %10.2f (`ckd4_ckd
> 3_2018') _tab %10.2f (`ckd4_ckd3_2018_ll') _tab %10.2f (`ckd4_ckd3_2018_ul') _tab %10.2f (`ckd4_ckd3_2019') _tab %10.2f (`ckd4_ckd3_2019_ll') _tab %10.2f (`ckd4_ckd3_2019_ul') _tab %10.2f (`ckd4_ckd3_2020') 
> _tab %10.2f (`ckd4_ckd3_2020_ll') _tab %10.2f (`ckd4_ckd3_2020_ul') _tab %10.2f (`ckd4_ckd3_2021') _tab %10.2f (`ckd4_ckd3_2021_ll') _tab %10.2f (`ckd4_ckd3_2021_ul') _tab %10.2f (`ckd4_ckd3_2022') _tab %10.
> 2f (`ckd4_ckd3_2022_ll') _tab %10.2f (`ckd4_ckd3_2022_ul') _n
194. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Dialysis") _tab %10.2f (`dialysis_ckd3_2017') _tab %10.2f (`dialysis_ckd3_2017_ll') _tab %10.2f (`dialysis_ckd3_2017_ul') _tab %10.2f (`d
> ialysis_ckd3_2018') _tab %10.2f (`dialysis_ckd3_2018_ll') _tab %10.2f (`dialysis_ckd3_2018_ul') _tab %10.2f (`dialysis_ckd3_2019') _tab %10.2f (`dialysis_ckd3_2019_ll') _tab %10.2f (`dialysis_ckd3_2019_ul') 
> _tab %10.2f (`dialysis_ckd3_2020') _tab %10.2f (`dialysis_ckd3_2020_ll') _tab %10.2f (`dialysis_ckd3_2020_ul') _tab %10.2f (`dialysis_ckd3_2021') _tab %10.2f (`dialysis_ckd3_2021_ll') _tab %10.2f (`dialysis_
> ckd3_2021_ul') _tab %10.2f (`dialysis_ckd3_2022') _tab %10.2f (`dialysis_ckd3_2022_ll') _tab %10.2f (`dialysis_ckd3_2022_ul') _n
195. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Deceased") _tab %10.2f (`deceased_ckd3_2017') _tab %10.2f (`deceased_ckd3_2017_ll') _tab %10.2f (`deceased_ckd3_2017_ul') _tab %10.2f (`d
> eceased_ckd3_2018') _tab %10.2f (`deceased_ckd3_2018_ll') _tab %10.2f (`deceased_ckd3_2018_ul') _tab %10.2f (`deceased_ckd3_2019') _tab %10.2f (`deceased_ckd3_2019_ll') _tab %10.2f (`deceased_ckd3_2019_ul') 
> _tab %10.2f (`deceased_ckd3_2020') _tab %10.2f (`deceased_ckd3_2020_ll') _tab %10.2f (`deceased_ckd3_2020_ul') _tab %10.2f (`deceased_ckd3_2021') _tab %10.2f (`deceased_ckd3_2021_ll') _tab %10.2f (`deceased_
> ckd3_2021_ul') _tab %10.2f (`deceased_ckd3_2022') _tab %10.2f (`deceased_ckd3_2022_ll') _tab %10.2f (`deceased_ckd3_2022_ul') _n
196. file write tablecontent ("`label`i''") _tab ("CKD stage 3") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_ckd3_2017') _tab %10.2f (`cardio_ckd3_2017_ll') _tab %10.2f (`cardio_ckd3_2017_ul') _tab 
> %10.2f (`cardio_ckd3_2018') _tab %10.2f (`cardio_ckd3_2018_ll') _tab %10.2f (`cardio_ckd3_2018_ul') _tab %10.2f (`cardio_ckd3_2019') _tab %10.2f (`cardio_ckd3_2019_ll') _tab %10.2f (`cardio_ckd3_2019_ul') _t
> ab %10.2f (`cardio_ckd3_2020') _tab %10.2f (`cardio_ckd3_2020_ll') _tab %10.2f (`cardio_ckd3_2020_ul') _tab %10.2f (`cardio_ckd3_2021') _tab %10.2f (`cardio_ckd3_2021_ll') _tab %10.2f (`cardio_ckd3_2021_ul')
>  _tab %10.2f (`cardio_ckd3_2022') _tab %10.2f (`cardio_ckd3_2022_ll') _tab %10.2f (`cardio_ckd3_2022_ul') _n
197. 
. *CKD stage 4/5 without RRT
. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("N/A") _tab %10.2f (`baseline_ckd4_2017') _tab %10.2f (`baseline_ckd4_2017_ll') _tab %10.2f (`baseline_ckd4_2017_ul') _tab %10.2f (`baselin
> e_ckd4_2018') _tab %10.2f (`baseline_ckd4_2018_ll') _tab %10.2f (`baseline_ckd4_2018_ul') _tab %10.2f (`baseline_ckd4_2019') _tab %10.2f (`baseline_ckd4_2019_ll') _tab %10.2f (`baseline_ckd4_2019_ul') _tab %
> 10.2f (`baseline_ckd4_2020') _tab %10.2f (`baseline_ckd4_2020_ll') _tab %10.2f (`baseline_ckd4_2020_ul') _tab %10.2f (`baseline_ckd4_2021') _tab %10.2f (`baseline_ckd4_2021_ll') _tab %10.2f (`baseline_ckd4_2
> 021_ul') _tab %10.2f (`baseline_ckd4_2022') _tab %10.2f (`baseline_ckd4_2022_ll') _tab %10.2f (`baseline_ckd4_2022_ul') _n
198. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("No progression") _tab %10.2f (`none_ckd4_2017') _tab %10.2f (`none_ckd4_2017_ll') _tab %10.2f (`none_ckd4_2017_ul') _tab %10.2f (`none_
> ckd4_2018') _tab %10.2f (`none_ckd4_2018_ll') _tab %10.2f (`none_ckd4_2018_ul') _tab %10.2f (`none_ckd4_2019') _tab %10.2f (`none_ckd4_2019_ll') _tab %10.2f (`none_ckd4_2019_ul') _tab %10.2f (`none_ckd4_2020
> ') _tab %10.2f (`none_ckd4_2020_ll') _tab %10.2f (`none_ckd4_2020_ul') _tab %10.2f (`none_ckd4_2021') _tab %10.2f (`none_ckd4_2021_ll') _tab %10.2f (`none_ckd4_2021_ul') _tab %10.2f (`none_ckd4_2022') _tab %
> 10.2f (`none_ckd4_2022_ll') _tab %10.2f (`none_ckd4_2022_ul') _n
199. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Dialysis") _tab %10.2f (`dialysis_ckd4_2017') _tab %10.2f (`dialysis_ckd4_2017_ll') _tab %10.2f (`dialysis_ckd4_2017_ul') _tab %10.2f (
> `dialysis_ckd4_2018') _tab %10.2f (`dialysis_ckd4_2018_ll') _tab %10.2f (`dialysis_ckd4_2018_ul') _tab %10.2f (`dialysis_ckd4_2019') _tab %10.2f (`dialysis_ckd4_2019_ll') _tab %10.2f (`dialysis_ckd4_2019_ul'
> ) _tab %10.2f (`dialysis_ckd4_2020') _tab %10.2f (`dialysis_ckd4_2020_ll') _tab %10.2f (`dialysis_ckd4_2020_ul') _tab %10.2f (`dialysis_ckd4_2021') _tab %10.2f (`dialysis_ckd4_2021_ll') _tab %10.2f (`dialysi
> s_ckd4_2021_ul') _tab %10.2f (`dialysis_ckd4_2022') _tab %10.2f (`dialysis_ckd4_2022_ll') _tab %10.2f (`dialysis_ckd4_2022_ul') _n
200. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Transplant") _tab %10.2f (`kt_ckd4_2017') _tab %10.2f (`kt_ckd4_2017_ll') _tab %10.2f (`kt_ckd4_2017_ul') _tab %10.2f (`kt_ckd4_2018') 
> _tab %10.2f (`kt_ckd4_2018_ll') _tab %10.2f (`kt_ckd4_2018_ul') _tab %10.2f (`kt_ckd4_2019') _tab %10.2f (`kt_ckd4_2019_ll') _tab %10.2f (`kt_ckd4_2019_ul') _tab %10.2f (`kt_ckd4_2020') _tab %10.2f (`kt_ckd4
> _2020_ll') _tab %10.2f (`kt_ckd4_2020_ul') _tab %10.2f (`kt_ckd4_2021') _tab %10.2f (`kt_ckd4_2021_ll') _tab %10.2f (`kt_ckd4_2021_ul') _tab %10.2f (`kt_ckd4_2022') _tab %10.2f (`kt_ckd4_2022_ll') _tab %10.2
> f (`kt_ckd4_2022_ul') _n
201. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Deceased") _tab %10.2f (`deceased_ckd4_2017') _tab %10.2f (`deceased_ckd4_2017_ll') _tab %10.2f (`deceased_ckd4_2017_ul') _tab %10.2f (
> `deceased_ckd4_2018') _tab %10.2f (`deceased_ckd4_2018_ll') _tab %10.2f (`deceased_ckd4_2018_ul') _tab %10.2f (`deceased_ckd4_2019') _tab %10.2f (`deceased_ckd4_2019_ll') _tab %10.2f (`deceased_ckd4_2019_ul'
> ) _tab %10.2f (`deceased_ckd4_2020') _tab %10.2f (`deceased_ckd4_2020_ll') _tab %10.2f (`deceased_ckd4_2020_ul') _tab %10.2f (`deceased_ckd4_2021') _tab %10.2f (`deceased_ckd4_2021_ll') _tab %10.2f (`decease
> d_ckd4_2021_ul') _tab %10.2f (`deceased_ckd4_2022') _tab %10.2f (`deceased_ckd4_2022_ll') _tab %10.2f (`deceased_ckd4_2022_ul') _n
202. file write tablecontent ("`label`i''") _tab ("CKD stage 4/5") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_ckd4_2017') _tab %10.2f (`cardio_ckd4_2017_ll') _tab %10.2f (`cardio_ckd4_2017_ul') _ta
> b %10.2f (`cardio_ckd4_2018') _tab %10.2f (`cardio_ckd4_2018_ll') _tab %10.2f (`cardio_ckd4_2018_ul') _tab %10.2f (`cardio_ckd4_2019') _tab %10.2f (`cardio_ckd4_2019_ll') _tab %10.2f (`cardio_ckd4_2019_ul') 
> _tab %10.2f (`cardio_ckd4_2020') _tab %10.2f (`cardio_ckd4_2020_ll') _tab %10.2f (`cardio_ckd4_2020_ul') _tab %10.2f (`cardio_ckd4_2021') _tab %10.2f (`cardio_ckd4_2021_ll') _tab %10.2f (`cardio_ckd4_2021_ul
> ') _tab %10.2f (`cardio_ckd4_2022') _tab %10.2f (`cardio_ckd4_2022_ll') _tab %10.2f (`cardio_ckd4_2022_ul') _n
203. 
. *Dialysis
. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("N/A") _tab %10.2f (`baseline_dialysis_2017') _tab %10.2f (`baseline_dialysis_2017_ll') _tab %10.2f (`baseline_dialysis_2017_ul') _tab %10.2f (`
> baseline_dialysis_2018') _tab %10.2f (`baseline_dialysis_2018_ll') _tab %10.2f (`baseline_dialysis_2018_ul') _tab %10.2f (`baseline_dialysis_2019') _tab %10.2f (`baseline_dialysis_2019_ll') _tab %10.2f (`bas
> eline_dialysis_2019_ul') _tab %10.2f (`baseline_dialysis_2020') _tab %10.2f (`baseline_dialysis_2020_ll') _tab %10.2f (`baseline_dialysis_2020_ul') _tab %10.2f (`baseline_dialysis_2021') _tab %10.2f (`baseli
> ne_dialysis_2021_ll') _tab %10.2f (`baseline_dialysis_2021_ul') _tab %10.2f (`baseline_dialysis_2022') _tab %10.2f (`baseline_dialysis_2022_ll') _tab %10.2f (`baseline_dialysis_2022_ul') _n
204. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("No progression") _tab %10.2f (`none_dialysis_2017') _tab %10.2f (`none_dialysis_2017_ll') _tab %10.2f (`none_dialysis_2017_ul') _tab %10.2f 
> (`none_dialysis_2018') _tab %10.2f (`none_dialysis_2018_ll') _tab %10.2f (`none_dialysis_2018_ul') _tab %10.2f (`none_dialysis_2019') _tab %10.2f (`none_dialysis_2019_ll') _tab %10.2f (`none_dialysis_2019_ul
> ') _tab %10.2f (`none_dialysis_2020') _tab %10.2f (`none_dialysis_2020_ll') _tab %10.2f (`none_dialysis_2020_ul') _tab %10.2f (`none_dialysis_2021') _tab %10.2f (`none_dialysis_2021_ll') _tab %10.2f (`none_d
> ialysis_2021_ul') _tab %10.2f (`none_dialysis_2022') _tab %10.2f (`none_dialysis_2022_ll') _tab %10.2f (`none_dialysis_2022_ul') _n
205. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Transplant") _tab %10.2f (`kt_dialysis_2017') _tab %10.2f (`kt_dialysis_2017_ll') _tab %10.2f (`kt_dialysis_2017_ul') _tab %10.2f (`kt_dialy
> sis_2018') _tab %10.2f (`kt_dialysis_2018_ll') _tab %10.2f (`kt_dialysis_2018_ul') _tab %10.2f (`kt_dialysis_2019') _tab %10.2f (`kt_dialysis_2019_ll') _tab %10.2f (`kt_dialysis_2019_ul') _tab %10.2f (`kt_di
> alysis_2020') _tab %10.2f (`kt_dialysis_2020_ll') _tab %10.2f (`kt_dialysis_2020_ul') _tab %10.2f (`kt_dialysis_2021') _tab %10.2f (`kt_dialysis_2021_ll') _tab %10.2f (`kt_dialysis_2021_ul') _tab %10.2f (`kt
> _dialysis_2022') _tab %10.2f (`kt_dialysis_2022_ll') _tab %10.2f (`kt_dialysis_2022_ul') _n
206. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Deceased") _tab %10.2f (`deceased_dialysis_2017') _tab %10.2f (`deceased_dialysis_2017_ll') _tab %10.2f (`deceased_dialysis_2017_ul') _tab %
> 10.2f (`deceased_dialysis_2018') _tab %10.2f (`deceased_dialysis_2018_ll') _tab %10.2f (`deceased_dialysis_2018_ul') _tab %10.2f (`deceased_dialysis_2019') _tab %10.2f (`deceased_dialysis_2019_ll') _tab %10.
> 2f (`deceased_dialysis_2019_ul') _tab %10.2f (`deceased_dialysis_2020') _tab %10.2f (`deceased_dialysis_2020_ll') _tab %10.2f (`deceased_dialysis_2020_ul') _tab %10.2f (`deceased_dialysis_2021') _tab %10.2f 
> (`deceased_dialysis_2021_ll') _tab %10.2f (`deceased_dialysis_2021_ul') _tab %10.2f (`deceased_dialysis_2022') _tab %10.2f (`deceased_dialysis_2022_ll') _tab %10.2f (`deceased_dialysis_2022_ul') _n
207. file write tablecontent ("`label`i''") _tab ("Dialysis") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_dialysis_2017') _tab %10.2f (`cardio_dialysis_2017_ll') _tab %10.2f (`cardio_dialysis_2017_u
> l') _tab %10.2f (`cardio_dialysis_2018') _tab %10.2f (`cardio_dialysis_2018_ll') _tab %10.2f (`cardio_dialysis_2018_ul') _tab %10.2f (`cardio_dialysis_2019') _tab %10.2f (`cardio_dialysis_2019_ll') _tab %10.
> 2f (`cardio_dialysis_2019_ul') _tab %10.2f (`cardio_dialysis_2020') _tab %10.2f (`cardio_dialysis_2020_ll') _tab %10.2f (`cardio_dialysis_2020_ul') _tab %10.2f (`cardio_dialysis_2021') _tab %10.2f (`cardio_d
> ialysis_2021_ll') _tab %10.2f (`cardio_dialysis_2021_ul') _tab %10.2f (`cardio_dialysis_2022') _tab %10.2f (`cardio_dialysis_2022_ll') _tab %10.2f (`cardio_dialysis_2022_ul') _n
208. 
. *Kidney transplant
. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("N/A") _tab %10.2f (`baseline_kt_2017') _tab %10.2f (`baseline_kt_2017_ll') _tab %10.2f (`baseline_kt_2017_ul') _tab %10.2f (`baseline_kt_2018
> ') _tab %10.2f (`baseline_kt_2018_ll') _tab %10.2f (`baseline_kt_2018_ul') _tab %10.2f (`baseline_kt_2019') _tab %10.2f (`baseline_kt_2019_ll') _tab %10.2f (`baseline_kt_2019_ul') _tab %10.2f (`baseline_kt_2
> 020') _tab %10.2f (`baseline_kt_2020_ll') _tab %10.2f (`baseline_kt_2020_ul') _tab %10.2f (`baseline_kt_2021') _tab %10.2f (`baseline_kt_2021_ll') _tab %10.2f (`baseline_kt_2021_ul') _tab %10.2f (`baseline_k
> t_2022') _tab %10.2f (`baseline_kt_2022_ll') _tab %10.2f (`baseline_kt_2022_ul') _n
209. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("No progression") _tab %10.2f (`none_kt_2017') _tab %10.2f (`none_kt_2017_ll') _tab %10.2f (`none_kt_2017_ul') _tab %10.2f (`none_kt_2018')
>  _tab %10.2f (`none_kt_2018_ll') _tab %10.2f (`none_kt_2018_ul') _tab %10.2f (`none_kt_2019') _tab %10.2f (`none_kt_2019_ll') _tab %10.2f (`none_kt_2019_ul') _tab %10.2f (`none_kt_2020') _tab %10.2f (`none_k
> t_2020_ll') _tab %10.2f (`none_kt_2020_ul') _tab %10.2f (`none_kt_2021') _tab %10.2f (`none_kt_2021_ll') _tab %10.2f (`none_kt_2021_ul') _tab %10.2f (`none_kt_2022') _tab %10.2f (`none_kt_2022_ll') _tab %10.
> 2f (`none_kt_2022_ul') _n
210. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Dialysis") _tab %10.2f (`dialysis_kt_2017') _tab %10.2f (`dialysis_kt_2017_ll') _tab %10.2f (`dialysis_kt_2017_ul') _tab %10.2f (`dialysis
> _kt_2018') _tab %10.2f (`dialysis_kt_2018_ll') _tab %10.2f (`dialysis_kt_2018_ul') _tab %10.2f (`dialysis_kt_2019') _tab %10.2f (`dialysis_kt_2019_ll') _tab %10.2f (`dialysis_kt_2019_ul') _tab %10.2f (`dialy
> sis_kt_2020') _tab %10.2f (`dialysis_kt_2020_ll') _tab %10.2f (`dialysis_kt_2020_ul') _tab %10.2f (`dialysis_kt_2021') _tab %10.2f (`dialysis_kt_2021_ll') _tab %10.2f (`dialysis_kt_2021_ul') _tab %10.2f (`di
> alysis_kt_2022') _tab %10.2f (`dialysis_kt_2022_ll') _tab %10.2f (`dialysis_kt_2022_ul') _n
211. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Deceased") _tab %10.2f (`deceased_kt_2017') _tab %10.2f (`deceased_kt_2017_ll') _tab %10.2f (`deceased_kt_2017_ul') _tab %10.2f (`deceased
> _kt_2018') _tab %10.2f (`deceased_kt_2018_ll') _tab %10.2f (`deceased_kt_2018_ul') _tab %10.2f (`deceased_kt_2019') _tab %10.2f (`deceased_kt_2019_ll') _tab %10.2f (`deceased_kt_2019_ul') _tab %10.2f (`decea
> sed_kt_2020') _tab %10.2f (`deceased_kt_2020_ll') _tab %10.2f (`deceased_kt_2020_ul') _tab %10.2f (`deceased_kt_2021') _tab %10.2f (`deceased_kt_2021_ll') _tab %10.2f (`deceased_kt_2021_ul') _tab %10.2f (`de
> ceased_kt_2022') _tab %10.2f (`deceased_kt_2022_ll') _tab %10.2f (`deceased_kt_2022_ul') _n
212. file write tablecontent ("`label`i''") _tab ("Transplant") _tab ("Cardiovascular admission") _tab %10.2f (`cardio_kt_2017') _tab %10.2f (`cardio_kt_2017_ll') _tab %10.2f (`cardio_kt_2017_ul') _tab %10.2f 
> (`cardio_kt_2018') _tab %10.2f (`cardio_kt_2018_ll') _tab %10.2f (`cardio_kt_2018_ul') _tab %10.2f (`cardio_kt_2019') _tab %10.2f (`cardio_kt_2019_ll') _tab %10.2f (`cardio_kt_2019_ul') _tab %10.2f (`cardio_
> kt_2020') _tab %10.2f (`cardio_kt_2020_ll') _tab %10.2f (`cardio_kt_2020_ul') _tab %10.2f (`cardio_kt_2021') _tab %10.2f (`cardio_kt_2021_ll') _tab %10.2f (`cardio_kt_2021_ul') _tab %10.2f (`cardio_kt_2022')
>  _tab %10.2f (`cardio_kt_2022_ll') _tab %10.2f (`cardio_kt_2022_ul') _n
213. }
(label sex already defined)
(label egfr_end already defined)
(label ckd_progression already defined)
(label ethnicity already defined)
(label imd already defined)
(label region already defined)
(label urban already defined)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         2,125
        from master                     2,125  (_merge==1)
        from using                          0  (_merge==2)

    Matched                             1,084  (_merge==3)
    -----------------------------------------
(1,310 observations deleted)
(786 real changes made)

Total estimation                         Number of obs = 1,899

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   139.0121   .7612549      137.5191    140.5051
--------------------------------------------------------------

Total estimation                         Number of obs = 1,899

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   139.0121   .7612549      137.5191    140.5051
--------------------------------------------------------------

Total estimation                         Number of obs = 1,454

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   106.7916    .648832      105.5189    108.0643
--------------------------------------------------------------

Total estimation                           Number of obs = 158

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   11.33208   .2445925      10.84896    11.81519
--------------------------------------------------------------

Total estimation                             Number of obs = 7

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .501858    .044247      .3935894    .6101266
--------------------------------------------------------------

Total estimation                            Number of obs = 67

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    5.08797   .1360342      4.816369    5.359571
--------------------------------------------------------------

Total estimation                            Number of obs = 72

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   5.030972   .1774016      4.677243    5.384701
--------------------------------------------------------------

Total estimation                           Number of obs = 134

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   9.819061   .2028882      9.417756    10.22037
--------------------------------------------------------------

Total estimation                            Number of obs = 92

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |     6.5068   .1998205      6.109881    6.903719
--------------------------------------------------------------

Total estimation                         Number of obs = 1,436

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   106.6045   .6265126      105.3755    107.8335
--------------------------------------------------------------

Total estimation                         Number of obs = 1,436

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   106.6045   .6265126      105.3755    107.8335
--------------------------------------------------------------

Total estimation                         Number of obs = 1,082

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   80.90688    .518152      79.89019    81.92358
--------------------------------------------------------------

Total estimation                           Number of obs = 158

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   11.33208   .2445925      10.84896    11.81519
--------------------------------------------------------------

Total estimation                             Number of obs = 6

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .452292   .0364449      .3586075    .5459765
--------------------------------------------------------------

Total estimation                            Number of obs = 47

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   3.582396   .1106215      3.359726    3.805066
--------------------------------------------------------------

Total estimation                            Number of obs = 92

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   6.716218   .1717934      6.374972    7.057464
--------------------------------------------------------------

Total estimation                            Number of obs = 67

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   4.887225   .1409868      4.605736    5.168714
--------------------------------------------------------------

Total estimation                           Number of obs = 219

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   15.30233   .2930054      14.72485    15.87982
--------------------------------------------------------------

Total estimation                           Number of obs = 219

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   15.30233   .2930054      14.72485    15.87982
--------------------------------------------------------------

Total estimation                           Number of obs = 174

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   12.16479   .2618256      11.64801    12.68157
--------------------------------------------------------------

Total estimation                             Number of obs = 1

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .049566          .             .           .
--------------------------------------------------------------

Total estimation                             Number of obs = 8

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .526642   .0731219      .3537361    .6995479
--------------------------------------------------------------

Total estimation                            Number of obs = 21

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.539029   .0675315      1.398161    1.679897
--------------------------------------------------------------

Total estimation                            Number of obs = 14

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |   1.016107   .0929213      .8153627    1.216851
--------------------------------------------------------------

Total estimation                             Number of obs = 9

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .427508   .0810208      .2406738    .6143422
--------------------------------------------------------------

Total estimation                             Number of obs = 9

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .427508   .0810208      .2406738    .6143422
--------------------------------------------------------------

Total estimation                             Number of obs = 8

--------------------------------------------------------------
             |      Total   Std. err.     [95% conf. interval]
-------------+------------------------------------------------
      weight |    .340767   .0684751      .1788492    .5026848
--------------------------------------------------------------
no observations
r(2000);

end of do-file

r(2000);

